<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>《web前端最佳实践》—高维护性css | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">《web前端最佳实践》—高维护性css</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">《web前端最佳实践》—高维护性css</h1><div class="post-meta">Mar 28, 2015<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2015/03/28/《web前端最佳实践》—高维护性css/" href="/2015/03/28/《web前端最佳实践》—高维护性css/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#高维护性css"><span class="toc-number">1.</span> <span class="toc-text">高维护性css</span></a></li></ol></div></div><div class="post-content"><p>&#x6709;&#x4EBA;&#x8BF4;html&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5B83;&#x751A;&#x81F3;&#x4E0D;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x79CD;&#x771F;&#x6B63;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x540C;&#x6837;&#x88AB;&#x7C7B;&#x4F3C;&#x7684;&#x770B;&#x5F85;&#xFF0C;&#x5B83;&#x5C31;&#x662F;css&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;css&#x7684;&#x4EE3;&#x7801;&#x7684;&#x786E;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x5982;&#x8981;&#x8981;&#x4F1A;&#x7B80;&#x5355;&#x7684;&#x4F7F;&#x7528;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x7136;&#x540E;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x7684;&#x7528;&#x5B83;&#x6765;&#x63A7;&#x5236;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5BBD;&#x9AD8;&#xFF0C;&#x5185;&#x5BB9;&#x5B57;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#x3001;&#x5927;&#x5C0F;&#x3001;&#x989C;&#x8272;&#x7B49;&#x7B49;&#x3002;&#x4F46;&#x5B83;&#x771F;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#x3002; &#x5C31;&#x50CF;&#x662F;&#x540C;&#x6837;&#x8BA4;&#x8BC6;&#x5B57;&#xFF0C;&#x4F1A;&#x5199;&#x5B57;&#xFF0C;&#x4F46;&#x603B;&#x6709;&#x4EBA;&#x80FD;&#x5199;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x6587;&#x7AE0;&#x4E00;&#x6837;&#x3002;&#x4F1A;&#x7528;&#x548C;&#x79D1;&#x5B66;&#x7684;&#x7528;&#xFF0C;&#x7075;&#x6D3B;&#x7684;&#x7528;&#x4ECD;&#x7136;&#x6709;&#x8DDD;&#x79BB;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6765;&#x8C08;&#x8C08;css&#x4E2D;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x65B9;&#x6CD5;&#x3002;</p>
<h2 id="&#x9AD8;&#x7EF4;&#x62A4;&#x6027;css"><a href="#&#x9AD8;&#x7EF4;&#x62A4;&#x6027;css" class="headerlink" title="&#x9AD8;&#x7EF4;&#x62A4;&#x6027;css"></a>&#x9AD8;&#x7EF4;&#x62A4;&#x6027;css</h2><p><strong>Css&#x6709;&#x4E9B;&#x4EC0;&#x4E48;&#x7279;&#x70B9;&#xFF1F;</strong></p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF1A;&#x5185;&#x8054;&#x3001;&#x5185;&#x5D4C;&#x3001;&#x5916;&#x8054;&#x3001;import&#x3002;&#x4E3A;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x6837;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;&#x5143;&#x7D20;&#x6807;&#x7B7E;&#x540D;&#x3001;&#x7C7B;&#x540D;&#x3001;id&#x3001;&#x5404;&#x79CD;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x7EC4;&#x5408;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B83;&#x662F;&#x5F88;&#x7075;&#x6D3B;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x7684;&#x89C4;&#x8303;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5C31;&#x80AF;&#x5B9A;&#x4F1A;&#x5BFC;&#x81F4;css&#x4EE3;&#x7801;&#x7684;&#x6DF7;&#x4E71;&#x548C;&#x96BE;&#x4EE5;&#x7EF4;&#x62A4;&#x3002;</p>
<p><strong>&#x5982;&#x4F55;&#x9AD8;&#x6548;&#x7EC4;&#x7EC7;css&#x4EE3;&#x7801;&#xFF1F;</strong></p>
<p>&#x7ED3;&#x6784;&#x6E05;&#x6670;&#x3001;&#x6A21;&#x5757;&#x5206;&#x660E;&#xFF0C;&#x5408;&#x7406;&#x7684;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x53EF;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x7528;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF0C;&#x964D;&#x4F4E;&#x5F00;&#x53D1;&#x590D;&#x6742;&#x5EA6;&#x3002;&#x90A3;&#x600E;&#x6837;&#x7EC4;&#x7EC7;&#x5462;&#xFF1F;</p>
<p>&#x9996;&#x5148;&#x662F;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF1A;&#x901A;&#x7528;&#x7C7B;&#x548C;&#x4E1A;&#x52A1;&#x7C7B;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x6765;&#x91CD;&#x7F6E;&#xFF0C;&#x5E38;&#x89C1;&#x547D;&#x540D;&#x662F;reset&#x6216;&#x8005;default&#x3001;normalize&#x7B49;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7528;&#x6765;&#x5B58;&#x653E;&#x901A;&#x7528;&#x6A21;&#x5757;&#x548C;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x6837;&#x5F0F;&#xFF0C;&#x5E38;&#x547D;&#x540D;&#x4E3A;mod&#x3001;common&#x7B49;&#xFF0C;&#x5982;&#x9875;&#x9762;&#x5BF9;&#x8BDD;&#x6846;&#xFF0C;&#x63D0;&#x793A;&#x6846;&#xFF0C;&#x5934;&#x90E8;&#xFF0C;&#x5E95;&#x90E8;&#xFF0C;&#x4FA7;&#x8FB9;&#x680F;&#x7B49;&#xFF0C;&#x4F1A;&#x5728;&#x591A;&#x4E2A;&#x9875;&#x9762;&#x7528;&#x5230;&#xFF0C;&#x8FD9;&#x6837;&#x65B9;&#x9762;&#x5404;&#x9875;&#x9762;&#x5F15;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x590D;&#x7528;&#x5EA6;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5B58;&#x5728;&#x517C;&#x5BB9;&#x65E7;&#x7248;IE&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x6709;&#x4E8C;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x51CF;&#x5C11;&#x975E;IE&#x6D4F;&#x89C8;&#x5668;&#x52A0;&#x8F7D;&#x6837;&#x5F0F;&#x6587;&#x4EF6;&#x7684;&#x8D1F;&#x62C5;</p>
<p>&#x4E8C;&#x3001;&#x5982;&#x679C;&#x672A;&#x6765;&#x51B3;&#x5B9A;&#x4E0D;&#x518D;&#x652F;&#x6301;&#x65E7;&#x7248;&#x7684;IE&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5219;&#x53EA;&#x9700;&#x8981;&#x53BB;&#x4FEE;&#x6539;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x5230;&#x5904;&#x627E;&#x53BB;&#x4FEE;&#x6539;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x5904;&#x7406;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x6709;&#x4E2A;&#x539F;&#x5219;&#x662F;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x5176;&#x4ED6;&#x4E0D;&#x5B58;&#x5728;&#x517C;&#x5BB9;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x5219;&#x628A;&#x8981;&#x505A;&#x517C;&#x5BB9;&#x7684;&#x90E8;&#x5206;&#x5355;&#x72EC;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>&#x5176;&#x4F59;&#x7684;css&#x6837;&#x5F0F;&#x6587;&#x4EF6;&#x5219;&#x7528;&#x4E8E;&#x4E1A;&#x52A1;&#x6A21;&#x5757;&#xFF0C;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x7684;&#x6837;&#x5F0F;&#x6587;&#x4EF6;&#x653E;&#x7F6E;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x5939;&#x4E2D;&#xFF0C;&#x539F;&#x5219;&#x4E0A;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x6837;&#x5F0F;&#x6587;&#x4EF6;&#x4E0D;&#x5B9C;&#x592A;&#x5927;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4E0D;&#x662F;&#x8981;&#x5F15;&#x5165;&#x5F88;&#x591A;&#x6587;&#x4EF6;&#x4E86;&#xFF1F;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x7684;&#x65F6;&#x5019;http&#x8BF7;&#x6C42;&#x4E0D;&#x662F;&#x591A;&#x5F88;&#x591A;&#xFF1F;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x77DB;&#x76FE;&#xFF0C;&#x6587;&#x4EF6;&#x7684;&#x5212;&#x5206;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x5F00;&#x53D1;&#x548C;&#x7EF4;&#x62A4;&#xFF0C;&#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x628A;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x538B;&#x7F29;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x5F15;&#x5165;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x662F;&#x6587;&#x4EF6;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x4E5F;&#x8981;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x89C4;&#x5219;&#x6765;&#x7EC4;&#x7EC7;&#x6837;&#x5F0F;&#x7684;&#x58F0;&#x660E;&#x3002; &#x6BD4;&#x5982;&#xFF0C;&#x6309;&#x7167;&#x6A21;&#x5757;&#x4E2D;&#x5143;&#x7D20;&#x7684;&#x5C42;&#x7EA7;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x540C;&#x7EA7;&#xFF0C;&#x5219;&#x6309;&#x7167;&#x5143;&#x7D20;&#x5728;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#xFF0C;&#x82E5;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x5143;&#x7D20;&#x5171;&#x7528;&#x76F8;&#x540C;&#x58F0;&#x660E;&#xFF0C;&#x5219;&#x5E94;&#x5148;&#x58F0;&#x660E;&#x5171;&#x901A;&#x6837;&#x5F0F;&#x3002; &#x5982;&#x679C;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;less&#x3001;sass&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;css&#x8D4B;&#x4E88;&#x4E86;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5982;&#x53D8;&#x91CF;&#x3001;&#x7EE7;&#x627F;&#x3001;&#x8FD0;&#x7B97;&#x3001;&#x51FD;&#x6570;&#x7B49;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x662F;&#x4ECE;&#x51E0;&#x4E2A;&#x5927;&#x7684;&#x65B9;&#x5411;&#x53BB;&#x8BF4;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x6D89;&#x53CA;&#x67D0;&#x51E0;&#x4E2A;&#x70B9;&#x8C08;&#x4E00;&#x8C08;</p>
<p><strong>&#x4F7F;&#x7528;css reset &#x7EDF;&#x4E00;&#x6D4F;&#x89C8;&#x5668;&#x663E;&#x793A;&#x6548;&#x679C;</strong></p>
<p>&#x9996;&#x5148;&#xFF0C;html&#x7684;&#x6807;&#x7B7E;&#x662F;&#x6709;&#x539F;&#x59CB;&#x6837;&#x5F0F;&#x7684;&#xFF0C;&#x4F46;&#x95EE;&#x9898;&#x662F;&#x5728;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x6807;&#x7B7E;&#x7684;&#x9ED8;&#x8BA4;&#x6837;&#x5F0F;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5DEE;&#x5F02;&#x7ED9;&#x5F00;&#x53D1;&#x9020;&#x6210;&#x4E86;&#x9EBB;&#x70E6;&#xFF0C;&#x65E9;&#x5728;2004&#x5E74;&#xFF0C;&#x5C31;&#x6709;&#x4EBA;&#x5F00;&#x53D1;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x91CD;&#x7F6E;&#x6837;&#x5F0F;&#x6587;&#x4EF6;&#xFF0C;&#x53EB;undohtml.Css,&#x540E;&#x7EED;&#x53C8;&#x6709;&#x4E86;&#x591A;&#x79CD;&#x91CD;&#x7F6E;&#x65B9;&#x6848;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E2A;&#x65B9;&#x6848;&#x201C;&#x706B;&#x7206;&#x4E00;&#x65F6;&#x201D;&#xFF0C;&#x6B64;&#x65B9;&#x6848;&#x603B;&#x5171;&#x5C31;&#x4E00;&#x884C;&#x4EE3;&#x7801;*{margin&#xFF1A;0&#xFF1B;padding&#xFF1A;0&#xFF1B;}&#x3002;&#x91CD;&#x7F6E;&#x4E86;&#x6240;&#x6709;&#x6807;&#x7B7E;&#x9ED8;&#x8BA4;&#x7684;margin&#x3001;padding&#x6837;&#x5F0F;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x5F0A;&#x7AEF;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x540E;&#x7EED;&#x5F00;&#x53D1;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x6709;&#x6548;&#x7684;&#x63D0;&#x9AD8;&#x6574;&#x4F53;&#x5F00;&#x53D1;&#x7684;&#x6548;&#x7387;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6B64;&#x65B9;&#x6848;&#x6027;&#x80FD;&#x4E5F;&#x4E0D;&#x4F73;&#xFF0C;&#x5F53;&#x9875;&#x9762;&#x5143;&#x7D20;&#x5F88;&#x591A;&#x65F6;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x9875;&#x9762;&#x6E32;&#x67D3;&#x7684;&#x6027;&#x80FD;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4EBA;&#x4EEC;&#x8FD8;&#x5728;&#x9010;&#x6E10;&#x7684;&#x63A2;&#x7D22;&#x66F4;&#x597D;&#x7684;&#x91CD;&#x7F6E;&#x65B9;&#x5F0F;&#xFF0C;&#x76EE;&#x524D;&#x6709;&#x591A;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x91CD;&#x7F6E;&#x65B9;&#x6848;&#xFF0C;&#x6709;Eric Meyer&#x5F00;&#x53D1;&#x7684;Reset CSS&#x548C;&#x96C5;&#x864E;&#x516C;&#x53F8;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x56E2;&#x961F;&#x5F00;&#x53D1;&#x7684;YUI Reset CSS&#x3002;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x79CD;&#x65B9;&#x6848;&#x9002;&#x5408;&#x6240;&#x6709;&#x9879;&#x76EE;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x597D;&#x8FD8;&#x662F;&#x9009;&#x62E9;&#x53C2;&#x8003;&#x522B;&#x4EBA;&#x7684;&#x65B9;&#x6848;&#x7136;&#x540E;&#x8BBE;&#x8BA1;&#x4E00;&#x5957;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x9879;&#x76EE;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x9700;&#x8981;&#x8003;&#x8651;&#x5982;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;HTML5&#x65B0;&#x6807;&#x7B7E; &#x9700;&#x8981;&#x91CD;&#x7F6E;&#x5B83;&#x4EEC;&#x7684;display&#x6837;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x4F4E;&#x7248;&#x672C;IE&#x4E2D;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x5B83;&#x4EEC;&#x7684;&#x9ED8;&#x8BA4;display&#x6837;&#x5F0F;&#x3002;</p>
<p>&#xFF08;2&#xFF09;padding&#x3001;margin&#x3001;border &#x6807;&#x7B7E;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x5DEE;&#x5F02;&#x4E3B;&#x8981;&#x662F;&#x4E0E;&#x8FD9;&#x4E09;&#x4E2A;&#x6837;&#x5F0F;&#x6709;&#x5173;&#x7684;&#x9ED8;&#x8BA4;&#x6837;&#x5F0F;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x9700;&#x8981;&#x91CD;&#x7F6E;&#x5168;&#x90E8;&#x5143;&#x7D20;&#x7684;margin&#x3001;padding&#x3001;border&#xFF0C;&#x5E94;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x5B57;&#x4F53;&#x8BBE;&#x7F6E; <code>&lt;h1&gt;</code>~<code>&lt;h6&gt;</code>&#x3001;<code>&lt;strong&gt;</code>&#x3001;<code>&lt;em&gt;</code>&#x7B49;&#x8BED;&#x4E49;&#x5316;&#x6807;&#x7B7E;&#x90FD;&#x6709;&#x9ED8;&#x8BA4;&#x5B57;&#x4F53;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x5F53;&#x4E2D;&#x6240;&#x9700;&#x8981;&#x7684;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x7C97;&#x7EC6;&#x90FD;&#x8DDF;&#x9ED8;&#x8BA4;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x822C;&#x9879;&#x76EE;&#x4E2D;&#x90FD;&#x4F1A;&#x5BF9;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;&#x91CD;&#x7F6E;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x7684;&#x6837;&#x5F0F;&#x91CD;&#x7F6E; &#x5178;&#x578B;&#x7684;&#x6709;li&#x9ED8;&#x8BA4;&#x7684;&#x5217;&#x8868;&#x9879;&#x6837;&#x5F0F;&#xFF0C;table&#x7684;&#x5355;&#x5143;&#x683C;&#x4E4B;&#x95F4;&#x9ED8;&#x8BA4;&#x7A7A;&#x95F4;&#xFF0C;a&#x94FE;&#x63A5;&#x7684;&#x4E0B;&#x5212;&#x7EBF;&#x7B49;&#x3002;</p>
<p><strong>&#x7ED9;css&#x5B9A;&#x4E49;&#x6392;&#x5E8F;</strong></p>
<p>Css&#x7684;&#x903B;&#x8F91;&#x6027;&#x4E0D;&#x5F3A;&#xFF0C;&#x968F;&#x610F;&#x7684;&#x4E66;&#x5199;&#x4E5F;&#x4E0D;&#x5F71;&#x54CD;&#x5176;&#x4F5C;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x501F;&#x52A9;&#x5DE5;&#x5177;&#x5BF9;&#x5176;&#x6392;&#x5E8F;&#x4E5F;&#x4F1A;&#x5F88;&#x7E41;&#x7410;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x4EBA;&#x4F1A;&#x5728;&#x610F;&#xFF0C;&#x4F46;&#x662F;&#x6392;&#x5E8F;&#x8FD8;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;</p>
<p>1&#x3001;&#x66F4;&#x6574;&#x6D01;</p>
<p>2&#x3001;&#x9632;&#x6B62;&#x91CD;&#x590D;&#x5B9A;&#x4E49;</p>
<p>3&#x3001;&#x80FD;&#x591F;&#x6E05;&#x6670;&#x67E5;&#x770B;&#x5B9A;&#x4E49;</p>
<p>4&#x3001;&#x540E;&#x7EED;&#x7EF4;&#x62A4;&#x80FD;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;</p>
<p>&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p>1&#x3001;&#x6309;&#x7C7B;&#x578B; &#x5982;&#xFF0C;&#x663E;&#x793A;&#x548C;&#x6D6E;&#x52A8;&#x3001;&#x5B9A;&#x4F4D;&#x3001;&#x5C3A;&#x5BF8;&#x3001;&#x5B57;&#x4F53;&#x7B49;</p>
<p>2&#x3001;&#x6309;&#x5B57;&#x6BCD; &#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF0C;&#x4F18;&#x70B9;&#x662F;&#x89C4;&#x5219;&#x7B80;&#x5355;</p>
<p>3&#x3001;&#x6309;&#x5B9A;&#x4E49;&#x957F;&#x5EA6; &#x6309;&#x7167;&#x6837;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;&#x5B57;&#x7B26;&#x957F;&#x5EA6;&#x6392;&#x5217;</p>
<p>&#x5404;&#x6709;&#x4F18;&#x52A3;&#xFF0C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x79CD;&#x3002; &#x4F46;&#x662F;&#x5982;&#x679C;&#x5355;&#x9760;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x7F16;&#x5199;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FD9;&#x4E48;&#x505A;&#x7684;&#x8BDD;&#x4E5F;&#x662F;&#x5F88;&#x96BE;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5199;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6309;&#x7167;&#x6548;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x65B9;&#x5F0F;&#x5199;&#xFF0C;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x65F6;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x4E3A;css&#x6392;&#x5E8F;&#x3002;&#x65E2;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x53C8;&#x65B9;&#x4FBF;&#x540E;&#x7EED;&#x4EE3;&#x7801;&#x9605;&#x8BFB;&#x548C;&#x7EF4;&#x62A4;&#x3002;&#x6709;&#x4E00;&#x6B3E;&#x514D;&#x8D39;&#x5DE5;&#x5177;&#x662F; CSScomb&#x3002;</p>
<p><strong>&#x5408;&#x7406;&#x5229;&#x7528;css&#x7684;&#x6743;&#x91CD;&#xFF0C;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x91CD;&#x7528;&#x6027;</strong></p>
<p>&#x4F55;&#x4E3A;&#x6743;&#x91CD;&#xFF0C;&#x5373;css&#x4F17;&#x591A;&#x7C7B;&#x578B;&#x9009;&#x62E9;&#x7B26;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x4F18;&#x5148;&#x7EA7;&#x9AD8;&#x7684;&#x6837;&#x5F0F;&#x4F1A;&#x8986;&#x76D6;&#x4F18;&#x5148;&#x7EA7;&#x4F4E;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x6743;&#x91CD;&#x7684;&#x66F4;&#x5177;&#x4F53;&#x89C4;&#x5219;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x67E5;&#x9605;&#x8D44;&#x6599;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x8D58;&#x8FF0;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x8BF4;&#x5982;&#x4F55;&#x4F9D;&#x7167;&#x9009;&#x62E9;&#x7B26;&#x7684;&#x6743;&#x91CD;&#x5B9A;&#x4E49;&#x5408;&#x9002;&#x7684;&#x9009;&#x62E9;&#x7B26;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x5C3D;&#x91CF;&#x4E0D;&#x4F7F;&#x7528;ID&#x9009;&#x62E9;&#x5668;</p>
<p>&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#x4E0D;&#x5141;&#x8BB8;&#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x540C;&#x6837;&#x7684;ID&#xFF0C;&#x800C;&#x4E14;ID&#x9009;&#x62E9;&#x5668;&#x6743;&#x91CD;&#x5F88;&#x9AD8;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x8986;&#x76D6;&#x4F7F;&#x7528;&#x4E86;ID&#x9009;&#x62E9;&#x5668;&#x7684;&#x5143;&#x7D20;&#x6837;&#x5F0F;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5728;&#x5176;&#x5143;&#x7D20;&#x4E0A;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x9009;&#x62E9;&#x7B26;&#xFF0C;&#x6216;&#x4F7F;&#x7528;&#xFF01;important&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x4F1A;&#x4F7F;&#x65E0;&#x6CD5;&#x91CD;&#x7528;&#x7684;&#x6837;&#x5F0F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x66F4;&#x591A;&#x3002;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x8F83;&#x4F4E;&#x6743;&#x91CD;&#x7684;&#x9009;&#x62E9;&#x7B26;&#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#x6837;&#x5F0F;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x51CF;&#x5C11;&#x5B50;&#x9009;&#x62E9;&#x5668;&#x7684;&#x5C42;&#x7EA7;</p>
<p>&#x4E5F;&#x662F;&#x964D;&#x4F4E;&#x5B50;&#x9009;&#x62E9;&#x7B26;&#x6574;&#x4F53;&#x6743;&#x91CD;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x5C42;&#x7EA7;&#x8D8A;&#x5C11;&#xFF0C;&#x5BF9;html&#x7ED3;&#x6784;&#x7684;&#x4F9D;&#x8D56;&#x5C31;&#x8D8A;&#x4F4E;&#x3002;&#x5F15;&#x8D77;Css&#x5C42;&#x7EA7;&#x8FC7;&#x591A;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;sass&#x3001;less&#x7B49;&#x5DE5;&#x5177;&#x7684;&#x6EE5;&#x7528;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x672C;&#x4EBA;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x521D;&#x5C31;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5D4C;&#x5957;&#x548C;&#x5F15;&#x7528;&#x7B49;&#x65B9;&#x5F0F;&#x6765;&#x5B9A;&#x4E49;&#x6837;&#x5F0F;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x4EE5;&#x6765;&#x7ED9;&#x81EA;&#x5DF1;&#x7701;&#x4E86;&#x5F88;&#x591A;&#x529F;&#x592B;&#xFF0C;&#x4F46;&#x6587;&#x4EF6;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x8981;&#x7F16;&#x8BD1;&#x51FA;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x7528;&#x53CD;&#x590D;&#x7684;&#x6572;&#x90A3;&#x4E48;&#x591A;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x4F46;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x4F9D;&#x7136;&#x8FD8;&#x662F;&#x4F1A;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x65B9;&#x4FBF;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x540C;&#x65F6;&#x4F9D;&#x7136;&#x8981;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x51CF;&#x5C11;&#x9009;&#x62E9;&#x5668;&#x5C42;&#x7EA7;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x4F7F;&#x7528;&#x7EC4;&#x5408;&#x7684;css&#x7C7B;&#x9009;&#x62E9;&#x5668;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x8003;&#x8651;css&#x6837;&#x5F0F;&#x8986;&#x76D6;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x907F;&#x5F00;&#x4E86;&#x8BA1;&#x7B97;&#x9009;&#x62E9;&#x7B26;&#x6743;&#x91CD;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x9AD8;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x7528;&#x6027;&#xFF0C;&#x7EC4;&#x5408;&#x7684;&#x6982;&#x5FF5;&#x662F;&#x628A;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x53EF;&#x53D8;&#x90E8;&#x5206;&#x548C;&#x7A33;&#x5B9A;&#x90E8;&#x5206;&#x5206;&#x5272;&#x5F00;&#x6765;&#xFF0C;&#x7A33;&#x5B9A;&#x90E8;&#x5206;&#x4F5C;&#x4E3A;&#x4E3B;&#x4F53;&#x7C7B;&#xFF0C;&#x53EF;&#x53D8;&#x90E8;&#x5206;&#x5206;&#x6210;&#x51E0;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7C7B;&#xFF0C;&#x7C7B;&#x4E0E;&#x7C7B;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x7EE7;&#x627F;&#xFF0C;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x8D77;&#x5230;&#x51CF;&#x5C11;&#x5BF9;html&#x7ED3;&#x6784;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x91CD;&#x7528;&#x6027;&#x7684;&#x4F5C;&#x7528;&#x3002;</p>
<p><strong>&#x5982;&#x4F55;&#x517C;&#x5BB9;IE&#x6D4F;&#x89C8;&#x5668;&#xFF1F;</strong></p>
<p>IE8&#x53CA;&#x4EE5;&#x4E0B;&#x7248;&#x672C;&#x7684;IE&#x6D4F;&#x89C8;&#x5668;&#x4E00;&#x76F4;&#x662F;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC3;&#x4E2D;&#x7684;&#x75DB;&#x3002;&#x4E3A;&#x4E86;&#x517C;&#x5BB9;&#x5B83;&#x4EEC;&#x505A;&#x989D;&#x5916;&#x6DFB;&#x52A0;&#x7684;&#x4EE3;&#x7801;&#x6210;&#x4E3A;hack&#x4EE3;&#x7801;&#xFF0C;&#x5F80;&#x5F80;&#x4EBA;&#x4EEC;&#x90FD;&#x4E0D;&#x60F3;&#x53BB;&#x5199;&#x90A3;&#x4E9B;&#x4EE3;&#x7801;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x517C;&#x5BB9;IE&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E00;&#x4E9B;&#x5B9E;&#x8DF5;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#xFF08;1&#xFF09;&#x719F;&#x6089;IE&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x6837;&#x5F0F;&#x517C;&#x5BB9;&#x95EE;&#x9898;</p>
<p>&#x4E00;&#x7C7B;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x672C;&#x8EAB;&#x7684;bug&#xFF0C;&#x4E00;&#x7C7B;&#x662F;&#x548C;&#x6807;&#x51C6;&#x4E0D;&#x517C;&#x5BB9;&#x6216;&#x8FD8;&#x4E0D;&#x652F;&#x6301;&#x6807;&#x51C6;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x5206;&#x79BB;&#x6837;&#x5F0F;&#x517C;&#x5BB9;&#x4EE3;&#x7801;</p>
<p>&#x6309;&#x7167;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x5224;&#x65AD;&#x8BED;&#x53E5;&#xFF0C;&#x6309;&#x9700;&#x52A0;&#x8F7D;</p>
<p><strong>em&#x3001;px&#x8FD8;&#x662F;%&#xFF1F;</strong></p>
<p>&#x8C08;&#x53CA;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5982;&#x4ECA;&#x9875;&#x9762;&#x529F;&#x80FD;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x7528;&#x6765;&#x8BBF;&#x95EE;&#x9875;&#x9762;&#x7684;&#x8BBE;&#x5907;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x9875;&#x9762;&#x7684;&#x5E03;&#x5C40;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9887;&#x5177;&#x6311;&#x6218;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x9875;&#x9762;&#x5F53;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x7684;&#x5C3A;&#x5BF8;&#x548C;&#x5B57;&#x4F53;&#x3001;&#x56FE;&#x7247;&#x7684;&#x5927;&#x5C0F;&#x7B49;&#x4E5F;&#x8DDF;&#x5E03;&#x5C40;&#x606F;&#x606F;&#x76F8;&#x5173;&#x3002;&#x9274;&#x4E8E;&#x6B64;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x5F00;&#x59CB;&#x91CD;&#x89C6;&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x9875;&#x9762;&#x5E03;&#x5C40;&#xFF0C;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x5C06;&#x9875;&#x9762;&#x5143;&#x7D20;&#x7684;&#x5C3A;&#x5BF8;&#x548C;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x76F8;&#x5BF9;&#x503C;&#x3002;&#x5B57;&#x4F53;&#x76F8;&#x5BF9;&#x5355;&#x4F4D;&#x5305;&#x62EC;&#xFF1A;em&#x3001;ex&#x3001;ch&#x3001;rem&#x3002;&#x66F4;&#x591A;&#x5185;&#x5BB9;&#x65E0;&#x9700;&#x8D58;&#x8FF0;&#xFF0C;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x6599;&#x6765;&#x8BB2;&#x89E3;&#x3002;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x51E0;&#x4E2A;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x5C3D;&#x91CF;&#x8BBE;&#x7F6E;&#x76F8;&#x5BF9;&#x5C3A;&#x5BF8;</p>
<p>&#x6240;&#x8C13;&#x8BBE;&#x7F6E;&#x76F8;&#x5BF9;&#x5C3A;&#x5BF8;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x9875;&#x9762;&#x6574;&#x4F53;&#x7684;&#x5E03;&#x5C40;&#x662F;&#x81EA;&#x9002;&#x5E94;&#x7684;&#xFF0C;&#x6574;&#x4F53;&#x7684;&#x5C3A;&#x5BF8;&#x53EF;&#x4EE5;&#x662F;&#x56FA;&#x5B9A;&#x5C3A;&#x5BF8;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x5C3A;&#x5BF8;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x9875;&#x9762;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x53EA;&#x6709;&#x5728;&#x53EF;&#x9884;&#x77E5;&#x5143;&#x7D20;&#x5C3A;&#x5BF8;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x4F7F;&#x7528;&#x7EDD;&#x5BF9;&#x5C3A;&#x5BF8;</p>
<p>&#x6BD4;&#x5982;&#x8BBE;&#x8BA1;&#x4E0A;&#x8981;&#x6C42;&#x4F7F;&#x7528;&#x7EDD;&#x5BF9;&#x5BBD;&#x5EA6;&#xFF0C;&#x6BD4;&#x5982;&#x6574;&#x4F53;&#x5BBD;&#x5EA6;&#xFF0C;&#x4FA7;&#x8FB9;&#x680F;&#x5BBD;&#x5EA6;&#xFF0C;&#x9875;&#x5934;&#x9875;&#x5C3E;&#x7684;&#x9AD8;&#x5EA6;&#x56FA;&#x5B9A;&#x7B49;&#xFF0C;&#x5728;&#x5C55;&#x793A;&#x56FE;&#x7247;&#x3001;&#x89C6;&#x9891;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5408;&#x9002;&#x7684;&#x56FA;&#x5B9A;&#x5C3A;&#x5BF8;&#x4F1A;&#x8BA9;&#x8FD9;&#x4E9B;&#x591A;&#x5A92;&#x4F53;&#x5143;&#x7D20;&#x5C55;&#x793A;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x4F7F;&#x7528;em&#x8BBE;&#x7F6E;&#x5B57;&#x4F53;&#x5927;&#x5C0F;</p>
<p>&#x4F7F;&#x7528;px&#x8BBE;&#x7F6E;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x4E0D;&#x597D;&#xFF0C;&#x4F7F;&#x7528;&#x767E;&#x5206;&#x6BD4;&#x8BBE;&#x7F6E;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x4E5F;&#x4E0D;&#x7B26;&#x5408;&#x4E60;&#x60EF;&#xFF0C;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#x662F;&#x4F7F;&#x7528;em&#x8BBE;&#x7F6E;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x5B57;&#x4F53;&#x8BBE;&#x7F6E;&#x7684;&#x5C42;&#x7EA7;&#x589E;&#x591A;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53CD;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x7EF4;&#x62A4;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x5BF9;&#x4E8E;&#x6B64;&#xFF0C;css3&#x5F15;&#x5165;&#x4E86;rem&#x5355;&#x4F4D;&#xFF0C;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x6839;&#x5143;&#x7D20;&#x7684;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x8BA1;&#x7B97;&#x7684;&#xFF0C;&#x5C31;&#x907F;&#x514D;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x76EE;&#x524D;&#x9664;&#x4E86;IE8&#x53CA;&#x4EE5;&#x4E0B;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x652F;&#x6301;&#x5B83;&#x3002;</p>
<p>&#x6B64;&#x6587;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x70B9;&#x5230;&#x4E3A;&#x6B62;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x4E00;&#x4E9B;&#x65B0;&#x624B;&#x6765;&#x8BF4;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5F15;&#x5BFC;&#x4F5C;&#x7528;&#xFF0C;&#x5E26;&#x6765;&#x4E00;&#x5B9A;&#x7684;&#x5E2E;&#x52A9;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x5728;&#x81EA;&#x5DF1;&#x9010;&#x6B65;&#x7684;&#x5B9E;&#x8DF5;&#x5F53;&#x4E2D;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x7684;&#x611F;&#x89E6;&#x548C;&#x7ECF;&#x9A8C;&#x3001;&#x6559;&#x8BAD;&#x7B49;&#xFF0C;&#x7ECF;&#x5E38;&#x7684;&#x603B;&#x7ED3;&#x548C;&#x653E;&#x5165;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x5B9E;&#x8DF5;&#x5F53;&#x4E2D;&#xFF0C;&#x76F8;&#x4FE1;&#x662F;&#x4F1A;&#x5F88;&#x6709;&#x597D;&#x5904;&#x7684;&#x3002;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x52A0;&#x6CB9;&#xFF01;~</p>
</div><a data-url="http://yoursite.com/2015/03/28/《web前端最佳实践》—高维护性css/" data-id="cisd9dxzl00274uqi1vi87t0f" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2015/03/30/《web前端最佳实践》—高性能css/" class="pre">《web前端最佳实践》—高性能css</a><a href="/2015/03/28/《web前端最佳实践》—HTML篇/" class="next">《web前端最佳实践》—HTML篇</a></div><div data-thread-key="2015/03/28/《web前端最佳实践》—高维护性css/" data-title="《web前端最佳实践》—高维护性css" data-url="http://yoursite.com/2015/03/28/《web前端最佳实践》—高维护性css/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2015/03/28/《web前端最佳实践》—高维护性css/" data-title="《web前端最佳实践》—高维护性css" data-url="http://yoursite.com/2015/03/28/《web前端最佳实践》—高维护性css/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/成长，经历，思考/" style="font-size: 15px;">成长，经历，思考</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/08/17/tencent_oneyear/">总有一个地方，我们未曾到达——我的鹅厂周年记</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/15/readbook_seetheworld/">静静的打开一本书，你会看到新的世界</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>