<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="总结," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x5199;&amp;#x5728;&amp;#x524D;&amp;#x9762;&amp;#x6211;&amp;#x5E38;&amp;#x5728;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4ECB;&amp;#x7ECD;&amp;#x91CC;&amp;#x8FD9;&amp;#x6837;&amp;#x5199;&amp;#xFF0C;&amp;#x7231;&amp;#x597D;&amp;#xFF1A;&amp;#x8BFB;&amp;#x4E66;&amp;#x3001;&amp;#x5199;&amp;#x4F5C;&amp;#x3002;">
<meta property="og:type" content="article">
<meta property="og:title" content="我的文字情结">
<meta property="og:url" content="http://yoursite.com/2016/02/28/my-love-with-words/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x5199;&amp;#x5728;&amp;#x524D;&amp;#x9762;&amp;#x6211;&amp;#x5E38;&amp;#x5728;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4ECB;&amp;#x7ECD;&amp;#x91CC;&amp;#x8FD9;&amp;#x6837;&amp;#x5199;&amp;#xFF0C;&amp;#x7231;&amp;#x597D;&amp;#xFF1A;&amp;#x8BFB;&amp;#x4E66;&amp;#x3001;&amp;#x5199;&amp;#x4F5C;&amp;#x3002;">
<meta property="og:updated_time" content="2016-02-28T15:30:19.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="我的文字情结">
<meta name="twitter:description" content="&amp;#x5199;&amp;#x5728;&amp;#x524D;&amp;#x9762;&amp;#x6211;&amp;#x5E38;&amp;#x5728;&amp;#x4E2A;&amp;#x4EBA;&amp;#x4ECB;&amp;#x7ECD;&amp;#x91CC;&amp;#x8FD9;&amp;#x6837;&amp;#x5199;&amp;#xFF0C;&amp;#x7231;&amp;#x597D;&amp;#xFF1A;&amp;#x8BFB;&amp;#x4E66;&amp;#x3001;&amp;#x5199;&amp;#x4F5C;&amp;#x3002;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 我的文字情结 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                我的文字情结
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-02-28T00:00:00+08:00" content="2016-02-28">
              2016-02-28
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/总结/" itemprop="url" rel="index">
                    <span itemprop="name">总结</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x5199;&#x5728;&#x524D;&#x9762;"><a href="#&#x5199;&#x5728;&#x524D;&#x9762;" class="headerlink" title="&#x5199;&#x5728;&#x524D;&#x9762;"></a>&#x5199;&#x5728;&#x524D;&#x9762;</h2><p>&#x6211;&#x5E38;&#x5728;&#x4E2A;&#x4EBA;&#x4ECB;&#x7ECD;&#x91CC;&#x8FD9;&#x6837;&#x5199;&#xFF0C;&#x7231;&#x597D;&#xFF1A;&#x8BFB;&#x4E66;&#x3001;&#x5199;&#x4F5C;&#x3002;</p>
<p>&#x6BCF;&#x6B21;&#x8DEF;&#x8FC7;&#x4E66;&#x5E97;&#x6216;&#x8005;&#x56FE;&#x4E66;&#x9986;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x79CD;&#x83AB;&#x540D;&#x7684;&#x5174;&#x594B;&#xFF0C;&#x5C31;&#x50CF;&#x5973;&#x4EBA;&#x770B;&#x5230;&#x6F02;&#x4EAE;&#x7684;&#x8863;&#x670D;&#x6216;&#x5305;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x6211;&#x5076;&#x5C14;&#x4F1A;&#x88AB;&#x4EBA;&#x8BF4;&#xFF0C;&#x8BDD;&#x771F;&#x591A;&#xFF0C;&#x5176;&#x5B9E;&#x8BA4;&#x8BC6;&#x6211;&#x7684;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x6211;&#x662F;&#x4E2A;&#x7279;&#x8001;&#x5B9E;&#x7684;&#x4EBA;&#x3002;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x8BDD;&#x591A;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x4E0D;&#x8BF4;&#x8BDD;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x662F;&#x5728;&#x601D;&#x8003;&#x554A;&#xFF0C;&#x4F60;&#x770B;&#x4EBA;&#x5BB6;&#x7231;&#x56E0;&#x65AF;&#x5766;&#xFF0C;&#x8BDD;&#x6BD4;&#x6211;&#x8FD8;&#x5C11;&#xFF0C;&#x4E8E;&#x662F;&#x2026;&#x597D;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x6BD4;&#x55BB;&#x4E0D;&#x6070;&#x5F53;&#xFF0C;stop~</p>
<p>&#x5982;&#x679C;&#x653E;&#x5728;&#x5FC3;&#x91CC;&#x4E0D;&#x8BF4;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x548C;&#x6587;&#x5B57;&#x6709;&#x4E86;&#x8054;&#x7CFB;&#x3002;</p>
<p>&#x4ECE;&#x5C0F;&#x6211;&#x4E0D;&#x662F;&#x8BED;&#x6587;&#x7279;&#x51FA;&#x4F17;&#x7684;&#x90A3;&#x7C7B;&#x4EBA;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x662F;&#x9057;&#x4F20;&#x4E86;&#x8001;&#x7238;&#x7684;&#x67D0;&#x4E9B;&#x7279;&#x8D28;&#xFF0C;&#x5BF9;&#x4E8B;&#x7269;&#x7684;&#x4F53;&#x4F1A;&#x6BD4;&#x8F83;&#x7EC6;&#x81F4;&#x3002;&#x518D;&#x52A0;&#x4E0A;&#x6211;&#x4E00;&#x8D2F;&#x7684;&#x8BA4;&#x771F;&#xFF0C;&#x5C31;&#x4F1A;&#x5BF9;&#x5B57;&#x6BD4;&#x8F83;&#x8BB2;&#x7A76;&#xFF0C;&#x8FDB;&#x800C;&#x53D1;&#x5C55;&#x5230;&#x53E5;&#xFF0C;&#x5230;&#x6587;&#xFF0C;&#x4E5F;&#x559C;&#x6B22;&#x770B;&#x8BED;&#x8A00;&#x7C7B;&#x8282;&#x76EE;&#xFF0C;&#x8BBF;&#x8C08;&#x3001;&#x7EFC;&#x827A;&#x3001;&#x76F8;&#x58F0;&#x7B49;&#x3002;&#x5370;&#x8C61;&#x4E2D;&#x8003;&#x8BD5;&#x6CA1;&#x5F97;&#x8FC7;&#x6EE1;&#x5206;&#xFF0C;&#x751A;&#x81F3;&#x7ECF;&#x5E38;&#x5728;&#x8003;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x9762;&#x5BF9;&#x7740;&#x90A3;&#x4E9B;&#x201C;&#x547D;&#x9898;&#x201D;&#x4F5C;&#x6587;&#x65E0;&#x4ECE;&#x4E0B;&#x7B14;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x5F71;&#x54CD;&#x6211;&#x559C;&#x6B22;&#x5B83;&#xFF0C;&#x6211;&#x53EA;&#x9700;&#x8981;&#x5728;&#x6211;&#x60F3;&#x5199;&#x3001;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80FD;&#x7528;&#x6211;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x8FBE;&#x51FA;&#x6765;&#xFF0C;&#x8DB3;&#x77E3;&#x3002;</p>
<h2 id="&#x8DA3;&#x95FB;&#x8F76;&#x4E8B;"><a href="#&#x8DA3;&#x95FB;&#x8F76;&#x4E8B;" class="headerlink" title="&#x8DA3;&#x95FB;&#x8F76;&#x4E8B;"></a>&#x8DA3;&#x95FB;&#x8F76;&#x4E8B;</h2><p>&#x8BF4;&#x5230;&#x5199;&#x6587;&#xFF0C;&#x6709;&#x4E0D;&#x5C11;&#x8BA9;&#x6211;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#x8DA3;&#x4E8B;&#xFF0C;&#x54B1;&#x6765;&#x8BF4;&#x51E0;&#x4EF6;&#xFF1A;</p>
<p>&#x5F88;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x8FD8;&#x4E0D;&#x8BA4;&#x8BC6;&#x90A3;&#x4E48;&#x591A;&#x5B57;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#x5728;&#x4E66;&#x4E0A;&#x770B;&#x5230;&#x201C;&#x9C81;&#x8FC5;&#x201D;&#x5148;&#x751F;&#xFF0C;&#x4E0D;&#x8BA4;&#x8BC6;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x8BFB;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x7ED3;&#x679C;&#x8BFB;&#x6210;&#x4E86;&#x201C;&#x767D;&#x4E94;&#x201D;&#x5148;&#x751F;&#xFF0C;&#x81F3;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0D;&#x8981;&#x95EE;&#x6211;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x4EEC;&#x4ECE;&#x5C0F;&#x7B11;&#x5230;&#x5927;&#xFF0C;&#x53EF;&#x662F;&#x6211;&#x600E;&#x4E48;&#x90FD;&#x60F3;&#x4E0D;&#x8D77;&#x6765;&#x81EA;&#x5DF1;&#x5E72;&#x8FC7;&#x8FD9;&#x4E8B;&#x513F;&#x2026;</p>
<p>&#x5C0F;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x548C;&#x59D0;&#x59D0;&#x5728;&#x56F4;&#x7740;&#x4E00;&#x4E2A;&#x684C;&#x5B50;&#x5199;&#x8BED;&#x6587;&#x4F5C;&#x4E1A;&#xFF0C;&#x7136;&#x540E;&#x7238;&#x5F00;&#x59CB;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x8BED;&#x6587;&#x6C34;&#x5E73;&#x505A;&#x8BC4;&#x4EF7;&#xFF0C;&#x505A;&#x6BD4;&#x8F83;&#x3002;&#x8BF4;&#x7740;&#x8BF4;&#x7740;&#xFF0C;&#x8001;&#x7238;&#x5C31;&#x8868;&#x626C;&#x6211;&#xFF0C;&#x6211;&#x59D0;&#x5F53;&#x7136;&#x4E0D;&#x9AD8;&#x5174;&#xFF0C;&#x6070;&#x5DE7;&#x6B63;&#x5728;&#x7EC7;&#x6BDB;&#x8863;&#x7684;&#x5988;&#x5988;&#x4E00;&#x4E0D;&#x5C0F;&#x5FC3;&#x628A;&#x7EBF;&#x7403;&#x4ECE;&#x624B;&#x4E2D;&#x6ED1;&#x843D;&#xFF0C;&#x6EDA;&#x5230;&#x4E86;&#x65C1;&#x8FB9;&#x7684;&#x8863;&#x67DC;&#x5E95;&#x4E0B;&#xFF0C;&#x6211;&#x53CD;&#x5E94;&#x7A0D;&#x5FEB;&#xFF0C;&#x4E5F;&#x662F;&#x7537;&#x5B69;&#x5B50;&#xFF0C;&#x5C31;&#x9A6C;&#x4E0A;&#x8DB4;&#x5230;&#x5730;&#x4E0A;&#x628A;&#x624B;&#x4F38;&#x8FDB;&#x53BB;&#x62FF;&#x4E86;&#x51FA;&#x6765;&#x3002;&#x5C31;&#x8FD9;&#x90FD;&#x88AB;&#x7238;&#x7ED9;&#x902E;&#x5230;&#x673A;&#x4F1A;&#xFF0C;&#x8BF4;&#xFF1A;&#x4F60;&#x4EEC;&#x4FE9;&#x5C31;&#x521A;&#x624D;&#x8FD9;&#x4E2A;&#x4E3E;&#x52A8;&#xFF0C;&#x5199;&#x4E2A;&#x5C0F;&#x4F5C;&#x6587;&#x51FA;&#x6765;&#x7ED9;&#x6211;&#x770B;&#x770B;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x8C01;&#x5199;&#x5F97;&#x597D;&#x4E86;&#x3002;&#x8FD9;&#x4E00;&#x8BF4;&#x6211;&#x4FE9;&#x90FD;&#x6709;&#x4E9B;&#x610F;&#x5916;&#xFF0C;&#x4E5F;&#x6709;&#x4E9B;&#x72AF;&#x96BE;&#xFF0C;&#x4F46;&#x8C01;&#x4F1A;&#x670D;&#x6C14;&#x5462;&#xFF0C;&#x5C31;&#x62A1;&#x8D77;&#x7B14;&#x5F00;&#x5199;&#x4E86;&#x3002;&#x5199;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x7ED3;&#x679C;&#x90A3;&#x5F53;&#x7136;&#x662F;&#xFF0C;&#x563F;&#x563F;&#xFF0C;&#x6211;&#x5199;&#x5F97;&#x53C8;&#x591A;&#x53C8;&#x597D;&#xFF0C;&#x7F8E;&#x6ECB;&#x6ECB;&#x3002;&#x4E0D;&#x8FC7;&#x540E;&#x6765;&#x60C5;&#x51B5;&#x6709;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x6211;&#x6709;&#x51E0;&#x5E74;&#x72B6;&#x6001;&#x4E0D;&#x597D;&#xFF0C;&#x5B66;&#x4E60;&#x4E5F;&#x4E0D;&#x662F;&#x5F88;&#x4E13;&#x5FC3;&#xFF0C;&#x5C31;&#x6CA1;&#x6211;&#x59D0;&#x5199;&#x5F97;&#x597D;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#x3002;</p>
<p>&#x521D;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5199;&#x4F5C;&#x6587;&#x662F;&#x5E38;&#x4E8B;&#xFF0C;&#x6BCF;&#x6B21;&#x4F5C;&#x6587;&#x88AB;&#x6279;&#x6539;&#x51FA;&#x6765;&#xFF0C;&#x4F18;&#x79C0;&#x4F5C;&#x6587;&#x90FD;&#x4F1A;&#x88AB;&#x8BED;&#x6587;&#x8001;&#x5E08;&#x6311;&#x51FA;&#x6765;&#x5728;&#x5168;&#x73ED;&#x540C;&#x5B66;&#x9762;&#x524D;&#x8BFB;&#xFF0C;&#x6211;&#xFF0C;&#x51E0;&#x4E4E;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x83B7;&#x5F97;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4E0D;&#x7BA1;&#x81EA;&#x8BA4;&#x4E3A;&#x5199;&#x5F97;&#x591A;&#x597D;&#xFF0C;&#x6211;&#x90FD;&#x6000;&#x7591;&#x8001;&#x5E08;&#x7684;&#x5BA1;&#x7F8E;&#x4E86;~&#x4F46;&#x662F;&#x6709;&#x51E0;&#x4E2A;&#x73ED;&#x91CC;&#x7684;&#x5B66;&#x9738;&#x5374;&#x662F;&#x6BCF;&#x6B21;&#x90FD;&#x6709;&#xFF0C;&#x6211;&#x5C31;&#x7EB3;&#x4E86;&#x95F7;&#xFF0C;&#x540E;&#x6765;&#xFF0C;&#x6211;&#x505A;&#x4E86;&#x5C0F;&#x806A;&#x660E;&#xFF0C;&#x4ECE;&#x300A;&#x65F6;&#x6587;&#x9009;&#x7CB9;&#x300B;&#x4E0A;&#x9762;&#x627E;&#x4E86;&#x4E00;&#x7BC7;&#x89C9;&#x5F97;&#x633A;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x6458;&#x6284;&#xFF0C;&#x7136;&#x540E;&#x8DDF;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x76F8;&#x642D;&#x914D;&#xFF0C;&#x7EC4;&#x5408;&#x6210;&#x4E86;&#x4E00;&#x7BC7;&#x6587;&#xFF0C;&#x7ED3;&#x679C;&#xFF0C;&#x8FD8;&#x771F;&#x662F;&#x88AB;&#x8BC4;&#x4E3A;&#x4F18;&#x79C0;&#x4F5C;&#x6587;&#xFF0C;&#x88AB;&#x8BED;&#x6587;&#x8001;&#x5E08;&#x62FF;&#x51FA;&#x6765;&#x8BFB;&#x4E86;&#xFF0C;&#x66F4;&#x5177;&#x8BBD;&#x523A;&#x610F;&#x5473;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x6070;&#x5DE7;&#x8BFB;&#x5230;&#x6211;&#x6458;&#x6284;&#x7ED3;&#x675F;&#x7684;&#x90A3;&#x53E5;&#x8BDD;&#xFF0C;&#x4E0B;&#x9762;&#x5185;&#x5BB9;&#x7ED9;&#x7684;&#x8BC4;&#x4EF7;&#x662F;&#x201C;&#x5199;&#x5F97;&#x5C31;&#x4E0D;&#x600E;&#x4E48;&#x6837;&#x4E86;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x4E0D;&#x8BFB;&#x4E86;&#xFF0C;&#x6211;&#x53EA;&#x6709;&#x201C;&#x5475;&#x5475;&#x201D;&#x3002;<br>&#x53E6;&#x5916;&#xFF0C;&#x5F53;&#x5E74;&#x4F18;&#x79C0;&#x4F5C;&#x6587;&#x90FD;&#x6709;&#x4E2A;&#x5171;&#x540C;&#x70B9;&#xFF0C;&#x6BCF;&#x4E00;&#x7BC7;&#x90FD;&#x4F1A;&#x8DD1;&#x5230;&#x53E4;&#x7F57;&#x9A6C;&#x6216;&#x57C3;&#x53CA;&#x91D1;&#x5B57;&#x5854;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4EC0;&#x4E48;&#x9065;&#x8FDC;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F5C;&#x6587;&#x9898;&#x76EE;&#x662F;&#x5565;&#xFF0C;&#x4F60;&#x90FD;&#x4F1A;&#x201C;&#x4E0D;&#x660E;&#x89C9;&#x5389;&#x201D;~</p>
<p>&#x9AD8;&#x4E00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x521A;&#x53BB;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x719F;&#xFF0C;&#x73ED;&#x91CC;&#x5F00;&#x73ED;&#x4F1A;&#xFF0C;&#x8981;&#x8BF7;&#x6BCF;&#x4E2A;&#x5BBF;&#x820D;&#x51FA;&#x4E2A;&#x8282;&#x76EE;&#xFF0C;&#x5230;&#x4E86;&#x67D0;&#x5BBF;&#x820D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E2A;&#x957F;&#x76F8;&#x6E05;&#x79C0;&#x7684;&#x7537;&#x751F;&#x88AB;&#x8D77;&#x54C4;&#x63A8;&#x5230;&#x4E86;&#x53F0;&#x4E0A;&#xFF0C;&#x624B;&#x91CC;&#x62FF;&#x7740;&#x4E00;&#x5F20;&#x7EB8;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x731C;&#x4ED6;&#x4F1A;&#x8868;&#x6F14;&#x4EC0;&#x4E48;&#x8282;&#x76EE;&#xFF0C;&#x7ED3;&#x679C;&#x4ED6;&#x8BF4;&#xFF0C;&#x6211;&#x7ED9;&#x5927;&#x5BB6;&#x6717;&#x8BF5;&#x9996;&#x8BD7;&#xFF0C;&#x987F;&#x89C9;&#x633A;&#x6CA1;&#x52B2;&#x7684;&#xFF0C;&#x4ED6;&#x7D27;&#x63A5;&#x7740;&#x8BF4;&#xFF0C;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#xFF1A;&#x795E;&#x9A6C;&#xFF1F;&#xFF01;&#x8FD9;&#x6211;&#x53EF;&#x5C31;&#x5750;&#x4E0D;&#x4F4F;&#x4E86;&#xFF0C;&#x6211;&#x600E;&#x80FD;&#x5FCD;&#x6709;&#x4EBA;&#x5728;&#x6211;&#x9762;&#x524D;&#x5982;&#x6B64;&#x51FA;&#x98CE;&#x5934;&#xFF0C;&#x8FD8;&#x662F;&#x8BD7;&#x3002;&#x4F46;&#x6211;&#x4E5F;&#x662F;&#x771F;&#x7684;&#x62FF;&#x4ED6;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#x5462;&#xFF0C;&#x4EE5;&#x8BD7;&#x4F1A;&#x53CB;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x6B63;&#x513F;&#x516B;&#x7ECF;&#x5199;&#x4E86;&#x7B2C;&#x4E00;&#x9996;&#x8BD7;&#xFF0C;&#x627E;&#x5230;&#x4ED6;&#x5E2E;&#x6211;&#x770B;&#x770B;&#xFF0C;&#x4ED6;&#x770B;&#x5B8C;&#x4E4B;&#x540E;&#x8BF4;&#xFF0C;&#x5199;&#x5F97;&#x4E0D;&#x9519;&#xFF0C;&#x5475;&#x5475;&#x3002;&#x4ECE;&#x90A3;&#x4EE5;&#x540E;&#xFF0C;&#x5C31;&#x6380;&#x5F00;&#x6211;&#x5199;&#x4F5C;&#x4E4B;&#x65C5;&#x7684;&#x7BC7;&#x7AE0;&#xFF0C;&#x540E;&#x9762;&#x518D;&#x8C08;&#x3002;</p>
<p>&#x9AD8;&#x4E8C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E00;&#x6B21;&#x4F5C;&#x6587;&#x9898;&#x76EE;&#x4E0B;&#x6765;&#xFF0C;&#x6CA1;&#x6709;&#x5934;&#x7EEA;&#xFF0C;&#x4F46;&#x53C8;&#x60F3;&#x628A;&#x5B83;&#x5199;&#x597D;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF0C;&#x6211;&#x628A;&#x81EA;&#x5DF1;&#x5173;&#x5728;&#x660F;&#x6697;&#x7684;&#x51FA;&#x79DF;&#x5C4B;&#x5185;&#xFF0C;&#x8BF4;&#x96BE;&#x542C;&#x70B9;&#x53EB;&#x201C;&#x80E1;&#x601D;&#x4E71;&#x60F3;&#x201D;&#xFF0C;&#x597D;&#x542C;&#x70B9;&#x53EB;&#x201C;&#x5929;&#x9A6C;&#x884C;&#x7A7A;&#x201D;&#x3002;&#x60F3;&#x7740;&#x60F3;&#x7740;&#xFF0C;&#x81EA;&#x5DF1;&#x5E73;&#x65F6;&#x559C;&#x6B22;&#x542C;&#x7684;&#x6B4C;&#x66F2;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x6B4C;&#x8BCD;&#x662F;&#x4E0D;&#x662F;&#x53EF;&#x4EE5;&#x62FF;&#x6765;&#x7528;&#xFF1F;&#x6211;&#x60F3;&#x5230;&#x4E86;tank&#x7684;&#x300A;&#x4E09;&#x56FD;&#x604B;&#x300B;&#xFF0C;&#x8FD8;&#x6709;&#x80E1;&#x5F66;&#x658C;&#x7684;&#x300A;&#x7687;&#x5E1D;&#x300B;&#xFF0C;&#x53EF;&#x662F;&#x8981;&#x600E;&#x4E48;&#x7ED3;&#x5408;&#x5462;&#xFF0C;&#x6700;&#x540E;&#x6211;&#x6784;&#x601D;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x53E4;&#x4EE3;&#x519B;&#x8425;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x7AD9;&#x5728;&#x5C0F;&#x58EB;&#x5175;&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x8868;&#x8FBE;&#x4ED6;&#x4EEC;&#x5FC3;&#x91CC;&#x7684;&#x60C5;&#x611F;&#x5427;&#x3002;&#x4E00;&#x8FB9;&#x5199;&#x4E00;&#x8FB9;&#x60F3;&#xFF0C;&#x4E00;&#x7BC7;&#x6587;&#x6700;&#x7EC8;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8FD8;&#x633A;&#x6EE1;&#x610F;&#xFF0C;&#x4F5C;&#x6587;&#x6279;&#x6539;&#x4E0B;&#x6765;&#xFF0C;&#x4EE4;&#x6211;&#x6CA1;&#x60F3;&#x5230;&#x7684;&#x662F;&#x5C45;&#x7136;&#x62FF;&#x4E86;56&#x5206;&#x7684;&#x9AD8;&#x5206;&#xFF08;&#x6EE1;&#x5206;60&#xFF09;&#xFF0C;&#x6211;&#x53EF;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x5F97;&#x8FC7;&#x63A5;&#x8FD1;50&#x5206;&#x7684;&#x5206;&#x6570;&#xFF0C;&#x4ECE;&#x90A3;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x8001;&#x8001;&#x5B9E;&#x5B9E;&#xFF0C;&#x5E73;&#x5E73;&#x6DE1;&#x6DE1;&#x7684;&#x5199;&#xFF0C;&#x9AD8;&#x5206;&#x5C31;&#x4E0D;&#x7528;&#x60F3;&#x4E86;&#xFF0C;&#x4F60;&#x8BB0;&#x4F4F;&#x4E86;&#x5417;~</p>
<p>&#x5927;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x5404;&#x79CD;&#x534F;&#x4F1A;&#x548C;&#x793E;&#x56E2;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x97F3;&#x4E50;&#x548C;&#x8FD0;&#x52A8;&#xFF0C;&#x5206;&#x522B;&#x62A5;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6295;&#x5165;&#x6700;&#x591A;&#x7684;&#x662F;&#x5076;&#x7136;&#x5F97;&#x77E5;&#x7684;&#x201C;&#x8BFB;&#x4E66;&#x4F1A;&#x201D;&#xFF0C;&#x201C;&#x8BFB;&#x4E66;&#x4F1A;&#x201D;&#x6BCF;&#x5B66;&#x671F;&#x4F1A;&#x4E3E;&#x529E;&#x4E00;&#x6B21;&#x4E3B;&#x9898;&#x5199;&#x4F5C;&#x6BD4;&#x8D5B;&#xFF0C;&#x521A;&#x53BB;&#x7B2C;&#x4E00;&#x5E74;&#xFF0C;&#x4F5C;&#x4E3A;&#x4F1A;&#x5185;&#x4EBA;&#x5458;&#xFF0C;&#x6211;&#x53C2;&#x52A0;&#x4E86;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4E5F;&#x53C2;&#x52A0;&#x4E86;&#x6587;&#x7AE0;&#x521D;&#x9009;&#x7684;&#x8BC4;&#x5BA1;&#x2026;&#x8BC4;&#x5BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5728;&#x4F17;&#x591A;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x4E86;&#x6211;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x6211;&#x5F53;&#x7136;&#x4E0D;&#x4F1A;&#x8BC4;&#x81EA;&#x5DF1;&#x7684;&#xFF0C;&#x5C31;&#x653E;&#x4E86;&#x56DE;&#x53BB;&#xFF0C;&#x540E;&#x6765;&#x6709;&#x4EBA;&#x62FF;&#x5230;&#x4E86;&#x6211;&#x7684;&#x6587;&#x7AE0;&#x5728;&#x90A3;&#x91CC;&#x770B;&#xFF0C;&#x521A;&#x53BB;&#x90FD;&#x4E0D;&#x719F;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x4E0D;&#x8BA4;&#x8BC6;&#x6211;&#xFF0C;&#x5C31;&#x8BC4;&#x8BBA;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x5C31;&#x5728;&#x65C1;&#x8FB9;&#x542C;&#x7740;&#xFF0C;&#x542C;&#x5F97;&#x8138;&#x90FD;&#x53D1;&#x70EB;&#xFF0C;&#x540E;&#x6765;&#x88AB;&#x6DD8;&#x6C70;&#x4E86;&#x2026;&#x5176;&#x5B9E;&#x5728;&#x90A3;&#x79CD;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x90A3;&#x4E48;&#x5FEB;&#x7684;&#x5BA1;&#x7A3F;&#x901F;&#x5EA6;&#xFF0C;&#x4E5F;&#x4E0D;&#x6307;&#x671B;&#x80FD;&#x8BC4;&#x4E0A;&#xFF0C;&#x5199;&#x5F97;&#x6BD4;&#x8F83;&#x7EC6;&#xFF0C;&#x5306;&#x5306;&#x5FD9;&#x5FD9;&#x770B;&#x5B8C;&#x7684;&#x8BDD;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x4E0D;&#x4F1A;&#x770B;&#x51FA;&#x4EC0;&#x4E48;&#x3002;<br>&#x4E0D;&#x8FC7;&#x7B2C;&#x4E00;&#x6B21;&#x867D;&#x7136;&#x88AB;&#x6DD8;&#x6C70;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x7B2C;&#x4E8C;&#x6B21;&#xFF0C;&#x8FD9;&#x4E00;&#x6B21;&#xFF0C;&#x6211;&#x5DF2;&#x7136;&#x6210;&#x4E3A;&#x4E86;&#x8BFB;&#x4E66;&#x4F1A;&#x7684;&#x526F;&#x4F1A;&#x957F;&#xFF0C;&#x5199;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x8BD7;&#x6587;&#x76F8;&#x642D;&#x914D;&#xFF0C;&#x8BC4;&#x5BA1;&#x7684;&#x65F6;&#x5019;&#x540C;&#x6837;&#x5728;&#x73B0;&#x573A;&#x53C2;&#x4E0E;&#xFF0C;&#x867D;&#x7136;&#x4ED6;&#x4EEC;&#x8BA4;&#x8BC6;&#x6211;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD8;&#x662F;&#x7ED9;&#x4E88;&#x4E86;&#x5BA2;&#x89C2;&#x7684;&#x8BC4;&#x4EF7;&#xFF0C;&#x6700;&#x540E;&#xFF0C;&#x5F97;&#x4E86;&#x4E00;&#x7B49;&#x5956;&#xFF0C;&#x55EF;&#x54FC;~&#x54C8;&#x54C8;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x51E0;&#x6BB5;&#x5C0F;&#x6545;&#x4E8B;&#x5148;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x4E0B;&#x9762;&#x804A;&#x70B9;&#x522B;&#x7684;&#x3002;</p>
<h2 id="&#x559C;&#x6B22;&#x7684;&#x4F5C;&#x5BB6;"><a href="#&#x559C;&#x6B22;&#x7684;&#x4F5C;&#x5BB6;" class="headerlink" title="&#x559C;&#x6B22;&#x7684;&#x4F5C;&#x5BB6;"></a>&#x559C;&#x6B22;&#x7684;&#x4F5C;&#x5BB6;</h2><p>&#x8BF4;&#x559C;&#x6B22;&#x5199;&#xFF0C;&#x90A3;&#x5F53;&#x7136;&#x5F97;&#x5148;&#x559C;&#x6B22;&#x8BFB;&#xFF0C;&#x4E0D;&#x7136;&#x6210;&#x4E86;&#x201C;&#x65E0;&#x6E90;&#x4E4B;&#x6C34;&#x3001;&#x65E0;&#x672C;&#x4E4B;&#x6728;&#x201D;&#xFF0C;&#x8981;&#x8BF4;&#x559C;&#x6B22;&#x54EA;&#x4E2A;&#x4F5C;&#x5BB6;&#xFF0C;&#x8BFB;&#x8FC7;&#x591A;&#x5C11;&#x540D;&#x8457;&#xFF0C;&#x8FD8;&#x771F;&#x6CA1;&#x6709;&#xFF0C;&#x80FD;&#x8BF4;&#x51FA;&#x6765;&#x7684;&#x5C48;&#x6307;&#x53EF;&#x6570;&#xFF0C;&#x4E09;&#x6BDB;&#x3001;&#x8D3E;&#x5E73;&#x51F9;&#x3001;&#x4F59;&#x79CB;&#x96E8;&#x3001;&#x97E9;&#x5BD2;&#x3001;&#x90ED;&#x656C;&#x660E;&#x3001;&#x8DEF;&#x9065;&#x3001;&#x743C;&#x7476;&#x3001;&#x5F20;&#x5C0F;&#x5A34;&#xFF0C;&#x597D;&#x5427;&#x5148;&#x8BF4;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x9976;&#x4E86;&#x6211;&#x5427;&#xFF0C;&#x4E00;&#x65F6;&#x771F;&#x8BF4;&#x4E0D;&#x51FA;&#x592A;&#x591A;&#xFF0C;&#x300A;&#x97E9;&#x5BD2;&#x6587;&#x96C6;&#x300B;&#x8BFB;&#x8FC7;&#x4E00;&#x672C;&#xFF0C;&#x8DEF;&#x9065;&#x7684;&#x300A;&#x4EBA;&#x751F;&#x300B;&#x8BFB;&#x8FC7;&#xFF0C;&#x4E2D;&#x5B66;&#x65F6;&#x4EE3;&#x7684;&#x6B66;&#x4FA0;&#x5C0F;&#x8BF4;&#x54B1;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B8C;&#x6574;&#x8BFB;&#x8FC7;&#x5F97;&#x771F;&#x6781;&#x5C11;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD8;&#x662F;&#x5F88;&#x6127;&#x5BF9;&#x4E8E;&#x201C;&#x7231;&#x8BFB;&#x4E66;&#x201D;&#x7684;&#x8BF4;&#x8F9E;&#x3002;&#x4E0D;&#x8FC7;&#x50CF;&#x300A;&#x8BFB;&#x8005;&#x300B;&#x3001;&#x300A;&#x9752;&#x5E74;&#x6587;&#x6458;&#x300B;&#x3001;&#x300A;&#x840C;&#x82BD;&#x300B;&#x4EC0;&#x4E48;&#x7684;&#x5012;&#x662F;&#x8BFB;&#x4E86;&#x4E0D;&#x5C11;&#xFF0C;&#x7B97;&#x5417;~</p>
<h2 id="&#x559C;&#x6B22;&#x7684;&#x5A92;&#x4F53;&#x4EBA;"><a href="#&#x559C;&#x6B22;&#x7684;&#x5A92;&#x4F53;&#x4EBA;" class="headerlink" title="&#x559C;&#x6B22;&#x7684;&#x5A92;&#x4F53;&#x4EBA;"></a>&#x559C;&#x6B22;&#x7684;&#x5A92;&#x4F53;&#x4EBA;</h2><p>&#x8FD9;&#x91CC;&#x8BF4;&#x5A92;&#x4F53;&#x4EBA;&#xFF0C;&#x8303;&#x56F4;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x5927;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#x662F;&#x7535;&#x89C6;&#x4E3B;&#x6301;&#x4EBA;&#xFF0C;&#x4E2A;&#x4EBA;&#x6700;&#x4E3A;&#x6B23;&#x8D4F;&#x7684;&#x662F;&#x767D;&#x5CA9;&#x677E;&#xFF0C;&#x6B63;&#x6C14;&#xFF0C;&#x624D;&#x6C14;&#xFF0C;&#x777F;&#x667A;&#xFF0C;&#x89C6;&#x89D2;&#x72EC;&#x7279;&#xFF0C;&#x601D;&#x7EF4;&#x654F;&#x6377;&#xFF0C;&#x6709;&#x540C;&#x884C;&#x5BF9;&#x5176;&#x8BC4;&#x4EF7;&#xFF0C;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4F60;&#x53EF;&#x80FD;&#x4ECE;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x53BB;&#x770B;&#x5F85;&#x548C;&#x89E3;&#x8BFB;&#xFF0C;&#x4ED6;&#x80FD;&#x4ECE;&#x4E03;&#x516B;&#x4E2A;&#x89D2;&#x5EA6;&#x53BB;&#x5256;&#x6790;&#x3002;&#x4E00;&#x76F4;&#x5F88;&#x94A6;&#x4F69;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x9664;&#x4E86;&#x4ED6;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x8F83;&#x4F18;&#x79C0;&#x7684;&#xFF0C;&#x8B6C;&#x5982;&#xFF0C;&#x6768;&#x6F9C;&#x3001;&#x9C81;&#x8C6B;&#x7B49;&#x3002;&#x90A3;&#x8FD9;&#x4E9B;&#x8DDF;&#x6587;&#x5B57;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x662F;&#x6709;&#xFF0C;&#x4EBA;&#x770B;&#x5F85;&#x4E8B;&#x7269;&#xFF0C;&#x6709;&#x611F;&#x6027;&#x548C;&#x7406;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x6587;&#x5B57;&#xFF0C;&#x53EF;&#x4EE5;&#x5F52;&#x4E3A;&#x611F;&#x6027;&#x4E00;&#x7C7B;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x7535;&#x89C6;&#x8282;&#x76EE;&#x7684;&#x5267;&#x672C;&#xFF0C;&#x65C1;&#x767D;&#xFF0C;&#x5E7F;&#x544A;&#x8BCD;&#xFF0C;&#x6B4C;&#x8BCD;&#xFF0C;&#x65E0;&#x4E0D;&#x5BF9;&#x6587;&#x5B57;&#x6709;&#x7740;&#x9AD8;&#x8981;&#x6C42;&#xFF0C;&#x5FC5;&#x987B;&#x662F;&#x53CD;&#x590D;&#x659F;&#x914C;&#x800C;&#x51FA;&#x7684;&#x7CBE;&#x534E;&#xFF0C;&#x4E0D;&#x591A;&#x4E0D;&#x5C11;&#x521A;&#x521A;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x5145;&#x6EE1;&#x7F8E;&#x611F;&#x548C;&#x611F;&#x67D3;&#x529B;&#x3002;</p>
<p>&#x4ED6;&#x4EEC;&#x4E5F;&#x90FD;&#x51FA;&#x8FC7;&#x4E66;&#xFF0C;&#x8BFB;&#x8FC7;&#x767D;&#x5CA9;&#x677E;&#x7684;&#x300A;&#x75DB;&#x5E76;&#x5FEB;&#x4E50;&#x7740;&#x300B;&#x3001;&#x300A;&#x5E78;&#x798F;&#x4E86;&#x5417;&#x300B;&#xFF0C;&#x6731;&#x519B;&#x7684;&#x300A;&#x6211;&#x7684;&#x96F6;&#x70B9;&#x65F6;&#x523B;&#x300B;&#xFF0C;&#x8FD1;&#x4E24;&#x5929;&#x521A;&#x4E70;&#x4E86;&#x4ED6;&#x7684;&#x65B0;&#x4E66;&#x300A;&#x767D;&#x8BF4;&#x300B;&#x548C;&#x6768;&#x6F9C;&#x7684;&#x300A;&#x4E00;&#x95EE;&#x4E00;&#x4E16;&#x754C;&#x300B;&#xFF0C;&#x51C6;&#x5907;&#x518D;&#x63A5;&#x53D7;&#x4E00;&#x4E9B;&#x718F;&#x9676;&#x3002;</p>
<h2 id="&#x66FE;&#x7ECF;&#x7684;&#x51B2;&#x52A8;"><a href="#&#x66FE;&#x7ECF;&#x7684;&#x51B2;&#x52A8;" class="headerlink" title="&#x66FE;&#x7ECF;&#x7684;&#x51B2;&#x52A8;"></a>&#x66FE;&#x7ECF;&#x7684;&#x51B2;&#x52A8;</h2><p>&#x65E2;&#x7136;&#x559C;&#x6B22;&#x8BFB;&#xFF0C;&#x559C;&#x6B22;&#x5199;&#xFF0C;&#x9664;&#x4E86;&#x53C2;&#x52A0;&#x6821;&#x56ED;&#x91CC;&#x7684;&#x6BD4;&#x8D5B;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x8BA4;&#x771F;&#x8003;&#x8651;&#x8FC7;&#x8981;&#x6295;&#x7A3F;&#xFF0C;&#x7ED9;&#x300A;&#x8BFB;&#x8005;&#x300B;&#x3001;&#x7ED9;&#x300A;&#x6D41;&#x884C;&#x6B4C;&#x66F2;&#x300B;&#xFF0C;&#x7ED9;&#x67D0;&#x5FD8;&#x4E86;&#x540D;&#x5B57;&#x7684;&#x5C0F;&#x4E66;&#xFF0C;&#x9664;&#x4E86;&#x662F;&#x5BF9;&#x81EA;&#x8EAB;&#x5199;&#x4F5C;&#x6C34;&#x5E73;&#x7684;&#x80AF;&#x5B9A;&#xFF0C;&#x8FD8;&#x80FD;&#x8D5A;&#x70B9;&#x7A3F;&#x8D39;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x6295;&#x4E86;&#x4E4B;&#x540E;&#x77F3;&#x6C89;&#x5927;&#x6D77;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x51C6;&#x5907;&#x597D;&#x4E86;&#x7A3F;&#x5B50;&#x5174;&#x5306;&#x5306;&#x7684;&#x8DD1;&#x53BB;&#x5BC4;&#xFF0C;&#x6253;&#x7535;&#x8BDD;&#x88AB;&#x544A;&#x77E5;&#x680F;&#x76EE;&#x5DF2;&#x7ECF;&#x505C;&#x4E86;&#xFF0C;&#x6DE1;&#x6DE1;&#x7684;&#x5FE7;&#x4F24;&#x3002;&#x76F4;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x8FC7;&#x8FD9;&#x4E48;&#x4E2A;&#x613F;&#x671B;&#xFF0C;&#x4E0D;&#x77E5;&#x4EE5;&#x540E;&#x6709;&#x6CA1;&#x6709;&#x673A;&#x4F1A;&#x4E86;~</p>
<h2 id="&#x6211;&#x7684;&#x4F5C;&#x54C1;&#x96C6;"><a href="#&#x6211;&#x7684;&#x4F5C;&#x54C1;&#x96C6;" class="headerlink" title="&#x6211;&#x7684;&#x4F5C;&#x54C1;&#x96C6;"></a>&#x6211;&#x7684;&#x4F5C;&#x54C1;&#x96C6;</h2><p>&#x6211;&#x6709;&#x4F5C;&#x54C1;&#x96C6;&#x5417;&#xFF1F;&#x6709;&#xFF0C;&#x54EA;&#x513F;&#x5462;&#xFF1F;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x653E;&#x54EA;&#x513F;&#x4E86;&#x3002;&#x6216;&#x8BB8;QQ&#x7A7A;&#x95F4;&#x91CC;&#x8FD8;&#x6709;&#x6B8B;&#x7559;&#xFF0C;&#x524D;&#x9762;&#x63D0;&#x5230;&#x662F;&#x9AD8;&#x4E2D;&#x65F6;&#x5019;&#x6380;&#x5F00;&#x7684;&#x5199;&#x4F5C;&#x7BC7;&#x7AE0;&#xFF0C;&#x4E5F;&#x60F3;&#x6295;&#x8FC7;&#x7A3F;&#xFF0C;&#x90FD;&#x51FA;&#x81EA;&#x6211;&#x7684;&#x4F5C;&#x54C1;&#x96C6;&#xFF0C;&#x51E0;&#x4E2A;&#x5F88;&#x666E;&#x901A;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;&#x5199;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x7ECF;&#x5386;&#xFF0C;&#x521D;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x79BB;&#x5F00;&#x5BB6;&#xFF0C;&#x8F97;&#x8F6C;&#x8FC7;&#x51E0;&#x5904;&#x6C42;&#x5B66;&#xFF0C;&#x63A5;&#x89E6;&#x8FC7;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x53D1;&#x751F;&#x8FC7;&#x5F88;&#x591A;&#x4E8B;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x5047;&#x671F;&#x7684;&#x65F6;&#x5019;&#x5728;&#x8001;&#x5BB6;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x591F;&#x5199;&#x4E86;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x97F3;&#x4E50;&#x561B;&#xFF0C;&#x88AB;&#x540C;&#x5B66;&#x523A;&#x6FC0;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x5F00;&#x59CB;&#x5199;&#x8BD7;&#xFF0C;&#x4E5F;&#x5199;&#x6B4C;&#x8BCD;&#xFF0C;&#x5176;&#x5B9E;&#x4E8C;&#x8005;&#x7684;&#x533A;&#x5206;&#x4E5F;&#x6CA1;&#x90A3;&#x4E48;&#x660E;&#x663E;&#xFF0C;&#x6B63;&#x6240;&#x8C13;&#x8BD7;&#x6B4C;&#x3002;</p>
<p>&#x5199;&#x5F97;&#x867D;&#x7136;&#x591A;&#xFF0C;&#x81EA;&#x8BA4;&#x4E3A;&#x5199;&#x5F97;&#x597D;&#x7684;&#x4E0D;&#x591A;&#xFF0C;&#x597D;&#x6587;&#x7AE0;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4F60;&#x6709;&#x591A;&#x535A;&#x5B66;&#xFF0C;&#x591A;&#x6709;&#x58A8;&#x6C34;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x70B9;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x4EBA;&#x4EEC;&#x5E38;&#x8BF4;&#x7684;&#x201C;&#x7075;&#x611F;&#x201D;&#xFF0C;&#x7075;&#x611F;&#x5176;&#x5B9E;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x770B;&#x4F3C;&#x7A81;&#x7136;&#x5192;&#x51FA;&#x6765;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5374;&#x662F;&#x4E00;&#x4E2A;&#x91CF;&#x53D8;&#x5230;&#x8D28;&#x53D8;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x601D;&#x7EF4;&#x8FD8;&#x662F;&#x60C5;&#x611F;&#xFF0C;&#x8DB3;&#x591F;&#x9971;&#x6EE1;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E30;&#x6C9B;&#x7684;&#x611F;&#x60C5;&#xFF0C;&#x8FBE;&#x5230;&#x4E86;&#x67D0;&#x4E2A;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x52A0;&#x4E0A;&#x4E00;&#x70B9;&#x70B9;&#x6587;&#x5B57;&#x4E0A;&#x7684;&#x659F;&#x914C;&#x7EC4;&#x7EC7;&#xFF0C;&#x5C31;ok&#x3002;&#x867D;&#x7136;&#x8BF4;&#x5F97;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x51E0;&#x4E2A;&#x6761;&#x4EF6;&#x540C;&#x65F6;&#x5177;&#x5907;&#x5F88;&#x96BE;&#x3002;&#x6240;&#x4EE5;&#x73B0;&#x5728;&#x6211;&#x5F88;&#x5C11;&#x52A8;&#x7B14;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x79EF;&#x7D2F;&#x548C;&#x523A;&#x6FC0;&#xFF0C;&#x5199;&#x4E0D;&#x51FA;&#x8BA9;&#x81EA;&#x5DF1;&#x6EE1;&#x610F;&#x7684;&#x4F5C;&#x54C1;&#xFF0C;&#x4E0D;&#x5982;&#x4E0D;&#x5199;&#x3002;</p>
<h2 id="&#x5199;&#x5728;&#x6700;&#x540E;"><a href="#&#x5199;&#x5728;&#x6700;&#x540E;" class="headerlink" title="&#x5199;&#x5728;&#x6700;&#x540E;"></a>&#x5199;&#x5728;&#x6700;&#x540E;</h2><p>&#x7D6E;&#x53E8;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6709;&#x611F;&#x4E8E;&#x73B0;&#x5728;&#x81EA;&#x5DF1;&#x633A;&#x96BE;&#x9759;&#x4E0B;&#x5FC3;&#x53BB;&#x8BFB;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x60F3;&#x5199;&#x70B9;&#x4EC0;&#x4E48;&#xFF0C;&#x4E5F;&#x5199;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x8111;&#x5B50;&#x91CC;&#x6CA1;&#x6599;&#xFF0C;&#x5C31;&#x60F3;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x54EA;&#xFF0C;&#x987A;&#x4FBF;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x548C;&#x6587;&#x5B57;&#x4E4B;&#x95F4;&#x5FAE;&#x5999;&#x7684;&#x60C5;&#x611F;&#x548C;&#x66FE;&#x7ECF;&#x7684;&#x7ECF;&#x5386;&#x3002;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x80FD;&#x628A;&#x5FC3;&#x6C89;&#x4E0B;&#x6765;&#xFF0C;&#x8E0F;&#x5B9E;&#x4E9B;&#xFF0C;&#x8BFB;&#x70B9;&#x4E66;&#xFF0C;&#x505A;&#x56DE;&#x5B89;&#x9759;&#x7684;&#x7F8E;&#x7537;&#x5B50;&#xFF0C;&#x54C8;&#x54C8;&#x3002;&#x4E0B;&#x6B21;&#x4F5C;&#x54C1;&#x89C1;~</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/总结/" rel="tag">#总结</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/25/javascript-study-one/" rel="next" title="征服javascript学习笔记（一）——认识js">
                <i class="fa fa-chevron-left"></i> 征服javascript学习笔记（一）——认识js
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/05/javascript-study-two/" rel="prev" title="征服javascript学习笔记（二）——基本概念（上）">
                征服javascript学习笔记（二）——基本概念（上） <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#写在前面"><span class="nav-number">1.</span> <span class="nav-text">写在前面</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#趣闻轶事"><span class="nav-number">2.</span> <span class="nav-text">趣闻轶事</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#喜欢的作家"><span class="nav-number">3.</span> <span class="nav-text">喜欢的作家</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#喜欢的媒体人"><span class="nav-number">4.</span> <span class="nav-text">喜欢的媒体人</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#曾经的冲动"><span class="nav-number">5.</span> <span class="nav-text">曾经的冲动</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#我的作品集"><span class="nav-number">6.</span> <span class="nav-text">我的作品集</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#写在最后"><span class="nav-number">7.</span> <span class="nav-text">写在最后</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
