<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="CSS," />





  <link rel="alternate" href="/atom.xml" title="灵感的小窝" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x6709;&amp;#x670B;&amp;#x53CB;&amp;#x9047;&amp;#x5230;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x4ED6;&amp;#x767E;&amp;#x601D;&amp;#x4E0D;&amp;#x5F97;&amp;#x5176;&amp;#x89E3;&amp;#xFF1A;&amp;#x6211;&amp;#x6CA1;">
<meta property="og:type" content="article">
<meta property="og:title" content="小谈inline-block的那点空隙">
<meta property="og:url" content="http://yoursite.com/2015/04/11/inline-block-gap/index.html">
<meta property="og:site_name" content="灵感的小窝">
<meta property="og:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x6709;&amp;#x670B;&amp;#x53CB;&amp;#x9047;&amp;#x5230;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x4ED6;&amp;#x767E;&amp;#x601D;&amp;#x4E0D;&amp;#x5F97;&amp;#x5176;&amp;#x89E3;&amp;#xFF1A;&amp;#x6211;&amp;#x6CA1;">
<meta property="og:image" content="http://yoursite.com/2015/04/11/inline-block-gap/1.jpg">
<meta property="og:image" content="http://yoursite.com/2015/04/11/inline-block-gap/2.jpg">
<meta property="og:image" content="http://yoursite.com/2015/04/11/inline-block-gap/3.jpg">
<meta property="og:image" content="http://yoursite.com/2015/04/11/inline-block-gap/4.jpg">
<meta property="og:image" content="http://yoursite.com/2015/04/11/inline-block-gap/5.jpg">
<meta property="og:image" content="http://yoursite.com/2015/04/11/inline-block-gap/6.jpg">
<meta property="og:updated_time" content="2016-02-24T12:59:36.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="小谈inline-block的那点空隙">
<meta name="twitter:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x6709;&amp;#x670B;&amp;#x53CB;&amp;#x9047;&amp;#x5230;&amp;#x4E86;&amp;#x8FD9;&amp;#x4E2A;&amp;#x95EE;&amp;#x9898;&amp;#xFF0C;&amp;#x7136;&amp;#x540E;&amp;#x4ED6;&amp;#x767E;&amp;#x601D;&amp;#x4E0D;&amp;#x5F97;&amp;#x5176;&amp;#x89E3;&amp;#xFF1A;&amp;#x6211;&amp;#x6CA1;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 小谈inline-block的那点空隙 | 灵感的小窝 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感的小窝</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                小谈inline-block的那点空隙
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-04-11T00:00:00+08:00" content="2015-04-11">
              2015-04-11
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6700;&#x8FD1;&#x6709;&#x670B;&#x53CB;&#x9047;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x767E;&#x601D;&#x4E0D;&#x5F97;&#x5176;&#x89E3;&#xFF1A;&#x6211;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x8FB9;&#x8DDD;&#x5440;&#xFF0C;&#x8FD9;&#x4E2D;&#x95F4;&#x600E;&#x4E48;&#x6709;&#x7A7A;&#x9699;&#x5462;&#xFF1F;&#x6211;&#x4E00;&#x770B;&#x4FBF;&#x77E5;&#x5B83;&#x7528;&#x4E86;inline-block&#x3002;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x95EE;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x7684;&#x554A;&#xFF0C;&#x6BD4;&#x8F83;&#x5E73;&#x5E38;&#x7684;&#x95EE;&#x9898;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x5728;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x662F;&#x4E0D;&#x6613;&#x5BDF;&#x89C9;&#x7684;&#x3002;</p>
<p><strong>1&#x3001;&#x8BBE;&#x7F6E;&#x4E86;&#x7236;&#x5143;&#x7D20;&#x80CC;&#x666F;&#x800C;&#x5B50;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x80CC;&#x666F;</strong></p>
<p><strong>2&#x3001;&#x5B50;&#x5143;&#x7D20;&#x672C;&#x8EAB;&#x5C31;&#x8BBE;&#x7F6E;&#x4E86;&#x5916;&#x8FB9;&#x8DDD;&#xFF0C;&#x800C;&#x4E14;&#x8FDC;&#x6BD4;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x7A7A;&#x9699;&#x8981;&#x5927;</strong></p>
<p>&#x56E0;&#x4E3A;inline-block&#x6240;&#x5F15;&#x8D77;&#x7684;&#x7A7A;&#x9699;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x5C0F;&#xFF0C;&#x6CA1;&#x6709;&#x201C;&#x50CF;&#x7D20;&#x773C;&#x201D;&#x7684;&#x8BDD;&#xFF0C;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x4E0D;&#x6613;&#x5BDF;&#x89C9;&#x4E86;&#x3002;</p>
<h2 id="&#x90A3;&#x4E48;inline-block&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#&#x90A3;&#x4E48;inline-block&#x662F;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="&#x90A3;&#x4E48;inline-block&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"></a>&#x90A3;&#x4E48;inline-block&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2><p>&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x90FD;&#x77E5;&#x9053;html&#x5143;&#x7D20;&#x4ECE;&#x8868;&#x73B0;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x53EF;&#x5206;&#x4E3A;&#x201C;&#x884C;&#x7EA7;&#x201D;&#x548C;&#x201C;&#x5757;&#x7EA7;&#x201D;&#x3002;</p>
<p>&#x90A3;&#x4E48;inline-block&#x5C31;&#x662F;&#x517C;&#x5177;&#x4E8C;&#x8005;&#x54AF;&#xFF1F;yes&#xFF0C;&#x56DE;&#x7B54;&#x6B63;&#x786E;&#x3002;&#x4E0D;&#x8FC7;&#x597D;&#x50CF;&#x53C8;&#x4E0D;&#x5B8C;&#x5168;&#x5BF9;&#x3002;</p>
<p>&#x8FD9;&#x662F;w3c&#x7684;&#x5B9A;&#x4E49;&#xFF1A;</p>
<p>This value causes an element to generate an inline-level block container. The inside of an inline-block is formatted as a block box, and the element itself is formatted as an atomic inline-level box.</p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5143;&#x7D20;&#x81EA;&#x8EAB;&#x4ECD;&#x7136;&#x8868;&#x73B0;&#x4E3A;&#x884C;&#x7EA7;&#xFF0C;&#x5185;&#x90E8;&#x88AB;&#x683C;&#x5F0F;&#x5316;&#x4E3A;&#x5177;&#x6709;&#x5757;&#x7EA7;&#x76D2;&#x7279;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x53EF;&#x8BBE;&#x7F6E;&#x5BBD;&#x9AD8;&#xFF0C;&#x4E0A;&#x4E0B;&#x5916;&#x8FB9;&#x8DDD;&#x7B49;&#x3002;</p>
<p>&#x56DE;&#x5F52;&#x6B63;&#x9898;&#xFF0C;inline-block&#x7684;&#x5143;&#x7D20;&#x95F4;&#x9699;&#xFF0C;&#x95F4;&#x9699;&#x4ECE;&#x4F55;&#x800C;&#x6765;&#x5462;&#xFF1F;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x786E;&#x65E0;&#x9700;&#x505A;&#x4EFB;&#x4F55;&#x7684;&#x8BBE;&#x7F6E;&#xFF0C;&#x5B83;&#x201C;&#x81EA;&#x5E26;&#x201D;&#x7684;&#x5C31;&#x6709;&#x3002;</p>
<p>&#x54B1;&#x4EEC;&#x5148;&#x4ECE;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x5165;&#x624B;&#xFF1A;</p>
<p><strong>1&#x3001;&#x9664;&#x6389;&#x7A7A;&#x767D;&#x7B26;</strong></p>
<p>&#x6765;&#x770B;&#x4E24;&#x5F20;&#x56FE;</p>
<p>html&#x7ED3;&#x6784;&#x4EE3;&#x7801;</p>
<p><img src="/2015/04/11/inline-block-gap/1.jpg" alt=""><br><img src="/2015/04/11/inline-block-gap/2.jpg" alt=""><br><img src="/2015/04/11/inline-block-gap/3.jpg" alt=""></p>
<p>&#x597D;&#x7684;&#xFF0C;&#x770B;&#x51FA;&#x6765;&#x4E0D;&#x540C;&#x4E86;&#x4E48;&#xFF1F;&#x4E24;&#x4E2A;ul&#x4E2D;&#x7684;li&#x90FD;&#x4F7F;&#x7528;&#x4E86;display:inline-block;But!!&#x4E3A;&#x4EC0;&#x4E48;&#x7B2C;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x7A7A;&#x9699;&#x800C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6709;&#x5462;&#xFF1F;ok&#xFF0C;&#x5DEE;&#x522B;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x4E2D;li&#x5168;&#x90FD;&#x662F;&#x5728;&#x540C;&#x4E00;&#x884C;&#xFF0C;&#x6CA1;&#x6709;&#x6362;&#x884C;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7684;&#x7A7A;&#x9699;&#xFF0C;&#x6CA1;&#x6709;&#x6362;&#x884C;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5F3A;&#x8C03;&#x6CA1;&#x6709;&#x7A7A;&#x9699;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x7684;&#x786E;&#x662F;&#x4E0D;&#x80FD;&#x6709;&#x7A7A;&#x9699;&#x7684;&#xFF0C;&#x54EA;&#x6015;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x90FD;&#x4E0D;&#x884C;&#xFF0C;&#x52A0;&#x4E0A;&#x5B83;&#x5C31;&#x53C8;&#x6210;&#x4E86;&#x4E0B;&#x9762;&#x90A3;&#x4E2A;&#x6B7B;&#x6837;&#x5B50;~&#x989D;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x5C31;&#x6210;&#x4E86;&#x4E0B;&#x9762;&#x90A3;&#x4E2A;&#x6837;&#x5B50;&#xFF1F;Because &#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BF9;&#x4E8E;&#x591A;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x7A7A;&#x767D;&#x7B26;&#xFF08;&#x7A7A;&#x683C;&#xFF0C;&#x6362;&#x884C;&#x7B26;&#xFF0C;&#x56DE;&#x8F66;&#x7B26;&#x7B49;&#xFF09;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x5C06;&#x4ED6;&#x4EEC;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x7A7A;&#x767D;&#x7B26;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x884C;&#x7A7A;&#x767D;&#x548C;&#x4E00;&#x4E2A;&#x7A7A;&#x767D;&#xFF0C;&#x6548;&#x679C;&#x4E0A;&#x662F;&#x4E00;&#x6837;&#x6EF4;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x63A8;&#x8350;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x60F3;&#x6CA1;&#x591A;&#x5C11;&#x4EBA;&#x4F1A;&#x4E3A;&#x4E86;&#x8868;&#x73B0;&#x53BB;&#x727A;&#x7272;&#x7ED3;&#x6784;&#x5427;&#x3002;</p>
<p><strong>2&#x3001;font-size&#xFF1A;0;</strong></p>
<p>&#x54A6;&#xFF1F;&#x7B49;&#x4F1A;&#x513F;&#xFF0C;&#x5403;&#x9519;&#x836F;&#x4E86;&#x4E48;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x63D0;&#x5230;font-size&#xFF0C;&#x8FD9;&#x91CC;&#x8DDF;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#xFF1F;&#x597D;&#x7684;&#xFF0C;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7A7A;&#x767D;&#x7B26;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5F52;&#x6839;&#x5230;&#x5E95;&#x8FD8;&#x662F;&#x5B57;&#x7B26;&#xFF0C;&#x65E2;&#x7136;&#x8FD9;&#x6837;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x53D7;&#x5230;font-size&#x7684;&#x5F71;&#x54CD;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E3A;&#x96F6;&#x5B83;&#x5C31;&#x6CA1;&#x4E86;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x90A3;&#x592A;&#x54C8;&#x76AE;&#x4E86;&#x3002;&#x505C;&#xFF0C;&#x6709;&#x4E24;&#x70B9;&#x7591;&#x95EE;&#xFF0C;&#x65E2;&#x7136;&#x8BBE;&#x7F6E;&#x4E3A;0&#x5B83;&#x4F1A;&#x6D88;&#x5931;&#xFF0C;&#x90A3;&#x4E48;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#xFF0C;&#x5B83;&#x4E5F;&#x6709;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#xFF1F;&#x4F60;&#x771F;&#x806A;&#x660E;&#xFF0C;&#x6765;&#x770B;</p>
<p>font-size:14px;</p>
<p><img src="/2015/04/11/inline-block-gap/4.jpg" alt=""></p>
<p>font-size:20px;</p>
<p><img src="/2015/04/11/inline-block-gap/5.jpg" alt=""></p>
<p>&#x662F;&#x4E0D;&#x662F;&#x660E;&#x663E;&#x770B;&#x51FA;&#x5DEE;&#x522B;&#x4E86;&#xFF1F;</p>
<p>&#x55EF;&#x55EF;~</p>
<p>&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x6709;&#x4E24;&#x70B9;&#x9700;&#x8981;&#x8003;&#x8651;&#xFF0C;&#x7236;&#x5143;&#x7D20;font-size&#x8BBE;&#x7F6E;&#x4E3A;0&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x8FD8;&#x8981;&#x4E3A;&#x5B50;&#x5143;&#x7D20;&#x91CD;&#x65B0;&#x8BBE;&#x7F6E;font-size&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#x6709;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x76EE;&#x524D;&#x662F;&#x4E0D;&#x652F;&#x6301;font-size&#x8BBE;&#x7F6E;&#x4E3A;0&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x4F4E;&#x7248;&#x672C;chrome&#xFF0C;&#x8FD8;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528; -webkit-text-size-adjust &#x8FD9;&#x4E2A;&#x79C1;&#x6709;&#x5C5E;&#x6027;&#x6765;&#x63A7;&#x5236;&#xFF0C;&#x5F53;&#x8BBE;&#x4E3A; none &#x65F6;&#x5C31;&#x652F;&#x6301;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x4E3A; 0 &#x4E86;&#x3002;</p>
<p><strong>3&#x3001;word-spacing</strong></p>
<p>&#x4E0D;&#x8981;&#x5FD8;&#x4E86;letter-spacing&#x548C;word-spacing&#x8FD9;&#x4E24;&#x4E2A;&#x6CD5;&#x5B9D;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x662F;&#x4E13;&#x95E8;&#x8D1F;&#x8D23;&#x5E72;&#x8FD9;&#x4E8B;&#x513F;&#x7684;&#xFF0C;&#x4ECE;&#x53EF;&#x884C;&#x6027;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x4E8C;&#x8005;&#x7686;&#x53EF;&#x80DC;&#x4EFB;&#x53BB;&#x9664;&#x7A7A;&#x9699;&#x7684;&#x91CD;&#x4EFB;&#xFF0C;&#x4F46;&#x662F;&#x63A8;&#x8350;&#x4F7F;&#x7528; word-spacing&#xFF0C;&#x56E0;&#x4E3A;letter-spacing&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x5982;&#x679C;&#x5927;&#x4E8E;&#x95F4;&#x9699;&#xFF0C;&#x5185;&#x90E8;&#x5185;&#x5BB9;&#x4F1A;&#x51FA;&#x73B0;&#x91CD;&#x53E0;&#xFF0C;&#x81F3;&#x4E8E;&#x662F;&#x600E;&#x4E48;&#x4E2A;&#x91CD;&#x53E0;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x6211;&#x505A;&#x8FC7;&#x7684;&#x8FD9;&#x4E2A;&#x4E1C;&#x4E1C;text-rotate&#xFF0C;&#x54C8;&#x54C8;.&#x5F53;&#x7ED9;word-spacing&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x503C;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x53BB;&#x9664;&#x4E86;&#x95F4;&#x9699;&#xFF0C;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x7684;&#x503C;&#x540C;&#x6837;&#x8DDF;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x76F8;&#x5173;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x8981;&#x5FD8;&#x4E86;&#xFF0C;&#x4E0A;&#x9762;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x5728;&#x5B50;&#x5143;&#x7D20;&#x4E2D;&#x9700;&#x8981;&#x91CD;&#x7F6E;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>4&#x3001;margin&#x8D1F;&#x503C;&#x4FEE;&#x590D;</strong></p>
<p>&#x76F8;&#x6BD4;&#x5176;&#x4ED6;&#x51E0;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x9119;&#x89C6;&#x4E86;~&#x56E0;&#x4E3A;&#xFF0C;&#x600E;&#x4E48;&#x770B;&#x90FD;&#x50CF;&#x662F;&#x5F88;&#x52C9;&#x5F3A;&#x7684;&#x53BB;&#x8FBE;&#x5230;&#x4E00;&#x79CD;&#x89C6;&#x89C9;&#x6548;&#x679C;&#xFF0C;&#x597D;&#x5427;&#x6211;&#x627F;&#x8BA4;&#x8FD9;&#x4E48;&#x5E72;&#x8FC7;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F88;&#x75DB;&#x82E6;~</p>
<p><strong>5&#x3001;&#x53BB;&#x6389;&#x4E2D;&#x95F4;&#x7684;&#x95ED;&#x5408;&#x6807;&#x7B7E;</strong></p>
<p>&#x6BD4;&#x5982;&#x8FD9;&#x6837;</p>
<p><img src="/2015/04/11/inline-block-gap/6.jpg" alt=""></p>
<p>&#x6B64;&#x5904;&#x5E94;&#x6709;&#x7816;&#x58F0;~&#x8FD9;&#x4E5F;&#x592A;&#x4E0D;&#x62E9;&#x624B;&#x6BB5;&#x4E86;&#x5427;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x786E;&#x662F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#x6EF4;&#x3002;&#x4F46;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x731C;&#x6D4B;&#xFF0C;&#x5B83;&#x662F;&#x628A;&#x540E;&#x9762;&#x7684;&#x90A3;&#x4E9B;&#x7A7A;&#x9699;&#x7B97;&#x4F5C;&#x4E86;li&#x7684;&#x5185;&#x90E8;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5916;&#x90E8;&#xFF0C;&#x8FD9;&#x6837;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x5C31;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x7A7A;&#x9699;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x540C;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;&#x4E2A;&#x4EBA;&#x4E0D;&#x63A8;&#x8350;&#xFF0C;&#x5BF9;&#x4E8E;&#x6709;&#x5F3A;&#x8FEB;&#x75C7;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x7B80;&#x76F4;&#x4E0D;&#x53EF;&#x5FCD;&#x53D7;&#x6709;&#x6728;&#x6709;&#xFF01;&#xFF01;~</p>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x610F;&#x89C1;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x4F7F;&#x7528;float&#xFF1F;</p>
<p>&#x597D;&#x7684;&#xFF0C;&#x90A3;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9002;&#x5408;&#x7528;inline-block&#x5462;&#xFF1F;</p>
<p>&#x4E00;&#x3001;float&#x5143;&#x7D20;&#x8131;&#x79BB;&#x4E86;&#x6587;&#x6863;&#x6D41;&#xFF0C;&#x4F1A;&#x5BF9;&#x5176;&#x5468;&#x56F4;&#x7684;&#x5143;&#x7D20;&#x9020;&#x6210;&#x5F71;&#x54CD;&#xFF0C;&#x800C;inline-block&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002; &#x4E8C;&#x3001;&#x60F3;&#x8981;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x7236;&#x5BB9;&#x5668;text-align&#xFF1A;center&#x8BA9;&#x5143;&#x7D20;&#x5C45;&#x4E2D;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x7528;&#x6D6E;&#x52A8;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x6211;&#x53E6;&#x4E00;&#x7BC7;&#x8C08;&#x4E0D;&#x5B9A;&#x5BBD;&#x5C45;&#x4E2D;&#x65B9;&#x6848;&#x7684;&#x6587;&#x7AE0;&#x4E2D;&#x63D0;&#x8FC7;&#x3002; &#x4E09;&#x3001;&#x4F7F;&#x5143;&#x7D20;&#x5782;&#x76F4;&#x5C45;&#x4E2D;&#xFF0C;inline-block&#x5143;&#x7D20;&#x662F;&#x6CBF;&#x7740;&#x9ED8;&#x8BA4;&#x7684;&#x57FA;&#x7EBF;&#x5BF9;&#x9F50;&#x3002;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x7D27;&#x8D34;&#x9876;&#x90E8;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;vertical&#x5C5E;&#x6027;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;&#x9ED8;&#x8BA4;&#x57FA;&#x7EBF;&#xFF0C;&#x4F46;&#x5BF9;&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5C31;&#x4E0D;&#x884C;&#x4E86;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x5C31;&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#x4E86;&#xFF0C;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x8865;&#x5145;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x6765;&#x8FD9;&#x91CC;&#x8DDF;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x5B66;&#x4E60;&#x4EA4;&#x6D41;&#xFF1A;152128548</p>
<p>&#x53E6;&#x9644;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#x7ED9;&#x5927;&#x5BB6;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;</p>
<p><a href="http://www.iyunlu.com/view/css-xhtml/64.html" target="_blank" rel="external">inline-block&#x524D;&#x4E16;&#x4ECA;&#x751F;</a></p>
<p><a href="http://www.zhangxinxu.com/wordpress/2012/04/inline-block-space-remove-%E5%8E%BB%E9%99%A4%E9%97%B4%E8%B7%9D/" target="_blank" rel="external">&#x53BB;&#x9664;inline-block&#x5143;&#x7D20;&#x95F4;&#x95F4;&#x8DDD;&#x7684;N&#x79CD;&#x65B9;&#x6CD5;</a></p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/CSS/" rel="tag">#CSS</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/03/30/《web前端最佳实践》—高性能css/" rel="next" title="《web前端最佳实践》—高性能css">
                <i class="fa fa-chevron-left"></i> 《web前端最佳实践》—高性能css
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/04/18/img-ele-gap/" rel="prev" title="图片以及其他替换元素的空隙问题">
                图片以及其他替换元素的空隙问题 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#那么inline-block是什么？"><span class="nav-number">1.</span> <span class="nav-text">那么inline-block是什么？</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
