<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>《web前端最佳实践》—HTML篇 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">《web前端最佳实践》—HTML篇</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">《web前端最佳实践》—HTML篇</h1><div class="post-meta">Mar 28, 2015<span> | </span><span class="category"><a href="/categories/HTML/">HTML</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2015/03/28/《web前端最佳实践》—HTML篇/" href="/2015/03/28/《web前端最佳实践》—HTML篇/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#一、web标准"><span class="toc-number">1.</span> <span class="toc-text">一、web标准</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#二、高可读性HTML"><span class="toc-number">2.</span> <span class="toc-text">二、高可读性HTML</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#三、小叙Html5"><span class="toc-number">3.</span> <span class="toc-text">三、小叙Html5</span></a></li></ol></div></div><div class="post-content"><h2 id="&#x4E00;&#x3001;web&#x6807;&#x51C6;"><a href="#&#x4E00;&#x3001;web&#x6807;&#x51C6;" class="headerlink" title="&#x4E00;&#x3001;web&#x6807;&#x51C6;"></a>&#x4E00;&#x3001;web&#x6807;&#x51C6;</h2><p>&#x5F88;&#x591A;&#x4EBA;&#x628A;web&#x6807;&#x51C6;&#x6302;&#x5728;&#x5634;&#x8FB9;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x5F15;&#x8D77;&#x8DB3;&#x591F;&#x91CD;&#x89C6;&#xFF0C;&#x53EA;&#x5173;&#x6CE8;&#x9875;&#x9762;&#x5916;&#x5728;&#x7684;&#x8868;&#x73B0;&#x800C;&#x5FFD;&#x7565;&#x9875;&#x9762;&#x672C;&#x8EAB;&#x4EE3;&#x7801;&#x7684;&#x8D28;&#x91CF;&#x3002;</p>
<p><strong>&#x6807;&#x51C6;&#x7684;&#x9875;&#x9762;&#x5177;&#x6709;&#x54EA;&#x4E9B;&#x4F18;&#x70B9;&#xFF1F;</strong></p>
<ul>
<li><p>&#x4FDD;&#x8BC1;&#x6D4F;&#x89C8;&#x5668;&#x6B63;&#x786E;&#x6E32;&#x67D3; &#x6700;&#x5927;&#x9650;&#x5EA6;&#x7684;&#x4FDD;&#x8BC1;&#x9875;&#x9762;&#x5728;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x6B63;&#x5E38;&#x89E3;&#x6790;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x80FD;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x4FDD;&#x8BC1;&#x5728;&#x672A;&#x6765;&#x7684;&#x5404;&#x79CD;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x6B63;&#x5E38;&#x89E3;&#x6790;&#x3002;</p>
</li>
<li><p>&#x66F4;&#x5BB9;&#x6613;&#x88AB;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x641C;&#x5BFB;&#xFF0C;&#x63D0;&#x9AD8;&#x7F51;&#x7AD9;&#x641C;&#x7D22;&#x6392;&#x540D;&#x3002;&#x6807;&#x51C6;&#x7684;&#x9875;&#x9762;&#x57FA;&#x672C;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x534A;&#x7684;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4F18;&#x5316;&#x5DE5;&#x4F5C;&#xFF0C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x7F51;&#x7EDC;&#x201C;&#x722C;&#x866B;&#x201D;&#x76EE;&#x7684;&#x662F;&#x8BFB;&#x61C2;&#x7F51;&#x7AD9;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x627E;&#x51FA;&#x7F51;&#x7AD9;&#x5173;&#x952E;&#x5B57;&#x3002;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x6807;&#x7B7E;&#x548C;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x51C6;&#x786E;&#x7406;&#x89E3;&#x7F51;&#x7AD9;&#x5185;&#x5BB9;&#x3002;</p>
</li>
<li><p>&#x63D0;&#x9AD8;&#x7F51;&#x7AD9;&#x6613;&#x7528;&#x6027;&#x3002;&#x8BA9;&#x7F51;&#x7AD9;&#x80FD;&#x88AB;&#x66F4;&#x591A;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#xFF0C;&#x6BD4;&#x5982;&#x89C6;&#x529B;&#x6216;&#x80A2;&#x4F53;&#x969C;&#x788D;&#x7528;&#x6237;&#x3002;</p>
</li>
<li><p>&#x66F4;&#x597D;&#x7684;&#x7EF4;&#x62A4;&#x548C;&#x6269;&#x5C55;&#x3002; &#x591A;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x5982;&#x679C;&#x9075;&#x5FAA;&#x7EDF;&#x4E00;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x5219;&#x4F1A;&#x66F4;&#x597D;&#x7684;&#x7406;&#x89E3;&#x548C;&#x7EF4;&#x62A4;&#x5DF2;&#x6709;&#x7684;&#x9875;&#x9762;&#x3002;&#x6807;&#x7B7E;&#x3001;&#x6837;&#x5F0F;&#x3001;&#x4EE5;&#x53CA;&#x884C;&#x4E3A;&#x5206;&#x79BB;&#x7684;&#x6807;&#x51C6;&#x9875;&#x9762;&#x663E;&#x7136;&#x5177;&#x6709;&#x66F4;&#x597D;&#x7684;&#x6269;&#x5C55;&#x6027;&#x3002;</p>
</li>
</ul>
<p><strong>&#x5982;&#x4F55;&#x505A;&#x5230;&#x6807;&#x51C6;&#xFF1F;</strong></p>
<ul>
<li><p>&#x6807;&#x51C6;&#x7684;HTML&#x9875;&#x9762;&#x7ED3;&#x6784;&#xFF0C;&#x6BD4;&#x5982;&#x6587;&#x6863;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x3001;head&#xFF08;title&#x548C;&#x5F15;&#x5165;&#x7684;&#x6587;&#x4EF6;&#xFF09;&#x3001;body&#x7B49;&#x3002;</p>
</li>
<li><p>&#x6B63;&#x786E;&#x95ED;&#x5408;&#x6807;&#x7B7E;&#x3002;</p>
</li>
<li><p>&#x505C;&#x6B62;&#x4F7F;&#x7528;&#x4E0D;&#x6807;&#x51C6;&#x7684;&#x6807;&#x7B7E;&#x548C;&#x5C5E;&#x6027;&#xFF0C;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#x3002;</p>
</li>
<li><p>&#x6837;&#x5F0F;&#x548C;&#x7ED3;&#x6784;&#x5206;&#x79BB;&#x3002;</p>
</li>
<li><p>&#x6DFB;&#x52A0;javascript&#x7981;&#x7528;&#x7684;&#x63D0;&#x793A;&#x4FE1;&#x606F;&#x3002;</p>
</li>
<li><p>&#x6DFB;&#x52A0;&#x5FC5;&#x8981;&#x7684;<code>&lt;addr&gt;</code>&#x6807;&#x7B7E;&#xFF0C;&#x6BD4;&#x5982;&#x5E38;&#x7528;&#x7684;keywords&#x3001;description&#xFF0C;&#x8BBE;&#x7F6E;IE&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x517C;&#x5BB9;&#x6A21;&#x5F0F;&#xFF0C;&#x8BBE;&#x7F6E;&#x9875;&#x9762;&#x5728;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E2D;&#x7684;&#x663E;&#x793A;&#x7B49;&#x3002;</p>
</li>
</ul>
<h2 id="&#x4E8C;&#x3001;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;HTML"><a href="#&#x4E8C;&#x3001;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;HTML" class="headerlink" title="&#x4E8C;&#x3001;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;HTML"></a>&#x4E8C;&#x3001;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;HTML</h2><p><strong>&#x4E00;&#x4E9B;&#x5C0F;&#x539F;&#x5219;</strong></p>
<ul>
<li><p>&#x6CE8;&#x610F;&#x6807;&#x7B7E;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x7F51;&#x9875;&#x7684;&#x5916;&#x89C2;&#x770B;&#x8D77;&#x6765;&#x600E;&#x6837;&#x8DDF;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x89E3;&#x6790;&#x4EE5;&#x53CA;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x6293;&#x53D6;&#x6BEB;&#x65E0;&#x5173;&#x7CFB;&#xFF0C;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;&#x7684;html&#x4EE3;&#x7801;&#x9664;&#x4E86;&#x4F7F;&#x5F00;&#x53D1;&#x8005;&#x81EA;&#x8EAB;&#x66F4;&#x6613;&#x770B;&#x61C2;&#x548C;&#x7EF4;&#x62A4;&#x4E4B;&#x5916;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x8FD8;&#x662F;&#x7ED9;&#x673A;&#x5668;&#x53BB;&#x8BFB;&#x7684;&#x3002;</p>
</li>
<li><p>&#x6CA1;&#x5FC5;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x6807;&#x7B7E;&#x5C31;&#x4E0D;&#x8981;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5176;&#x5B83;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x505A;&#x5230;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x4F2A;&#x5143;&#x7D20;&#x3002; &#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x4F7F;&#x7528;&#x4E0D;&#x5F53;&#x4E4B;&#x5904;&#x6709;&#x201C;&#x5206;&#x9694;&#x7B26;&#x201D;&#x548C;&#x201C;&#x7A7A;&#x6807;&#x7B7E;&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x201D;&#x7B49;&#x3002;</p>
</li>
<li><p>&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x975E;&#x6587;&#x5B57;&#x5185;&#x5BB9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x867D;&#x7136;&#x770B;&#x4F3C;&#x4F7F;&#x7528;&#x7A7A;&#x6807;&#x7B7E;&#x914D;&#x5408;css&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5374;&#x4E0D;&#x80FD;&#x5F97;&#x77E5;&#x5B83;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x6587;&#x5B57;&#x8BF4;&#x660E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x7528;css&#x5C06;&#x5176;&#x9690;&#x85CF;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x4E5F;&#x4FBF;&#x4E8E;&#x7B2C;&#x4E09;&#x65B9;&#x9605;&#x8BFB;&#x5DE5;&#x5177;&#x7684;&#x8BC6;&#x522B;&#x3002;</p>
</li>
<li><p>&#x719F;&#x6089;&#x5404;&#x6807;&#x7B7E;&#x4E0A;&#x89C4;&#x8303;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x7ED9;html&#x6807;&#x7B7E;&#x6DFB;&#x52A0;&#x5FC5;&#x8981;&#x7684;&#x5C5E;&#x6027; &#x6BD4;&#x5982;&#x5E38;&#x89C1;&#x7684;&#xFF1A;alt&#x3001;title&#x3001;for&#x7B49;&#x3002;</p>
</li>
<li><p><code>&lt;br&gt;</code>&#x5E94;&#x4EC5;&#x7528;&#x4E8E;&#x6587;&#x672C;&#x5185;&#x5BB9;&#x7684;&#x6362;&#x884C;&#xFF0C;&#x4E0D;&#x5E94;&#x7528;&#x4E8E;&#x884C;&#x7EA7;&#x5143;&#x7D20;&#x7684;&#x6362;&#x884C;&#x3002;</p>
</li>
<li><p>&#x7F51;&#x9875;&#x4E2D;&#x7684;&#x56FE;&#x7247;&#x662F;&#x4F7F;&#x7528;<code>&lt;img&gt;</code>&#x8FD8;&#x662F;background&#xFF1F; &#x82E5;&#x4F5C;&#x4E3A;&#x9875;&#x9762;&#x5185;&#x5BB9;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5219;&#x4F7F;&#x7528;img&#xFF0C;&#x82E5;&#x4EC5;&#x7528;&#x4E8E;&#x88C5;&#x9970;&#xFF0C;&#x4F7F;&#x7528;background&#x3002;</p>
</li>
</ul>
<p><strong>&#x5E38;&#x7528;&#x51E0;&#x7C7B;&#x6807;&#x7B7E;&#x7684;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;</strong></p>
<p><strong>&#x7F51;&#x9875;&#x6807;&#x9898;&#x5C42;&#x7EA7;</strong></p>
<p>&#x6807;&#x9898;&#x6807;&#x7B7E;&#x6307;&#x7684;&#x662F;h1~h6&#x8FD9;6&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x7EDF;&#x79F0;hx&#x6807;&#x7B7E;&#xFF0C;&#x76F8;&#x6BD4;&#x5176;&#x4ED6;&#x7684;&#x8BED;&#x4E49;&#x6807;&#x7B7E;&#xFF0C;<hx>&#x6807;&#x7B7E;&#x4F1A;&#x53D7;&#x5230;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x201C;&#x7279;&#x6B8A;&#x7167;&#x987E;&#x3002;</hx></p>
<p>&#xFF08;1&#xFF09;&#x5728;&#x6807;&#x9898;&#x5904;&#x5E94;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x9875;&#x9762;&#x4E2D;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;h1&#x6807;&#x7B7E;&#xFF0C;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x4F1A;&#x7ED9;&#x4E88;&#x5B83;&#x6700;&#x9AD8;&#x6743;&#x91CD;&#x3002;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x6807;&#x9898;&#x6807;&#x7B7E;&#x4ECE;h2&#x5F00;&#x59CB;&#x3002;</p>
<p>&#xFF08;3&#xFF09;<code>&lt;hx&gt;</code>&#x6807;&#x7B7E;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x8981;&#x8DF3;&#x7EA7;&#xFF0C;&#x4FDD;&#x6301;&#x5C42;&#x7EA7;&#x8FDE;&#x8D2F;&#x6027;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x4E0D;&#x8981;&#x5355;&#x7EAF;&#x4F7F;&#x7528;<code>&lt;hx&gt;</code>&#x6807;&#x7B7E;&#x7ED9;&#x5185;&#x5BB9;&#x8BBE;&#x7F6E;&#x6837;&#x5F0F;&#x3002;</p>
<p><strong>&#x6B63;&#x786E;&#x8BBE;&#x8BA1;&#x8868;&#x5355;</strong></p>
<p>&#xFF08;1&#xFF09;&#x4E0D;&#x8981;&#x4F7F;&#x7528;<code>&lt;table&gt;</code>&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x4E0D;&#x8981;&#x7528;<code>&lt;span&gt;</code>&#x5C55;&#x793A;&#x8868;&#x5355;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x5E94;&#x4F7F;&#x7528;<code>&lt;label&gt;</code>&#xFF08;&#x7528;&#x4E8E;&#x4E3A;&#x8F93;&#x5165;&#x63A7;&#x4EF6;&#x5B9A;&#x4E49;&#x6587;&#x672C;&#xFF09;&#xFF1B;&#x6307;&#x5B9A;&#x5173;&#x8054;&#x63A7;&#x4EF6;&#x53EA;&#x9700;&#x628A;&#x76F8;&#x5173;&#x63A7;&#x4EF6;&#x7684;id&#x8D4B;&#x4E88;<code>&lt;label&gt;</code>&#x7684;for&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x4E0D;&#x4EC5;&#x628A;<code>&lt;label&gt;</code>&#x5143;&#x7D20;&#x89E6;&#x53D1;&#x7684;&#x4E8B;&#x4EF6;&#x6307;&#x5411;&#x4E86;&#x76F8;&#x5173;&#x8868;&#x5355;&#x5143;&#x7D20;&#xFF0C;&#x6269;&#x5927;&#x4E86;&#x53EF;&#x64CD;&#x4F5C;&#x8303;&#x56F4;&#xFF0C;&#x4E5F;&#x4ECE;&#x8BED;&#x4E49;&#x4E0A;&#x7ED1;&#x5B9A;&#x4E86;&#x4E24;&#x8005;&#x3002; &#xFF08;3&#xFF09;&#x4F7F;&#x7528;<code>&lt;fieldset&gt;</code>&#x7ED9;&#x8868;&#x5355;&#x63A7;&#x4EF6;&#x5206;&#x7EC4;&#xFF0C;<code>&lt;legend&gt;</code>&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x63A7;&#x4EF6;&#x7EC4;&#x7684;&#x6807;&#x9898;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;<code>&lt;fieldset&gt;</code>&#x7684;disable&#x5C5E;&#x6027;&#x7981;&#x7528;&#x5305;&#x542B;&#x7684;&#x8868;&#x5355;&#x63A7;&#x4EF6;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x7ED9;&#x8F93;&#x5165;&#x63A7;&#x4EF6;&#x8BBE;&#x7F6E;&#x5408;&#x9002;&#x7684;&#x6C34;&#x5370;&#x63D0;&#x793A;&#xFF0C;&#x6240;&#x8C13;&#x6C34;&#x5370;&#x63D0;&#x793A;&#xFF0C;&#x5373;&#x5728;&#x672A;&#x586B;&#x5199;&#x4E4B;&#x524D;&#x91CC;&#x9762;&#x6240;&#x663E;&#x793A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5F53;&#x63A7;&#x4EF6;&#x83B7;&#x53D6;&#x7126;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x6237;&#x5F00;&#x59CB;&#x8F93;&#x5165;&#x65F6;&#x6D88;&#x5931;&#x3002;&#x53EF;&#x4F7F;&#x7528;placeholder&#x5C5E;&#x6027;&#xFF0C;IE9&#x4EE5;&#x4E0B;&#x53EF;&#x4F7F;&#x7528;jquery-placeholder&#x63D2;&#x4EF6;&#x6A21;&#x62DF;&#x3002;</p>
<p>&#xFF08;5&#xFF09;&#x5982;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x8BBE;&#x7F6E;tab&#x987A;&#x5E8F;&#x3002;&#x5F88;&#x591A;&#x7528;&#x6237;&#x4F1A;&#x6709;&#x4F7F;&#x7528;&#x952E;&#x76D8;tab&#x952E;&#x6765;&#x5207;&#x6362;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6846;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F1A;&#x5B89;&#x88C5;&#x754C;&#x9762;&#x4E0A;&#x7684;&#x5206;&#x5E03;&#x987A;&#x5E8F;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x5982;&#x9700;&#x8981;&#x7279;&#x6B8A;&#x8BBE;&#x5B9A;&#xFF0C;&#x53EF;&#x8BBE;&#x7F6E;tabindex&#x5C5E;&#x6027;&#x503C;&#x3002;</p>
<p>&#xFF08;6&#xFF09;&#x4F7F;&#x7528;html5&#x4E2D;&#x65B0;&#x5F15;&#x5165;&#x7684;&#x8868;&#x5355;&#x63A7;&#x4EF6;&#x7C7B;&#x578B;&#xFF0C;&#x5982;url&#x3001;email&#x3001;search&#x7B49;&#x3002;&#x9AD8;&#x7EA7;&#x6D4F;&#x89C8;&#x5668;&#x6709;&#x5F88;&#x597D;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x5B83;&#x4EEC;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x4EE5;text&#x7C7B;&#x578B;&#x63A7;&#x4EF6;&#x5C55;&#x73B0;&#x3002;</p>
<p><strong>&#x7CBE;&#x7B80;html&#x4EE3;&#x7801;</strong></p>
<p>1&#x3001;&#x5220;&#x9664;&#x591A;&#x4F59;&#x5BB9;&#x5668;&#xFF0C;&#x6BD4;&#x8F83;&#x5178;&#x578B;&#x7684;&#x662F;<code>&lt;div&gt;</code>&#x548C;<code>&lt;span&gt;</code>&#xFF0C;&#x8FD9;&#x662F;&#x4E24;&#x4E2A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8BED;&#x4E49;&#xFF0C;&#x5E38;&#x88AB;&#x6EE5;&#x7528;&#x7684;&#x6807;&#x7B7E;&#x3002;</p>
<p>2&#x3001;&#x88C5;&#x9970;&#x6027;&#x5143;&#x7D20;&#x4F7F;&#x7528;css&#x5B9E;&#x73B0;&#x3002;&#x5982;&#x80CC;&#x666F;&#x3001;&#x4F2A;&#x5143;&#x7D20;&#x7B49;&#x3002;</p>
<p>3&#x3001;&#x907F;&#x514D;&#x4F7F;&#x7528;table&#x5E03;&#x5C40;&#xFF0C;&#x662F;&#x4EE3;&#x7801;&#x66F4;&#x5C11;&#xFF0C;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x907F;&#x514D;&#x56E0;&#x91CD;&#x7ED8;&#x6216;&#x91CD;&#x6392;&#x800C;&#x964D;&#x4F4E;&#x6027;&#x80FD;&#x3002;</p>
<p><strong>&#x8FC7;&#x65F6;&#x7684;&#x5757;&#x7EA7;&#x548C;&#x884C;&#x5185;&#x5143;&#x7D20;</strong></p>
<p>&#x6BCF;&#x4E2A;&#x4F7F;&#x7528;css&#x7684;&#x4EBA;&#x90FD;&#x4E86;&#x89E3;&#x8FC7;&#x8FD9;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5374;&#x90FD;&#x662F;&#x4ECE;&#x6837;&#x5F0F;&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x7406;&#x89E3;&#x539F;&#x751F;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6709;&#x70B9;&#x4E0D;&#x59A5;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x672C;&#x8EAB;&#x8DDF;&#x201C;&#x7ED3;&#x6784;&#x4E0E;&#x8868;&#x73B0;&#x5206;&#x79BB;&#x201D;&#x7684;&#x601D;&#x8DEF;&#x6709;&#x8FDD;&#x80CC;&#xFF0C;html5&#x4E2D;&#x6DE1;&#x5316;&#x4E86;&#x4E8C;&#x8005;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x5206;&#x6210;&#x4E86;7&#x7C7B;&#x3002; &#x5B83;&#x4EEC;&#x662F;&#xFF1A;&#x5143;&#x6570;&#x636E;&#x5F0F;&#x5185;&#x5BB9;&#x3001;&#x6D41;&#x5F0F;&#x5185;&#x5BB9;&#x3001;&#x7AE0;&#x8282;&#x5F0F;&#x5185;&#x5BB9;&#x3001;&#x6807;&#x9898;&#x5F0F;&#x5185;&#x5BB9;&#x3001;&#x6BB5;&#x843D;&#x5F0F;&#x5185;&#x5BB9;&#x3001;&#x5D4C;&#x5165;&#x5F0F;&#x5185;&#x5BB9;&#x548C;&#x4EA4;&#x4E92;&#x5F0F;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x4ECE;&#x5185;&#x5BB9;&#x6A21;&#x578B;&#x6765;&#x8BF4;&#xFF0C;&#x4EE5;&#x524D;&#x5BF9;&#x4E8E;&#x5757;&#x7EA7;&#x548C;&#x884C;&#x5185;&#x5143;&#x7D20;&#x4E2D;&#x5185;&#x5BB9;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;html5&#x7ED3;&#x675F;&#x4E86;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x7684;&#x5C40;&#x9762;&#xFF0C;&#x4ECE;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#x51FA;&#x53D1;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E86;&#x5185;&#x5BB9;&#x6A21;&#x578B;&#x3002;&#x6BD4;&#x5982;<code>&lt;a&gt;</code>&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5757;&#x72B6;&#x5143;&#x7D20;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x5F88;&#x591A;&#x5DEE;&#x5F02;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x5BB6;&#x6709;&#x91CD;&#x65B0;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x5C0F;&#x53D9;Html5"><a href="#&#x4E09;&#x3001;&#x5C0F;&#x53D9;Html5" class="headerlink" title="&#x4E09;&#x3001;&#x5C0F;&#x53D9;Html5"></a>&#x4E09;&#x3001;&#x5C0F;&#x53D9;Html5</h2><p>&#x5148;&#x6765;&#x770B;&#x51E0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x3002;</p>
<p>2012&#x5E74;12&#x6708;17&#x65E5;&#xFF0C;HTML5&#x5B9A;&#x4E49;&#x5B8C;&#x6210;&#x3002;</p>
<p>2014&#x5E74;6&#x6708;17&#x65E5;&#xFF0C;&#x53D1;&#x5E03;&#x6807;&#x51C6;&#x8349;&#x6848;&#x7684;&#x6700;&#x7EC8;&#x5F81;&#x6C42;&#x610F;&#x89C1;&#x7A3F;&#x3002;</p>
<p>2014&#x5E74;10&#x6708;28&#x65E5;&#xFF0C;W3C&#x53D1;&#x5E03;HTML5&#x6B63;&#x5F0F;&#x63A8;&#x8350;&#x6807;&#x51C6;&#x3002;</p>
<p><strong>&#x65B0;&#x7279;&#x6027;&#x7684;&#x4F7F;&#x7528;</strong></p>
<p>&#x8FD1;&#x51E0;&#x5E74;&#xFF0C;HTML5&#x7684;&#x6982;&#x5FF5;&#x88AB;&#x7092;&#x7684;&#x8FC7;&#x5934;&#x4E86;&#xFF0C;&#x7ED9;&#x4EBA;&#x611F;&#x89C9;&#x662F;&#x9177;&#x70AB;&#xFF0C;&#x751A;&#x81F3;&#x201C;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#x201D;&#xFF0C;&#x7136;&#x800C;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;web&#x6807;&#x51C6;&#x3002;&#x662F;&#x5BF9;&#x51E0;&#x4E2A;&#x5E94;&#x7528;&#x6BD4;&#x8F83;&#x5E7F;&#x6CDB;&#x7684;&#x7279;&#x6027;&#x7684;&#x8BA8;&#x8BBA;&#x3002;</p>
<p><strong>1&#x3001;&#x7B80;&#x5316;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;</strong></p>
<p>&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x6587;&#x6863;&#x7C7B;&#x578B;&#x58F0;&#x660E;&#x3001;&#x5B9A;&#x4E49;&#x9875;&#x9762;&#x7F16;&#x7801;&#x3001;&#x6837;&#x5F0F;&#x548C;&#x811A;&#x6B65;&#x7684;&#x5F15;&#x7528;&#x65B9;&#x5F0F;&#x7B49;&#x3002;</p>
<p><strong>2&#x3001;&#x4F7F;&#x7528;&#x65B0;&#x6807;&#x7B7E;&#x548C;&#x65B0;&#x5C5E;&#x6027;</strong></p>
<p>&#x65B0;&#x6807;&#x7B7E;&#xFF1A;</p>
<p>&#x8BED;&#x4E49;&#x5316;&#x6807;&#x7B7E;&#xFF1A;<code>&lt;header&gt;</code>&#x3001;<code>&lt;nav&gt;</code>&#x7B49;</p>
<p>&#x529F;&#x80FD;&#x6027;&#x6807;&#x7B7E;&#xFF1A;<code>&lt;svg&gt;</code>&#x3001;<code>&lt;canvas&gt;</code>&#x3001;<code>&lt;video&gt;</code>&#x7B49;</p>
<p>&#x65B0;&#x7684;&#x8F93;&#x5165;&#x63A7;&#x4EF6;&#x7C7B;&#x578B;&#xFF1A;tel&#x3001;search&#x3001;email&#x7B49;</p>
<p>&#x65B0;&#x5C5E;&#x6027;&#xFF1A;</p>
<p><code>&lt;script&gt;</code>&#x7684;async&#x5C5E;&#x6027;</p>
<p><code>&lt;base&gt;</code>&#x7684;target&#x5C5E;&#x6027;</p>
<p><code>&lt;input&gt;</code>&#x548C;<code>&lt;textarea&gt;</code>&#x91CC;&#x9762;&#x7684;placeholder&#x3001;required&#x3001;autofocus&#x5C5E;&#x6027;</p>
<p>&#x6807;&#x7B7E;&#x81EA;&#x5B9A;&#x4E49;&#x5C5E;&#x6027;data-*&#xFF0C;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x65F6;&#x6DFB;&#x52A0;&#x5BF9;&#x5E94;API&#xFF1A;dataset</p>
<p><strong>&#x5C0F;tips</strong></p>
<p><strong>&#x4E0D;&#x8981;&#x4F7F;&#x7528;HTML5&#x4E2D;&#x5DF2;&#x7ECF;&#x5F03;&#x7528;&#x7684;&#x6807;&#x7B7E;&#x548C;&#x5C5E;&#x6027;</strong></p>
<p>1&#x3001;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8BED;&#x4E49;&#xFF0C;&#x4EC5;&#x4E3A;&#x4E86;&#x8BBE;&#x7F6E;&#x5916;&#x89C2; <code>&lt;basefont&gt;</code>&#x3001;<code>&lt;big&gt;</code>&#x3001;<code>&lt;center&gt;</code>&#x3001;<code>&lt;font&gt;</code>&#x3001;<code>&lt;strike&gt;</code>&#x3001;<code>&lt;tt&gt;</code>&#x7B49; 2&#x3001;&#x7834;&#x574F;&#x4E86;&#x53EF;&#x7528;&#x6027;&#x7684;&#x6807;&#x7B7E; <code>&lt;frame&gt;</code>&#x3001;<code>&lt;frameset&gt;</code>&#x3001;<code>&lt;noframes&gt;</code></p>
<p>3&#x3001;&#x79FB;&#x9664;&#x7684;&#x6807;&#x7B7E;&#x5C5E;&#x6027; align&#x3001;valign&#x3001;bgcolor&#x7B49;</p>
<p><strong>&#x5982;&#x4F55;&#x5904;&#x7406;&#x517C;&#x5BB9;&#x6027;</strong></p>
<p>&#xFF08;1&#xFF09;&#x901A;&#x8FC7;document.creatElement&#x4EA7;&#x751F;&#x6807;&#x7B7E;</p>
<p>&#xFF08;2&#xFF09;&#x4F7F;&#x7528;&#x6210;&#x719F;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x5982;&#xFF1A;html5shim</p>
<p>&#x6CE8;&#xFF1A;&#x6B64;&#x5904;&#x4EC5;&#x4E3A;&#x8BA9;&#x6D4F;&#x89C8;&#x5668;&#x8BC6;&#x522B;&#x65B0;&#x6807;&#x7B7E;&#x7684;&#x517C;&#x5BB9;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4ED6;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x517C;&#x5BB9;&#x95EE;&#x9898;&#xFF0C;&#x6B64;&#x5904;&#x4E0D;&#x8D58;&#x8FF0;&#x3002;</p>
<p>&#x6B64;&#x6587;&#x4E3A;&#x8BFB;&#x4E86;&#x515A;&#x5EFA;&#x524D;&#x8F88;&#x6240;&#x8457;&#x300A;web&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x300B;HTML&#x90E8;&#x5206;&#x4E4B;&#x540E;&#x6240;&#x8BB0;&#x5F55;&#xFF0C;&#x5185;&#x5BB9;&#x4EC5;&#x4EC5;&#x662F;&#x51B0;&#x5C71;&#x4E00;&#x89D2;&#x3002;&#x9605;&#x8BFB;&#x8FC7;&#x7A0B;&#x4E2D;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x81EA;&#x8EAB;&#x7684;&#x5F88;&#x591A;&#x4E0D;&#x8DB3;&#xFF0C;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#x3002;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x90FD;&#x80FD;&#x8BFB;&#x4E00;&#x4E0B;&#x3002;</p>
</div><a data-url="http://yoursite.com/2015/03/28/《web前端最佳实践》—HTML篇/" data-id="cil2gjqjw0023hvqi2jj2c48w" class="article-share-link">分享到</a><div class="tags"><a href="/tags/HTML/">HTML</a></div><div class="post-nav"><a href="/2015/03/28/《web前端最佳实践》—高维护性css/" class="pre">《web前端最佳实践》—高维护性css</a><a href="/2015/03/14/front-homes-picture-overview-CSS3/" class="next">图文浅谈css3</a></div><div data-thread-key="2015/03/28/《web前端最佳实践》—HTML篇/" data-title="《web前端最佳实践》—HTML篇" data-url="http://yoursite.com/2015/03/28/《web前端最佳实践》—HTML篇/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2015/03/28/《web前端最佳实践》—HTML篇/" data-title="《web前端最佳实践》—HTML篇" data-url="http://yoursite.com/2015/03/28/《web前端最佳实践》—HTML篇/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/02/25/javascript-study-one/">征服javascript学习笔记（一）——认识js</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/24/new-year-first-do/">新年伊始，我都做了些什么</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/01/01/2015-summary/">梦幻般的2015，更丰盈的2016</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/14/自学者需要具备的基本技能和素质/">自学者需要具备的基本技能和素质</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/01/basic-layout/">说说基本的布局观</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/10/17/those-year-i-do-bad/">那些年我干过的矬事</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/09/13/zuiniu-birth/">醉牛前端诞生记</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/08/08/two-years-fe/">两年前端行</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/08/07/front-end-home-margin-that-thing/">margin那些事儿</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/22/再谈css/">再谈css</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>