<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="移动端," />





  <link rel="alternate" href="/atom.xml" title="灵感的小窝" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x4E0A;&amp;#x4E00;&amp;#x4E2A;&amp;#x79FB;&amp;#x52A8;&amp;#x9879;&amp;#x76EE;&amp;#x5DF2;&amp;#x7ECF;&amp;#x662F;&amp;#x524D;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x7684;&amp;#x4E8B;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x672C;&amp;#x60F3;&amp;#x90A3;">
<meta property="og:type" content="article">
<meta property="og:title" content="再谈移动页面之移动开发方面新的小收获">
<meta property="og:url" content="http://yoursite.com/2014/08/09/再谈移动页面之移动开发方面新的小收获/index.html">
<meta property="og:site_name" content="灵感的小窝">
<meta property="og:description" content="&amp;#x4E0A;&amp;#x4E00;&amp;#x4E2A;&amp;#x79FB;&amp;#x52A8;&amp;#x9879;&amp;#x76EE;&amp;#x5DF2;&amp;#x7ECF;&amp;#x662F;&amp;#x524D;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x7684;&amp;#x4E8B;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x672C;&amp;#x60F3;&amp;#x90A3;">
<meta property="og:updated_time" content="2016-02-24T12:55:51.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="再谈移动页面之移动开发方面新的小收获">
<meta name="twitter:description" content="&amp;#x4E0A;&amp;#x4E00;&amp;#x4E2A;&amp;#x79FB;&amp;#x52A8;&amp;#x9879;&amp;#x76EE;&amp;#x5DF2;&amp;#x7ECF;&amp;#x662F;&amp;#x524D;&amp;#x6BB5;&amp;#x65F6;&amp;#x95F4;&amp;#x7684;&amp;#x4E8B;&amp;#x4E86;&amp;#xFF0C;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x672C;&amp;#x60F3;&amp;#x90A3;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 再谈移动页面之移动开发方面新的小收获 | 灵感的小窝 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感的小窝</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                再谈移动页面之移动开发方面新的小收获
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-08-09T00:00:00+08:00" content="2014-08-09">
              2014-08-09
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/移动端/" itemprop="url" rel="index">
                    <span itemprop="name">移动端</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4E0A;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x9879;&#x76EE;&#x5DF2;&#x7ECF;&#x662F;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x4E8B;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x672C;&#x60F3;&#x90A3;&#x65F6;&#x5019;&#x5C31;&#x8D81;&#x70ED;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x5FC3;&#x7EEA;&#x5404;&#x79CD;&#x6CE2;&#x6298;&#xFF0C;&#x803D;&#x6401;&#x5230;&#x73B0;&#x5728;&#x3002;&#x4E89;&#x53D6;&#x80FD;&#x591F;&#x6700;&#x5927;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x6316;&#x6398;&#x8BB0;&#x5FC6;&#x628A;&#x5B83;&#x4EEC;&#x6316;&#x51FA;&#x6765;&#x5427;&#xFF01;~</p>
<p>&#x4E00;&#x3001;&#x518D;&#x6B21;&#x5F3A;&#x8C03;&#x5206;&#x8FA8;&#x7387;<br>&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x6765;&#x8272;&#x5F69;&#x9C9C;&#x660E;&#x7684;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;PC&#x5C4F;&#x5E55;&#x5F88;&#x5927;&#xFF0C;iphone&#x5C4F;&#x5E55;&#x5F88;&#x5C0F;&#xFF0C;&#x53EF;&#x662F;&#x524D;&#x8005;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x5374;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x540E;&#x8005;&#x90A3;&#x4E48;&#x5927;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x8981;&#x7279;&#x522B;&#x7684;&#x53BB;&#x6CE8;&#x610F;&#xFF0C;&#x4E0D;&#x7136;&#x5F88;&#x5BB9;&#x6613;&#x94BB;&#x8FDB;&#x6B7B;&#x80E1;&#x540C;&#x8D70;&#x4E0D;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x7684;&#x5728;PC&#x4E0A;&#x8C03;&#x8BD5;&#x79FB;&#x52A8;&#x7AEF;&#x7F51;&#x9875;&#xFF1F;<br>&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#x7528;&#x8C37;&#x6B4C;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#xFF0C;&#x8FD9;&#x5F53;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x7684;&#x5F88;&#x76F4;&#x89C2;&#x4E5F;&#x633A;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x201C;&#x53D8;&#x6210;&#x201D;&#x624B;&#x673A;&#x5C4F;&#x5E55;&#xFF0C;&#x600E;&#x4E48;&#x53D8;&#x5462;&#xFF1F;&#x76F4;&#x63A5;&#x8C03;&#x5C4F;&#x5E55;&#x5206;&#x8FA9;&#x7387;&#x5C31;&#x662F;&#x4E86;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x4E0D;&#x8FC7;&#x53EA;&#x662F;&#x76F8;&#x4F3C;&#x6548;&#x679C;&#x54E6;&#xFF01;&#xFF08;&#x8FD8;&#x8981;&#x5FCD;&#x53D7;&#x6240;&#x6709;&#x56FE;&#x6807;&#x90FD;&#x53D8;&#x5927;&#xFF0C;&#x773C;&#x775B;&#x4F1A;&#x4E0D;&#x8212;&#x670D;~&#xFF09;&#x3002;&#x80AF;&#x5B9A;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#xFF0C;&#x518D;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x5427;&#xFF0C;&#x7528;DW&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x5B83;&#x7684;&#x5370;&#x8C61;&#x4EC5;&#x4EC5;&#x662F;&#x7528;&#x6765;&#x7F16;&#x7801;&#xFF0C;&#x4F30;&#x8BA1;&#x4F60;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;<br>&#x518D;&#x8C08;&#x79FB;&#x52A8;&#x9875;&#x9762;&#x4E4B;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x65B0;&#x7684;&#x5C0F;&#x6536;&#x83B7; - &#x7075;&#x611F; - linggan<br>&#x662F;&#x7684;&#xFF0C;&#x5B83;&#x5C31;&#x5728;&#x4F60;&#x6240;&#x719F;&#x6089;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x9884;&#x89C8;&#x6309;&#x94AE;&#x7684;&#x524D;&#x9762;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x91CC;&#x5217;&#x51FA;&#x6765;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x53EF;&#x9009;&#x9879;&#x6709;&#x9650;&#xFF0C;&#x8FD8;&#x662F;&#x80FD;&#x63D0;&#x4F9B;&#x5230;&#x4E00;&#x4E9B;&#x53C2;&#x7167;&#x6027;&#x3002;<br>&#x6211;&#x76F8;&#x4FE1;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x77E5;&#x9053;&#xFF0C;&#x8BF7;&#x4E0D;&#x541D;&#x8D50;&#x6559;&#xFF0C;&#x5B9A;&#x5341;&#x5206;&#x611F;&#x8C22;&#xFF01;~</p>
<p>&#x4E09;&#x3001;&#x5F53;&#x5FC3;&#x4F60;&#x6240;&#x7528;&#x7684;&#x662F;&#x201C;&#x767E;&#x5206;&#x6BD4;&#x201D;&#xFF01;</p>
<p>&#x65E2;&#x7136;&#x662F;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x90A3;&#x8BF7;&#x544A;&#x8BC9;&#x6211;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x76F4;&#x89C9;&#x6548;&#x679C;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5BF9;&#xFF0C;&#x5C31;&#x662F;&#x603B;&#x5BBD;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x8981;&#x6307;&#x671B;&#x80FD;&#x4E00;&#x6B21;&#x6027;&#x5B9A;&#x4E49;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x663E;&#x793A;&#x6548;&#x679C;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x4E4B;&#x524D;&#x5BF9;&#x6B64;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x6000;&#x7591;&#xFF0C;&#x4E3E;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x3002;<br>&#x518D;&#x8C08;&#x79FB;&#x52A8;&#x9875;&#x9762;&#x4E4B;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x65B0;&#x7684;&#x5C0F;&#x6536;&#x83B7; - &#x7075;&#x611F; - linggan<br>&#x518D;&#x8C08;&#x79FB;&#x52A8;&#x9875;&#x9762;&#x4E4B;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x65B0;&#x7684;&#x5C0F;&#x6536;&#x83B7; - &#x7075;&#x611F; - linggan<br> &#x8FD9;&#x4E24;&#x5F20;&#x56FE;&#x4EE3;&#x7801;&#x7684;&#x533A;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x4EC5;&#x4EC5;&#x7EA2;&#x8272;&#x90E8;&#x5206;&#x5BBD;&#x5EA6;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF08;&#x53EF;&#x80FD;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x600E;&#x4E48;&#x9AD8;&#x5EA6;&#x548C;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x4E5F;&#x53D8;&#x4E86;&#xFF0C;&#x597D;&#x5427;&#x662F;&#x6211;&#x56FE;&#x622A;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x505A;&#x8BD5;&#x9A8C;&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x5FAE;&#x8C03;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4E24;&#x6B3E;&#x5206;&#x8FA8;&#x7387;&#x76F8;&#x5DEE;&#x5F88;&#x591A;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x8FD8;&#x4F1A;&#x76F8;&#x5DEE;&#x5F88;&#x591A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x6B21;&#x5B9A;&#x4E49;&#x6253;&#x904D;&#x5929;&#x4E0B;&#x662F;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x4E86;~</p>
<p>&#x56DB;&#x3001;px&#x3001;em&#x3001;rem&#x548C;62.5%<br>&#x5F88;&#x591A;&#x4EBA;&#x6216;&#x8005;&#x4F1A;&#x89C9;&#x5F97;px&#x5F88;&#x5E38;&#x7528;&#xFF0C;&#x90FD;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x4EBA;&#x7528;&#x8FC7;em&#xFF0C;&#x80AF;&#x5B9A;&#x4E5F;&#x6709;&#x4EBA;&#x4F1A;&#x628A;em&#x5F53;&#x505A;rem&#x7684;&#x6027;&#x8D28;&#x53BB;&#x7528;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x8FD8;&#x6CA1;&#x6709;&#x5BDF;&#x89C9;&#xFF0C;&#x800C;rem&#x548C;62.5%&#x5C31;&#x6709;&#x7740;&#x5BC6;&#x5207;&#x8054;&#x7CFB;&#x4E86;&#x3002;<br>em&#x662F;&#x6309;&#x6BD4;&#x4F8B;&#x6765;&#x7684;&#xFF0C;&#x90A3;px&#x662F;&#x7EDD;&#x5BF9;&#x5355;&#x4F4D;&#x4E48;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x5F88;&#x8FC5;&#x901F;&#x5E76;&#x4E14;&#x5F88;&#x54CD;&#x4EAE;&#x7684;&#x56DE;&#x7B54;&#xFF1A;&#x662F;&#x7684;&#xFF01; &#x90A3;&#x606D;&#x559C;&#x4F60;&#xFF01;</p>
<p>px&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x5355;&#x4F4D;&#xFF0C;&#x76F8;&#x5BF9;&#x7684;&#x662F;&#x8BBE;&#x5907;&#x50CF;&#x7D20;(device pixel)&#x3002;<br>&#x6BD4;&#x5982;iPhone 5&#x4F7F;&#x7528;&#x7684;&#x662F;Retina&#x89C6;&#x7F51;&#x819C;&#x5C4F;&#x5E55;&#xFF0C;&#x4F7F;&#x7528;2px x 2px&#x7684; device pixel &#x4EE3;&#x8868; 1px x 1px &#x7684; css pixel&#xFF0C;&#x6240;&#x4EE5;&#x8BBE;&#x5907;&#x50CF;&#x7D20;&#x6570;&#x4E3A;640 x 1136px&#xFF0C;&#x800C;CSS&#x903B;&#x8F91;&#x50CF;&#x7D20;&#x6570;&#x4E3A;320 x 568px&#x3002;<br>&#x6BD4;&#x8F83;&#x6B63;&#x786E;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;&#x7531;&#x8BBE;&#x8BA1;&#x5E08;&#x6309;&#x7167;&#x8BBE;&#x5907;&#x50CF;&#x7D20;(device pixel)&#x4E3A;&#x5355;&#x4F4D;&#x5236;&#x4F5C;&#x8BBE;&#x8BA1;&#x7A3F;&#x3002;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x53C2;&#x7167;&#x76F8;&#x5173;&#x7684;&#x8BBE;&#x5907;&#x50CF;&#x7D20;&#x6BD4;(device pixel ratio)&#xFF0C;&#x8FDB;&#x884C;&#x6362;&#x7B97;&#x4EE5;&#x53CA;&#x7F16;&#x7801;&#x3002;</p>
<p>&#x90A3;em&#x5462;&#xFF1F;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x5B57;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x5927;&#x5C0F;&#x662F;&#x4F1A;&#x7EE7;&#x627F;&#x7684;&#xFF0C;&#x800C;em&#x662F;&#x548C;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7684;&#x7236;&#x5143;&#x7D20;&#x53BB;&#x6BD4;&#x8F83;&#xFF0C;&#x975E;body&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x6839;&#x5143;&#x7D20;&#x6216;&#x6D4F;&#x89C8;&#x5668;&#x9ED8;&#x8BA4;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60F3;&#x8BA1;&#x7B97;&#x65B9;&#x4FBF;&#xFF0C;&#x90A3;62.5%&#x548C;rem&#x5C31;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#x4E86;&#xFF0C;&#x4E0D;&#x5FC5;&#x6015;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5B9A;&#x4E49;62.5%&#xFF1F;&#x2014;&#x2014;16*0.625=10&#xFF01;&#x54C7;&#xFF0C;&#x597D;&#x597D;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;<br> &#x65B9;&#x4FBF;&#xFF0C;&#x800C;rem&#x5219;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x9ED8;&#x8BA4;&#x6216;&#x8005;body&#x5B9A;&#x4E49;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x3002;&#x5728;body&#x91CC;&#x5B9A;&#x4E49;&#x4E86;62.5%&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x4E0B;&#x9762;&#x60F3;&#x5B9A;&#x4E49;&#x591A;&#x5927;&#x7684;&#x5B57;&#x4F53;&#x6839;&#x672C;&#x5C31;&#x7528;&#x4E0D;&#x7740;&#x8BA1;&#x7B97;&#x5668;&#x4E86;&#x76F4;&#x63A5;&#x52A0;&#x4E2A;&#x5C0F;&#x6570;&#x70B9;&#x540E;&#x9762;&#x8DDF;rem&#x5C31;&#x6B27;&#x4E86;&#xFF01;~&#x4E0D;&#x8FC7;&#x8981;&#x8BF4;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8981;&#x7167;&#x987E;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x53BB;&#x591A;&#x5199;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x9632;&#x5728;&#x4E0D;&#x652F;&#x6301;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6B7B;&#x5F97;&#x5F88;&#x60E8;&#xFF0C;&#x60F3;&#x5FC5;&#x5927;&#x5BB6;&#x90FD;&#x4E60;&#x60EF;&#x4E86;&#x5427;&#xFF1F;~</p>
<p>&#x4E94;&#x3001;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#x548C;js&#x5224;&#x65AD;&#x5C4F;&#x5E55;</p>
<p>&#x8981;&#x60F3;&#x771F;&#x7684;&#x9002;&#x5E94;&#x5404;&#x79CD;&#x5C4F;&#x5E55;&#xFF0C;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#x662F;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x65F6;&#x5019;js&#x5BF9;&#x5C4F;&#x5E55;&#x7684;&#x5224;&#x65AD;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x90FD;&#x633A;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x5C31;&#x56E0;&#x4E3A;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x9AD8;&#x5EA6;&#x6216;&#x8005;&#x5BBD;&#x5EA6;&#x663E;&#x5F97;&#x5F88;&#x522B;&#x626D;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x6709;&#x5FC5;&#x8981;&#x628A;&#x5B83;&#x5355;&#x72EC;&#x62FF;&#x51FA;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x628A;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;<br> &#xFF0C;&#x5355;&#x72EC;&#x8FDB;&#x884C;&#x5927;&#x5C0F;&#x5C3A;&#x5BF8;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x6216;&#x8005;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x53EA;&#x4FDD;&#x7559;&#x4E3B;&#x8981;&#x90E8;&#x5206;&#xFF0C;&#x6B21;&#x8981;&#x7684;&#x53EF;&#x4EE5;&#x62FF;&#x6389;&#xFF0C;&#x53EF;&#x7528;&#x7B2C;&#x4E00;&#xFF0C;&#x4E0D;&#x80FD;&#x6709;&#x660E;&#x663E;&#x7684;bug&#xFF0C;&#x4E0D;&#x7136;&#x4F60;&#x5C31;&#x73A9;&#x5B8C;&#x4E86;&#xFF01;~</p>
<p>&#x5148;&#x8FD9;&#x4E48;&#x591A;&#x5427;&#xFF0C;&#x8111;&#x7EC6;&#x80DE;&#x5DF2;&#x7ECF;&#x6302;&#x4E86;&#x4E0D;&#x5C11;&#x4E86;&#xFF0C;&#x4EE5;&#x540E;&#x6709;&#x4E86;&#x4F1A;&#x7EE7;&#x7EED;&#xFF01;~</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/移动端/" rel="tag">#移动端</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2014/08/09/你还在坚持吗？~/" rel="next" title="你还在坚持吗？">
                <i class="fa fa-chevron-left"></i> 你还在坚持吗？
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2014/08/16/初谈怎样更好的去规划CSS/" rel="prev" title="初谈怎样更好的去规划CSS">
                初谈怎样更好的去规划CSS <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
