<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />





  <link rel="alternate" href="/atom.xml" title="灵感的小窝" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description">
<meta property="og:type" content="website">
<meta property="og:title" content="灵感的小窝">
<meta property="og:url" content="http://yoursite.com/page/6/index.html">
<meta property="og:site_name" content="灵感的小窝">
<meta property="og:description">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="灵感的小窝">
<meta name="twitter:description">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 灵感的小窝 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left 
   page-home 
 ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感的小窝</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">

    

    
    

    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/08/09/再谈移动页面之移动开发方面新的小收获/" itemprop="url">
                  再谈移动页面之移动开发方面新的小收获
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-08-09T00:00:00+08:00" content="2014-08-09">
              2014-08-09
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/移动端/" itemprop="url" rel="index">
                    <span itemprop="name">移动端</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4E0A;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x9879;&#x76EE;&#x5DF2;&#x7ECF;&#x662F;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x4E8B;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x672C;&#x60F3;&#x90A3;&#x65F6;&#x5019;&#x5C31;&#x8D81;&#x70ED;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x5FC3;&#x7EEA;&#x5404;&#x79CD;&#x6CE2;&#x6298;&#xFF0C;&#x803D;&#x6401;&#x5230;&#x73B0;&#x5728;&#x3002;&#x4E89;&#x53D6;&#x80FD;&#x591F;&#x6700;&#x5927;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x6316;&#x6398;&#x8BB0;&#x5FC6;&#x628A;&#x5B83;&#x4EEC;&#x6316;&#x51FA;&#x6765;&#x5427;&#xFF01;~</p>
<p>&#x4E00;&#x3001;&#x518D;&#x6B21;&#x5F3A;&#x8C03;&#x5206;&#x8FA8;&#x7387;<br>&#x7528;&#x4E00;&#x53E5;&#x8BDD;&#x6765;&#x8272;&#x5F69;&#x9C9C;&#x660E;&#x7684;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;PC&#x5C4F;&#x5E55;&#x5F88;&#x5927;&#xFF0C;iphone&#x5C4F;&#x5E55;&#x5F88;&#x5C0F;&#xFF0C;&#x53EF;&#x662F;&#x524D;&#x8005;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x5374;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x540E;&#x8005;&#x90A3;&#x4E48;&#x5927;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x8981;&#x7279;&#x522B;&#x7684;&#x53BB;&#x6CE8;&#x610F;&#xFF0C;&#x4E0D;&#x7136;&#x5F88;&#x5BB9;&#x6613;&#x94BB;&#x8FDB;&#x6B7B;&#x80E1;&#x540C;&#x8D70;&#x4E0D;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x5982;&#x4F55;&#x66F4;&#x597D;&#x7684;&#x5728;PC&#x4E0A;&#x8C03;&#x8BD5;&#x79FB;&#x52A8;&#x7AEF;&#x7F51;&#x9875;&#xFF1F;<br>&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#x7528;&#x8C37;&#x6B4C;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#xFF0C;&#x8FD9;&#x5F53;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x7684;&#x5F88;&#x76F4;&#x89C2;&#x4E5F;&#x633A;&#x65B9;&#x4FBF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x628A;&#x81EA;&#x5DF1;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x201C;&#x53D8;&#x6210;&#x201D;&#x624B;&#x673A;&#x5C4F;&#x5E55;&#xFF0C;&#x600E;&#x4E48;&#x53D8;&#x5462;&#xFF1F;&#x76F4;&#x63A5;&#x8C03;&#x5C4F;&#x5E55;&#x5206;&#x8FA9;&#x7387;&#x5C31;&#x662F;&#x4E86;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x4E0D;&#x8FC7;&#x53EA;&#x662F;&#x76F8;&#x4F3C;&#x6548;&#x679C;&#x54E6;&#xFF01;&#xFF08;&#x8FD8;&#x8981;&#x5FCD;&#x53D7;&#x6240;&#x6709;&#x56FE;&#x6807;&#x90FD;&#x53D8;&#x5927;&#xFF0C;&#x773C;&#x775B;&#x4F1A;&#x4E0D;&#x8212;&#x670D;~&#xFF09;&#x3002;&#x80AF;&#x5B9A;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#xFF0C;&#x518D;&#x4ECB;&#x7ECD;&#x4E00;&#x79CD;&#x5427;&#xFF0C;&#x7528;DW&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x5B83;&#x7684;&#x5370;&#x8C61;&#x4EC5;&#x4EC5;&#x662F;&#x7528;&#x6765;&#x7F16;&#x7801;&#xFF0C;&#x4F30;&#x8BA1;&#x4F60;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;<br>&#x518D;&#x8C08;&#x79FB;&#x52A8;&#x9875;&#x9762;&#x4E4B;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x65B0;&#x7684;&#x5C0F;&#x6536;&#x83B7; - &#x7075;&#x611F; - linggan<br>&#x662F;&#x7684;&#xFF0C;&#x5B83;&#x5C31;&#x5728;&#x4F60;&#x6240;&#x719F;&#x6089;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x9884;&#x89C8;&#x6309;&#x94AE;&#x7684;&#x524D;&#x9762;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x91CC;&#x5217;&#x51FA;&#x6765;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x53EF;&#x9009;&#x9879;&#x6709;&#x9650;&#xFF0C;&#x8FD8;&#x662F;&#x80FD;&#x63D0;&#x4F9B;&#x5230;&#x4E00;&#x4E9B;&#x53C2;&#x7167;&#x6027;&#x3002;<br>&#x6211;&#x76F8;&#x4FE1;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x77E5;&#x9053;&#xFF0C;&#x8BF7;&#x4E0D;&#x541D;&#x8D50;&#x6559;&#xFF0C;&#x5B9A;&#x5341;&#x5206;&#x611F;&#x8C22;&#xFF01;~</p>
<p>&#x4E09;&#x3001;&#x5F53;&#x5FC3;&#x4F60;&#x6240;&#x7528;&#x7684;&#x662F;&#x201C;&#x767E;&#x5206;&#x6BD4;&#x201D;&#xFF01;</p>
<p>&#x65E2;&#x7136;&#x662F;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x90A3;&#x8BF7;&#x544A;&#x8BC9;&#x6211;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x76F4;&#x89C9;&#x6548;&#x679C;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5BF9;&#xFF0C;&#x5C31;&#x662F;&#x603B;&#x5BBD;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x8981;&#x6307;&#x671B;&#x80FD;&#x4E00;&#x6B21;&#x6027;&#x5B9A;&#x4E49;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x663E;&#x793A;&#x6548;&#x679C;&#x4E00;&#x6837;&#x4E86;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x4E4B;&#x524D;&#x5BF9;&#x6B64;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x6000;&#x7591;&#xFF0C;&#x4E3E;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x3002;<br>&#x518D;&#x8C08;&#x79FB;&#x52A8;&#x9875;&#x9762;&#x4E4B;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x65B0;&#x7684;&#x5C0F;&#x6536;&#x83B7; - &#x7075;&#x611F; - linggan<br>&#x518D;&#x8C08;&#x79FB;&#x52A8;&#x9875;&#x9762;&#x4E4B;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x65B0;&#x7684;&#x5C0F;&#x6536;&#x83B7; - &#x7075;&#x611F; - linggan<br> &#x8FD9;&#x4E24;&#x5F20;&#x56FE;&#x4EE3;&#x7801;&#x7684;&#x533A;&#x522B;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x4EC5;&#x4EC5;&#x7EA2;&#x8272;&#x90E8;&#x5206;&#x5BBD;&#x5EA6;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF08;&#x53EF;&#x80FD;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#x600E;&#x4E48;&#x9AD8;&#x5EA6;&#x548C;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x4E5F;&#x53D8;&#x4E86;&#xFF0C;&#x597D;&#x5427;&#x662F;&#x6211;&#x56FE;&#x622A;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x4F60;&#x4EEC;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x505A;&#x8BD5;&#x9A8C;&#xFF09;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x5FAE;&#x8C03;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x4E24;&#x6B3E;&#x5206;&#x8FA8;&#x7387;&#x76F8;&#x5DEE;&#x5F88;&#x591A;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x8FD8;&#x4F1A;&#x76F8;&#x5DEE;&#x5F88;&#x591A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x6B21;&#x5B9A;&#x4E49;&#x6253;&#x904D;&#x5929;&#x4E0B;&#x662F;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x4E86;~</p>
<p>&#x56DB;&#x3001;px&#x3001;em&#x3001;rem&#x548C;62.5%<br>&#x5F88;&#x591A;&#x4EBA;&#x6216;&#x8005;&#x4F1A;&#x89C9;&#x5F97;px&#x5F88;&#x5E38;&#x7528;&#xFF0C;&#x90FD;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x4EBA;&#x7528;&#x8FC7;em&#xFF0C;&#x80AF;&#x5B9A;&#x4E5F;&#x6709;&#x4EBA;&#x4F1A;&#x628A;em&#x5F53;&#x505A;rem&#x7684;&#x6027;&#x8D28;&#x53BB;&#x7528;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x8FD8;&#x6CA1;&#x6709;&#x5BDF;&#x89C9;&#xFF0C;&#x800C;rem&#x548C;62.5%&#x5C31;&#x6709;&#x7740;&#x5BC6;&#x5207;&#x8054;&#x7CFB;&#x4E86;&#x3002;<br>em&#x662F;&#x6309;&#x6BD4;&#x4F8B;&#x6765;&#x7684;&#xFF0C;&#x90A3;px&#x662F;&#x7EDD;&#x5BF9;&#x5355;&#x4F4D;&#x4E48;&#xFF1F;&#x5982;&#x679C;&#x4F60;&#x5F88;&#x8FC5;&#x901F;&#x5E76;&#x4E14;&#x5F88;&#x54CD;&#x4EAE;&#x7684;&#x56DE;&#x7B54;&#xFF1A;&#x662F;&#x7684;&#xFF01; &#x90A3;&#x606D;&#x559C;&#x4F60;&#xFF01;</p>
<p>px&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x5355;&#x4F4D;&#xFF0C;&#x76F8;&#x5BF9;&#x7684;&#x662F;&#x8BBE;&#x5907;&#x50CF;&#x7D20;(device pixel)&#x3002;<br>&#x6BD4;&#x5982;iPhone 5&#x4F7F;&#x7528;&#x7684;&#x662F;Retina&#x89C6;&#x7F51;&#x819C;&#x5C4F;&#x5E55;&#xFF0C;&#x4F7F;&#x7528;2px x 2px&#x7684; device pixel &#x4EE3;&#x8868; 1px x 1px &#x7684; css pixel&#xFF0C;&#x6240;&#x4EE5;&#x8BBE;&#x5907;&#x50CF;&#x7D20;&#x6570;&#x4E3A;640 x 1136px&#xFF0C;&#x800C;CSS&#x903B;&#x8F91;&#x50CF;&#x7D20;&#x6570;&#x4E3A;320 x 568px&#x3002;<br>&#x6BD4;&#x8F83;&#x6B63;&#x786E;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;&#x7531;&#x8BBE;&#x8BA1;&#x5E08;&#x6309;&#x7167;&#x8BBE;&#x5907;&#x50CF;&#x7D20;(device pixel)&#x4E3A;&#x5355;&#x4F4D;&#x5236;&#x4F5C;&#x8BBE;&#x8BA1;&#x7A3F;&#x3002;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x53C2;&#x7167;&#x76F8;&#x5173;&#x7684;&#x8BBE;&#x5907;&#x50CF;&#x7D20;&#x6BD4;(device pixel ratio)&#xFF0C;&#x8FDB;&#x884C;&#x6362;&#x7B97;&#x4EE5;&#x53CA;&#x7F16;&#x7801;&#x3002;</p>
<p>&#x90A3;em&#x5462;&#xFF1F;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x5B57;&#x4F53;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x5927;&#x5C0F;&#x662F;&#x4F1A;&#x7EE7;&#x627F;&#x7684;&#xFF0C;&#x800C;em&#x662F;&#x548C;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x7684;&#x7236;&#x5143;&#x7D20;&#x53BB;&#x6BD4;&#x8F83;&#xFF0C;&#x975E;body&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x6839;&#x5143;&#x7D20;&#x6216;&#x6D4F;&#x89C8;&#x5668;&#x9ED8;&#x8BA4;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60F3;&#x8BA1;&#x7B97;&#x65B9;&#x4FBF;&#xFF0C;&#x90A3;62.5%&#x548C;rem&#x5C31;&#x6D3E;&#x4E0A;&#x7528;&#x573A;&#x4E86;&#xFF0C;&#x4E0D;&#x5FC5;&#x6015;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5B9A;&#x4E49;62.5%&#xFF1F;&#x2014;&#x2014;16*0.625=10&#xFF01;&#x54C7;&#xFF0C;&#x597D;&#x597D;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;<br> &#x65B9;&#x4FBF;&#xFF0C;&#x800C;rem&#x5219;&#x662F;&#x76F8;&#x5BF9;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x9ED8;&#x8BA4;&#x6216;&#x8005;body&#x5B9A;&#x4E49;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x3002;&#x5728;body&#x91CC;&#x5B9A;&#x4E49;&#x4E86;62.5%&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x4E0B;&#x9762;&#x60F3;&#x5B9A;&#x4E49;&#x591A;&#x5927;&#x7684;&#x5B57;&#x4F53;&#x6839;&#x672C;&#x5C31;&#x7528;&#x4E0D;&#x7740;&#x8BA1;&#x7B97;&#x5668;&#x4E86;&#x76F4;&#x63A5;&#x52A0;&#x4E2A;&#x5C0F;&#x6570;&#x70B9;&#x540E;&#x9762;&#x8DDF;rem&#x5C31;&#x6B27;&#x4E86;&#xFF01;~&#x4E0D;&#x8FC7;&#x8981;&#x8BF4;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8981;&#x7167;&#x987E;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x53BB;&#x591A;&#x5199;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x9632;&#x5728;&#x4E0D;&#x652F;&#x6301;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6B7B;&#x5F97;&#x5F88;&#x60E8;&#xFF0C;&#x60F3;&#x5FC5;&#x5927;&#x5BB6;&#x90FD;&#x4E60;&#x60EF;&#x4E86;&#x5427;&#xFF1F;~</p>
<p>&#x4E94;&#x3001;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#x548C;js&#x5224;&#x65AD;&#x5C4F;&#x5E55;</p>
<p>&#x8981;&#x60F3;&#x771F;&#x7684;&#x9002;&#x5E94;&#x5404;&#x79CD;&#x5C4F;&#x5E55;&#xFF0C;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#x662F;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6709;&#x65F6;&#x5019;js&#x5BF9;&#x5C4F;&#x5E55;&#x7684;&#x5224;&#x65AD;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x90FD;&#x633A;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x5C31;&#x56E0;&#x4E3A;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x9AD8;&#x5EA6;&#x6216;&#x8005;&#x5BBD;&#x5EA6;&#x663E;&#x5F97;&#x5F88;&#x522B;&#x626D;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x6709;&#x5FC5;&#x8981;&#x628A;&#x5B83;&#x5355;&#x72EC;&#x62FF;&#x51FA;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x628A;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;<br> &#xFF0C;&#x5355;&#x72EC;&#x8FDB;&#x884C;&#x5927;&#x5C0F;&#x5C3A;&#x5BF8;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x6216;&#x8005;&#x5FC5;&#x8981;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x53EA;&#x4FDD;&#x7559;&#x4E3B;&#x8981;&#x90E8;&#x5206;&#xFF0C;&#x6B21;&#x8981;&#x7684;&#x53EF;&#x4EE5;&#x62FF;&#x6389;&#xFF0C;&#x53EF;&#x7528;&#x7B2C;&#x4E00;&#xFF0C;&#x4E0D;&#x80FD;&#x6709;&#x660E;&#x663E;&#x7684;bug&#xFF0C;&#x4E0D;&#x7136;&#x4F60;&#x5C31;&#x73A9;&#x5B8C;&#x4E86;&#xFF01;~</p>
<p>&#x5148;&#x8FD9;&#x4E48;&#x591A;&#x5427;&#xFF0C;&#x8111;&#x7EC6;&#x80DE;&#x5DF2;&#x7ECF;&#x6302;&#x4E86;&#x4E0D;&#x5C11;&#x4E86;&#xFF0C;&#x4EE5;&#x540E;&#x6709;&#x4E86;&#x4F1A;&#x7EE7;&#x7EED;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/08/09/你还在坚持吗？~/" itemprop="url">
                  你还在坚持吗？
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-08-09T00:00:00+08:00" content="2014-08-09">
              2014-08-09
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x8FD1;&#x671F;&#x7684;&#x5DE5;&#x4F5C;&#x4F9D;&#x7136;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#x65B0;&#x4E8B;&#x7269;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x89C9;&#x5F97;&#x538B;&#x529B;&#x5C71;&#x5927;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x90FD;&#x633A;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6210;&#x957F;&#x7684;&#x5FC5;&#x7ECF;&#x4E4B;&#x8DEF;&#x3002;&#x5404;&#x65B9;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x4ECD;&#x5728;&#x6301;&#x7EED;&#x7740;&#xFF0C;&#x4F46;&#x4F3C;&#x4E4E;&#x4ECD;&#x7136;&#x654C;&#x4E0D;&#x8FC7;&#x65F6;&#x95F4;&#x5BF9;&#x8010;&#x6027;&#x7684;&#x8003;&#x9A8C;~&#x8FD8;&#x597D;&#xFF0C;&#x6211;&#x8FD8;&#x5728;&#x575A;&#x6301;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x4E00;&#x76F4;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x3002;</p>
<p>&#x8DDF;&#x4E00;&#x4E9B;&#x524D;&#x8F88;&#x4E13;&#x5BB6;&#x7ECF;&#x5E38;&#x4EA4;&#x6D41;&#xFF0C;&#x5411;&#x4ED6;&#x4EEC;&#x8BF7;&#x6559;&#xFF0C;&#x89C9;&#x5F97;&#x6536;&#x76CA;&#x5F88;&#x591A;&#xFF0C;&#x5305;&#x62EC;&#x4E4B;&#x524D;&#x8BA4;&#x8BC6;&#x7684;&#x5C0F;&#x5FD7;&#x3001;&#x963F;&#x5F53;&#xFF0C;&#x5927;&#x767D;&#x3001;&#x5927;&#x6F20;&#x3001;&#x9B3C;&#x54E5;&#x3001;&#x9B3C;&#xFF0C;&#x540E;&#x6765;&#x8BA4;&#x8BC6;&#x7684;&#x4E00;&#x4E1D;&#x3001;&#x97EC;&#x54E5;&#x7B49;&#x7B49;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x628A;&#x4ED6;&#x4EEC;&#x7684;&#x201C;&#x540D;&#x5B57;&#x201D;&#x5217;&#x51FA;&#x6765;&#x5462;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x8868;&#x793A;&#x611F;&#x8C22;&#xFF0C;&#x7B2C;&#x4E8C;&#x662F;&#x8868;&#x8FBE;&#x4E00;&#x79CD;&#x94A6;&#x4F69;&#xFF0C;&#x80FD;&#x5728;&#x884C;&#x4E1A;&#x91CC;&#x505A;&#x6280;&#x672F;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#xFF0C;&#x800C;&#x4E14;&#x4F9D;&#x7136;&#x4FDD;&#x6301;&#x7740;&#x65FA;&#x76DB;&#x7CBE;&#x529B;&#xFF0C;&#x70ED;&#x60C5;&#x4E0D;&#x51CF;&#x7684;&#x53BB;&#x5B66;&#x4E60;&#xFF0C;&#x7814;&#x7A76;&#xFF0C;&#x5206;&#x4EAB;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x662F;&#x8BF4;&#x8BF4;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x5F88;&#x96BE;&#x80FD;&#x53EF;&#x8D35;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x4F1A;&#x8BA4;&#x540C;&#x4E00;&#x79CD;&#x89C2;&#x70B9;&#xFF0C;&#x5B66;&#x5F97;&#x8D8A;&#x591A;&#xFF0C;&#x63A5;&#x89E6;&#x5230;&#x7684;&#x9886;&#x57DF;&#x4E5F;&#x8D8A;&#x5E7F;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x8EAB;&#x7684;&#x4E0D;&#x8DB3;&#x4E5F;&#x8D8A;&#x591A;&#xFF0C;&#x6574;&#x4E2A;&#x4EBA;&#x4E5F;&#x5C31;&#x4F1A;&#x8D8A;&#x8C26;&#x900A;&#x3002;</p>
<p>&#x65F6;&#x4E0D;&#x65F6;&#x6709;&#x7740;&#x4E00;&#x79CD;&#x865A;&#x8363;&#x5FC3;&#x9A71;&#x4F7F;&#x60F3;&#x5C1D;&#x8BD5;&#x52A0;&#x5165;&#x77E5;&#x540D;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x4F46;&#x9274;&#x4E8E;&#x80FD;&#x529B;&#x548C;&#x7ECF;&#x9A8C;&#x4E0A;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x6682;&#x65F6;&#x5C1A;&#x672A;&#x5982;&#x613F;&#xFF0C;&#x4E0D;&#x8FC7;&#x6211;&#x5E0C;&#x671B;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#xFF0C;&#x5F53;&#x6211;&#x771F;&#x7684;&#x80FD;&#x52A0;&#x5165;&#x5B83;&#x4EEC;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x5E26;&#x6709;&#x4EFB;&#x4F55;&#x611F;&#x60C5;&#x8272;&#x5F69;&#xFF0C;&#x800C;&#x4EC5;&#x4EC5;&#x62B1;&#x7740;&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x6280;&#x672F;&#x5458;&#xFF0C;&#x4E00;&#x540D;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x5FC3;&#xFF0C;&#x53BB;&#x521B;&#x9020;&#x597D;&#x7684;&#x4EA7;&#x54C1;&#xFF01;~</p>
<p>&#x8D70;&#x4E0A;&#x8FD9;&#x6761;&#x8DEF;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4F60;&#x53BB;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x80FD;&#x575A;&#x6301;&#x8D8A;&#x4E45;&#x7684;&#x4EBA;&#xFF0C;&#x5149;&#x8292;&#x8D8A;&#x662F;&#x8000;&#x773C;&#xFF0C;&#x4F60;&#x8FD8;&#x5728;&#x575A;&#x6301;&#x5417;&#xFF1F;&#x8DDF;&#x6211;&#x4E00;&#x8D77;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x5427;&#xFF01;</p>
<p>&#x5927;&#x6F20;&#x535A;&#x5BA2;&#xFF1A;<a href="http://www.w3cplus.com/" target="_blank" rel="external">w3cplus</a>&#x4E00;&#x4E2A;&#x597D;&#x591A;&#x5E74;&#xFF0C;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x535A;&#x4E3B;&#x4E5F;&#x7279;&#x522B;&#x52E4;&#x594B;&#xFF0C;&#x503C;&#x5F97;&#x5927;&#x5BB6;&#x5B66;&#x4E60;&#xFF01;</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" itemprop="url">
                  初接触移动开发可能遇到的一部分问题（一无所知的可以看看）
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-07-05T00:00:00+08:00" content="2014-07-05">
              2014-07-05
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/移动端/" itemprop="url" rel="index">
                    <span itemprop="name">移动端</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h2 id="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"><a href="#&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"></a>&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;</h2><p>&#x662F;&#x7684;&#xFF0C;&#x7535;&#x8111;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5927;&#x81F4;&#x662F;&#x80CC;&#x666F;&#x5BBD;&#x5EA6;100%&#xFF0C;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x5C45;&#x4E2D;&#xFF0C;&#x5206;&#x680F;&#x5E03;&#x5C40;&#x6D6E;&#x52A8;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x5185;&#x5916;&#x8FB9;&#x8DDD;&#x7B49;&#x4FBF;&#x53EF;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x5230;&#x4E86;&#x79FB;&#x52A8;&#x7AEF;&#x5462;&#xFF1F;&#x5C4F;&#x5E55;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x5C0F;&#xFF0C;&#x4F60;&#x522B;&#x544A;&#x8BC9;&#x6211;&#x8981;&#x628A;&#x56FE;&#x7247;&#x548C;&#x6587;&#x5B57;&#x90FD;&#x8C03;&#x6574;&#x5230;&#x5F88;&#x5C0F;&#x7136;&#x540E;&#x628A;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x7ECF;&#x9A8C;&#x518D;&#x5168;&#x90E8;&#x642C;&#x8FC7;&#x6765;&#xFF0C;&#x663E;&#x7136;&#x4E0D;&#x9760;&#x8C31;&#xFF0C;&#x672C;&#x8EAB;&#x624B;&#x673A;&#x7F51;&#x9875;&#x6709;&#x7740;&#x5C4F;&#x5E55;&#x5C0F;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4FFA;&#x5C31;&#x610F;&#x5473;&#x7740;&#x7A7A;&#x95F4;&#x975E;&#x5E38;&#x5B9D;&#x8D35;&#xFF0C;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5730;&#x65B9;&#x7ED9;&#x4F60;&#x7559;&#x767D;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x533A;&#x57DF;&#x8981;&#x4E48;&#x53EF;&#x64CD;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x7528;&#x6765;&#x5C55;&#x793A;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x611F;&#x5B98;&#x548C;&#x64CD;&#x4F5C;&#x4FBF;&#x5229;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;"><a href="#&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;" class="headerlink" title="&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;"></a>&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;</h2><p>&#x9996;&#x5148;&#x5C31;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x767E;&#x5206;&#x6BD4;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x4E3A;&#x4E86;&#x8BBE;&#x7F6E;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x5BB9;&#x5668;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x6709;&#x4E86;&#x5BB9;&#x5668;&#x5927;&#x5C0F;&#xFF0C;&#x5185;&#x5BB9;&#x533A;&#x57DF;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x5B57;&#x4F53;&#x548C;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x731C;&#x5BF9;&#x4E86;&#xFF0C;&#x5B57;&#x4F53;&#x4E5F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x60EF;&#x4E86;&#x50CF;&#x7D20;&#xFF08;px&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x4F60;&#x7528;em&#xFF0C;&#x6216;&#x8005;rem&#x4E4B;&#x7C7B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4E00;&#x4E0B;&#x5F88;&#x4E0D;&#x4E60;&#x60EF;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x8003;&#x6807;&#x51C6;&#x8FD8;&#x662F;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x4E86;&#x798F;&#x97F3;&#xFF0C;&#x4E00;&#x822C;&#x9ED8;&#x8BA4;&#x5927;&#x5C0F;16px&#x662F;1em&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x51C6;&#x5907;&#x4E2A;&#x8BA1;&#x7B97;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x50CF;&#x7D20;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#x4E00;&#x8F6C;&#x6362;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x770B;&#x6837;&#x5B50;&#x8FD9;&#x6837;&#x662F;&#x51D1;&#x5408;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x662F;&#x51D1;&#x5408;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x603B;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x201C;&#x83AB;&#x540D;&#x201D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x7684;&#x7EE7;&#x627F;&#x6027;&#xFF0C;&#x4F7F;&#x7528;px&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x60F3;&#x8BBE;&#x7F6E;&#x591A;&#x5C11;&#x5C31;&#x662F;&#x591A;&#x5C11;&#x5BF9;&#x5427;&#xFF1F;&#x4EFB;&#x4F60;&#x6446;&#x5E03;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E2A;&#x7EDF;&#x4E00;&#x6807;&#x51C6;&#xFF08;px&#xFF09;&#x7EDD;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x800C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x6BD4;&#x5982;&#x7236;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x7684;2em&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;32px&#x5927;&#x5C0F;&#xFF0C;&#x5B50;&#x5143;&#x7D20;&#x4F60;&#x518D;&#x8BBE;&#x7F6E;&#x4E2A;2em&#xFF0C;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x8FD9;&#x91CC;&#x597D;&#x50CF;2em&#x2260;2em&#x4E86;&#xFF0C;&#x5177;&#x4F53;&#x81EA;&#x5DF1;&#x53BB;&#x5B9E;&#x9A8C;&#x5427;~&#x5982;&#x679C;&#x6211;&#x8FD9;&#x4E48;&#x8BF4;&#x4F60;&#x89C9;&#x5F97;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5408;&#x60C5;&#x5408;&#x7406;&#xFF0C;&#x90A3;&#x8BF4;&#x660E;&#x4F60;&#x6BD4;&#x8F83;&#x806A;&#x660E;&#xFF0C;&#x4F46;&#x5F53;&#x4F60;&#x6446;&#x8131;&#x4E0D;&#x6389;px&#x5E26;&#x6765;&#x7684;&#x4E60;&#x60EF;&#x800C;&#x9047;&#x5230;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x56DE;&#x6765;&#x770B;&#x6216;&#x8BB8;&#x4F1A;&#x53D1;&#x73B0;&#x70B9;&#x513F;&#x4EF7;&#x503C;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;"><a href="#&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;" class="headerlink" title="&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;"></a>&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;</h2><p>&#x4F60;&#x4F1A;&#x5802;&#x800C;&#x7687;&#x4E4B;&#x7684;&#x53BB;&#x8DDF;&#x8BBE;&#x8BA1;&#x8BF4;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x9002;&#x5E94;&#x5404;&#x79CD;&#x5C3A;&#x5BF8;&#xFF0C;&#x4F60;&#x7ED9;&#x6211;&#x8BBE;&#x8BA1;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x56FE;&#x7247;&#x5427;&#xFF0C;&#x4F60;&#x786E;&#x5B9A;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF1F;&#x53EF;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E5F;&#x884C;&#x554A;~&#x53EA;&#x53EF;&#x60DC;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x56FE;&#x7247;&#x53EF;&#x5927;&#x90FD;&#x662F;&#x4ECE;&#x540E;&#x53F0;&#x81EA;&#x884C;&#x4E0A;&#x4F20;&#x7684;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;&#x53EA;&#x80FD;&#x7528;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x6211;&#x53EA;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x6838;&#x5FC3;&#x53EA;&#x7528;&#x5230;&#x4E00;&#x70B9;&#xFF1A;max-width&#xFF1A;100%&#xFF0C;&#x81F3;&#x4E8E;&#x9700;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x4E0A;max-height:100%,&#x6216;&#x8005;height&#xFF1A;auto&#x3002;&#x670B;&#x53CB;&#xFF0C;&#x81EA;&#x5DF1;&#x53BB;&#x8BD5;&#x9A8C;&#x5427;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x9519;&#x7684;&#x5462;&#xFF1F;&#x591A;&#x5C1D;&#x8BD5;&#x624D;&#x80FD;&#x63A5;&#x8FD1;&#x771F;&#x7406;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;"><a href="#&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;" class="headerlink" title="&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;"></a>&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;</h2><p>&#x4E8B;&#x5B9E;&#x597D;&#x50CF;&#x4E0D;&#x5C3D;&#x7136;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x6B63;&#x786E;&#x8BA1;&#x7B97;&#x767E;&#x5206;&#x6BD4;&#x5417;&#xFF1F;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#xFF1A;&#x76EE;&#x6807;&#x5143;&#x7D20;&#x5BBD;&#x5EA6;/&#x4E0A;&#x4E0B;&#x6587;&#x5143;&#x7D20;&#x5BBD;&#x5EA6;=&#x767E;&#x5206;&#x6BD4;&#x5BBD;&#x5EA6;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x76F8;&#x5BF9;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x7236;&#x5143;&#x7D20;&#x53EA;&#x5360;&#x5230;&#x4E86;60%&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x60F3;&#x5B83;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x5360;&#x5230;&#x5B83;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x90A3;&#x5C31;&#x9664;&#x4EE5;2&#x5417;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x6216;&#x8BB8;&#x806A;&#x660E;&#x7684;&#x4F60;&#x60F3;&#x5230;&#x4E86;&#xFF0C;&#x662F;50%&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x60F3;&#x5F53;&#x7136;&#x7684;30%&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x548C;em&#x540C;&#x7406;&#x3002;</p>
<h2 id="&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;"><a href="#&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;" class="headerlink" title="&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;"></a>&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;</h2><p>&#x786E;&#x5B9E;&#x5B58;&#x5728;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x574F;&#x4E60;&#x60EF;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4F60;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#x67D0;&#x79CD;&#x5C4F;&#x5E55;&#x7684;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4F60;&#x8111;&#x6D77;&#x4E2D;&#x5C31;&#x6709;&#x4E86;&#x90A3;&#x4E2A;&#x5206;&#x8FA8;&#x7387;&#x4E0B;&#x76F8;&#x5E94;&#x6570;&#x503C;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x4F60;&#x518D;&#x53BB;&#x770B;&#x624B;&#x673A;&#x6216;&#x8005;&#x5E73;&#x677F;&#x7535;&#x8111;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x89C9;&#x5F97;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BBD;&#x5EA6;&#x5927;&#x6982;&#x4E5F;&#x5C31;300px&#x5DE6;&#x53F3;&#xFF0C;&#x90A3;&#x4E2A;&#x5BBD;&#x5EA6;&#x4E5F;&#x5C31;500px&#x5DE6;&#x53F3;&#x5427;&#x3002;&#x7AE5;&#x978B;&#xFF0C;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x8981;&#x5F88;&#x8C28;&#x614E;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x773C;&#x89C1;&#x4E0D;&#x4E3A;&#x5B9E;&#xFF0C;&#x7ECF;&#x9A8C;&#x4E0D;&#x53EF;&#x4FE1;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x63D0;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x5462;&#xFF0C;&#x8DDF;&#x4E0B;&#x9762;&#x8981;&#x8BF4;&#x7684;&#x6709;&#x5173;~</p>
<h2 id="&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;"><a href="#&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;" class="headerlink" title="&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;"></a>&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;</h2><p>&#x5982;&#x679C;&#x4F60;&#x5B9E;&#x5728;&#x4E0D;&#x60F3;&#x90A3;&#x4E48;&#x8D39;&#x52B2;&#x7684;&#x53BB;&#x8BBE;&#x7F6E;&#x548C;&#x8BA1;&#x7B97;&#x767E;&#x5206;&#x6BD4;&#x548C;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x8981;&#x641E;&#x6E05;&#x695A;&#x7F51;&#x9875;&#x8981;&#x5728;&#x54EA;&#x4E9B;&#x8BBE;&#x5907;&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x4EE5;&#x53CA;&#x5206;&#x8FA8;&#x7387;&#x8303;&#x56F4;&#xFF0C;&#x8BB0;&#x4F4F;&#x662F;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BA9;&#x4F60;&#x53BB;&#x72AF;&#x201C;&#x7B2C;&#x4E94;&#x70B9;&#x201D;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#xFF1A;@media screen and &#xFF08;max-width:xx px&#xFF09;{}.&#x662F;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4F60;&#x5B9A;&#x4E49;&#x7684;xx&#x5BBD;&#x5EA6;&#x4EE5;&#x5185;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7EDD;&#x5BF9;&#x5BBD;&#x5EA6;&#x548C;&#x5927;&#x5C0F;&#x4E86;&#xFF0C;&#x6211;&#x6CA1;&#x9A97;&#x4F60;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x76F4;&#x63A5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;html&#x6587;&#x4EF6;&#x7684;&#x5934;&#x90E8;&#x52A0;&#x5165;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5F15;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6837;&#x5F0F;&#x8868;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6837;&#x5F0F;&#x8868;&#x91CC;&#x76F4;&#x63A5;&#x8FD9;&#x6837;&#x5199;&#xFF0C;&#x7136;&#x540E;&#x8986;&#x76D6;&#x6389;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x4F46;&#x5B83;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x597D;&#x5904;&#xFF0C;&#x8FD8;&#x6709;&#x4E0D;&#x4FBF;&#x5229;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8003;&#x8651;&#x7684;&#x8BBE;&#x5907;&#x4E0D;&#x591A;&#x8FD8;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x5F88;&#x591A;&#x6216;&#x8005;&#x4F60;&#x8FFD;&#x6C42;&#x8FBE;&#x5230;&#x67D0;&#x79CD;&#x7279;&#x6B8A;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x6BCF;&#x5C0F;10px&#xFF0C;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x5C31;&#x53D8;&#xFF0C;&#x90A3;&#x4F60;&#x8981;&#x5199;&#x591A;&#x5C11;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x624D;&#x80FD;&#x6EE1;&#x8DB3;&#x5462;&#xFF1F;~</p>
<p>&#x6216;&#x8BB8;&#x6709;&#x4EBA;&#x6CA1;&#x770B;&#x5B8C;&#x5C31;&#x60F3;&#x5FCD;&#x4E0D;&#x4F4F;&#x5728;&#x5FC3;&#x91CC;&#x53D1;&#x51FA;&#x58F0;&#x97F3;&#xFF0C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x7528;jquery mobile&#x4E4B;&#x7C7B;&#x7684;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x554A;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x7528;&#x7BA1;&#x4E86;&#x591A;&#x597D;&#x3002;&#x597D;&#x5427;&#x6211;&#x627F;&#x8BA4;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x5BF9;&#x5B83;&#x4E86;&#x89E3;&#x7684;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x53EA;&#x662F;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x9A8C;&#xFF0C;&#x5B83;&#x7684;&#x786E;&#x4E0D;&#x9700;&#x8981;&#x8BA9;&#x4F60;&#x8003;&#x8651;&#x5E03;&#x5C40;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x8BA9;&#x4F60;&#x5F88;&#x96BE;&#x4E0B;&#x624B;&#x53BB;&#x5957;&#x7528;&#x5B83;&#x4F60;&#x53C8;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;~</p>
<p>&#x6700;&#x540E;&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x53EA;&#x662F;&#x5F88;&#x5C11;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8FD8;&#x6709;&#x6D41;&#x5F0F;&#x5E03;&#x5C40;&#x3001;&#x6839;&#x636E;&#x5185;&#x5BB9;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x6539;&#x53D8;&#x987A;&#x5E8F;&#x7B49;&#x7B49;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x95EE;&#x9898;&#x8FD8;&#x5F88;&#x591A;&#xFF0C;&#x7B49;&#x4F60;&#x53BB;&#x4E0D;&#x65AD;&#x63A2;&#x7D22;&#x5427;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/07/04/新工作一个月，深圳工作一周年记/" itemprop="url">
                  新工作一个月，深圳工作一周年记
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-07-04T00:00:00+08:00" content="2014-07-04">
              2014-07-04
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经历/" itemprop="url" rel="index">
                    <span itemprop="name">经历</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x524D;&#x51E0;&#x5929;&#x9519;&#x8FC7;&#x4E86;&#x6BD5;&#x4E1A;&#x548C;&#x6765;&#x6DF1;&#x5733;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x4ECA;&#x5929;&#x4E00;&#x770B;&#x65F6;&#x95F4;&#xFF0C;&#x6070;&#x662F;&#x5DE5;&#x4F5C;&#x4E00;&#x5468;&#x5E74;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x80FD;&#x518D;&#x9519;&#x8FC7;&#x4E86;~</p>
<p>&#x4E00;&#x5E74;&#x4ECD;&#x662F;&#x804C;&#x573A;&#x65B0;&#x4EBA;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x5E38;&#x5411;&#x522B;&#x4EBA;&#x8FD9;&#x4E48;&#x63CF;&#x8FF0;&#xFF1A;&#x201C;&#x6211;&#x6BD5;&#x4E1A;&#x7684;&#x7B2C;&#x4E8C;&#x5929;&#x4E0B;&#x5348;&#x5C31;&#x6765;&#x5230;&#x4E86;&#x6DF1;&#x5733;&#x201D;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x6211;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x5BF9;&#x5916;&#x9762;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x5BF9;&#x6DF1;&#x5733;&#xFF0C;&#x5BF9;&#x5DE5;&#x4F5C;&#xFF0C;&#x5BF9;&#x6211;&#x70ED;&#x7231;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x662F;&#x591A;&#x4E48;&#x575A;&#x5B9A;&#x548C;&#x671F;&#x5F85;&#x3002;&#x4E0D;&#x77E5;&#x662F;&#x5426;&#x66FE;&#x6709;&#x4EBA;&#x611F;&#x53D7;&#x5230;&#x8FC7;&#xFF0C;&#x5475;&#x5475;&#x3002;</p>
<p>&#x4F9D;&#x7136;&#x8BB0;&#x5F97;&#x90A3;&#x5929;&#x662F;&#x600E;&#x4E48;&#x6765;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x53C8;&#x80CC;&#x53C8;&#x62D6;&#x7684;&#x62FF;&#x7740;&#x4E09;&#x4E2A;&#x91CD;&#x91CD;&#x7684;&#x884C;&#x674E;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x8981;&#x8F6C;&#x4E00;&#x8D9F;&#x706B;&#x8F66;&#xFF0C;&#x884C;&#x674E;&#x91CD;&#x4E0D;&#x91CD;&#x7684;&#x5012;&#x662F;&#x5728;&#x5176;&#x6B21;&#x4E86;&#x3002;&#x6700;&#x62C5;&#x5FC3;&#x7684;&#x662F;&#xFF0C;&#x5305;&#x5343;&#x4E07;&#x522B;&#x88AB;&#x6491;&#x7834;&#x6216;&#x8005;&#x80CC;&#x5305;&#x7684;&#x888B;&#x5B50;&#x5343;&#x4E07;&#x522B;&#x65AD;&#x6389;&#x554A;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x62FF;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x4EC0;&#x4E48;&#x610F;&#x5916;&#xFF0C;&#x90A3;&#x4E5F;&#x7B49;&#x6211;&#x4E0A;&#x4E86;&#x76F4;&#x8FBE;&#x7EC8;&#x70B9;&#x7684;&#x8F66;&#x518D;&#x5230;&#x6765;&#x5427;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x4E00;&#x8FB9;&#x7740;&#x6025;&#x7684;&#x8D76;&#xFF0C;&#x4E00;&#x8FB9;&#x8FD8;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x3002;&#x8FD8;&#x597D;&#x4E00;&#x5207;&#x987A;&#x5229;&#x3002;&#x5230;&#x4E86;&#x6DF1;&#x5733;&#x6765;&#x4E0D;&#x53CA;&#x53BB;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x53BB;&#x901B;&#xFF0C;&#x53BB;&#x73A9;&#x513F;&#xFF0C;&#x5F88;&#x70ED;&#xFF0C;&#x8981;&#x642C;&#x4E1C;&#x897F;&#x5230;&#x79DF;&#x623F;&#x7684;9&#x697C;&#xFF0C;&#x6CA1;&#x6709;&#x7535;&#x68AF;&#xFF0C;&#x8981;&#x6574;&#x7406;&#x623F;&#x95F4;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x51C6;&#x5907;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x8BF4;&#x4E86;&#x6BD5;&#x4E1A;&#x540E;&#x4E0D;&#x518D;&#x627E;&#x5BB6;&#x91CC;&#x8981;&#x94B1;&#xFF0C;&#x867D;&#x7136;&#x4EBA;&#x8BF4;&#x5230;&#x505A;&#x4E0D;&#x5230;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x4E5F;&#x6709;&#x670B;&#x53CB;&#x8BF4;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x627E;&#x5BB6;&#x91CC;&#x8981;&#x70B9;&#x94B1;&#x662F;&#x5E94;&#x8BE5;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x7A33;&#x5B9A;&#x4E86;&#x53EF;&#x4EE5;&#x9760;&#x81EA;&#x5DF1;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x60F3;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x3002;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x5176;&#x5B9E;&#x771F;&#x8C08;&#x4E0D;&#x4E0A;&#x82E6;&#xFF08;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;~&#xFF09;&#xFF0C;&#x6CA1;&#x6709;&#x997F;&#x8FC7;&#x4E00;&#x987F;&#xFF0C;&#x4F46;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x8BF8;&#x591A;&#x4E8B;&#x60C5;&#x4ECD;&#x7136;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x8F7B;&#x677E;&#x7684;&#xFF0C;&#x6211;&#x4E00;&#x4E00;&#x514B;&#x670D;&#x7740;&#xFF0C;&#x4E5F;&#x5E76;&#x6CA1;&#x611F;&#x89C9;&#x591A;&#x7D2F;&#xFF0C;&#x6216;&#x8BB8;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5E74;&#x8F7B;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x4F1A;&#x592A;&#x5728;&#x4E4E;&#xFF0C;&#x518D;&#x8BF4;&#x4E86;&#xFF0C;&#x6211;&#x6765;&#x7684;&#x662F;&#x6DF1;&#x5733;&#xFF0C;&#x90A3;&#x80A1;&#x5174;&#x594B;&#x52B2;&#x513F;&#x4E5F;&#x80FD;&#x652F;&#x6491;&#x6211;&#x597D;&#x4E00;&#x9635;&#x513F;&#x5427;~</p>
<p>&#x6211;&#x66FE;&#x7ECF;&#x53BB;&#x8FC7;&#x5317;&#x4EAC;&#x627E;&#x5B9E;&#x4E60;&#xFF0C;&#x8FD9;&#x6B21;&#x662F;&#x6765;&#x6DF1;&#x5733;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BCF;&#x6B21;&#x627E;&#x5DE5;&#x4F5C;&#x90FD;&#x6CA1;&#x7528;&#x591A;&#x4E45;&#xFF0C;&#x8FD9;&#x6B21;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x5728;&#x6211;&#x5373;&#x5C06;&#x4E0D;&#x62B1;&#x4EC0;&#x4E48;&#x5E0C;&#x671B;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x79F0;&#x5FC3;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x627E;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x4E0A;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x624D;&#x534E;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x5F88;&#x611F;&#x8C22;&#x5B83;&#xFF0C;&#x4E5F;&#x611F;&#x8C22;&#x6625;&#x54E5;&#xFF0C;&#x4E5F;&#x5F88;&#x611F;&#x8C22;&#x5C0F;&#x806A;&#xFF0C;&#x6625;&#x54E5;&#x201C;&#x6536;&#x7559;&#x201D;&#x4E86;&#x6211;&#xFF0C;&#x800C;&#x5C0F;&#x806A;&#xFF0C;&#x5E74;&#x9F84;&#x6BD4;&#x6211;&#x5C0F;&#xFF0C;&#x5374;&#x6210;&#x4E86;&#x6211;&#x7684;&#x4E3B;&#x7BA1;&#xFF0C;&#x7B97;&#x662F;&#x6211;&#x804C;&#x573A;&#x7B2C;&#x4E00;&#x4E2A;&#x5E08;&#x5085;&#x5427;&#x3002;&#x4F9D;&#x7136;&#x6E05;&#x6670;&#x7684;&#x8BB0;&#x5F97;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x5C0F;&#x806A;&#x5728;&#x64CD;&#x4F5C;&#x90A3;&#x5BC6;&#x5BC6;&#x9EBB;&#x9EBB;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#x5019;&#x6211;&#x5934;&#x5927;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x6211;&#x8DDF;&#x4E0D;&#x61C2;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x611F;&#x89C9;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x5FCD;&#x4E0D;&#x4F4F;&#x95EE;&#x4E86;&#x4ED6;&#x4E00;&#x53E5;&#xFF1A;&#x201C;&#x90A3;&#x4E48;&#x591A;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x662F;&#x54EA;&#x4E2A;&#x5440;&#xFF1F;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F30;&#x8BA1;&#x4E5F;&#x53EA;&#x6709;&#x83DC;&#x9E1F;&#x624D;&#x95EE;&#x5F97;&#x51FA;&#x5427;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5C31;&#x662F;&#x6BCF;&#x5929;&#x90FD;&#x8FDB;&#x6B65;&#x7684;&#x8BA9;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5174;&#x594B;&#x662F;&#x540E;&#x8BDD;&#xFF0C;&#x5174;&#x594B;&#x4E4B;&#x524D;&#xFF0C;&#x662F;&#x63A5;&#x8FDE;&#x4E0D;&#x65AD;&#x7684;&#x90C1;&#x95F7;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x6211;&#x6700;&#x5E38;&#x8BF4;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#xFF1A;&#x201D;&#x6211;&#x90FD;&#x60F3;&#x6B7B;&#x201C;&#x3002;&#x8FD9;&#x662F;&#x53E5;&#x73A9;&#x7B11;&#x8BDD;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x80FD;&#x60F3;&#x8C61;&#x5230;&#x6709;&#x591A;&#x90C1;&#x95F7;&#xFF0C;&#x90C1;&#x95F7;&#x5728;&#x4E8E;&#xFF0C;&#x6709;&#x4E9B;&#x4F60;&#x6839;&#x672C;&#x68C0;&#x67E5;&#x4E0D;&#x51FA;&#x6216;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x7684;&#x8D85;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#xFF0C;&#x522B;&#x4EBA;&#x7ED9;&#x4F60;&#x6307;&#x51FA;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x552F;&#x4E00;&#x4F1A;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x7684;&#x667A;&#x5546;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B21;&#x603B;&#x662F;&#x8BA9;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#xFF0C;&#x505A;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x7F51;&#x7AD9;&#x8BB0;&#x4E0D;&#x6E05;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x72EC;&#x7ACB;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x5374;&#x8BB0;&#x5F97;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x867D;&#x7136;&#x90A3;&#x6B21;&#x6211;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9996;&#x9875;&#x5C31;&#x7528;&#x4E86;&#x4E24;&#x5929;&#xFF0C;&#x5475;&#x5475;&#x3002;</p>
<p>&#x624D;&#x534E;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#x6210;&#x957F;&#x662F;&#x5168;&#x65B9;&#x4F4D;&#x7684;&#xFF0C;&#x516C;&#x53F8;&#x521D;&#x521B;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x4E1A;&#x52A1;&#x5F00;&#x5C55;&#x3001;&#x4E1A;&#x52A1;&#x91CF;&#x589E;&#x957F;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x5404;&#x79CD;&#x9500;&#x552E;&#x3001;&#x6C9F;&#x901A;&#x6280;&#x5DE7;&#xFF0C;&#x4EBA;&#x5458;&#x7BA1;&#x7406;&#xFF0C;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#x7B49;&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x3002;&#x53EF;&#x662F;&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x4E2A;&#x4EBA;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x9009;&#x62E9;&#x79BB;&#x53BB;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;&#x6211;&#x4EEC;&#x73A9;&#x513F;&#x8FC7;&#x5F88;&#x591A;&#x6E38;&#x620F;&#xFF0C;&#x5728;&#x5E74;&#x4F1A;&#x821E;&#x53F0;&#x4E0A;&#x8868;&#x6F14;&#x6392;&#x7EC3;&#x4E86;&#x4E24;&#x4E2A;&#x6708;&#x7684;&#x821E;&#x8E48;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x52A0;&#x73ED;&#x5230;&#x8FD1;12&#x70B9;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x53BB;&#x6F02;&#x6D41;&#xFF0C;&#x4E00;&#x8D77;&#x51FA;&#x53BB;&#x5230;&#x666F;&#x70B9;&#x6E38;&#x73A9;&#x3002;&#x3002;&#x3002;&#x5F88;&#x591A;&#x7F8E;&#x597D;&#x8BB0;&#x5FC6;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x7528;&#x8FD9;&#x4E00;&#x5E74;&#x7ECF;&#x5386;&#x6765;&#x5206;&#x4EAB;&#x7ED9;&#x540E;&#x6765;&#x7684;&#x6CA1;&#x7ECF;&#x5386;&#x8FC7;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x4EBA;&#xFF1A;&#x9752;&#x6625;&#x5B9D;&#x8D35;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4E0A;&#x6CA1;&#x4E0A;&#x8FC7;&#x5927;&#x5B66;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x5B66;&#x767D;&#x4E0A;&#x4E86;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x8FC7;&#x53BB;&#x7684;&#x4E8B;&#xFF0C;20&#x5DE6;&#x53F3;&#xFF0C;&#x4EBA;&#x751F;&#x624D;&#x521A;&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x4E0D;&#x665A;&#xFF0C;&#x4F60;&#x9996;&#x5148;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x628A;&#x559C;&#x6B22;&#x7684;&#x53D8;&#x6210;&#x64C5;&#x957F;&#x7684;&#xFF0C;&#x6709;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x5954;&#x7740;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x53BB;&#x52AA;&#x529B;&#xFF0C;&#x4E0D;&#x8981;&#x4EBA;&#x4E91;&#x4EA6;&#x4E91;&#xFF0C;&#x4E0D;&#x8981;&#x76F2;&#x76EE;&#x8DDF;&#x98CE;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x53EA;&#x770B;&#x91CD;&#x773C;&#x524D;&#x5229;&#x76CA;&#x3001;&#x53EA;&#x770B;&#x5230;&#x773C;&#x524D;&#x7684;&#x82E6;&#xFF0C;&#x8981;&#x6709;&#x6240;&#x8FFD;&#x6C42;&#xFF0C;&#x5F53;&#x4F60;&#x633A;&#x4E86;&#x8FC7;&#x6765;&#xFF0C;&#x6709;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x7B11;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8FC7;&#x5F80;&#xFF0C;&#x4E5F;&#x80FD;&#x7B11;&#x5BF9;&#x90A3;&#x4E9B;&#x66FE;&#x8BF4;&#x4F60;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x6709;&#x4E0D;&#x5C11;&#x5E74;&#x8F7B;&#x4EBA;&#x56FE;&#x8F7B;&#x677E;&#xFF0C;&#x56FE;&#x80FD;&#x8D5A;&#x94B1;&#xFF0C;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x6708;&#x4E09;&#x56DB;&#x5343;&#x7684;&#x85AA;&#x6C34;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x5DE5;&#x4F5C;&#x53C8;&#x4E0D;&#x96BE;&#xFF0C;&#x4E00;&#x8FB9;&#x8FD9;&#x4E48;&#x60F3;&#x7740;&#xFF0C;&#x4E00;&#x8FB9;&#x53C8;&#x5728;&#x7A7A;&#x95F2;&#x7684;&#x65F6;&#x5019;&#x8DDF;&#x4EBA;&#x804A;&#x5929;&#x6709;&#x6C14;&#x65E0;&#x529B;&#x7684;&#x8BF4;&#x201D;&#x6211;&#x597D;&#x65E0;&#x804A;&#x554A;&#x201C;&#x201D;&#x80FD;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF0C;&#x8FD8;&#x90A3;&#x6837;&#x5457;&#x201C;&#xFF0C;&#x5F53;&#x4F60;&#x662F;&#x8FD9;&#x6837;&#x63CF;&#x8FF0;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x4E0D;&#x7D2F;&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x80FD;&#x517B;&#x6D3B;&#x81EA;&#x5DF1;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x7684;&#x9752;&#x6625;&#x4F60;&#x6562;&#x4FDD;&#x8BC1;&#x662F;&#x65E0;&#x6094;&#x7684;&#x5417;&#xFF1F;~</p>
<p>&#x5927;&#x56DB;&#x8003;&#x7814;&#x5931;&#x8D25;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x679C;&#x65AD;&#x653E;&#x5F03;&#x4E86;&#x4E8C;&#x6218;&#xFF0C;&#x540C;&#x5B66;&#x548C;&#x5BB6;&#x4EBA;&#x90FD;&#x66FE;&#x95EE;&#x8FC7;&#x6211;&#x751A;&#x81F3;&#x529D;&#x8FC7;&#x6211;&#xFF0C;&#x518D;&#x6765;&#x4E00;&#x5E74;&#x5427;&#xFF0C;&#x6211;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x5F53;&#x521D;&#x9009;&#x62E9;&#x8003;&#x7814;&#x4E00;&#x6837;&#x6CA1;&#x72B9;&#x8C6B;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x90A3;&#x4F55;&#x4E0D;&#x5168;&#x8EAB;&#x5FC3;&#x6295;&#x5165;&#x4E8E;&#x5B83;&#xFF1F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x8003;&#x7814;&#x672C;&#x8EAB;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x60F3;&#x5BF9;&#x4E0D;&#x7BA1;&#x662F;&#x4E00;&#x6218;&#x8FD8;&#x662F;&#x4E8C;&#x6218;&#x6210;&#x529F;&#x7684;&#x540C;&#x5B66;&#x597D;&#x53CB;&#x8BF4;&#xFF0C;&#x4F60;&#x4EEC;&#x4E00;&#x5B9A;&#x8981;&#x52A0;&#x6CB9;&#x597D;&#x597D;&#x5E72;&#xFF0C;&#x53D1;&#x6325;&#x597D;&#x5B83;&#x7684;&#x6700;&#x5927;&#x4EF7;&#x503C;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5BF9;&#x4E8C;&#x6218;&#x4ECD;&#x7136;&#x5931;&#x5229;&#x7684;&#x540C;&#x5B66;&#x8BF4;&#xFF0C;&#x5931;&#x8D25;&#x5E76;&#x4E0D;&#x53EF;&#x6015;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x6765;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;&#x800C;&#x5DF2;&#xFF0C;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E13;&#x6CE8;&#x7684;&#x53BB;&#x505A;&#xFF0C;&#x51E0;&#x5E74;&#x4EE5;&#x540E;&#x6216;&#x8BB8;&#x4F60;&#x5E76;&#x4E0D;&#x4F1A;&#x5BF9;&#x5F53;&#x5E74;&#x7684;&#x843D;&#x699C;&#x611F;&#x5230;&#x9057;&#x61BE;~</p>
<p>&#x65B0;&#x516C;&#x53F8;&#x53EB;inser &#x5F71;&#x81F4;&#x79D1;&#x6280;&#xFF0C;&#x65B0;&#x5DE5;&#x4F5C;&#x662F;&#x505A;&#x5FAE;&#x7535;&#x5F71;app&#x548C;&#x5FAE;&#x7535;&#x5F71;&#x5E73;&#x53F0;&#x7684;&#xFF0C;&#x6211;&#x672C;&#x8EAB;&#x4E5F;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x5FAE;&#x7535;&#x5F71;&#xFF0C;&#x8001;&#x677F;&#x4EBA;&#x5F88;&#x597D;&#xFF0C;&#x540C;&#x4E8B;&#x5F88;&#x5E74;&#x8F7B;&#xFF0C;&#x5BCC;&#x6709;&#x671D;&#x6C14;&#xFF0C;&#x5173;&#x6CE8;&#x524D;&#x6CBF;&#xFF0C;&#x6709;&#x6FC0;&#x60C5;&#x548C;&#x521B;&#x9020;&#x529B;&#x3002;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x4E0D;&#x5C11;&#x56F0;&#x96BE;&#xFF0C;&#x4F46;&#x514B;&#x670D;&#x56F0;&#x96BE;&#x540E;&#x7684;&#x6536;&#x83B7;&#x66F4;&#x8BA9;&#x6211;&#x5174;&#x594B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x2014;&#x2014;&#x524D;&#x7AEF;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x662F;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#xFF0C;&#x6211;&#x5230;&#x5E95;&#x6709;&#x591A;&#x559C;&#x6B22;&#x524D;&#x7AEF;&#x5462;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x559C;&#x6B22;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x524D;&#x7AEF;&#xFF0C;&#x800C;&#x662F;&#x521B;&#x9020;&#x4F18;&#x79C0;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x521B;&#x9020;&#x7F8E;&#x611F;&#xFF0C;&#x7ED9;&#x4EBA;&#x4EEC;&#x63D0;&#x4F9B;&#x7B80;&#x5355;&#x3001;&#x5FEB;&#x6377;&#x3001;&#x5BCC;&#x6709;&#x7F8E;&#x611F;&#x7684;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#x3002;&#x6211;&#x5EFA;&#x4E86;QQ&#x7FA4;&#xFF0C;&#x540D;&#x5B57;&#x53EB;&#x201D;&#x7F8E;&#x662F;&#x7F16;&#x51FA;&#x6765;&#x7684;&#x201C;&#xFF0C;&#x5E76;&#x5728;&#x91CC;&#x9762;&#x5206;&#x4EAB;&#x4E86;&#x6211;&#x641C;&#x96C6;&#x4E00;&#x5E74;&#x591A;&#x7684;&#x597D;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x4E70;&#x4E86;&#x5F88;&#x591A;&#x672C;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x4E66;&#xFF0C;&#x7ED3;&#x8BC6;&#x4E86;&#x5728;&#x6DF1;&#x5733;&#x3001;&#x4E0A;&#x6D77;&#x3001;&#x5317;&#x4EAC;&#x7B49;&#x5730;&#x5DE5;&#x4F5C;&#x7684;&#x884C;&#x4E1A;&#x5927;&#x725B;&#xFF0C;&#x6211;&#x4F1A;&#x53BB;&#x817E;&#x8BAF;&#x542C;&#x8BB2;&#x5EA7;&#x5E76;&#x8BA4;&#x771F;&#x8BB0;&#x7B14;&#x8BB0;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x662F;&#x4E2A;&#x524D;&#x7AEF;&#x83DC;&#x9E1F;&#xFF0C;&#x7EAF;&#x5C4C;&#x4E1D;&#x3002;&#x53EF;&#x90A3;&#x53C8;&#x600E;&#x6837;&#xFF0C;&#x8C01;&#x80FD;&#x4FDD;&#x8BC1;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x4E0D;&#x4F1A;&#x4E0A;&#x6F14;&#x5C4C;&#x4E1D;&#x9006;&#x88AD;&#xFF1F;~</p>
<p>&#x8C28;&#x4EE5;&#x6B64;&#x6587;&#xFF0C;&#x7EAA;&#x5FF5;&#x5DE5;&#x4F5C;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x6DF1;&#x5733;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x6211;&#x4E0D;&#x786E;&#x5B9A;&#x4EE5;&#x540E;&#x4F1A;&#x4E0D;&#x4F1A;&#x6709;&#x201D;&#x4E8C;&#x5468;&#x5E74;&#x201C; &#x3001;&#x201D;&#x4E09;&#x5468;&#x5E74;&#x201C;..&#x4E0D;&#x53BB;&#x7BA1;&#x5B83;&#xFF0C;&#x8D70;&#x597D;&#x811A;&#x4E0B;&#x6BCF;&#x4E00;&#x6B65;&#xFF0C;&#x628A;&#x63E1;&#x81EA;&#x5DF1;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x8981;&#x5BF9;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x5173;&#x5FC3;&#x652F;&#x6301;&#x6211;&#x7684;&#x5BB6;&#x4EBA;&#x3001;&#x670B;&#x53CB;&#x8BF4;&#x58F0;&#x611F;&#x8C22;&#x3002;&#x6211;&#x4F1A;&#x7EE7;&#x7EED;&#x52AA;&#x529B;&#xFF01;~ </p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/07/04/inser工作一月/" itemprop="url">
                  inser工作一月
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-07-04T00:00:00+08:00" content="2014-07-04">
              2014-07-04
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经历/" itemprop="url" rel="index">
                    <span itemprop="name">经历</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x8F9E;&#x53BB;&#x65E7;&#x7684;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x6CA1;&#x60F3;&#x8FC7;&#x518D;&#x6B21;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x521B;&#x4E1A;&#x578B;&#x516C;&#x53F8;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x4EBA;&#x4E0D;&#x60F3;&#x53BB;&#x8FFD;&#x6C42;&#x884C;&#x4E1A;&#x91CC;&#x7684;&#x201C;&#x9AD8;&#x5BCC;&#x5E05;&#x201D;&#x751A;&#x81F3;&#x5DE8;&#x5934;&#xFF0C;&#x60F3;&#x53BB;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x73AF;&#x5883;&#x7ED9;&#x81EA;&#x5DF1;&#x9540;&#x91D1;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x597D;&#x7684;&#x73AF;&#x5883;&#x548C;&#x5F85;&#x9047;&#xFF0C;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x53EA;&#x7ED9;&#x8DB3;&#x591F;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x51C6;&#x5907;&#x7684;&#xFF0C;&#x5F53;&#x4F60;&#x6EE1;&#x6000;&#x4FE1;&#x5FC3;&#x548C;&#x70ED;&#x5FF1;&#x7684;&#x53BB;&#xFF0C;&#x751A;&#x81F3;&#x80CC;&#x540E;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x4E0D;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x52AA;&#x529B;&#x53BB;&#x60F3;&#x4E3A;&#x81EA;&#x5DF1;&#x4E89;&#x53D6;&#x54EA;&#x6015;&#x4E00;&#x70B9;&#x5E0C;&#x671B;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x90FD;&#x8D77;&#x4E0D;&#x4E86;&#x591A;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x516C;&#x53F8;&#x4E0D;&#x662F;&#x6536;&#x517B;&#x6240;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7AD9;&#x5728;&#x8001;&#x677F;&#x6216;&#x8005;HR&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x60F3;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x804C;&#x4F4D;&#x540D;&#x989D;&#x4E5F;&#x662F;&#x6709;&#x9650;&#x800C;&#x4E14;&#x5B9D;&#x8D35;&#x7684;&#xFF0C;&#x7406;&#x5E94;&#x4E0D;&#x5BF9;&#x4EFB;&#x4F55;&#x4E0D;&#x8FBE;&#x8981;&#x6C42;&#x7684;&#x4EBA;&#x624B;&#x8F6F;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x88AB;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x592A;&#x591A;&#x7684;&#x90C1;&#x95F7;&#x548C;&#x62B1;&#x6028;&#xFF0C;&#x90A3;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x4E5F;&#x66FE;&#x6709;&#x670B;&#x53CB;&#x6258;&#x6211;&#x4ECB;&#x7ECD;&#x5DE5;&#x4F5C;&#xFF0C;&#x6700;&#x5E38;&#x542C;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x662F;&#xFF1A;&#x201C;&#x8BA9;&#x6211;&#x53BB;&#x5C31;&#x884C;&#xFF0C;&#x505A;&#x4EC0;&#x4E48;&#x90FD;&#x53EF;&#x4EE5;&#x201D;&#x3002;&#x90A3;&#x4E14;&#x95EE;&#xFF0C;&#x7A76;&#x7ADF;&#x8BA9;&#x4F60;&#x505A;&#x4EC0;&#x4E48;&#x5462;~&#x6CA1;&#x516C;&#x53F8;&#x4F1A;&#x63D0;&#x4F9B;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x6A21;&#x7CCA;&#x7684;&#x804C;&#x4F4D;&#xFF0C;&#x7ED9;&#x201C;&#x505A;&#x4EC0;&#x4E48;&#x90FD;&#x884C;&#x201D;&#x7684;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x8FD8;&#x662F;&#x60F3;&#x597D;&#x4F60;&#x5230;&#x5E95;&#x8981;&#x5E72;&#x561B;&#x5427;~</p>
<p>&#x626F;&#x7684;&#x6709;&#x70B9;&#x8FDC;&#xFF0C;&#x6211;&#x4E4B;&#x6240;&#x4EE5;&#x52A0;&#x5165;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5F85;&#x9047;&#x6709;&#x591A;&#x4E48;&#x7684;&#x597D;&#xFF0C;&#x4E1A;&#x52A1;&#x524D;&#x666F;&#x591A;&#x4E48;&#x7684;&#x597D;&#xFF0C;&#x516C;&#x53F8;&#x591A;&#x6709;&#x5F71;&#x54CD;&#x529B;&#x7B49;&#x7B49;&#x3002;&#x9996;&#x5148;&#x6211;&#x627F;&#x8BA4;&#x7684;&#x786E;&#x662F;&#x770B;&#x4E0A;&#x4E86;&#x5B83;&#x7684;&#x4E1A;&#x52A1;&#x524D;&#x666F;&#xFF0C;&#x4F46;&#x66F4;&#x591A;&#x7684;&#x662F;&#xFF0C;&#x8001;&#x677F;&#x7684;&#x4EF7;&#x503C;&#x89C2;&#x548C;&#x5F00;&#x5C55;&#x4E1A;&#x52A1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x8DDF;&#x4E00;&#x7FA4;&#x5E74;&#x8F7B;&#x7684;&#x3001;&#x6709;&#x5E72;&#x52B2;&#x513F;&#x7684;&#x3001;&#x5BCC;&#x6709;&#x6FC0;&#x60C5;&#x548C;&#x521B;&#x610F;&#x7684;&#x540C;&#x4E8B;&#x4E00;&#x8D77;&#x5171;&#x4E8B;&#xFF0C;&#x8FD9;&#x672C;&#x8EAB;&#x5C31;&#x86EE;&#x6709;&#x5438;&#x5F15;&#x529B;&#x3002;</p>
<p>&#x5DE5;&#x4F5C;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x56F0;&#x96BE;&#x5012;&#x662F;&#x9047;&#x5230;&#x8FC7;&#x4E0D;&#x5C11;&#xFF0C;&#x4F46;&#x6BCF;&#x6B21;&#x56F0;&#x96BE;&#x90FD;&#x662F;&#x63A8;&#x7740;&#x81EA;&#x5DF1;&#x524D;&#x884C;&#x7684;&#x52A9;&#x63A8;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EA;&#x80FD;&#x524D;&#x884C;&#xFF0C;&#x522B;&#x65E0;&#x4ED6;&#x6CD5;&#xFF0C;&#x6BCF;&#x6B21;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#x6216;&#x8005;&#x6218;&#x80DC;&#x4E86;&#x56F0;&#x96BE;&#xFF0C;&#x90FD;&#x6709;&#x4E00;&#x79CD;&#x7531;&#x8877;&#x7684;&#x6B23;&#x6170;&#x548C;&#x9F13;&#x821E;&#xFF0C;&#x5B83;&#x4F1A;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x539F;&#x6765;&#x8FD9;&#x6837;&#x6211;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x6DF1;&#x5965;&#x90A3;&#x4E48;&#x795E;&#x5947;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4F1A;&#x7EE7;&#x7EED;&#x6CBF;&#x7740;&#x8FD9;&#x6761;&#x8DEF;&#x8D70;&#x4E0B;&#x53BB;&#xFF0C;&#x4E0B;&#x4E00;&#x4E2A;&#x8DEF;&#x53E3;&#x5728;&#x4F55;&#x65B9;&#x73B0;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4F46;&#x8FD9;&#x6BB5;&#x8DEF;&#x4E00;&#x5B9A;&#x8981;&#x8D70;&#x7684;&#x6F02;&#x4EAE;&#xFF01;~&#x4E3A;&#x81EA;&#x5DF1;&#xFF0C;&#x4E5F;&#x4E3A;&#x540C;&#x6837;&#x8D70;&#x5728;&#x594B;&#x6597;&#x8DEF;&#x4E0A;&#x7684;&#x4F60;&#xFF0C;&#x52A0;&#x6CB9;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/05/28/五天面试（5.24—5.28）/" itemprop="url">
                  五天面试（5.24—5.28）
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-05-28T00:00:00+08:00" content="2014-05-28">
              2014-05-28
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经历/" itemprop="url" rel="index">
                    <span itemprop="name">经历</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <h2 id="&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;"><a href="#&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;" class="headerlink" title="&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;"></a>&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;</h2><p>&#x4ECE;&#x8F66;&#x516C;&#x5E99;&#x4E0B;&#x8F66;&#xFF0C;&#x6325;&#x6C57;&#x5982;&#x96E8;&#xFF0C;&#x8D70;&#x4E86;&#x4E0D;&#x5C11;&#x5F2F;&#x8DEF;&#xFF0C;&#x5230;&#x4E86;&#x697C;&#x4E0B;&#xFF0C;&#x4E58;&#x7535;&#x68AF;&#x4E0A;&#x53BB;&#xFF0C;&#x626D;&#x5934;&#x4E00;&#x770B;&#x5BF9;&#x9762;&#x662F;&#x730E;&#x8058;&#x7F51;&#xFF0C;&#x7740;&#x5B9E;&#x60CA;&#x8BB6;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x7136;&#x540E;&#x5C31;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;xx&#x603B;&#xFF0C;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x8001;&#x5927;&#x3002;&#x7B11;&#x5BB9;&#x53EF;&#x63AC;&#x7684;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x63D0;&#x95EE;&#x7684;&#x5957;&#x8DEF;&#x4ECE;&#x4E13;&#x4E1A;&#x5230;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF0C;&#x5230;&#x4E3A;&#x4EC0;&#x4E48;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E74;&#x9F84;&#x7B49;&#x7B49;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x95EE;&#x4E86;&#x6280;&#x672F;&#x5458;&#x76F8;&#x5173;&#xFF1A;&#x56FE;&#x7247;&#x5904;&#x7406;&#x3001;&#x524D;&#x7AEF;&#x3001;&#x540E;&#x53F0;&#x3002;&#x5177;&#x4F53;&#x662F;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x4E2D;&#x628A;&#x4E00;&#x4E2A;&#x73BB;&#x7483;&#x7F38;&#x6316;&#x51FA;&#x6765;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x675F;&#x82B1;&#xFF0C;&#x4E0D;&#x52A8;&#x53F6;&#x5B50;&#xFF0C;&#x600E;&#x4E48;&#x628A;&#x82B1;&#x4ECE;&#x7EA2;&#x8272;&#x53D8;&#x6210;&#x53D8;&#x6210;&#x9EC4;&#x8272;&#x3002;&#x3002;&#x3002;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x4E8B;&#x513F;&#x4E48;~&#xFF09;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x70B9;&#x504F;&#x4E86;&#xFF0C;&#x6CA1;&#x7B54;&#x51FA;&#x6765;&#xFF0C;&#x540E;&#x6765;&#x77E5;&#x9053;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x62A0;&#x51FA;&#x6765;&#x6539;&#x989C;&#x8272;&#x7684;&#xFF0C;&#x64E6;&#x3002;&#x3002;&#x3002;&#x518D;&#x7136;&#x540E;&#xFF0C;&#x8C08;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#xFF0C;&#x624D;&#x516D;&#x4E2A;&#x4EBA;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x6708;&#x5DE6;&#x53F3;&#xFF0C;&#x505A;&#x5A5A;&#x5E86;&#x5E73;&#x53F0;&#x7684;&#xFF0C;&#x597D;&#x5427;&#x3002;&#x6280;&#x672F;&#x8FD9;&#x5757;&#x513F;&#x7B97;&#x662F;&#x6CA1;&#x987A;&#x5229;&#x8FC7;&#x5173;&#x3002;&#x63A5;&#x7740;&#x4F83;&#x4F83;&#x800C;&#x8C08;&#x516C;&#x53F8;&#x548C;&#x7F51;&#x7AD9;&#x65B9;&#x9762;&#xFF0C;&#x5012;&#x662F;&#x5F15;&#x8D77;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x597D;&#x611F;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x54E5;&#x8EAB;&#x4E0A;&#x8FD8;&#x7B97;&#x6709;&#x70B9;&#x4EAE;&#x70B9;&#x4E48;&#xFF08;&#x54C8;&#x54C8;&#xFF09;&#x3002;&#x6CA1;&#x62D2;&#x7EDD;&#x4E5F;&#x6CA1;&#x540C;&#x610F;&#xFF0C;&#x5F85;&#x5B9A;&#x3002;</p>
<h2 id="&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;"><a href="#&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;" class="headerlink" title="&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;"></a>&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;</h2><p>&#x8FD9;&#x4E2A;&#xFF0C;&#x5728;&#x79D1;&#x6280;&#x56ED;&#x540C;&#x65B9;&#x4FE1;&#x606F;&#x6E2F;&#x4E09;&#x697C;&#xFF0C;&#x529E;&#x516C;&#x73AF;&#x5883;&#x86EE;&#x597D;&#x3002;&#x56E2;&#x961F;&#x5E74;&#x8F7B;&#x6709;&#x6D3B;&#x529B;&#xFF0C;&#x53EA;&#x4E00;&#x4E2A;&#x4E8B;&#x4E1A;&#x90E8;&#x5C31;60&#x591A;&#x4EBA;&#xFF0C;&#x505A;&#x4E86;&#x4E00;&#x4E0B;&#x8BD5;&#x9898;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x53EF;&#x601C;&#x7684;&#x4E24;&#x9053;css&#x9898;&#xFF0C;&#x5269;&#x4E0B;&#x51E0;&#x4E4E;&#x5168;&#x662F;js&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x9898;html5&#xFF0C;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x516C;&#x53F8;&#x5F88;&#x91CD;&#x89C6;&#x7684;js&#x6211;&#x7ED9;&#x3002;&#x3002;&#x8BF4;&#x591A;&#x4E86;&#x90FD;&#x662F;&#x6CEA;&#x3002;&#x521A;&#x8BE2;&#x95EE;&#x5230;&#x7ED3;&#x679C;&#xFF0C;&#x5E0C;&#x671B;&#x7834;&#x706D;&#x4E86;&#x3002;</p>
<h2 id="&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;"><a href="#&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;" class="headerlink" title="&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;"></a>&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;</h2><p>&#x4F60;&#x6CA1;&#x542C;&#x8FC7;&#x8FD9;&#x540D;&#x5B57;&#x5427;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x542C;&#x8FC7;&#x3002;&#x53EF;&#x662F;&#x5B83;&#x5C31;&#x662F;&#x90A3;&#x6837;&#x7684;&#x5B58;&#x5728;&#x4E8E;&#x79D1;&#x6280;&#x56ED;&#x5A01;&#x65B0;&#x8F6F;&#x4EF6;&#x56ED;1&#x680B;&#xFF0C;&#x4E8C;&#x697C;&#xFF0C;&#x90A3;&#x4E48;&#x9A84;&#x50B2;&#xFF0C;&#x768E;&#x6D01;&#x3001;&#x9AD8;&#x8D35;&#xFF08;&#x6211;&#x600E;&#x4E48;&#x6CA1;&#x53BB;&#x5F53;&#x4F5C;&#x5BB6;&#xFF0C;&#x54C8;&#x54C8;&#xFF09;&#x3002;&#x53BB;&#x5230;&#x524D;&#x53F0;&#x5148;&#x8BA9;&#x6211;&#x586B;&#x8868;&#xFF0C;&#x516C;&#x53F8;&#x4EBA;&#x6765;&#x4EBA;&#x5F80;&#x7684;&#xFF0C;&#x4EBA;&#x4E8B;&#x662F;&#x6211;&#x8001;&#x4E61;&#xFF0C;&#x90A3;&#x4E2A;&#x7A81;&#x7136;&#x4EB2;&#x8FD1;&#x5450;&#xFF0C;&#x804A;&#x4E86;&#x804A;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x6280;&#x672F;&#x6765;&#x4E86;&#xFF0C;&#x4F9D;&#x7136;&#x90A3;&#x4E48;&#x5E74;&#x8F7B;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x597D;&#x50CF;&#x8FD8;&#x633A;&#x5389;&#x5BB3;&#xFF0C;&#x5389;&#x5BB3;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x5462;&#xFF0C;&#x63D0;&#x7684;&#x95EE;&#x9898;&#x6211;&#x6240;&#x7ED9;&#x7684;&#x7B54;&#x6848;&#x597D;&#x50CF;&#x662F;&#x5728;&#x80CC;&#x62DB;&#x8058;&#x5E7F;&#x544A;&#xFF0C;&#x95EE;&#x6211;&#x517C;&#x5BB9;&#x6027;&#x3001;&#x524D;&#x7AEF;&#x9664;&#x4E86;css&#x3001;html&#x3001;js&#x8FD8;&#x9700;&#x8981;&#x638C;&#x63E1;&#x4EC0;&#x4E48;&#xFF0C;&#x95EE;&#x6211;&#x6DFB;&#x52A0;&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;&#x65B9;&#x9762;&#xFF0C;&#xFF0C;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4ED6;&#x4E5F;&#x6CA1;&#x770B;&#x6211;&#x51E0;&#x773C;&#xFF0C;&#x5C31;&#x4E24;&#x9875;&#x7B80;&#x5386;&#x6765;&#x6765;&#x56DE;&#x56DE;&#x7684;&#x7FFB;&#x7740;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8BF4;&#x5B8C;&#x4E86;&#x5C31;&#x8BA9;&#x6211;&#x518D;&#x5750;&#x4E00;&#x4F1A;&#x513F;&#x8BA9;&#x4EBA;&#x4E8B;&#x8FC7;&#x6765;&#x8DDF;&#x6211;&#x804A;&#xFF0C;&#x4EBA;&#x4E8B;&#x8FC7;&#x6765;&#x4E86;&#xFF08;&#x5176;&#x5B9E;&#x6211;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#xFF09;&#x3002;&#x4ED6;&#x5012;&#x662F;&#x663E;&#x5F97;&#x6BD4;&#x6211;&#x8FD8;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x5F88;&#x5927;&#x5EA6;&#xFF08;&#x4E0D;&#x7136;&#x80FD;&#x600E;&#x4E48;&#x6837;&#x3002;&#x3002;&#xFF09;&#x7684;&#x8BF4;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5C31;&#x5F53;&#x662F;&#x4E00;&#x6B21;&#x7ECF;&#x5386;&#xFF0C;&#x5B66;&#x4E60;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x4ED6;&#x5B89;&#x6170;&#x548C;&#x9F13;&#x52B1;&#x4E86;&#x6211;&#x51E0;&#x53E5;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x6F47;&#x6D12;&#x8D70;&#x4E00;&#x56DE;&#x4E86;&#xFF0C;&#x8DDF;&#x7F8E;&#x5973;&#x524D;&#x53F0;&#x9053;&#x4E86;&#x4E2A;&#x522B;&#xFF0C;&#x5979;&#x8FD8;&#x60CA;&#x8BB6;&#x8BF4;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x5FEB;&#xFF0C;&#x54B1;&#x80FD;&#x4E0D;&#x8868;&#x73B0;&#x7684;&#x50CF;&#x88AB;&#x79D2;&#x6740;&#x4E00;&#x6837;&#x5417;&#xFF1F;&#xFF01;~</p>
<h2 id="&#x8C37;&#x7F8E;&#xFF1A;"><a href="#&#x8C37;&#x7F8E;&#xFF1A;" class="headerlink" title="&#x8C37;&#x7F8E;&#xFF1A;"></a>&#x8C37;&#x7F8E;&#xFF1A;</h2><p>&#x8FD9;&#x662F;&#x4E00;&#x5BB6;&#x5916;&#x5305;&#x516C;&#x53F8;&#xFF0C;&#x6765;&#x4E4B;&#x524D;&#x6709;&#x4E9B;&#x72B9;&#x8C6B;&#xFF0C;&#x8981;&#x4E0D;&#x8981;&#x518D;&#x505A;&#x5916;&#x5305;&#x554A;&#xFF0C;&#x53EF;&#x5B83;&#x4EEC;&#x5B98;&#x7F51;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x8C8C;&#x4F3C;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x6211;&#x5C31;&#x53BB;&#x4E86;&#xFF0C;&#x5357;&#x5C71;&#xFF0C;&#x65B0;&#x80FD;&#x6E90;&#x5927;&#x53A6;&#xFF0C;&#x5916;&#x9762;&#x770B;&#x8D77;&#x6765;&#x771F;&#x4E0D;&#x600E;&#x6837;&#xFF0C;&#x91CC;&#x9762;&#x5012;&#x4E5F;&#x8FD8;&#x884C;&#x5427;&#x3002;&#x53BB;&#x5230;&#x633A;&#x987A;&#x5229;&#x89C1;&#x5230;&#x4E86;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x4E00;&#x4E2A;&#x56DB;&#x5341;&#x5C81;&#x4E0A;&#x4E0B;&#x7684;&#x5973;&#x58EB;&#xFF0C;&#x4EBA;&#x5BB6;&#x53EF;&#x662F;&#x6267;&#x884C;&#x603B;&#x76D1;&#xFF0C;&#x53C8;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x5C4B;&#x91CC;&#xFF0C;&#x6BCF;&#x5BB6;&#x516C;&#x53F8;&#x9762;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x662F;&#x5C0F;&#x5C4B;&#x3002;&#x3002;&#x3002;&#x9762;&#x5BF9;&#x9762;&#x5750;&#x4E0B;&#xFF0C;&#x7B80;&#x5386;&#x5949;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x804A;&#x3002;&#x7ECF;&#x8FC7;&#x51E0;&#x6B21;&#x9762;&#x8BD5;&#x540E;&#xFF0C;&#x65E9;&#x5C31;&#x66F4;&#x52A0;&#x7684;&#x8001;&#x7EC3;&#x548C;&#x81EA;&#x7136;&#xFF08;&#x8865;&#x5145;&#x4E00;&#x4E0B;&#xFF0C;&#x4E4B;&#x524D;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#x6210;&#x529F;&#x7684;~&#xFF09;&#xFF0C;&#x5750;&#x4E0B;&#x6325;&#x6D12;&#x7740;&#x6211;&#x7684;&#x201C;&#x624D;&#x534E;&#x201D;&#xFF0C;&#x8DDF;&#x5979;&#x4EA4;&#x6D41;&#x78B0;&#x649E;&#x51FA;&#x633A;&#x591A;&#x7684;&#x706B;&#x82B1;&#xFF0C;&#x8FBE;&#x6210;&#x4E86;&#x82E5;&#x5E72;&#x5171;&#x8BC6;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5979;&#x6BD4;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x66F4;&#x76F8;&#x4FE1;&#x6211;&#x80FD;&#x505A;&#x597D;&#x3002;&#x6211;&#x6CA1;&#x7528;&#x4EC0;&#x4E48;&#x9B54;&#x6CD5;&#x5427;&#xFF0C;&#x8FD9;&#x662F;&#x600E;&#x4E48;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x54C8;&#x54C8;&#xFF01;&#x7136;&#x540E;&#xFF0C;&#x5979;&#x8BA9;&#x6211;&#x770B;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5165;&#x804C;&#x3002;&#x6211;&#x53BB;&#xFF0C;&#x65F6;&#x95F4;&#x4E5F;&#x4E0D;&#x957F;&#x5450;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x88AB;&#x79D2;&#x6740;&#xFF0C;&#x4E00;&#x4E2A;&#x5374;&#x662F;&#x76F4;&#x63A5;&#x664B;&#x7EA7;&#x3002;&#x8FD9;&#x5DEE;&#x8DDD;&#xFF0C;&#x5883;&#x754C;&#x554A;&#xFF0C;&#x683C;&#x5C40;&#x554A;&#xFF01;~&#x597D;&#x5427;&#xFF0C;&#x4E0D;&#x8BF4;&#x90A3;&#x4E48;&#x591A;&#x6D6E;&#x5938;&#x7684;&#x8BDD;&#x4E86;&#x3002;<br>&#x4EE5;&#x4E0A;&#x53EA;&#x662F;&#x8FD1;&#x51E0;&#x5929;&#x9762;&#x8BD5;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x540E;&#x7EED;&#x5982;&#x679C;&#x6709;&#x66F4;&#x7CBE;&#x5F69;&#x7684;&#xFF0C;&#x518D;&#x5949;&#x4E0A;&#x5427;&#xFF01;~</p>
<p>&#x6CE8;&#x660E;&#x4E00;&#x53E5;&#xFF1A;&#x65E0;&#x8BBA;&#x53D7;&#x8FC7;&#x591A;&#x5C11;&#x6253;&#x51FB;&#xFF0C;&#x88AB;&#x8F7B;&#x89C6;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x4F1A;&#x6BCF;&#x5929;&#x884C;&#x8D70;&#x5728;&#x524D;&#x8FDB;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;never stop&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/05/03/“看起来不错”其实挺重要！/" itemprop="url">
                  “看起来不错”其实挺重要！
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-05-03T00:00:00+08:00" content="2014-05-03">
              2014-05-03
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5F88;&#x591A;&#x4E8B;&#x7269;&#x7684;&#x7B2C;&#x4E00;&#x5370;&#x8C61;&#x751A;&#x81F3;&#x51B3;&#x5B9A;&#x6027;&#x5370;&#x8C61;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x89C6;&#x89C9;&#x6765;&#x4F20;&#x9012;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7528;&#x773C;&#x53BB;&#x611F;&#x89C9;&#xFF0C;&#x90A3;&#x4E48;&#x201C;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#x201D;&#x5C31;&#x663E;&#x5F97;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#xFF01;&#x53EF;&#x8FD9;&#x65F6;&#x5E38;&#x88AB;&#x4EBA;&#x5FFD;&#x7565;&#xFF0C;&#x8BA4;&#x4E3A;&#x90A3;&#x4F55;&#x5FC5;&#x5462;&#xFF0C;&#x90FD;&#x662F;&#x8868;&#x9762;&#x529F;&#x592B;&#xFF0C;&#x672C;&#x8D28;&#x597D;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x9519;~</p>
<p>&#x4E00;&#x4E2A;&#x957F;&#x5F97;&#x6F02;&#x4EAE;&#x7684;&#x59D1;&#x5A18;&#xFF0C;&#x662F;&#x4EBA;&#x90FD;&#x60F3;&#x591A;&#x770B;&#x4E00;&#x773C;&#xFF0C;&#x51D1;&#x8FD1;&#x4E9B;&#xFF1B;&#x4F60;&#x53BB;&#x89C1;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#xFF0C;&#x7A7F;&#x7740;&#x4F11;&#x95F2;&#x8DDF;&#x7A7F;&#x7740;&#x6574;&#x9F50;&#x3001;&#x804C;&#x4E1A;&#xFF0C;&#x5B8C;&#x5168;&#x662F;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF1B;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x8D44;&#x6599;&#xFF0C;&#x662F;&#x6574;&#x6574;&#x9F50;&#x9F50;&#xFF0C;&#x5E72;&#x5E72;&#x51C0;&#x51C0;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x968F;&#x4FBF;&#x7684;&#x6392;&#x7248;&#xFF0C;&#x7ED9;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x5DEE;&#x522B;&#x5F88;&#x5927;&#xFF0C;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x4E00;&#x5F20;&#x7EB8;&#x4E0A;&#x9762;&#x5199;&#x6709;&#x5B57;&#x800C;&#x5DF2;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5219;&#x663E;&#x5F97;&#x6B63;&#x89C4;&#x548C;&#x804C;&#x4E1A;&#x5316;&#xFF1B;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x662F;&#x505A;&#x5DE5;&#x7CBE;&#x7EC6;&#x8FD8;&#x662F;&#x7C97;&#x7CD9;&#xFF0C;&#x5B8C;&#x5168;&#x51B3;&#x5B9A;&#x4E86;&#x8BBF;&#x95EE;&#x8005;&#x5BF9;&#x4F60;&#x7F51;&#x7AD9;&#x7684;&#x559C;&#x7231;&#x5EA6;&#x751A;&#x81F3;&#x613F;&#x4E0D;&#x613F;&#x610F;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x9875;&#x9017;&#x7559;&#x3002;</p>
<p>&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x5427;&#xFF0C;&#x5F88;&#x591A;&#x201C;&#x8868;&#x9762;&#x201D;&#x7684;&#x4E1C;&#x897F;&#x5176;&#x5B9E;&#x5C31;&#x51B3;&#x5B9A;&#x4E86;&#x4F60;&#x80FD;&#x5426;&#x6210;&#x529F;&#xFF0C;&#x4E0D;&#x8981;&#x5C0F;&#x770B;&#x5B83;&#x54E6;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/03/23/逃离舒适区(转)/" itemprop="url">
                  逃离舒适区(转)
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-03-23T00:00:00+08:00" content="2014-03-23">
              2014-03-23
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x5F88;&#x65E9;&#x8BFB;&#x7684;&#x9003;&#x79BB;&#x8212;&#x9002;&#x533A;<br>&#x5F88;&#x65E9;&#x5C31;&#x5F00;&#x59CB;&#x8BD5;&#x4E86;</p>
<p>&#x516B;&#x5E74;<br>&#x4E09;&#x5BB6;&#x516C;&#x53F8;</p>
<p>&#x4ECE;UI&#x8BBE;&#x8BA1;&#x5230;&#x7F51;&#x7AD9;&#x8BBE;&#x8BA1;<br>&#x4ECE;&#x7F51;&#x7AD9;&#x8BBE;&#x8BA1;&#x5230;&#x524D;&#x7AEF;<br>&#x4ECE;&#x524D;&#x7AEF;&#x5230;&#x7BA1;&#x7406;<br>&#x4ECE;&#x7BA1;&#x7406;&#x5230;&#x4EA7;&#x54C1;<br>&#x4ECE;&#x4EA7;&#x54C1;&#x5230;&#x9879;&#x76EE;&#x7EC4;<br>&#x4ECE;&#x719F;&#x6089;&#x4E0B;&#x6765;&#x7A33;&#x5B9A;&#x7684;&#x9879;&#x76EE;&#x7EC4;&#x7A7A;&#x964D;&#x5230;&#x964C;&#x751F;&#x7684;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x56E2;&#x961F;</p>
<p>&#x6BCF;&#x5F53;&#x65E5;&#x5B50;&#x597D;&#x8D77;&#x6765;&#xFF0C;&#x8212;&#x8212;&#x670D;&#x670D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5FCD;&#x4E0D;&#x4F4F;&#x6298;&#x817E;<br>&#x6BCF;&#x6B21;&#x90FD;&#x5F02;&#x5E38;&#x8270;&#x8F9B;<br>&#x964D;&#x85AA;&#x8DF3;&#x69FD;<br>&#x964D;&#x804C;&#x8C03;&#x5C97;<br>&#x4ECE;&#x201C;&#x53D1;&#x53F7;&#x65BD;&#x4EE4;&#x201D;&#x5230;&#x201C;&#x6C42;&#x4EBA;&#x529E;&#x4E8B;&#x201D;<br>&#x4ECE;&#x201C;&#x5750;&#x7740;&#x6570;&#x94B1;&#x201D;&#x5230;&#x201C;&#x71AC;&#x591C;&#x7684;&#x5927;&#x82E6;&#x903C;&#x201D;</p>
<p>&#x6CA1;&#x6709;&#x8C01;&#x662F;&#x5929;&#x624D;<br>&#x65E0;&#x975E;&#x5C31;&#x662F;&#x62FC;&#x65F6;&#x95F4;&#x786C;&#x625B;&#x7F62;&#x4E86;<br>&#x625B;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x597D;&#x65E5;&#x5B50;<br>&#x625B;&#x4E0D;&#x4E0B;&#x6765;&#x5C31;&#x6002;&#x903C;&#x4E00;&#x9635;&#x5B50;<br>&#x4E0D;&#x52A0;&#x85AA;<br>&#x7F62;&#x4E86;</p>
<p>&#x518D;&#x590D;&#x76D8;<br>&#x4ECD;&#x4F1A;&#x5982;&#x6B64;<br>&#x8BA4;&#x771F;&#x5BF9;&#x5F85;&#x6BCF;&#x4E00;&#x6B21;&#x9009;&#x62E9;<br>&#x522B;&#x8BA9;&#x81EA;&#x5DF1;&#x592A;&#x8212;&#x670D;</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/03/21/你的位置和你应有的态度（给所有刚开始努力的人）/" itemprop="url">
                  你的位置和你应有的态度（给所有刚开始努力的人）
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-03-21T00:00:00+08:00" content="2014-03-21">
              2014-03-21
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x6700;&#x8FD1;&#x8DDF;&#x540C;&#x4E8B;&#x4E00;&#x8D77;&#x53BB;&#x5065;&#x8EAB;&#xFF0C;&#x7ED3;&#x679C;&#x4E24;&#x4E2A;&#x661F;&#x671F;&#x4E0D;&#x5230;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x540C;&#x4E8B;&#x90FD;&#x6389;&#x961F;&#x4E86;&#xFF0C;&#x7ECF;&#x5E38;&#x53BB;&#x7684;&#x5C31;&#x53EA;&#x6709;&#x6211;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#xFF0C;&#x6700;&#x5E38;&#x53BB;&#x7684;&#x5C31;&#x53EA;&#x6709;&#x6211;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x8BF4;&#xFF0C;&#x4EBA;&#x5C11;&#x4E86;&#x53BB;&#x6CA1;&#x610F;&#x601D;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x3002;&#x6211;&#x53EA;&#x60F3;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x529E;&#x7684;&#x5E74;&#x5361;&#xFF0C;&#x534A;&#x4E2A;&#x6708;&#x90FD;&#x6491;&#x4E0D;&#x5230;&#x5C31;&#x4E0D;&#x53BB;&#x4E86;&#xFF0C;&#x90A3;&#x4E0D;&#x4EC5;&#x4EC5;&#x8BF4;&#x660E;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x61D2;&#xFF0C;&#x4E0D;&#x60F3;&#x53BB;&#x5065;&#x8EAB;&#xFF0C;&#x5176;&#x5B9E;&#x53CD;&#x6620;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;&#x5F85;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x6001;&#x5EA6;&#x548C;&#x98CE;&#x683C;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#x662F;&#x5426;&#x591F;&#x8D1F;&#x8D23;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x51B3;&#x5B9A;&#x4E86;&#x7684;&#x4E1C;&#x897F;&#x591F;&#x4E0D;&#x591F;&#x575A;&#x6301;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#xFF0C;&#x4ECA;&#x5929;&#x6709;&#x4E2A;&#x5065;&#x8EAB;&#x6559;&#x7EC3;&#x624D;&#x8DDF;&#x6211;&#x8BF4;&#xFF0C;&#x521D;&#x671F;&#x9636;&#x6BB5;&#x4E5F;&#x5F97;&#x6709;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#xFF0C;&#x5728;&#x524D;&#x8FDB;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x8FDE;&#x521D;&#x671F;&#x9636;&#x6BB5;&#x8FD8;&#x6CA1;&#x5B8C;&#x6210;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x3002;&#x6211;&#x65E9;&#x5C31;&#x8BF4;&#x8FC7;&#xFF0C;&#x653E;&#x5F03;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x53BB;&#x505A;&#x5C31;&#x662F;&#x4E86;,&#x6267;&#x884C;&#x529B;&#x548C;&#x6BC5;&#x529B;&#x51B3;&#x5B9A;&#x4E86;&#x592A;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x6709;&#x6CA1;&#x6709;&#x7ED3;&#x679C;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x4FDD;&#x6301;&#x4E0B;&#x53BB;&#x8FBE;&#x5230;&#x6700;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x8FBE;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E00;&#x4E24;&#x4EF6;&#x5C0F;&#x4E8B;&#x5C31;&#x80FD;&#x770B;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x65F6;&#x5019;&#x770B;&#x4EBA;&#x5C31;&#x77E5;&#x9053;&#x80FD;&#x4E0D;&#x80FD;&#x6210;&#x4E8B;&#x7684;&#x539F;&#x56E0;&#x5427;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x8FDB;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6001;&#x5EA6;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8DB3;&#x591F;&#x52AA;&#x529B;&#xFF0C;&#x60F3;&#x8981;&#x8FBE;&#x5230;&#x67D0;&#x4E2A;&#x7A0B;&#x5EA6;&#x6216;&#x8005;&#x6C34;&#x5E73;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4EFF;&#x4F5B;&#x6CA1;&#x6709;&#x5728;&#x524D;&#x8FDB;&#xFF0C;&#x95EE;&#x9898;&#x51FA;&#x5728;&#x54EA;&#x513F;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6025;&#x4E8E;&#x6C42;&#x6210;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x4ED8;&#x51FA;&#x8DB3;&#x591F;&#x7684;&#x5B9E;&#x9645;&#x884C;&#x52A8;&#xFF0C;&#x603B;&#x662F;&#x60F3;&#x7684;&#x6BD4;&#x505A;&#x5F97;&#x591A;&#xFF0C;&#x60F3;&#x8C61;&#x91CC;&#x7684;&#x81EA;&#x5DF1;&#x548C;&#x5B9E;&#x9645;&#x7684;&#x81EA;&#x5DF1;&#x6709;&#x5F88;&#x5927;&#x5DEE;&#x8DDD;&#xFF0C;&#x8BB0;&#x4F4F;&#xFF1A;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x5728;&#x60F3;&#x8C61;&#x5F53;&#x4E2D;&#x8BA9;&#x81EA;&#x5DF1;&#x53D8;&#x5F3A;&#xFF0C;&#x4E0D;&#x8981;&#x53BB;&#x5E7B;&#x60F3;&#x5F97;&#x5230;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x4ED8;&#x51FA;&#x53BB;&#x79EF;&#x7D2F;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F60;&#x60F3;&#x6709;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x90A3;&#x5C31;&#x53BB;&#x505A;&#xFF0C;&#x505A;&#x4E86;&#x624D;&#x4F1A;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E86;&#x624D;&#x80FD;&#x8FDB;&#x6B65;&#xFF01;</p>
<p>&#x8FD9;&#x4E24;&#x70B9;&#x770B;&#x4F3C;&#x666E;&#x901A;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x662F;&#x963B;&#x6321;&#x5F88;&#x591A;&#x4EBA;&#x53BB;&#x8DEF;&#x7684;&#x4E24;&#x4E2A;&#x81F4;&#x547D;&#x56E0;&#x7D20;&#xFF0C;&#x4E0E;&#x5927;&#x5BB6;&#x5171;&#x52C9;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/03/20/重复和渐进，让复杂的东西变简单，简单的变神奇！/" itemprop="url">
                  重复和渐进，让复杂的东西变简单，简单的变神奇！
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-03-20T00:00:00+08:00" content="2014-03-20">
              2014-03-20
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x6CA1;&#x6709;&#x54EA;&#x4E00;&#x9879;&#x77E5;&#x8BC6;&#x4E0D;&#x662F;&#x6D69;&#x5982;&#x70DF;&#x6D77;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5B83;&#x7684;&#x8BA4;&#x77E5;&#x4E5F;&#x4F1A;&#x4ECE;&#x964C;&#x751F;&#x719F;&#x6089;&#xFF0C;&#x518D;&#x5230;&#x611F;&#x89C9;&#x5B83;&#x65E0;&#x9650;&#x5927;&#x3002;</p>
<p>&#x53EF;&#x662F;&#x4EC0;&#x4E48;&#x624D;&#x662F;&#x8BA9;&#x5B83;&#x201C;&#x4E3A;&#x6211;&#x6240;&#x7528;&#x201D;&#xFF0C;&#x6563;&#x53D1;&#x5149;&#x8292;&#x7684;&#x65B9;&#x6CD5;&#x5462;&#xFF1F;</p>
<p>&#x91CD;&#x590D;&#x80FD;&#x4F7F;&#x6211;&#x4EEC;&#x6253;&#x7834;&#x539F;&#x6709;&#x601D;&#x7EF4;&#x53BB;&#x660E;&#x767D;&#x4EE5;&#x524D;&#x4ECE;&#x6CA1;&#x63A5;&#x89E6;&#x8FC7;&#x7684;&#x770B;&#x4F3C;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x90A3;&#x53C8;&#x5982;&#x4F55;&#x6E10;&#x8FDB;&#x5462;&#xFF1F;&#x6240;&#x8C13;&#x6E10;&#x8FDB;&#xFF0C;&#x5C31;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x91CD;&#x590D;&#xFF0C;&#x4E0A;&#x5347;&#x5230;&#x4EE5;&#x53D8;&#x5E94;&#x5BF9;&#x53D8;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x53D8;&#x91CF;&#xFF0C;&#x6240;&#x6709;&#x5B66;&#x4E60;&#x7F16;&#x7A0B;&#x6216;&#x8005;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x8BF4;&#x5C0F;&#x5F88;&#x5C0F;&#xFF0C;&#x4F46;&#x662F;&#x8C01;&#x90FD;&#x65E0;&#x6CD5;&#x53BB;&#x5426;&#x8BA4;&#x5B83;&#x5DE8;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x7528;&#x6D3B;&#x4E86;&#x80FD;&#x8D77;&#x5230;&#x5F88;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x53EA;&#x662F;&#x63A7;&#x5236;&#x8BED;&#x53E5;&#xFF0C;&#x51FD;&#x6570;&#xFF0C;&#x65B9;&#x6CD5;&#x4EC0;&#x4E48;&#x7684;&#x624D;&#x5F88;&#x4F1F;&#x5927;&#xFF0C;&#x5F53;&#x4F60;&#x628A;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#x7531;&#x91CD;&#x590D;&#x7684;&#x641E;&#x61C2;&#xFF0C;&#x5230;&#x6E10;&#x8FDB;&#x7684;&#x7075;&#x6D3B;&#xFF0C;&#x624D;&#x662F;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x756A;&#x5883;&#x754C;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4ECE;&#x89C4;&#x5219;&#x5230;&#x4E0D;&#x89C4;&#x5219;&#xFF0C;&#x5904;&#x7406;&#x989C;&#x8272;&#xFF0C;&#x56FE;&#x7247;&#xFF0C;&#x65B9;&#x5F62;&#xFF0C;&#x5230;&#x5706;&#x5F62;&#xFF0C;&#x5230;&#x4E0D;&#x65B9;&#x4E0D;&#x5706;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x8981;&#x7A81;&#x7834;&#x7684;&#xFF0C;&#x603B;&#x662F;&#x8BA9;&#x4F60;&#x5728;&#x89C9;&#x5F97;&#x8FD8;&#x53EF;&#x4EE5;&#x7684;&#x65F6;&#x5019;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4F60;&#x8FD8;&#x6709;&#x4E1C;&#x897F;&#x662F;&#x505A;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#x3002;<br>&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x5C55;&#x73B0;&#x5728;&#x81EA;&#x5DF1;&#x773C;&#x524D;&#x7684;&#x6216;&#x8005;&#x81EA;&#x5DF1;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#x5C31;&#x662F;&#x6240;&#x6709;&#x4E86;&#xFF0C;&#x90A3;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x51B0;&#x5C71;&#x4E00;&#x89D2;&#x3002;</p>
<p>&#x575A;&#x6301;&#x7684;&#x5B66;&#x4E60;&#x548C;&#x7EC3;&#x4E60;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x539F;&#x672C;&#x770B;&#x8D77;&#x6765;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#x4EFB;&#x4F60;&#x8C03;&#x9063;&#xFF0C;&#x53D8;&#x5F97;&#x795E;&#x5947;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    

  </section>

  
  <nav class="pagination">
    <a class="extend prev" rel="prev" href="/page/5/"><i class="fa fa-angle-left"></i></a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/5/">5</a><span class="page-number current">6</span><a class="page-number" href="/page/7/">7</a><a class="extend next" rel="next" href="/page/7/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel  sidebar-panel-active ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
  

  
  

  
  


</body>
</html>
