<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>初谈怎样更好的去规划CSS | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">初谈怎样更好的去规划CSS</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">初谈怎样更好的去规划CSS</h1><div class="post-meta">Aug 16, 2014<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2014/08/16/初谈怎样更好的去规划CSS/" href="/2014/08/16/初谈怎样更好的去规划CSS/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#一、全局的定义、继承"><span class="toc-number">1.</span> <span class="toc-text">一、全局的定义、继承</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#二、可重用css"><span class="toc-number">2.</span> <span class="toc-text">二、可重用css</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#三、模块化"><span class="toc-number">3.</span> <span class="toc-text">三、模块化</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#四、效果实现"><span class="toc-number">4.</span> <span class="toc-text">四、效果实现</span></a></li></ol></div></div><div class="post-content"><p>&#x6211;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x90FD;&#x8C08;&#x4E0D;&#x4E0A;&#x7684;&#x4E0D;&#x5408;&#x683C;&#x7684;&#x524D;&#x7AEF;~&#x4F46;&#x8FD8;&#x7B97;&#x662F;&#x4E2A;&#x6709;&#x70B9;&#x8FFD;&#x6C42;&#x3001;&#x4E0D;&#x65AD;&#x524D;&#x8FDB;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x5408;&#x7406;&#x3001;&#x66F4;&#x9AD8;&#x6548;&#x3001;&#x66F4;&#x4F18;&#x7F8E;&#x3002;&#x4E3A;&#x4E86;&#x7167;&#x987E;&#x4E00;&#x4E0B;&#x57FA;&#x7840;&#x7A0D;&#x5FAE;&#x8584;&#x5F31;&#x4E00;&#x4E9B;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4F1A;&#x4ECE;&#x6D45;&#x5230;&#x6DF1;&#x7684;&#x9010;&#x6B65;&#x53BB;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E8B;&#x513F;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x524D;&#x7AEF;&#x6280;&#x672F;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x8981;&#x4ECE;html&#x3001;css&#x3001;js&#x8FD9;&#x4E48;&#x4E00;&#x6761;&#x7EBF;&#x8D70;&#x8FC7;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x5148;&#x5199;&#x7684;&#x5C31;&#x662F;html&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x7ED3;&#x6784;&#x548C;&#x5185;&#x5BB9;&#xFF0C;&#x7F51;&#x9875;&#x5C31;&#x662F;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#xFF0C;&#x5C31;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x5B83;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF08;css&#xFF09;&#xFF0C;&#x521D;&#x5B66;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x53BB;&#x5199;&#x6574;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x4E2A;&#x80FD;&#x5B9E;&#x73B0;&#x6548;&#x679C;&#x7684;&#x5C0F;&#x4F8B;&#x5B50;&#x53BB;&#x5199;&#xFF0C;&#x6BCF;&#x5F53;&#x8FD9;&#x4E9B;&#x5C0F;&#x4F8B;&#x5B50;&#x4E56;&#x4E56;&#x7684;&#x5448;&#x73B0;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65B0;&#x7AE5;&#x978B;&#x90FD;&#x4F1A;&#x5174;&#x594B;&#x5F02;&#x5E38;&#x662F;&#x5427;~&#x4EC0;&#x4E48;&#x5404;&#x79CD;&#x7C97;&#x4F53;&#x7684;&#xFF0C;&#x659C;&#x4F53;&#x7684;&#xFF0C;&#x5C45;&#x4E2D;&#x7684;&#xFF0C;&#x5927;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x7684;&#xFF0C;&#x6362;&#x884C;&#x7684;&#xFF0C;&#x6C34;&#x5E73;&#x7EBF;&#xFF0C;&#x8DD1;&#x9A6C;&#x706F;&#x7684;&#xFF0C;&#x80CC;&#x666F;&#x97F3;&#x4E50;&#x7684;&#xFF0C;&#x90FD;&#x60F3;&#x53BB;&#x8BD5;&#x8BD5;&#xFF08;&#x5176;&#x5B9E;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;~&#xFF09;&#xFF0C;&#x5230;&#x540E;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x4E0D;&#x597D;&#x662F;&#x5427;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x7ED3;&#x6784;&#x548C;&#x8868;&#x73B0;&#x5206;&#x79BB;&#x7684;&#x539F;&#x5219;&#xFF0C;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x8DDF;&#x7740;&#x67D0;&#x4E9B;&#x521D;&#x7EA7;&#x6559;&#x7A0B;&#x53BB;&#x7C7B;&#x4F3C;&#x7684;&#x8FD9;&#x6837;&#x5199;</p>
<pre><code>&lt;div style=&quot;&quot;;&gt;&lt;/div&gt;
</code></pre><p>&#x8FD9;&#x79CD;&#x53EB;&#x5185;&#x8054;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x9065;&#x8FDC;&#xFF0C;&#x521D;&#x5B66;&#x8005;&#x773C;&#x91CC;&#x7684;&#x5B89;&#x5168;&#x533A;&#x5C31;&#x662F;<title></title>&#x548C;<body></body>,&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5934;&#x90E8;&#x663E;&#x793A;&#x6807;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x5728;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x533A;&#x586B;&#x5145;&#x3002;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x4F3C;&#x4E4E;&#x90FD;&#x4E0D;&#x6562;&#x52A8;&#xFF0C;&#x968F;&#x7740;&#x5B66;&#x4E60;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x4F1A;&#x63A5;&#x89E6;&#x5230;&#x5185;&#x5D4C;&#x5F0F;</p>
<p>&#x5C31;&#x662F;&#x628A;&#x6837;&#x5F0F;&#x8868;&#x6574;&#x4E2A;&#x7528;<style></style>&#x5305;&#x88F9;&#x8D77;&#x6765;&#x653E;&#x5728;<head></head>&#x91CC;&#xFF1A;</p>
<p>&#x8FD9;&#x91CC;&#x5C31;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x5230;&#x201C;&#x4E3A;&#x6807;&#x7B7E;&#x8BBE;&#x7F6E;&#x6837;&#x5F0F;&#x201D;&#x3001;&#x201C;&#x5B9A;&#x4E49;&#x7C7B;&#x201D;&#x3001;&#x201C;&#x5B9A;&#x4E49;ID&#x201D;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E2A;&#x540E;&#x9762;&#x8C08;&#x3002;&#x5B66;&#x5B8C;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E0D;&#x9519;&#x561B;&#xFF0C;&#x6BD4;&#x5185;&#x8054;&#x7684;&#x597D;&#xFF08;&#x4E5F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x9002;&#x5E94;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E5F;&#x90FD;&#x8FD8;&#x4E0D;&#x592A;&#x7B26;&#x5408;&#x5206;&#x79BB;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x4E00;&#x770B;&#x8FD8;&#x6709;&#x5916;&#x8054;&#x7684;&#x3002;&#x3002;&#x3002;&#x989D;&#xFF0C;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4EBA;&#x4E00;&#x822C;&#x4F1A;&#x95EE;&#x4E2A;&#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x5904;&#x662F;&#x5565;&#x554A;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x5916;&#x8054;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x4F60;&#x7528;&#x5728;&#x7F51;&#x9875;&#x91CC;&#x7684;&#x65F6;&#x5019;&#x7528;&#x4E0A;&#x8FD9;&#x4E48;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;</p>
<pre><code>&lt;link type=&quot;text/css&quot; rel=&quot;stylesheet&quot; href=&quot;css&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&quot;/&gt;
</code></pre><p>&#x76F8;&#x540C;&#x7684;&#x6837;&#x5F0F;&#x8868;&#x53EA;&#x8981;&#x5199;&#x4E00;&#x6B21;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x5F53;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E0D;&#x8BBA;&#x5728;&#x7B80;&#x5355;&#x8FD8;&#x662F;&#x590D;&#x6742;&#x7684;&#x7F51;&#x7AD9;&#x4E2D;&#x597D;&#x5904;&#x90FD;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x4E5F;&#x5B9E;&#x73B0;&#x4E86;&#x7ED3;&#x6784;&#x548C;&#x8868;&#x73B0;&#x7684;&#x5B8C;&#x5168;&#x5206;&#x79BB;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E48;&#x4E00;&#x6765;&#x5C31;&#x8981;&#x6CE8;&#x610F;&#x5230;&#x7C7B;&#x6216;&#x8005;id&#x7684;&#x547D;&#x540D;&#x548C;&#x907F;&#x514D;&#x5C42;&#x53E0;&#x8986;&#x76D6;&#x7B49;&#x7B49;&#xFF0C;&#x540E;&#x9762;&#x8BB2;&#x3002;&#x65E2;&#x7136;&#x6709;&#x8FD9;&#x4E48;&#x597D;&#x7684;&#xFF0C;&#x8FD9;&#x4E0B;&#x603B;&#x53EF;&#x4EE5;&#x4E86;&#x5427;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x60F3;&#x7684;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#xFF0C;&#x4F60;&#x61C2;&#x7684;&#xFF0C;&#x4EBA;&#x603B;&#x662F;&#x8981;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x65E0;&#x77E5;&#x4ED8;&#x51FA;&#x4EE3;&#x4EF7;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x5728;&#x6837;&#x5F0F;&#x8868;&#x4E2D;&#x5F15;&#x5165;&#x5916;&#x90E8;&#x6837;&#x5F0F;&#x6587;&#x4EF6;@import&#xFF0C;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x5982;&#xFF1A;</p>
<pre><code>&lt;style&gt;@import url(&apos;a.css&apos;);&lt;/style&gt;
</code></pre><p>&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5F15;&#x5165;&#x6837;&#x5F0F;&#x8868;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x8DDF;link&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E13;&#x4E3A;css&#x800C;&#x751F;&#xFF0C;link&#x5374;&#x80FD;&#x505A;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#xFF0C;&#x968F;&#x4FBF;&#x8BF7;&#x4E00;&#x4E2A;&#x9AD8;&#x624B;&#x90FD;&#x80FD;&#x8BF4;&#x51FA;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E9B;&#x4E0D;&#x5229;&#xFF0C;&#x6BD4;&#x5982;&#x5FC5;&#x987B;&#x5199;&#x5728;&#x6240;&#x6709;&#x6837;&#x5F0F;&#x4E0A;&#x9762;&#xFF0C;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x6162;&#xFF0C;js&#x7684;dom&#x64CD;&#x4F5C;&#x4E0D;&#x4E86;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x603B;&#x4E4B;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x4E0D;&#x591A;&#xFF0C;&#x5728;&#x6B64;&#x5148;&#x4E0D;&#x8BE6;&#x8FF0;&#x3002;</p>
<p>&#x987A;&#x5E26;&#x8BF4;&#x4E00;&#x4E0B;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4E8B;&#x513F;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5B9A;&#x4E49;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x5B83;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#x6837;&#x5F0F;&#x4F18;&#x5148;&#x7279;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x8DDD;&#x79BB;&#x6700;&#x8FD1;&#x7684;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5185;&#x5D4C;&#x5927;&#x4E8E;&#x5916;&#x8054;&#xFF0C;&#x5185;&#x8054;&#x5927;&#x4E8E;&#x5916;&#x5D4C;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x53EA;&#x662F;&#x4EE5;&#x7A0B;&#x5E8F;&#x4F5C;&#x8005;&#x6240;&#x5199;&#x6837;&#x5F0F;&#x8303;&#x56F4;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x7F6E;&#x548C;&#x4EE3;&#x7406;&#x3001;&#x9ED8;&#x8BA4;&#x6837;&#x5F0F;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#x3002;&#x7279;&#x6B8A;&#x6027;&#x5219;&#x53E6;&#x5F53;&#x522B;&#x8BBA;&#xFF0C;&#x600E;&#x6837;&#x53BB;&#x589E;&#x52A0;&#x7279;&#x6B8A;&#x6027;&#x5462;&#xFF0C;&#x6BD4;&#x5982;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x662F;&#x6307;&#x5B9A;&#x4E86;&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#x540C;&#x7C7B;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4F60;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x4E86;&#x201C;&#x7C7B;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x89C4;&#x5219;&#x5C31;&#x53EA;&#x5BF9;&#x8FD9;&#x4E00;&#x4E2A;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x5B9A;&#x4E49;&#x201C;id&#x201D;&#x540C;&#x6837;&#xFF0C;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x540C;&#x6837;&#x540D;&#x79F0;&#x7684;&#x201C;id&#x201D;&#x53EA;&#x80FD;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#xFF0C;&#x7C7B;&#x53EF;&#x4EE5;&#x591A;&#x5904;&#x51FA;&#x73B0;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x5355;&#x4E00;&#x5B9A;&#x4E49;&#xFF0C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E5F;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5B9A;&#x4E49;&#x7C7B;&#x548C;&#x201C;id&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x6807;&#x7B7E;&#x4E5F;&#x597D;&#xFF0C;&#x7C7B;&#x4E5F;&#x597D;&#xFF0C;&#x201C;id&#x201D;&#x4E5F;&#x597D;&#xFF0C;&#x90FD;&#x662F;&#x6211;&#x4EEC;&#x5BF9;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x9644;&#x52A0;&#x6837;&#x5F0F;&#x80FD;&#x7528;&#x5230;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x7279;&#x70B9;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x540C;&#x4E5F;&#x662F;&#x4E3A;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x6837;&#x5F0F;&#x63D0;&#x4F9B;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x4E00;&#x5C42;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x80FD;&#x8FD0;&#x7528;&#x5305;&#x542B;&#x5173;&#x7CFB;&#x53BB;&#x591A;&#x5C42;&#x8BBE;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5728;&#x5B9A;&#x4E49;&#x4E86;&#x6807;&#x7B7E;&#x548C;&#x7C7B;&#x4E4B;&#x540E;&#x53BB;&#x589E;&#x52A0;&#x7279;&#x6B8A;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD5;&#x7ADF;&#x8303;&#x56F4;&#x8D8A;&#x5C0F;&#x8D8A;&#x6709;&#x9488;&#x5BF9;&#x6027;&#xFF0C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x4E14;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#x3002;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x4F2A;&#x7C7B;&#xFF0C;&#x5B50;&#x8282;&#x70B9;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5144;&#x5F1F;&#x8282;&#x70B9;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5C5E;&#x6027;&#x9009;&#x62E9;&#x5668;&#xFF0C;css3&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x4E30;&#x5BCC;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x90FD;&#x8FD8;&#x6CA1;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x9EBB;&#x70E6;&#xFF0C;&#x4F60;&#x8981;&#x660E;&#x767D;&#x4E00;&#x70B9;&#xFF0C;&#x5B9A;&#x90A3;&#x4E9B;&#x6807;&#x51C6;&#x7684;&#x4EBA;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x53BB;&#x627E;&#x9EBB;&#x70E6;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7279;&#x6B8A;&#x7684;&#x9009;&#x62E9;&#x5668;&#x53EA;&#x4F1A;&#x7ED9;&#x4F60;&#x5E26;&#x53BB;&#x4FBF;&#x5229;&#x3002;&#x53EA;&#x6709;&#x628A;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5229;&#x7528;&#x597D;&#x5404;&#x81EA;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5DE7;&#x5999;&#x7684;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x5199;&#x51FA;&#x66F4;&#x7CBE;&#x7B80;&#xFF0C;&#x9AD8;&#x6548;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x5230;&#x5904;&#x7684;&#x5B9A;&#x4E49;&#x7C7B;&#xFF0C;&#x6216;&#x8005;&#x591A;&#x5C42;&#x5D4C;&#x5957;&#x7684;&#x53BB;&#x5B9A;&#x4E49;&#x540E;&#x4EE3;&#x6837;&#x5F0F;&#x3002;&#x6709;&#x4E9B;&#x4E66;&#x7C4D;&#x4F1A;&#x53BB;&#x6839;&#x636E;&#x6807;&#x7B7E;&#xFF0C;id&#xFF0C;&#x7C7B;&#x8FD9;&#x4E9B;&#x53BB;&#x89E3;&#x91CA;&#x6743;&#x91CD;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E14;&#x6559;&#x4F60;&#x600E;&#x4E48;&#x8BA1;&#x7B97;&#x6743;&#x91CD;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x7ED5;&#x6765;&#x7ED5;&#x53BB;&#x4E5F;&#x7ED5;&#x4E0D;&#x660E;&#x767D;&#xFF0C;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x4E5F;&#x4E0D;&#x7528;&#x53BB;&#x6B7B;&#x8BB0;&#xFF0C;&#x53BB;&#x8BA1;&#x7B97;&#xFF0C;&#x591A;&#x5B9E;&#x8DF5;&#xFF0C;&#x6709;&#x4E86;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x6240;&#x7406;&#x89E3;&#x7684;&#x548C;&#x638C;&#x63E1;&#x7684;&#x5176;&#x5B9E;&#x548C;&#x6309;&#x7167;&#x6743;&#x91CD;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EA;&#x662F;&#x51FA;&#x4E8E;&#x5355;&#x7EAF;&#x7684;css&#x65B9;&#x6CD5;&#x65B9;&#x9762;&#x8003;&#x8651;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x6765;&#x8BF4;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x53BB;&#x89C4;&#x5212;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x51E0;&#x70B9;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x4F60;&#x4ED4;&#x7EC6;&#x7684;&#x5BF9;&#x8BBE;&#x8BA1;&#x7A3F;&#x548C;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;&#x4EE5;&#x53CA;&#x4EA4;&#x4E92;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x51ED;&#x7A7A;&#x8003;&#x8651;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;"><a href="#&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;" class="headerlink" title="&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;"></a>&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;</h2><p>&#x8FD9;&#x662F;&#x4F18;&#x5316;css&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x6B65;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x4F60;&#x7701;&#x53BB;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4F60;&#x53BB;&#x4ED4;&#x7EC6;&#x7684;&#x770B;&#xFF0C;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x5177;&#x6709;&#x5171;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x5171;&#x6027;&#x7684;&#x8303;&#x56F4;&#x662F;&#x591A;&#x5927;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x5B9A;&#x4E49;&#xFF0C;&#x591A;&#x5904;&#x751F;&#x6548;&#x3002;&#x8FD8;&#x8981;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x662F;&#x53EF;&#x4EE5;&#x7EE7;&#x627F;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5B57;&#x4F53;&#x7C7B;&#x578B;&#x3001;&#x5927;&#x5C0F;&#x3001;&#x989C;&#x8272;&#xFF08;&#x6709;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x7684;&#x9664;&#x5916;&#xFF0C;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x53E6;&#x5916;&#x5B9A;&#x4E49;&#x53BB;&#x8986;&#x76D6;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x5F80;&#x5F80;&#x5DF2;&#x7ECF;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x9875;&#x9762;&#x5185;&#x8FD9;&#x7C7B;&#x7684;&#x6837;&#x5F0F;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x591A;&#x79CD;&#xFF0C;&#x9664;&#x975E;&#x8BBE;&#x8BA1;&#x5E08;&#x90A3;&#x5565;&#x4E86;~</p>
<h2 id="&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css"><a href="#&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css" class="headerlink" title="&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css"></a>&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css</h2><p>&#x4E0A;&#x9762;&#x4E24;&#x70B9;&#x63D0;&#x5230;&#x7684;&#x662F;&#x9488;&#x5BF9;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x91CC;&#x9762;&#x53EF;&#x4EE5;&#x600E;&#x6837;&#x53BB;&#x6784;&#x601D;&#x4F18;&#x5316;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x53C8;&#x591A;&#x4E9B;&#x8003;&#x8651;&#x4E86;&#xFF0C;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x91CD;&#x7528;&#x5462;&#xFF1F;&#x8FD8;&#x771F;&#x6709;&#x4E0D;&#x5C11;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5C45;&#x4E2D;&#x3001;&#x6D6E;&#x52A8;&#x3001;&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x3001;&#x6E05;&#x9664;&#x9ED8;&#x8BA4;&#x6837;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x66F4;&#x7EC6;&#x81F4;&#x4E00;&#x4E9B;&#x7684;&#x8BDD;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5230;&#x5B57;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x5143;&#x7D20;&#x7684;&#x663E;&#x793A;&#x6216;&#x9690;&#x85CF;&#xFF0C;&#x4E00;&#x6BB5;&#x56FA;&#x5B9A;&#x9AD8;&#x5EA6;&#x7684;&#x7A7A;&#x767D;&#x7B49;&#x7B49;&#xFF0C;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x7EC6;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5728;&#x6837;&#x5F0F;&#x7684;&#x5B9A;&#x4E49;&#x91CC;&#x591A;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x7684;&#x8BBE;&#x7F6E;&#x6216;&#x8BB8;&#x4F1A;&#x6BD4;&#x5728;&#x6807;&#x7B7E;&#x4E0A;&#x591A;&#x52A0;&#x4E00;&#x4E2A;&#x7C7B;&#x66F4;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x4E0A;&#x9762;&#x6709;&#x56DB;&#x4E94;&#x4E2A;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x7684;&#x7C7B;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x662F;&#x53D7;&#x4E0D;&#x4E86;&#x7684;~<br>&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x8FD8;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x4F60;&#x4E0D;&#x7528;&#x518D;&#x6BCF;&#x6B21;&#x5199;&#x6837;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x53BB;&#x5B9A;&#x4E49;body&#x3001;&#x4E00;&#x5806;hx&#x3001;ul&#x3001;ol&#x6B64;&#x7C7B;&#x7684;&#x4E1C;&#x4E1C;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x4E8B;&#x5148;&#x5199;&#x597D;&#x7684;&#x6837;&#x5F0F;&#x8868;&#x5373;&#x53EF;&#x3002;&#x9700;&#x8981;&#x5C45;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x4F60;&#x770B;&#x60C5;&#x51B5;&#x662F;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x8FD8;&#x662F;&#x52A0;&#x4E0A;&#x4E8B;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x7C7B;&#xFF0C;&#x53EA;&#x5B9A;&#x4E49;&#x5BBD;&#x5EA6;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x7B80;&#x6D01;&#x548C;&#x7F16;&#x5199;&#x6548;&#x7387;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x54EA;&#x79CD;&#x6BD4;&#x8F83;&#x597D;&#x5C31;&#x9009;&#x54EA;&#x79CD;&#x3002;<br>&#x6211;&#x73B0;&#x5728;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x7684;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x91CD;&#x7F6E;css&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x4E2A;&#x516C;&#x5171;css&#x6587;&#x4EF6;&#xFF0C;&#x52A0;&#x4E00;&#x4E2A;&#x7AD9;&#x70B9;css&#x6587;&#x4EF6;&#xFF0C;&#x81F3;&#x4E8E;&#x5F88;&#x591A;&#x4EBA;&#x91C7;&#x7528;&#x8FC7;&#x7684;&#x7279;&#x6B8A;&#x529F;&#x80FD;&#x6216;&#x8005;&#x7248;&#x5757;&#x513F;&#x5355;&#x72EC;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x53BB;&#x91C7;&#x7528;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4E0D;&#x597D;&#xFF0C;&#x6216;&#x8BB8;&#x5F53;&#x6211;&#x89C9;&#x5F97;&#x6709;&#x5FC5;&#x8981;&#x6216;&#x8005;&#x6709;&#x597D;&#x5904;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x4F1A;&#x91C7;&#x7528;&#x3002;<br>&#x53E6;&#x5916;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x63D0;&#x9192;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x591A;&#x4F59;&#x7684;&#x63D0;&#x9192;&#xFF0C;&#x53EF;&#x91CD;&#x7528;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x5B8C;&#x5168;&#x7684;&#x7167;&#x642C;&#x8FC7;&#x6765;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9879;&#x76EE;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5220;&#x51CF;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x6539;&#xFF0C;&#x91CD;&#x7528;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4EFD;&#xFF0C;&#x7528;&#x5230;&#x9879;&#x76EE;&#x91CC;&#x7684;&#x65F6;&#x5019;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x6839;&#x636E;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x5373;&#x53EF;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;"><a href="#&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;" class="headerlink" title="&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;"></a>&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;</h2><p>&#x521A;&#x521A;&#x5B66;&#x4F1A;&#x5199;css&#x4EBA;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E2A;&#x4E0D;&#x5927;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x5427;&#xFF0C;&#x600E;&#x4E48;&#x5F62;&#x5BB9;&#x5462;&#xFF0C;&#x601D;&#x7EF4;&#x50CF;&#x8131;&#x7F30;&#x7684;&#x91CE;&#x9A6C;&#xFF1F;&#x8FD8;&#x662F;&#x8352;&#x91CE;&#x6E38;&#x9B42;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x53CD;&#x6B63;&#x5C31;&#x662F;&#x60F3;&#x5230;&#x54EA;&#x513F;&#x5199;&#x5230;&#x54EA;&#x513F;&#xFF0C;&#x5199;&#x7740;&#x5199;&#x7740;&#x89C9;&#x5F97;&#x4E0D;&#x5BF9;&#x4E86;&#xFF0C;&#x518D;&#x56DE;&#x5934;&#x6539;&#xFF0C;&#x89C9;&#x5F97;&#x7F3A;&#x70B9;&#x4EC0;&#x4E48;&#x518D;&#x5F80;&#x4E0A;&#x52A0;&#xFF0C;&#x7B49;&#x7B49;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x7F3A;&#x5C11;&#x4E8B;&#x5148;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x6CA1;&#x6709;&#x5148;&#x52A8;&#x8111;&#x540E;&#x52A8;&#x624B;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x91CC;&#x9762;&#x6709;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x53BB;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#x4E0D;&#x4EC5;&#x4EC5;&#x80FD;&#x4F7F;&#x5185;&#x5BB9;&#x66F4;&#x7ED3;&#x6784;&#x5316;&#x3001;&#x5177;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x66F4;&#x662F;&#x4E3A;&#x4E86;&#x4E4B;&#x540E;&#x5B9A;&#x4E49;css&#x6216;&#x8005;&#x540E;&#x671F;&#x505A;&#x4FEE;&#x6539;&#x7684;&#x65F6;&#x5019;&#x53BB;&#x67E5;&#x627E;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x5927;&#x4FBF;&#x5229;&#xFF0C;&#x4E5F;&#x7275;&#x626F;&#x5230;&#x4E86;&#x547D;&#x540D;&#x7684;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x4E0D;&#x540C;&#x800C;&#x968F;&#x610F;&#x547D;&#x540D;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x65B0;&#x95FB;&#xFF0C;&#x547D;&#x540D;&#x4E2A;&#x201C;xw&#x201D;&#xFF0C;&#x4F60;&#x5F53;&#x65F6;&#x5012;&#x662F;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4F60;&#x8FD8;&#x77E5;&#x9053;&#x4E48;&#xFF0C;&#x522B;&#x4EBA;&#x770B;&#x7684;&#x65F6;&#x5019;&#x77E5;&#x9053;&#x4E48;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5728;&#x6CA1;&#x5F62;&#x6210;&#x4E60;&#x60EF;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x5728;&#x4E1A;&#x754C;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x5E76;&#x666E;&#x904D;&#x8FD0;&#x7528;&#x4E4B;&#x524D;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x53BB;&#x7528;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;"><a href="#&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;" class="headerlink" title="&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;"></a>&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;</h2><p>&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x6709;&#x591A;&#x5904;&#x7684;&#x9634;&#x5F71;&#xFF0C;&#x6216;&#x8005;&#x591A;&#x5904;&#x7684;&#x906E;&#x7F69;&#x5C42;&#xFF0C;&#x5B83;&#x4EEC;&#x4EC5;&#x4EC5;&#x662F;&#x5B58;&#x5728;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5BB9;&#x91CC;&#xFF0C;&#x6548;&#x679C;&#x548C;&#x5B9A;&#x4F4D;&#x65B9;&#x5F0F;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x5927;&#x5C0F;&#x5C3A;&#x5BF8;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x9700;&#x8981;&#x987E;&#x53CA;&#x591A;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x5B9A;&#x4E49;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x5E26;&#x7740;&#x5404;&#x79CD;&#x524D;&#x7F00;&#x7684;&#x4E00;&#x5927;&#x5768;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F55;&#x4E0D;&#x53EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#x5462;&#xFF0C;&#x6211;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x6548;&#x679C;&#x7C7B;&#x201D;&#xFF0C;&#x628A;&#x5B9A;&#x4F4D;&#x65B9;&#x5F0F;&#xFF0C;&#x6548;&#x679C;&#x5B9E;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x5199;&#x597D;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x54EA;&#x91CC;&#x9700;&#x8981;&#xFF0C;&#x5C31;&#x5728;&#x90A3;&#x91CC;&#x52A0;&#x4E0A;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x53E6;&#x5916;&#x518D;&#x5229;&#x7528;&#x7279;&#x6B8A;&#x6027;&#x53BB;&#x9009;&#x62E9;&#x5B83;&#xFF0C;&#x5B9A;&#x4E49;&#x4E13;&#x6709;&#x5C3A;&#x5BF8;&#x6216;&#x8005;&#x4F4D;&#x7F6E;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x4E8E;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x91CC;&#x9762;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x53C2;&#xFF0C;&#x5475;&#x5475;&#x3002;&#x60F3;&#x61D2;&#x7701;&#x52B2;&#x513F;&#x5C31;&#x591A;&#x52A8;&#x52A8;&#x8111;&#x5427;&#xFF01;~</p>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x65B9;&#x9762;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x8D44;&#x6599;&#x63A8;&#x8350;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x9B3C;&#x54E5;&#x5199;&#x7684;<a href="http://blog.cssforest.org/2014/07/01/%E9%A1%B5%E9%9D%A2%E9%87%8D%E6%9E%84%E4%B8%AD%E7%9A%84%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F.html" target="_blank" rel="external">&#x300A;&#x9875;&#x9762;&#x91CD;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x300B;</a></p>
<p>&#x4EE5;&#x4E0A;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x5728;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4F53;&#x4F1A;&#x603B;&#x7ED3;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF0C;&#x53EA;&#x6D89;&#x53CA;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#xFF0C;&#x5BF9;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x4E9B;&#x7528;&#x5904;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x522B;&#x7684;&#x5730;&#x65B9;&#x53EF;&#x80FD;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x501F;&#x9274;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x6211;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x4E4B;&#x5904;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6211;&#x7ED3;&#x5408;&#x4E86;&#x4E00;&#x4E9B;&#x522B;&#x4EBA;&#x95EE;&#x8FC7;&#x6211;&#x7684;&#x95EE;&#x9898;&#x548C;&#x81EA;&#x5DF1;&#x9047;&#x5230;&#x8FC7;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x6559;&#x8BAD;&#x7B49;&#x628A;&#x4ECE;&#x521D;&#x63A5;&#x89E6;&#x5199;&#x7F51;&#x9875;&#x7684;&#x804C;&#x573A;&#x65B0;&#x4EBA;&#x5230;&#x5177;&#x5907;&#x4E86;&#x4E00;&#x5B9A;css&#x57FA;&#x7840;&#x7684;&#x4EBA;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8F83;&#x5B8C;&#x6574;&#x7684;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#x5427;&#xFF0C;&#x6BD4;&#x8F83;&#x6709;&#x987A;&#x5E8F;&#x548C;&#x903B;&#x8F91;&#x7684;&#x53BB;&#x770B;&#xFF0C;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x591A;&#x54E6;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#xFF0C;&#x5148;&#x5199;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;&#xFF0C;&#x4EE5;&#x540E;&#x6709;&#x65B0;&#x7684;&#x6536;&#x83B7;&#x6216;&#x8005;&#x89C9;&#x5F97;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x6709;&#x4E0D;&#x8DB3;&#x7684;&#x5730;&#x65B9;&#x6211;&#x4F1A;&#x518D;&#x5199;&#x4E00;&#x7BC7;&#x52A0;&#x4EE5;&#x4FEE;&#x6B63;&#x8865;&#x5145;&#xFF01;~</p>
</div><a data-url="http://yoursite.com/2014/08/16/初谈怎样更好的去规划CSS/" data-id="cj7d5p5a80014vrqivmyeorg3" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2014/08/30/need-practice/" class="pre">万丈高楼平地起——实践为王，应需而生</a><a href="/2014/08/09/再谈移动页面之移动开发方面新的小收获/" class="next">再谈移动页面之移动开发方面新的小收获</a></div><div data-thread-key="2014/08/16/初谈怎样更好的去规划CSS/" data-title="初谈怎样更好的去规划CSS" data-url="http://yoursite.com/2014/08/16/初谈怎样更好的去规划CSS/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2014/08/16/初谈怎样更好的去规划CSS/" data-title="初谈怎样更好的去规划CSS" data-url="http://yoursite.com/2014/08/16/初谈怎样更好的去规划CSS/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/成长，经历，思考/" style="font-size: 15px;">成长，经历，思考</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2017/09/09/f2er-club-new-guide/">新版前端导航前瞻</a></li><li class="post-list-item"><a class="post-list-link" href="/2017/08/17/tencent_two/">每个人都在跟自己赛跑——我的鹅厂两年记</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/12/18/css_conf_2016/">第三届CSS中国开发者大会纪实</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/11/28/ui_developer/">明白了这些，你不仅仅能成长为优秀的UI工程师</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/21/javascript-study-six/">征服javascript学习笔记（六）——面向对象的程序设计之创建对象</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/17/tencent_oneyear/">总有一个地方，我们未曾到达——我的鹅厂周年记</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/15/readbook_seetheworld/">静静的打开一本书，你会看到新的世界</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>