<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>浅析line-height和vertical | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">浅析line-height和vertical</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">浅析line-height和vertical</h1><div class="post-meta">Jun 19, 2015<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2015/06/19/front-home-lineheight-and-vertical/" href="/2015/06/19/front-home-lineheight-and-vertical/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div></div></div><div class="post-content"><p>line-height</p>
<p>&#x901A;&#x5E38;&#x88AB;&#x6211;&#x4EEC;&#x7528;&#x6765;&#x5E72;&#x561B;&#x5462;&#xFF1F;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;height&#xFF1A;<em>px;line-height:</em>px;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4E48;&#xFF1F;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x7528;&#x5B83;&#x6765;&#x5BF9;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x5C45;&#x4E2D;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x5C45;&#x4E2D;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x884C;&#x9AD8;&#x662F;&#x5143;&#x7D20;&#x57FA;&#x7EBF;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x884C;&#x9AD8;&#x4F1A;&#x51CF;&#x53BB;&#x5B57;&#x4F53;&#x7684;&#x9AD8;&#x5EA6;&#x7136;&#x540E;&#x4E0A;&#x4E0B;&#x5E73;&#x5206;&#x53BB;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x884C;&#x5185;&#x6846;&#xFF08;inline box&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x9AD8;&#x5EA6;&#x548C;&#x884C;&#x9AD8;&#x4E00;&#x81F4;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x4F53;&#x73B0;&#x4E3A;&#x5C45;&#x4E2D;&#x3002;&#x90A3;&#x4E48;&#x5B83;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x7814;&#x7A76;&#x4E4B;&#x5904;&#x5462;&#xFF1F;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;&#x6709;&#x65F6;&#x5019;&#x8BBE;&#x7F6E;&#x4E86;line-height&#x5374;&#x4ECD;&#x7136;&#x4E0D;&#x80FD;&#x5C06;&#x5185;&#x5BB9;&#x5C45;&#x4E2D;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x8BBE;&#x7F6E;&#x4E86;vertical-align&#xFF1A;middle;&#x6CA1;&#x7528;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x5148;&#x6765;&#x6982;&#x89C8;&#x4E00;&#x4E0B;&#xFF1A;line-height</p>
<p>&#x5728;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#xFF0C;&#x5C06;line-height&#x5C5E;&#x6027;&#x6307;&#x5B9A;&#x7684;&#x7EBF;&#x6846;&#x5143;&#x7D20;&#x4E2D;&#x7684;&#x6700;&#x5C0F;&#x9AD8;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x975E;&#x66FF;&#x6362;&#x884C;&#x5185;&#x5143;&#x7D20;&#xFF0C;&#x884C;&#x9AD8;&#x6307;&#x5B9A;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x884C;&#x6846;&#x7684;&#x9AD8;&#x5EA6;&#x503C;&#x7684;&#x9AD8;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x66FF;&#x6362;&#x7684;&#x884C;&#x5185;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x6309;&#x94AE;&#x6216;&#x5176;&#x4ED6;&#x8F93;&#x5165;&#x5143;&#x4EF6;&#xFF0C;&#x884C;&#x9AD8;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6548;&#x679C;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x51FA;&#x73B0;&#x4E86;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x7684;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x884C;&#x9AD8;&#x4F5C;&#x7528;&#x7684;&#x662F;&#x9AD8;&#x5EA6;&#x3002;</p>
<p>&#x610F;&#x601D;&#x662F;&#x53EF;&#x4EE5;&#x4E0D;&#x8BBE;&#x7F6E;height&#xFF1F;Yes&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x8BA4;&#x4E3A;&#x5F53;&#x6211;&#x4EEC;&#x7ED9;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x5BB9;&#x5668;&#x586B;&#x5145;&#x4E86;&#x6587;&#x5B57;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x7ED9;&#x5BB9;&#x5668;&#x8BBE;&#x7F6E;&#x9AD8;&#x5EA6;&#xFF0C;&#x6587;&#x5B57;&#x4E5F;&#x4F1A;&#x628A;&#x5BB9;&#x5668;&#x6491;&#x8D77;&#x6765;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#xFF0C;&#x5B83;&#x662F;&#x7531;&#x548C;&#x6587;&#x5B57;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x7684;&#x8BBE;&#x7F6E;&#x4EE5;&#x53CA;line-height&#xFF1A;normal&#x6765;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x5BF9;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x548C;&#x884C;&#x5185;&#x5143;&#x7D20;&#x7684;&#x5F71;&#x54CD;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x5148;&#x7ED9;&#x51FA;&#x8BD5;&#x9A8C;&#x7684;&#x539F;&#x59CB;&#x56FE;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;</p>
<p>Code </p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/1.jpg" alt=""></p>
<p>&#x6BCF;&#x4E2A;div&#x8BBE;&#x7F6E;&#x4E86;20px&#x5185;&#x8FB9;&#x8DDD;&#xFF0C;&#x4E3A;&#x4E0B;&#x56FE;&#x7684;&#x7EFF;&#x8272;&#x90E8;&#x5206;&#xFF0C;font-size&#xFF1A;16px;</p>
<p>&#x6548;&#x679C; </p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/2.jpg" alt=""></p>
<p>&#x6211;&#x4EEC;&#x7ED9;p&#x8BBE;&#x7F6E;line-height&#xFF1A;0&#xFF1B;overflow&#xFF1A;hidden&#xFF1B;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/3.jpg" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6B64;&#x65F6;p&#x201C;&#x6D88;&#x5931;&#x201D;&#x4E86;&#x3002;&#x4F46;&#x4E5F;&#x4F1A;&#x60CA;&#x8BB6;&#x7684;&#x53D1;&#x73B0;span&#x8FD9;&#x91CC;&#x5B8C;&#x597D;&#x65E0;&#x635F;&#xFF0C;&#x6765;&#x770B;&#x6D4F;&#x89C8;&#x5668;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x7684;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/4.jpg" alt=""></p>
<p>&#x662F;&#x7684;&#xFF0C;&#x5B83;&#x7684;line-height&#x540C;&#x6837;&#x88AB;&#x6539;&#x53D8;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x9AD8;&#x5EA6;&#x5374;&#x4E0D;&#x4E3A;0.&#x8FD9;&#x5C31;&#x662F;&#x5BF9;&#x884C;&#x5185;&#x5143;&#x7D20;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x884C;&#x5185;&#x5143;&#x7D20;&#x7684;&#x884C;&#x9AD8;&#x4F1A;&#x8DDF;&#x7740;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x9AD8;&#x5EA6;&#x4E0D;&#x4F1A;&#x53D8;&#x3002;</p>
<p>line-height&#x53D6;&#x503C;</p>
<p>&#x503C;&#xFF1A;</p>
<p>normal</p>
<p>inherit</p>
<p>&#x5E26;&#x5355;&#x4F4D;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5982;:20px(&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B58;&#x5728;&#x4E14;&#x5408;&#x7406;&#x7684;em&#x3001;rem&#x7B49;);</p>
<p>&#x65E0;&#x5355;&#x4F4D;&#x503C;&#xFF0C;&#x5982;:2;</p>
<p>&#x767E;&#x5206;&#x6BD4;&#x503C;&#xFF1A;&#x5982;:150%;</p>
<p>&#x548C;&#x4EC0;&#x4E48;&#x662F;&#x76F8;&#x5173;&#x7684;&#xFF1F;</p>
<p>font-stretch&#x3001;font-variant&#x3001;font-style&#x3001;font-weight font-size&#x3001;font-family</p>
<p>&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x6765;&#x770B; Normal=&#xFF1F; &#x5728;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x8BBE;&#x7F6E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;normal&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x5E94;&#x8BE5;&#x662F;1&#x5427;&#xFF1F;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x731C;&#x6D4B;z-index&#x5728;&#x4E0D;&#x8BBE;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#x9ED8;&#x8BA4;&#x503C;&#x662F;0&#x4E00;&#x6837;&#x3002;&#x770B;&#x770B;&#x4FBF;&#x77E5;</p>
<p>Normal</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/5.jpg" alt=""></p>
<p>1</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/6.jpg" alt=""></p>
<p>&#x4E0D;&#x4E00;&#x6837;&#x554A;&#xFF0C;&#x90A3;100%&#x5462;&#xFF1F;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/7.jpg" alt=""></p>
<p>&#x770B;&#x8D77;&#x6765;&#x7EB9;&#x4E1D;&#x672A;&#x52A8;&#x54C8;&#x3002;&#x53EF;&#x80FD;&#x6709;&#x4EBA;&#x4F1A;&#x95EE;&#xFF0C;1&#x548C;100%&#x4E0D;&#x662F;&#x4E00;&#x6837;&#x7684;&#x4E48;&#xFF1F;&#xFF01;&#x53EF;&#x771F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x540E;&#x9762;&#x8BB2;&#x3002;</p>
<p>&#x90A3;normal&#x662F;&#x591A;&#x5C11;&#xFF1F;</p>
<p>&#x4E0D;&#x80FD;&#x9760;&#x731C;&#x54C8;&#xFF01;&#x5B83;&#x5728;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x8BA1;&#x7B97;&#x503C;&#x4E5F;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x6709;&#x8D44;&#x6599;&#x8BF4;&#x5B83;&#x53D6;&#x503C;&#x662F;&#x5728;1.1-1.2&#x4E4B;&#x95F4;&#xFF0C;css&#x6743;&#x5A01;&#x6307;&#x5357;&#x4E0A;&#x4E5F;&#x8BF4;&#x662F;1.2&#x500D;&#xFF0C;&#x636E;&#x6211;&#x6D4B;&#x8BD5;&#xFF0C;&#x5728;chrome&#x4E0B;&#xFF0C;&#x7B49;&#x4E8E;line-height&#xFF1A;1.32;</p>
<p>Inherit</p>
<p>&#x7EE7;&#x627F;&#xFF0C;&#x8DDF;&#x4E0A;&#x4F8B;&#x76F8;&#x5173;&#xFF0C;line-height&#x4F1A;&#x600E;&#x6837;&#x7EE7;&#x627F;&#xFF1F;&#x5148;&#x770B;&#x6570;&#x503C;</p>
<p>&#x6570;&#x503C;&#x5206;&#x4E3A;&#x5E26;&#x5355;&#x4F4D;&#x548C;&#x4E0D;&#x5E26;&#x5355;&#x4F4D;&#x7684;</p>
<p>&#x5E26;&#x5355;&#x4F4D;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x5C31;&#x5F88;&#x76F4;&#x89C2;&#x4E86;&#xFF0C;&#x4F60;&#x5B9A;&#x591A;&#x5C11;&#x5B83;&#x5C31;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x5C31;&#x8DDF;&#x6211;&#x4EEC;js&#x5F53;&#x4E2D;&#x6240;&#x8BF4;&#x7684;&#x5B57;&#x9762;&#x91CF;&#x4E00;&#x6837;&#x3002;But&#xFF0C;&#x53EA;&#x662F;&#x5BF9;&#x4E8E;px&#x3001;pt&#x7B49;&#x5177;&#x6709;&#x7269;&#x7406;&#x6807;&#x51C6;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x540E;&#x9762;&#x8BB2;&#x3002;</p>
<p>&#x4E0D;&#x5E26;&#x5355;&#x4F4D;</p>
<p>&#x8FD9;&#x91CC;&#x9762;&#x5C31;&#x7275;&#x626F;&#x5230;&#x4E00;&#x4E2A;&#x7EE7;&#x627F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0A;&#x9762;&#x6709;&#x63D0;&#x5230;1&#x548C;100%&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x539F;&#x56E0;&#x5C31;&#x5728;&#x4E8E;&#x6B64;&#x3002;&#x4E0D;&#x5E26;&#x5355;&#x4F4D;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5B83;&#x662F;&#x5C06;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x4F5C;&#x4E3A;&#x6BD4;&#x4F8B;&#x4F20;&#x9012;&#x4E86;&#x4E0B;&#x53BB;&#xFF0C;&#x81F3;&#x4E8E;&#x540E;&#x4EE3;&#x7684;&#x884C;&#x9AD8;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x5219;&#x662F;&#x7531;&#x540E;&#x4EE3;&#x7684;font&#x76F8;&#x5173;&#x5C5E;&#x6027;&#x51B3;&#x5B9A;&#x3002;&#x54B1;&#x770B;&#x56FE;&#x4E3E;&#x6817;&#x5B50;~</p>
<p>&#x5176;&#x5B9E;&#x4E0A;&#x9762;&#x5DF2;&#x7ECF;&#x8D34;&#x4E86;&#x4E00;&#x5F20;&#x56FE;&#x3002;&#x90A3;&#x91CC;&#x7684;1&#x548C;100%&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;font-size&#x88AB;&#x7EE7;&#x627F;&#x4E86;&#x4E0B;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7EE7;&#x627F;&#x7684;&#x662F;&#x6570;&#x503C;&#x8FD8;&#x662F;&#x6BD4;&#x4F8B;&#x5C31;&#x6CA1;&#x6709;&#x533A;&#x522B;&#x4E86;&#x3002; &#x5982;&#x679C;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5462;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x6211;mod&#x884C;&#x9AD8;&#x8BBE;&#x7F6E;&#x4E3A;1.5;p&#x7684;font-size&#xFF1A;18px;&#x518D;&#x6765;&#x770B;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x53EA;&#x6539;&#x53D8;&#x4E86;&#x6570;&#x503C;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/8.jpg" alt=""></p>
<p>&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x53D8;&#x5316;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E8C;&#x8005;&#x7684;&#x533A;&#x522B;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/9.jpg" alt=""></p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/10.jpg" alt=""></p>
<p>&#x8FD9;&#x65F6;p&#x7684;&#x884C;&#x9AD8;line-height=18<em>1.5=27px&#xFF0C;span&#x90E8;&#x5206;&#x7684;&#x884C;&#x9AD8; line-height=16</em>1.5=24px;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x5F53;line-height&#x4E3A;&#x4E0D;&#x5E26;&#x5355;&#x4F4D;&#x7684;&#x6570;&#x503C;&#x65F6;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x3002;&#x3002;&#x3002;&#x5F53;&#x5B83;&#x662F;1.5em&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF1F;&#x4F1A;&#x662F;&#x4E00;&#x6837;&#x7684;&#x4E48;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x7236;&#x7EA7;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;1.5em&#xFF1B; &#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/11.jpg" alt=""></p>
<p>&#x5455;&#x543C;&#xFF01;&#x770B;&#x6765;&#x6D4F;&#x89C8;&#x5668;&#x8FD9;&#x65F6;&#x5019;&#x6CA1;&#x6709;&#x7406;&#x4F1A;p&#x7684;18px&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E86;&#x7236;&#x7EA7;&#x7684;16px&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x770B;&#x767E;&#x5206;&#x6BD4;</p>
<p>&#x767E;&#x5206;&#x6BD4;&#x548C;&#x65E0;&#x5355;&#x4F4D;&#x6570;&#x503C;&#x4ECE;&#x6570;&#x5B66;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4E5F;&#x662F;&#x591A;&#x6570;&#x4EBA;&#x770B;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x6700;&#x56F0;&#x60D1;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x4EBA;&#x603B;&#x4F1A;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x5224;&#x65AD;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x5F80;&#x5F80;&#x5177;&#x4F53;&#x7684;&#x4E8B;&#x7269;&#x6709;&#x7740;&#x5177;&#x4F53;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4F1A;&#x6709;&#x5DEE;&#x522B;&#x3002;&#x5BF9;&#x4E8E;line-height&#x6765;&#x8BF4;&#xFF0C;&#x524D;&#x9762;&#x8BF4;&#x4E86;&#x65E0;&#x5355;&#x4F4D;&#x503C;&#x662F;&#x7EE7;&#x627F;&#x4E86;&#x6BD4;&#x4F8B;&#xFF0C;&#x767E;&#x5206;&#x6BD4;&#x5219;&#x662F;&#x7EE7;&#x627F;&#x4E86;&#x884C;&#x9AD8;&#x7684;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x7236;&#x5143;&#x7D20;&#x7684;&#x884C;&#x9AD8;&#x51B3;&#x5B9A;&#x4E86;&#x4E0B;&#x9762;&#x6240;&#x6709;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x524D;&#x63D0;&#x662F;&#x5B50;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x884C;&#x9AD8;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x9A8C;&#x8BC1;&#x6211;&#x4EEC;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x7ED9;&#x7236;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;line-height&#xFF1A;150%;/&#x5B50;&#x5143;&#x7D20;&#x4E0D;&#x8BBE;&#x7F6E;&#xFF0C;&#x5982;&#x679C;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x6599;&#xFF0C;&#x884C;&#x9AD8;&#x5E94;&#x8BE5;&#x90FD;&#x662F;24px&#xFF0C;&#x6765;&#x770B;&#x7ED3;&#x679C;&#xFF0C;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/12.jpg" alt=""></p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/13.jpg" alt=""></p>
<p>&#x770B;&#x6765;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x5F53;&#x662F;&#x767E;&#x5206;&#x6BD4;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4EEC;&#x7EE7;&#x627F;&#x4E86;&#x7236;&#x7EA7;&#x7684;line-height&#x503C;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x81F3;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x90FD;&#x8FD8;&#x662F;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x90A3;&#x4E0D;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x5462;&#xFF1F;&#x6BD4;&#x5982;</p>
<p>&#x884C;&#x9AD8;&#x5C0F;&#x4E8E;&#x5B57;&#x53F7;</p>
<p>&#x6211;&#x4EEC;&#x7ED9;line-height:0.5; &#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x5462;&#xFF1F;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/14.jpg" alt=""></p>
<p>p&#x7684;&#x884C;&#x9AD8;&#x4F1A;&#x7F29;&#x5F88;&#x591A;&#xFF0C;&#x540C;&#x65F6;&#x9AD8;&#x5EA6;&#x4E5F;&#x8DDF;&#x7740;&#x884C;&#x9AD8;&#x53D8;&#x5316;&#xFF0C;&#x4F46;span&#x7684;&#x9AD8;&#x5EA6;&#x672A;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x6B63;&#x5982;&#x4E0A;&#x6587;&#x6240;&#x8BF4;&#xFF0C;&#x5B83;&#x7684;&#x9AD8;&#x5EA6;&#x4E0D;&#x4F1A;&#x88AB;line-height&#x6539;&#x53D8;&#x3002;</p>
<p>&#x4F46;&#x884C;&#x9AD8;&#x786E;&#x5B9E;&#x53D8;&#x4E86;</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/15.jpg" alt=""></p>
<p>&#x505A;&#x4E00;&#x4E2A;&#x5C0F;&#x7ED3;&#xFF1A;</p>
<p>1&#x3001;&#x884C;&#x9AD8;&#x4F1A;&#x5F71;&#x54CD;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x884C;&#x5185;&#x5143;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#x3002;</p>
<p>2&#x3001;1&#x548C;100%&#x548C;1em&#x4E0D;&#x540C;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x6BD4;&#x4F8B;&#xFF0C;&#x4F46;&#x5BF9;&#x8C61;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x4F20;&#x9012;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x540C;&#x3002;1&#x662F;&#x628A;&#x6BD4;&#x4F8B;&#x4F20;&#x9012;&#x7ED9;&#x540E;&#x4EE3;&#xFF0C;100%&#x662F;&#x5C06;&#x8BA1;&#x7B97;&#x540E;&#x7684;&#x503C;&#x4F20;&#x9012;&#x7ED9;&#x540E;&#x4EE3;&#xFF0C;1em&#x5219;&#x4F1A;&#x4F7F;&#x5143;&#x7D20;&#x4EE5;&#x5176;&#x7236;&#x5143;&#x7D20;font-size&#x503C;&#x4E3A;&#x53C2;&#x8003;&#x6765;&#x8BA1;&#x7B97;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x9AD8;&#x3002;</p>
<p>vertical-align</p>
<p>&#x597D;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x770B;&#x770B;vertical-align&#x5427;&#xFF0C;&#x4E5F;&#x8BE5;&#x5B83;&#x767B;&#x573A;&#x4E86;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x7528;&#x5B83;&#x662F;&#x5E72;&#x561B;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x60F3;&#x5F88;&#x723D;&#x7684;&#x50CF;text-align&#x90A3;&#x6837;&#x7528;&#x5B83;&#x6765;&#x8FDB;&#x884C;&#x5782;&#x76F4;&#x5C45;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x5C45;&#x4E2D;&#x7684;&#x7528;&#x5904;&#x5B9E;&#x5728;&#x592A;&#x5E7F;&#x4E86;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x7740;&#x4E00;&#x79CD;&#x5BF9;&#x79F0;&#x7F8E;&#x3002;</p>
<p>Value</p>
<p>&#x957F;&#x5EA6; &#x901A;&#x8FC7;&#x8DDD;&#x79BB;&#x5347;&#x9AD8;&#xFF08;&#x6B63;&#x503C;&#xFF09;&#x6216;&#x964D;&#x4F4E;&#xFF08;&#x8D1F;&#x503C;&#xFF09;&#x5143;&#x7D20;&#x3002;&#x2019;0cm&#x2019;&#x7B49;&#x540C;&#x4E8E;&#x2019;baseline&#x2019;</p>
<p>&#x767E;&#x5206;&#x503C; &#x2013; % &#x901A;&#x8FC7;&#x8DDD;&#x79BB;&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;1line-height1&#x503C;&#x7684;&#x767E;&#x5206;&#x5927;&#x5C0F;&#xFF09;&#x5347;&#x9AD8;&#xFF08;&#x6B63;&#x503C;&#xFF09;&#x6216;&#x964D;&#x4F4E;&#xFF08;&#x8D1F;&#x503C;&#xFF09;&#x5143;&#x7D20;&#x3002;&#x2019;0%&#x2019;&#x7B49;&#x540C;&#x4E8E;&#x2019;baseline&#x2019;</p>
<p>baseline &#x9ED8;&#x8BA4;&#x3002;&#x5143;&#x7D20;&#x7684;&#x57FA;&#x7EBF;&#x4E0E;&#x7236;&#x5143;&#x7D20;&#x7684;&#x57FA;&#x7EBF;&#x5BF9;&#x9F50;&#x3002;</p>
<p>sub &#x964D;&#x4F4E;&#x5143;&#x7D20;&#x7684;&#x57FA;&#x7EBF;&#x5230;&#x7236;&#x5143;&#x7D20;&#x5408;&#x9002;&#x7684;&#x4E0B;&#x6807;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>super &#x5347;&#x9AD8;&#x5143;&#x7D20;&#x7684;&#x57FA;&#x7EBF;&#x5230;&#x7236;&#x5143;&#x7D20;&#x5408;&#x9002;&#x7684;&#x4E0A;&#x6807;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>top &#x628A;&#x5BF9;&#x9F50;&#x7684;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x9876;&#x7AEF;&#x4E0E;line box&#x9876;&#x7AEF;&#x5BF9;&#x9F50;&#x3002;</p>
<p>text-top &#x628A;&#x5143;&#x7D20;&#x7684;&#x9876;&#x7AEF;&#x4E0E;&#x7236;&#x5143;&#x7D20;&#x5185;&#x5BB9;&#x533A;&#x57DF;&#x7684;&#x9876;&#x7AEF;&#x5BF9;&#x9F50;&#x3002;</p>
<p>middle &#x5143;&#x7D20;&#x7684;&#x4E2D;&#x5782;&#x70B9;&#x4E0E; &#x7236;&#x5143;&#x7D20;&#x7684;&#x57FA;&#x7EBF;&#x52A0;1/2&#x7236;&#x5143;&#x7D20;&#x4E2D;&#x5B57;&#x6BCD;x&#x7684;&#x9AD8;&#x5EA6; &#x5BF9;&#x9F50;&#x3002;</p>
<p>bottom &#x628A;&#x5BF9;&#x9F50;&#x7684;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x5E95;&#x7AEF;&#x4E0E;line box&#x5E95;&#x7AEF;&#x5BF9;&#x9F50;&#x3002;</p>
<p>text-bottom &#x628A;&#x5143;&#x7D20;&#x7684;&#x5E95;&#x7AEF;&#x4E0E;&#x7236;&#x5143;&#x7D20;&#x5185;&#x5BB9;&#x533A;&#x57DF;&#x7684;&#x5E95;&#x7AEF;&#x5BF9;&#x9F50;&#x3002;</p>
<p>inherit &#x91C7;&#x7528;&#x7236;&#x5143;&#x7D20;&#x76F8;&#x5173;&#x5C5E;&#x6027;&#x7684;&#x76F8;&#x540C;&#x7684;&#x6307;&#x5B9A;&#x503C;&#x3002;</p>
<p>&#x5B83;&#x5BF9;&#x54EA;&#x4E9B;&#x5143;&#x7D20;&#x8D77;&#x4F5C;&#x7528;&#x5462;&#xFF1F;</p>
<p>&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x5C5E;&#x4E8E;inline&#x6216;&#x662F;inline-block&#xFF08;table-cell&#x4E5F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;inline-block&#x6C34;&#x5E73;&#xFF09;&#xFF0C;vertical-align&#x624D;&#x4F1A;&#x8D77;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x600E;&#x4E48;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#xFF1F;</p>
<p>&#x4ECE;&#x5404;&#x79CD;&#x53D6;&#x503C;&#x7684;&#x63CF;&#x8FF0;&#x6765;&#x770B;&#xFF0C;&#x5B83;&#x5BF9;&#x4E8E;&#x5143;&#x7D20;&#x672C;&#x8EAB;&#x7684;&#x8868;&#x73B0;&#x5E76;&#x65E0;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x662F;&#x5F71;&#x54CD;&#x7684;&#x5728;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x662F;&#x5176;&#x81EA;&#x8EAB;&#x76F8;&#x5BF9;&#x4E8E;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x5143;&#x7D20;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5C31;&#x597D;&#x7406;&#x89E3;&#x4E00;&#x4E9B;&#x4E86;&#xFF0C;&#x627E;&#x627E;&#x4F4D;&#x7F6E;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;baseline&#xFF0C;&#x5373;&#x5B50;&#x5143;&#x7D20;&#x7684;&#x57FA;&#x7EBF;&#x548C;&#x7236;&#x5143;&#x7D20;&#x57FA;&#x7EBF;&#x5BF9;&#x9F50;&#x3002;&#x56E0;&#x4E3A;&#x8BA9;&#x6240;&#x6709;&#x6587;&#x672C;&#x5143;&#x7D20;&#x7684;&#x5E95;&#x7AEF;&#x5BF9;&#x9F50;&#x662F;&#x518D;&#x6B63;&#x5E38;&#x4E0D;&#x8FC7;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5176;&#x4ED6;&#x7684;&#x5462;&#xFF1F;</p>
<p>&#x6211;&#x4EEC;&#x62FF;label&#x6765;&#x770B;&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x770B;&#x5F97;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x4E00;&#x4E2A;input&#x6765;&#x5BF9;&#x6BD4;&#xFF0C;&#x8FD9;&#x6070;&#x5DE7;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x5E38;&#x7528;&#x7EC4;&#x5408;&#x3002;</p>
<p>&#x628A;label&#x7684;font-size&#x8BBE;&#x7F6E;&#x4E3A;30px&#x3002;</p>
<p>&#x503C;&#x5F53;&#x4E2D;&#x6709;&#x51E0;&#x4E2A;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7406;&#x89E3;&#x7684;&#xFF0C;&#x6BD4;&#x5982;</p>
<p>top </p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/16.jpg" alt=""></p>
<p>bottom </p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/17.jpg" alt=""></p>
<p>text-top </p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/18.jpg" alt=""></p>
<p>text-bottom</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/19.jpg" alt=""></p>
<p>middle </p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/20.jpg" alt=""></p>
<p>&#x90A3;&#x4E48;sub&#x548C;super&#x8BE5;&#x600E;&#x4E48;&#x7406;&#x89E3;&#x5462;&#xFF1F;</p>
<p>&#x8FD9;&#x4E2A;&#x5728;&#x67D0;&#x4E9B;&#x65F6;&#x5019;&#x4F1A;&#x5F15;&#x8D77;&#x8BEF;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x53EF;&#x80FD;&#x8BBE;&#x7F6E;&#x7684;super&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6587;&#x5B57;&#x770B;&#x8D77;&#x6765;&#x6BD4;sub&#x7684;&#x4F4D;&#x7F6E;&#x8FD8;&#x4F4E;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5B57;&#x4F53;&#x548C;&#x884C;&#x9AD8;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x662F;&#x4E0D;&#x662F;&#x4F1A;&#x5BF9;&#x5B83;&#x4EEC;&#x6709;&#x4E9B;&#x773C;&#x719F;&#x5462;&#xFF1F;&#x5BF9;&#xFF0C;html&#x6709;&#x4E24;&#x4E2A;&#x6807;&#x7B7E;&#x662F;&#x7528;&#x6765;&#x8D1F;&#x8D23;&#x8BBE;&#x5B9A;&#x4E0A;&#x3001;&#x4E0B;&#x6807;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E24;&#x4E2A;&#x662F;&#x4E0D;&#x662F;&#x540C;&#x7406;&#xFF1F; &#x6765;&#x770B;&#x770B;&#x4FBF;&#x77E5;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7ED9;&#x7236;&#x5143;&#x7D20;&#x5B9A;&#x4E86;&#x65E0;&#x5355;&#x4F4D;&#x6570;&#x503C;&#x7684;line-height&#xFF0C;&#x6240;&#x4EE5;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x4F1A;&#x5F71;&#x54CD;&#x884C;&#x9AD8;&#xFF0C;&#x8FDB;&#x800C;&#x5F71;&#x54CD;&#x5230;&#x57FA;&#x7EBF;&#x548C;&#x5BF9;&#x9F50;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C06;font-size:16px;&#x6765;&#x770B;&#x6548;&#x679C;&#x3002;</p>
<p>super</p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/21.jpg" alt=""><br>sub </p>
<p><img src="/2015/06/19/front-home-lineheight-and-vertical/22.jpg" alt=""></p>
<p>It&#x2019;s true!~</p>
<p>&#x5BF9;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x767E;&#x5206;&#x6BD4;&#x548C;&#x957F;&#x5EA6;</p>
<p>&#x767E;&#x5206;&#x6BD4;&#x7684;&#x4F4D;&#x7F6E;&#x4F9D;&#x7136;&#x662F;&#x4ECE;&#x57FA;&#x7EBF;&#x7B97;&#x8D77;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#x7684;&#x9876;&#x90E8;&#x3002;&#x6B63;&#x503C;&#x4F1A;&#x4F7F;&#x5143;&#x7D20;&#x5411;&#x4E0A;&#x79FB;&#x52A8;&#xFF0C;&#x8D1F;&#x503C;&#x4F1A;&#x4F7F;&#x5176;&#x5411;&#x4E0B;&#x79FB;&#x52A8;&#xFF0C;&#x8FD9;&#x8DDF;&#x5176;&#x4ED6;&#x503C;&#x6BD4;&#x5982;margin&#x548C;&#x5B9A;&#x4F4D;&#x53C8;&#x4E0D;&#x540C;&#x3002;&#x5F53;&#x5176;&#x9876;&#x90E8;&#x6216;&#x8005;&#x5E95;&#x90E8;&#x8D85;&#x8FC7;&#x4E86;&#x540C;&#x7EA7;&#x5143;&#x7D20;&#x7684;&#x6700;&#x5927;&#x884C;&#x9AD8;&#xFF0C;&#x5219;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x6574;&#x4F53;&#x7684;&#x9AD8;&#x5EA6;&#x3002;</p>
<p>&#x957F;&#x5EA6;&#x548C;&#x767E;&#x5206;&#x6BD4;&#x7C7B;&#x4F3C;&#xFF0C;&#x4EE5;&#x57FA;&#x7EBF;&#x4E3A;&#x6807;&#x51C6;&#xFF0C;&#x6B63;&#x503C;&#x4E0A;&#x79FB;&#xFF0C;&#x8D1F;&#x503C;&#x4E0B;&#x79FB;&#xFF0C;&#x8D85;&#x51FA;&#x6700;&#x5927;&#x884C;&#x5185;&#x6846;&#x7684;&#x9AD8;&#x5EA6;&#x5219;&#x6491;&#x8D77;&#x5916;&#x56F4;&#x5BB9;&#x5668;&#x7684;&#x9AD8;&#x5EA6;&#x3002;</p>
<p>&#x60F3;&#x73A9;&#x513F;&#x7684;&#x8BDD;&#xFF0C;&#x5F20;&#x8001;&#x5E08;&#x6709;&#x4E2A;&#x9875;&#x9762;&#x53EF;&#x4EE5;&#x73A9;&#x73A9;&#x513F;<a href="http://www.zhangxinxu.com/study/201005/verticle-align-test-demo.html" target="_blank" rel="external">vertical-align</a></p>
<p>&#x53E6;&#x5916;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x5230;MDN&#x548C;strick&#x4E0A;&#x9762;&#x770B;&#x770B;&#x76F8;&#x5173;&#x7684;&#x5185;&#x5BB9;</p>
<p><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/line-height" target="_blank" rel="external">mdn-line-height</a><br><a href="https://css-tricks.com/almanac/properties/l/line-height/" target="_blank" rel="external">css-tricks-line-height</a></p>
<p><a href="https://developer.mozilla.org/en-US/docs/Web/CSS/vertical-align" target="_blank" rel="external">mdn-vertical-align</a><br><a href="https://css-tricks.com/almanac/properties/v/vertical-align/" target="_blank" rel="external">css-tricks-vertical-align</a></p>
<p>&#x4E00;&#x7BC7;baseline&#x7684;&#x6587;&#x7AE0;&#x53C2;&#x8003;<a href="https://www.qianduan.net/css-baseline-road/" target="_blank" rel="external">baseline</a></p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x5C31;&#x5148;&#x804A;&#x5230;&#x8FD9;&#x513F;&#x5427;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x758F;&#x6F0F;&#xFF0C;&#x6B22;&#x8FCE;&#x62CD;&#x7816;&#xFF01;</p>
<p>&#x53EF;&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x524D;&#x7AEF;&#x5468;&#x672B; css3china&#xFF0C;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x597D;&#x4E1C;&#x897F;&#x63A8;&#x9001;&#x3002;</p>
<p>&#x4E5F;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#xFF1A;152128548&#x548C;&#x6211;&#x4EEC;&#x4EA4;&#x6D41;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x9AD8;&#x624B;&#x54E6;&#xFF01;~</p>
</div><a data-url="http://yoursite.com/2015/06/19/front-home-lineheight-and-vertical/" data-id="cirkcbsz8004na0qihbgqq8pm" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2015/06/22/再谈css/" class="pre">再谈css</a><a href="/2015/06/12/zindex-zoom-and-the-brothers-home-front/" class="next">z-index和zoom这哥俩</a></div><div data-thread-key="2015/06/19/front-home-lineheight-and-vertical/" data-title="浅析line-height和vertical" data-url="http://yoursite.com/2015/06/19/front-home-lineheight-and-vertical/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2015/06/19/front-home-lineheight-and-vertical/" data-title="浅析line-height和vertical" data-url="http://yoursite.com/2015/06/19/front-home-lineheight-and-vertical/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>