<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>新年伊始，我都做了些什么 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">新年伊始，我都做了些什么</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">新年伊始，我都做了些什么</h1><div class="post-meta">Feb 24, 2016<span> | </span><span class="category"><a href="/categories/经历/">经历</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2016/02/24/new-year-first-do/" href="/2016/02/24/new-year-first-do/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#新气象"><span class="toc-number">1.</span> <span class="toc-text">新气象</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#新起点"><span class="toc-number">2.</span> <span class="toc-text">新起点</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#勇气"><span class="toc-number">2.1.</span> <span class="toc-text">勇气</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#初心"><span class="toc-number">2.2.</span> <span class="toc-text">初心</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#行动"><span class="toc-number">2.3.</span> <span class="toc-text">行动</span></a></li></ol></li></ol></div></div><div class="post-content"><h2 id="&#x65B0;&#x6C14;&#x8C61;"><a href="#&#x65B0;&#x6C14;&#x8C61;" class="headerlink" title="&#x65B0;&#x6C14;&#x8C61;"></a>&#x65B0;&#x6C14;&#x8C61;</h2><p><strong>&#x65B0;&#x5E74;&#x65B0;&#x6C14;&#x8C61;&#xFF0C;&#x535A;&#x5BA2;&#x642C;&#x65B0;&#x5BB6;</strong></p>
<p>&#x65E9;&#x5C31;&#x60F3;&#x628A;&#x535A;&#x5BA2;&#x653E;&#x5728;github&#x4E0A;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#xFF0C;&#x6CA1;&#x6709;&#x591A;&#x4F59;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x90A3;&#x624D;&#x53EB;&#x81EA;&#x5DF1;&#x7684;&#x535A;&#x5BA2;&#x561B;~&#x4F46;&#x4E00;&#x76F4;&#x6CA1;&#x80FD;&#x5982;&#x613F;&#x2026;&#x2026;&#x9996;&#x5148;&#x662F;&#x61D2;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#xFF0C;&#x6700;&#x8FD1;&#x60F3;&#x8D81;&#x7740;&#x65B0;&#x5E74;&#x7684;&#x5F00;&#x7AEF;&#x91CD;&#x65B0;&#x641E;&#x4E00;&#x4E0B;&#xFF0C;&#x4E0D;&#x5411;&#x56F0;&#x96BE;&#x59A5;&#x534F;&#xFF0C;&#x5728;&#x540C;&#x4E8B;&#x7684;&#x5E2E;&#x52A9;&#x548C;&#x81EA;&#x5DF1;&#x7684;&#x6478;&#x7D22;&#x4E4B;&#x4E0B;&#xFF0C;&#x6700;&#x7EC8;&#x5B8C;&#x6210;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8FD9;&#x4E48;&#x6F02;&#x4EAE;&#x7684;&#x535A;&#x5BA2;&#x4E0D;&#x80FD;&#x6D6A;&#x8D39;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x5F00;&#x59CB;&#x8282;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#x535A;&#x6587;&#x3002;</p>
<h2 id="&#x65B0;&#x8D77;&#x70B9;"><a href="#&#x65B0;&#x8D77;&#x70B9;" class="headerlink" title="&#x65B0;&#x8D77;&#x70B9;"></a>&#x65B0;&#x8D77;&#x70B9;</h2><p>&#x5173;&#x952E;&#x8BCD;&#xFF1A;<strong>&#x52C7;&#x6C14;</strong>&#x3001;<strong>&#x521D;&#x5FC3;</strong>&#x3001;<strong>&#x884C;&#x52A8;</strong></p>
<p><strong>&#x6709;&#x6240;&#x8FFD;&#x6C42;&#x662F;&#x597D;&#x4E8B;&#xFF0C;&#x82E6;&#x4E50;&#x9178;&#x751C;&#x662F;&#x751F;&#x6D3B;&#x3002;</strong></p>
<p>&#x4ECE;&#x53BB;&#x5E74;&#x5E74;&#x5E95;&#x5C31;&#x5728;&#x60F3;&#xFF0C;&#x6211;&#x660E;&#x5E74;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x9700;&#x8981;&#x600E;&#x4E48;&#x505A;&#x624D;&#x80FD;&#x8FBE;&#x5230;&#x76EE;&#x6807;&#xFF1F;&#x56E0;&#x4E3A;&#x6D51;&#x6D51;&#x5669;&#x5669;&#x7684;&#x8FC7;&#xFF0C;&#x65F6;&#x95F4;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x8FC7;&#x53BB;&#xFF0C;&#x53C8;&#x4E00;&#x4E8B;&#x65E0;&#x6210;&#xFF0C;&#x4F46;&#x8BF4;&#x5B9E;&#x8BDD;&#x4E00;&#x76F4;&#x6CA1;&#x60F3;&#x660E;&#x767D;&#xFF0C;&#x540E;&#x6765;&#x5C31;&#x628A;&#x5B83;&#x4EEC;&#x5177;&#x4F53;&#x5316;&#x3001;&#x91CF;&#x5316;&#xFF0C;&#x753B;&#x4E86;&#x4E00;&#x5F20;&#x5B8F;&#x4F1F;&#x7684;&#x8111;&#x56FE;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x6BCF;&#x4E2A;&#x6708;&#xFF0C;&#x7528;&#x591A;&#x5C11;&#x5929;&#x65F6;&#x95F4;&#xFF0C;&#x5B8C;&#x6210;&#x4EC0;&#x4E48;&#x4EFB;&#x52A1;&#xFF0C;&#x753B;&#x7740;&#x753B;&#x7740;&#x53D1;&#x73B0;&#xFF0C;&#x600E;&#x4E48;&#x90FD;&#x662F;&#x8DDF;&#x5DE5;&#x4F5C;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x5B66;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x53EF;&#x4E0D;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x5217;&#x4E86;&#x51E0;&#x4E2A;&#x751F;&#x6D3B;&#x3001;&#x60C5;&#x611F;&#x65B9;&#x9762;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x89C4;&#x5212;&#x5B8C;&#x6210;&#x4E86;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x770B;&#x7740;&#x8111;&#x56FE;&#xFF0C;16&#x5E74;&#x8FC7;&#x5B8C;&#x4E4B;&#x540E;&#x6211;&#x4F1A;&#x597D;&#x725B;&#x903C;&#x554A;&#xFF01;~</p>
<p>&#x4F46;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x8BA1;&#x5212;&#x8D76;&#x4E0D;&#x4E0A;&#x53D8;&#x5316;&#xFF0C;&#x5E74;&#x5E95;&#x5DE5;&#x4F5C;&#x5F02;&#x5E38;&#x7E41;&#x5FD9;&#xFF0C;&#x4E00;&#x6708;&#x4EFD;&#x8BA1;&#x5212;&#x6401;&#x6D45;&#xFF0C;&#x4E8C;&#x6708;&#x4EFD;&#x6625;&#x8282;&#xFF0C;&#x4E00;&#x5E74;&#x5230;&#x5934;&#x96BE;&#x5F97;&#x7A7A;&#x95F2;&#xFF0C;&#x60F3;&#x591A;&#x966A;&#x966A;&#x5BB6;&#x4EBA;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;2016&#x7684;&#x4E00;&#x4E2A;&#x534A;&#x6708;&#x7684;&#x89C4;&#x5212;&#x8981;&#x5F80;&#x540E;&#x5EF6;&#x8FDF;&#x3002;</p>
<p>&#x968F;&#x4E4B;&#x800C;&#x6765;&#x6709;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x9700;&#x8981;&#x641E;&#x6E05;&#x695A;&#xFF1A;</p>
<p>1&#x3001;&#x5217;&#x51FA;&#x6765;&#x65B0;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6709;&#x65B0;&#x7684;&#x5F00;&#x59CB;&#x4E86;&#x5417;&#xFF1F;</p>
<p>2&#x3001;&#x5217;&#x51FA;&#x6765;&#x7684;&#x5C31;&#x80FD;&#x5B8C;&#x6210;&#x5417;&#xFF1F;</p>
<p>&#x663E;&#x7136;&#x4E00;&#x5207;&#x90FD;&#x4E0D;&#x4F1A;&#x91CD;&#x65B0;&#x5F52;&#x96F6;&#xFF0C;&#x4EE5;&#x524D;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8FD8;&#x662F;&#x8981;&#x63A5;&#x7740;&#x505A;&#xFF0C;&#x4EE5;&#x524D;&#x6316;&#x7684;&#x5751;&#x8FD8;&#x662F;&#x8981;&#x63A5;&#x7740;&#x586B;&#x3002;</p>
<p>&#x5217;&#x51FA;&#x6765;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x4E0D;&#x53BB;&#x5177;&#x4F53;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x5B83;&#x6C38;&#x8FDC;&#x5728;&#x90A3;&#x91CC;&#x8EBA;&#x7740;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x6587;&#x7AE0;&#x5F00;&#x5934;&#x7684;&#x90A3;&#x4E09;&#x4E2A;&#x5173;&#x952E;&#x5B57;&#x3002;</p>
<p>&#x54B1;&#x4E00;&#x4E2A;&#x4E2A;&#x7684;&#x8BF4;&#xFF1A;</p>
<h3 id="&#x52C7;&#x6C14;"><a href="#&#x52C7;&#x6C14;" class="headerlink" title="&#x52C7;&#x6C14;"></a>&#x52C7;&#x6C14;</h3><p>&#x201C;<strong>&#x5FC3;&#x7406;&#x574E;&#x5F80;&#x5F80;&#x6BD4;&#x4E8B;&#x60C5;&#x672C;&#x8EAB;&#x66F4;&#x96BE;&#x8DE8;&#x8D8A;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x9065;&#x8FDC;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x662F;&#x2018;&#x610F;&#x8BC6;&#x2019;&#x5230;&#x2018;&#x884C;&#x4E3A;&#x2019;</strong>&#x201D;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6211;2&#x6708;17&#x53F7;&#x53D1;&#x7684;&#x4E00;&#x6761;&#x670B;&#x53CB;&#x5708;&#xFF0C;&#x8FD9;&#x4E2A;&#x611F;&#x60F3;&#x4ECE;&#x4F55;&#x800C;&#x6765;&#xFF1F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x60F3;&#x5E73;&#x65F6;&#x6709;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x81EA;&#x5DF1;&#x8BF4;&#x4E86;&#x60F3;&#x53BB;&#x505A;&#xFF0C;&#x6253;&#x7B97;&#x505A;&#xFF0C;&#x51C6;&#x5907;&#x505A;&#xFF0C;&#x7B49;&#x4E24;&#x5929;&#x4F1A;&#x505A;&#xFF0C;&#x5374;&#x4E00;&#x76F4;&#x653E;&#x90A3;&#x91CC;&#x6CA1;&#x505A;&#xFF1F;&#x4E8B;&#x60C5;&#x672C;&#x8EAB;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x96BE;&#xFF0C;&#x800C;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x5F00;&#x59CB;&#x53BB;&#x505A;&#x5B83;&#xFF0C;&#x6CA1;&#x6709;&#x201C;&#x903C;&#x201D;&#x81EA;&#x5DF1;&#x53BB;&#x505A;&#x3002;</p>
<h3 id="&#x521D;&#x5FC3;"><a href="#&#x521D;&#x5FC3;" class="headerlink" title="&#x521D;&#x5FC3;"></a>&#x521D;&#x5FC3;</h3><p>&#x8F6C;&#x773C;&#x95F4;&#x6765;&#x6DF1;&#x8FD1;&#x4E09;&#x5E74;&#x4E86;&#xFF0C;&#x66FE;&#x7ECF;&#x7684;&#x9065;&#x9065;&#x65E0;&#x671F;&#xFF0C;&#x968F;&#x7740;&#x5E74;&#x9F84;&#x7684;&#x589E;&#x957F;&#x4EFF;&#x4F5B;&#x90FD;&#x53D8;&#x5F97;&#x98DE;&#x5FEB;&#x3002;&#x4E09;&#x5E74;&#x524D;&#xFF0C;&#x8FD9;&#x5EA7;&#x57CE;&#x5E02;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x964C;&#x751F;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x65B0;&#x9C9C;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x672A;&#x6765;&#xFF0C;&#x6CA1;&#x6709;&#x53BB;&#x591A;&#x60F3;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x7684;&#x57FA;&#x77F3;&#xFF0C;&#x4E00;&#x65E0;&#x6240;&#x6709;&#xFF0C;&#x53EA;&#x4E3A;&#x751F;&#x5B58;&#x3002;&#x4E09;&#x5E74;&#x540E;&#xFF0C;&#x4E0D;&#x7BA1;&#x4E2D;&#x95F4;&#x7ECF;&#x5386;&#x4E86;&#x591A;&#x5C11;&#x4E8B;&#xFF0C;&#x90FD;&#x5DF2;&#x7ECF;&#x9010;&#x6E10;&#x7684;&#x719F;&#x6089;&#x4E86;&#x8FD9;&#x5EA7;&#x66FE;&#x65E0;&#x6BD4;&#x5411;&#x5F80;&#x7684;&#x57CE;&#x5E02;&#xFF0C;&#x5DE5;&#x4F5C;&#x548C;&#x751F;&#x6D3B;&#x6162;&#x6162;&#x7A33;&#x5B9A;&#x4E86;&#x4E0B;&#x6765;&#x3002;&#x4ECE;&#x4E24;&#x65B9;&#x9762;&#x6765;&#x8003;&#x91CF;&#x3002;</p>
<p><strong>&#x5DE5;&#x4F5C;</strong></p>
<p>&#x6211;&#x867D;&#x81EA;&#x8BE9;&#x201C;&#x5DE5;&#x4F5C;&#x72C2;&#x201D;&#xFF0C;&#x4F46;&#x6BD4;&#x8D77;&#x4E00;&#x822C;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#x771F;&#x7684;&#x4E0D;&#x7B97;&#xFF0C;&#x4E0D;&#x8BBA;&#x4ECE;&#x6280;&#x672F;&#x5E7F;&#x5EA6;&#x548C;&#x6DF1;&#x5EA6;&#x8FD8;&#x662F;&#x6295;&#x5165;&#x65F6;&#x95F4;&#x5360;&#x6BD4;&#xFF0C;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x6709;&#x4EBA;&#x51FA;&#x53BB;&#x6E38;&#x73A9;&#x8FD8;&#x5E26;&#x7740;&#x7535;&#x8111;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x4EBA;&#x6625;&#x8282;&#x8FD8;&#x6BCF;&#x5929;&#x5728;&#x5FAE;&#x535A;&#x4E0A;&#x66F4;&#x65B0;&#x7740;&#x81EA;&#x5DF1;&#x73A9;&#x6280;&#x672F;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5DEE;&#x8FDC;&#x4E86;&#x54C8;&#x3002;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x6BCF;&#x6B21;&#x90FD;&#x628A;&#x5DE5;&#x4F5C;&#x6302;&#x5728;&#x5634;&#x8FB9;&#xFF0C;&#x653E;&#x5728;&#x751F;&#x6D3B;&#x524D;&#x9762;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x5DE5;&#x4F5C;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x7A33;&#x5B9A;&#xFF0C;&#x8DB3;&#x591F;&#x6211;&#x652F;&#x6491;&#x751F;&#x6D3B;&#x4E14;&#x6709;&#x8282;&#x4F59;&#x4E4B;&#x524D;&#xFF0C;&#x65E0;&#x6687;&#x987E;&#x53CA;&#x5176;&#x4ED6;&#xFF0C;&#x73B0;&#x5728;&#x597D;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x5F00;&#x59CB;&#x7740;&#x624B;&#x505A;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x4E8B;&#x3002;</p>
<p>2015&#xFF0C;&#x8FDB;&#x5165;&#x65B0;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x9002;&#x5E94;&#x4E86;&#x73AF;&#x5883;&#x548C;&#x5DE5;&#x4F5C;&#x4EFB;&#x52A1;&#xFF0C;&#x6280;&#x672F;&#x65B9;&#x9762;&#x5728;&#x7F13;&#x6162;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x5C97;&#x4F4D;&#x5185;&#x5FEB;&#x5230;&#x4E86;&#x74F6;&#x9888;&#x671F;&#xFF0C;&#x5C97;&#x4F4D;&#x5916;&#x9884;&#x5907;&#x6316;&#x6398;&#x4E2D;&#x3002;</p>
<p>2016&#xFF0C;&#x6211;&#x8981;&#x5982;&#x4F55;&#x5728;&#x5DE5;&#x4F5C;&#x65B9;&#x9762;&#x4FDD;&#x6301;&#x521D;&#x5FC3;&#xFF1F;</p>
<p>1&#x3001;&#x662F;&#x5426;&#x80FD;&#x505A;&#x5F97;&#x6BD4;&#x4EE5;&#x524D;&#x66F4;&#x9AD8;&#x6548;&#x3001;&#x66F4;&#x4F18;&#x8D28;<br>2&#x3001;&#x8FD8;&#x6709;&#x54EA;&#x4E9B;&#x6280;&#x672F;&#x9700;&#x8981;&#x592F;&#x5B9E;&#x57FA;&#x7840;&#x3001;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E0B;&#x91CD;&#x65B0;&#x7684;&#x5BA1;&#x89C6;&#x548C;&#x5F52;&#x7EB3;&#x603B;&#x7ED3;<br>3&#x3001;&#x5904;&#x4E8E;&#x5177;&#x4F53;&#x7684;&#x90E8;&#x95E8;&#x548C;&#x5C97;&#x4F4D;&#xFF0C;&#x9700;&#x8981;&#x7406;&#x89E3;&#x548C;&#x660E;&#x767D;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5B58;&#x5728;&#x54EA;&#x4E9B;&#x4E0D;&#x8DB3;</p>
<p>&#x6574;&#x4F53;&#x7A33;&#x4E2D;&#x6C42;&#x8FDB;&#xFF0C;&#x5411;&#x5916;&#x62D3;&#x5C55;&#x5BFB;&#x6C42;&#x65B0;&#x7684;&#x7A81;&#x7834;&#x548C;&#x4E50;&#x8DA3;&#x3002;</p>
<p><strong>&#x751F;&#x6D3B;</strong></p>
<p>&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x6765;&#x6DF1;&#x642C;&#x8FC7;&#x56DB;&#x6B21;&#x5BB6;&#xFF0C;&#x4F4F;&#x8FC7;5&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x5565;&#x90FD;&#x6CA1;&#x6709;&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x5165;&#x4F4F;&#x516C;&#x53F8;&#x5BBF;&#x820D;&#xFF1B;&#x7B2C;&#x4E09;&#x4E2A;&#x81EA;&#x5DF1;&#x51FA;&#x53BB;&#x79DF;&#x4E86;&#x4E2A;&#x5355;&#x95F4;&#xFF0C;&#x4E70;&#x4E86;&#x4E2A;&#x7535;&#x8111;&#x684C;&#xFF1B;&#x7B2C;&#x56DB;&#x4E2A;&#x662F;&#x6362;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x642C;&#x7684;&#xFF0C;&#x623F;&#x5B50;&#x5F88;&#x5C0F;&#xFF0C;&#x88C5;&#x4FEE;&#x4E5F;&#x5F88;&#x7B80;&#x964B;&#xFF1B;&#x7B2C;&#x4E94;&#x4E2A;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x7684;&#x4E86;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x6027;&#x4EF7;&#x6BD4;&#x9AD8;&#xFF0C;&#x79BB;&#x516C;&#x53F8;&#x8FD1;&#xFF0C;&#x4E00;&#x5BA4;&#x4E00;&#x5385;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x662F;&#x7A7A;&#x7740;&#x7684;&#xFF0C;&#x538B;&#x6291;&#x4E45;&#x4E86;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x4EFB;&#x6027;~&#x5176;&#x4ED6;&#x65B9;&#x9762;&#xFF0C;&#x4E70;&#x4E86;&#x4E2A;&#x201C;&#x597D;&#x5E8A;&#x201D;&#xFF0C;&#x65B0;&#x4E70;&#x4E86;&#x7535;&#x8111;&#x684C;&#xFF0C;&#x6DFB;&#x7F6E;&#x4E86;&#x4E2A;&#x4E66;&#x67DC;&#xFF0C;&#x55EF;&#xFF0C;&#x522B;&#x7684;&#x6CA1;&#x4E86;&#xFF0C;&#x70ED;&#x6C34;&#x5668;&#x548C;&#x6D17;&#x8863;&#x673A;&#x4E00;&#x76F4;&#x6CA1;&#x4E70;&#x3002;&#xFF08;&#x770B;&#x5427;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#x505A;&#x4E8B;&#x9700;&#x8981;&#x52C7;&#x6C14;&#x5427;&#xFF0C;&#x54C8;&#x54C8;&#xFF09;</p>
<p>&#x90A3;&#x4E48;&#x751F;&#x6D3B;&#x7684;&#x521D;&#x5FC3;&#x53C8;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x5DE5;&#x4F5C;&#x53EA;&#x662F;&#x751F;&#x6D3B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x5904;&#x5728;&#x751F;&#x6D3B;&#x538B;&#x529B;&#x5982;&#x6B64;&#x5927;&#x7684;&#x4E00;&#x7EBF;&#x57CE;&#x5E02;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5DF2;&#x7ECF;&#x8FC7;&#x53CD;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x8981;&#x5C3D;&#x91CF;&#x4E0D;&#x504F;&#x79BB;&#x6B63;&#x5E38;&#x7684;&#x8F68;&#x9053;&#x3002;</p>
<p>&#x611F;&#x60C5;&#xFF1A;&#x4F9D;&#x7136;&#x5355;&#x8EAB;..&#xFF08;&#x6B64;&#x5904;&#x7701;&#x7565;&#x4E00;&#x4E07;&#x5B57;&#xFF09;&#xFF0C;&#x4ECA;&#x5E74;&#x4F1A;&#x8131;&#x5355;&#xFF0C;&#x4F1A;&#x8131;&#x5355;&#xFF0C;&#x4F1A;&#x8131;&#x5355;..</p>
<p>&#x6E38;&#x73A9;&#xFF1A;&#x6DF1;&#x5733;&#x597D;&#x73A9;&#x513F;&#x7684;&#x5730;&#x65B9;&#x5DF2;&#x7ECF;&#x53BB;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x4ECA;&#x5E74;&#x5E94;&#x8BE5;&#x4F1A;&#x8BA9;&#x7236;&#x6BCD;&#x518D;&#x6765;&#x73A9;&#x513F;&#x4E00;&#x6B21;</p>
<p>&#x6B63;&#x4E8B;&#xFF1A;&#x6709;&#x65F6;&#x95F4;&#x5C3D;&#x91CF;&#x575A;&#x6301;&#x5065;&#x8EAB;&#xFF1B;&#x8BE5;&#x6DFB;&#x7F6E;&#x4E24;&#x6837;&#x65B0;&#x7684;&#x5BB6;&#x7528;&#x7535;&#x5668;&#x4E86;&#xFF08;&#x4E0A;&#x9762;&#x63D0;&#x8FC7;&#xFF09;&#xFF1B;&#x5B66;&#x505A;&#x51E0;&#x6837;&#x81EA;&#x5DF1;&#x7231;&#x5403;&#x7684;&#x83DC;&#xFF1B;&#x5F00;&#x59CB;&#x5B66;&#x8F66;&#x4E86;</p>
<p>&#x521D;&#x5FC3;&#x5E76;&#x4E0D;&#x662F;&#x4F60;&#x4F9D;&#x7136;&#x8FD8;&#x505C;&#x7559;&#x5728;&#x6700;&#x521D;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x5FC3;&#x6001;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x5408;&#x7406;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x4F60;&#x9700;&#x8981;&#x4E0D;&#x53D7;&#x5916;&#x754C;&#x65E0;&#x8C13;&#x7684;&#x5E72;&#x6270;&#xFF0C;&#x6765;&#x601D;&#x8003;&#x81EA;&#x5DF1;&#x7684;&#x4ECE;&#x524D;&#x548C;&#x73B0;&#x5728;&#xFF0C;&#x660E;&#x786E;&#x81EA;&#x8EAB;&#x76EE;&#x524D;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x91CD;&#x70B9;&#xFF0C;&#x9700;&#x8981;&#x8FBE;&#x6210;&#x7684;&#x76EE;&#x6807;&#x3002;&#x521D;&#x5FC3;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x4FDD;&#x6301;&#x6700;&#x521D;&#x7684;&#x90A3;&#x79CD;&#x5411;&#x524D;&#x7684;&#x52BF;&#x5934;&#x3002;</p>
<h3 id="&#x884C;&#x52A8;"><a href="#&#x884C;&#x52A8;" class="headerlink" title="&#x884C;&#x52A8;"></a>&#x884C;&#x52A8;</h3><p>&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x4E86;&#x52C7;&#x6C14;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x52C7;&#x6C14;&#x6765;&#x5E72;&#x561B;&#x5462;&#xFF1F;&#x5F53;&#x7136;&#x662F;&#x4ED8;&#x8BF8;&#x884C;&#x52A8;&#x3002;</p>
<p>&#x201C;<strong>&#x6211;&#x77E5;&#x9053;&#x4F60;&#x6CA1;&#x65F6;&#x95F4;&#xFF0C;&#x4E0A;&#x73ED;&#x65F6;&#x95F4;&#x5FD9;&#x6210;&#x72D7;&#xFF0C;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#x61D2;&#x6210;&#x732A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x65F6;&#x95F4;&#x90FD;&#x53BB;&#x54EA;&#x513F;&#x4E86;&#xFF1F;</strong>&#x201D;</p>
<p>&#x8FD9;&#x662F;&#x6211;2&#x6708;20&#x53F7;&#x53D1;&#x7684;&#x4E00;&#x6761;&#x670B;&#x53CB;&#x5708;&#xFF0C;&#x611F;&#x6168;&#x4E8E;&#x5E73;&#x65F6;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x8BF4;&#x81EA;&#x5DF1;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x6CA1;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x800C;&#x60F3;&#x60F3;&#x6211;&#x4EEC;&#x7684;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x90FD;&#x7528;&#x6765;&#x5E72;&#x561B;&#x4E86;&#xFF1F;&#x7761;&#x89C9;&#xFF1F;&#x804A;&#x5929;&#x5439;&#x6C34;&#xFF1F;&#x53D1;&#x5446;&#xFF1F;&#x770B;&#x5267;&#xFF1F;&#x6253;&#x6E38;&#x620F;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x4E9B;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5728;kill time&#xFF0C;&#x7136;&#x540E;&#x7B49;&#x5230;&#x8BF4;&#x67D0;&#x4EF6;&#x4E8B;&#x8FD8;&#x6CA1;&#x505A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x8BF4;&#xFF0C;&#x54EA;&#x6709;&#x65F6;&#x95F4;&#x554A;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8BF4;&#xFF1A;<strong>&#x522B;&#x61D2;&#xFF0C;&#x884C;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x6709;&#x65F6;&#x95F4;&#x4E86;&#x3002;</strong></p>
<p>&#x6211;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#x53BB;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x4E8B;&#x60C5;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x5217;&#x51FA;&#x6E05;&#x5355;</p>
<p>1&#x3001;&#x81EA;&#x5DF1;&#x7684;&#x623F;&#x95F4;&#x505A;&#x4E86;&#x4E00;&#x6B21;&#x5927;&#x626B;&#x8361;&#xFF0C;&#x91CD;&#x65B0;&#x7684;&#x6574;&#x7406;&#xFF0C;&#x6E05;&#x6D17;<br>2&#x3001;&#x7F51;&#x8D2D;&#x4E86;&#x4E24;&#x672C;&#x4E66;<br>3&#x3001;&#x5E74;&#x524D;&#x5C1D;&#x8BD5;&#x7528;&#x7684;&#x4E00;&#x6B3E;&#x63D2;&#x4EF6;&#xFF0C;&#x603B;&#x662F;&#x5931;&#x8D25;&#xFF0C;&#x539F;&#x56E0;&#x672A;&#x641E;&#x660E;&#x3002; &#x641E;&#x5B9A;<br>4&#x3001;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x77E5;&#x9053;PS CC&#x7248;&#x672C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x7684;&#x751F;&#x6210;&#x56FE;&#x7247;&#xFF0C;&#x53EF;&#x5927;&#x5927;&#x7684;&#x63D0;&#x9AD8;&#x5207;&#x56FE;&#x6548;&#x7387;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x5C1D;&#x8BD5;&#x4E4B;&#x540E;&#xFF0C;&#x6CA1;&#x5F04;&#x6210;&#xFF0C;&#x653E;&#x5F03;&#x4E86;&#x3002; &#x641E;&#x5B9A;+&#x5B89;&#x88C5;CSS3PS  &#x641E;&#x5B9A;<br>5&#x3001;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x7F16;&#x7801;&#x6548;&#x7387;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x5B89;&#x88C5;&#x4E86;&#x201C;CodeFormatter&#x201D;&#xFF0C;&#x201D;Cssrem&#x201D;&#x53CA;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x6A21;&#x677F;&#x63D2;&#x4EF6;&#xFF0C;&#x63D0;&#x5347;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#xFF0C;&#x5B89;&#x88C5;&#x4E86;&#x201C;Seti_UI&#x201D;&#x4E3B;&#x9898;<br>6&#x3001;&#x9884;&#x7EA6;&#x516C;&#x53F8;&#x770B;&#x7259;<br>7&#x3001;&#x4F7F;&#x7528;hexo+github pages&#x91CD;&#x5EFA;&#x535A;&#x5BA2;&#xFF0C;&#x4E4B;&#x524D;&#x62D6;&#x4E86;&#x5F88;&#x4E45;&#x3002; &#x641E;&#x5B9A;<br>8&#x3001;&#x62A5;&#x9A7E;&#x6821;&#x5B66;&#x8F66;</p>
<p>&#x6682;&#x5217;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x8FD9;&#x90FD;&#x4EC0;&#x4E48;&#x9E21;&#x6BDB;&#x849C;&#x76AE;&#x7684;&#x4E8B;&#xFF0C;&#x8FD8;&#x8981;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x52C7;&#x6C14;&#xFF1F;&#x56FE;&#x6837;&#x56FE;&#x68EE;&#x7834;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x4E0A;&#x9762;&#x5217;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x6709;&#x5FC5;&#x987B;&#x5E72;&#x7684;&#x5417;&#xFF1F;&#x6709;&#x6025;&#x4E8B;&#x5417;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x6CA1;&#x6709;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x4E8E;&#x53EF;&#x505A;&#x53EF;&#x4E0D;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x62D6;&#x5F88;&#x4E45;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#xFF0C;&#x6709;&#x597D;&#x5904;&#x7684;&#xFF0C;&#x4F60;&#x505A;&#x4E00;&#x4EF6;&#x5C31;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x66F4;&#x8212;&#x670D;&#xFF0C;&#x505A;&#x4E00;&#x4EF6;&#x5C31;&#x5C11;&#x4E00;&#x4EF6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x505A;&#xFF1F;~</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8FD8;&#x4F1A;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#x53BB;&#x505A;&#x66F4;&#x591A;&#x7684;&#x4E8B;&#x3002;</p>
<p>&#x505A;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6709;&#x8BF8;&#x591A;&#x7684;&#x611F;&#x609F;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x5C31;&#x662F;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x53D8;&#x5F97;&#x5F3A;&#x5927;&#x4E86;&#xFF0C;&#x624D;&#x80FD;&#x53BB;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#xFF0C;&#x800C;&#x662F;&#x4F60;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x52AA;&#x529B;&#x5C1D;&#x8BD5;&#x4E2D;&#xFF0C;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x4EF6;&#x53C8;&#x4E00;&#x4EF6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x6536;&#x83B7;&#xFF0C;&#x53D8;&#x5F97;&#x6BD4;&#x4EE5;&#x524D;&#x66F4;&#x5F3A;&#x5927;</p>
<p>&#x4E8C;&#x3001;&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x6CA1;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x591A;&#x90FD;&#x662F;&#x88AB;&#x81EA;&#x5DF1;&#x6253;&#x53D1;&#x4E86;&#xFF0C;&#x522B;&#x61D2;&#xFF0C;&#x884C;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x6709;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x505A;&#x7684;&#x4E8B;&#x591A;&#x4E86;&#xFF0C;&#x70E6;&#x607C;&#x5C31;&#x5C11;&#x4E86;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x65B0;&#x5E74;&#x7B2C;&#x4E00;&#x7BC7;&#x5C31;&#x5148;&#x8FD9;&#x4E48;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#x5427;&#xFF0C;&#x591A;&#x8BF4;&#x65E0;&#x76CA;&#xFF0C;&#x5B9E;&#x8DF5;&#x662F;&#x771F;&#x7406;&#x3002;</p>
<p>&#x4E0B;&#x6B21;&#x89C1;~</p>
</div><a data-url="http://yoursite.com/2016/02/24/new-year-first-do/" data-id="cimozr8a1003ehwqi7ewl1hxl" class="article-share-link">分享到</a><div class="tags"><a href="/tags/经历/">经历</a></div><div class="post-nav"><a href="/2016/02/25/javascript-study-one/" class="pre">征服javascript学习笔记（一）——认识js</a><a href="/2016/01/01/2015-summary/" class="next">梦幻般的2015，更丰盈的2016</a></div><div data-thread-key="2016/02/24/new-year-first-do/" data-title="新年伊始，我都做了些什么" data-url="http://yoursite.com/2016/02/24/new-year-first-do/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2016/02/24/new-year-first-do/" data-title="新年伊始，我都做了些什么" data-url="http://yoursite.com/2016/02/24/new-year-first-do/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/05/javascript-study-two/">征服javascript学习笔记（二）——基本概念（上）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/28/my-love-with-words/">我的文字情结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/25/javascript-study-one/">征服javascript学习笔记（一）——认识js</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/24/new-year-first-do/">新年伊始，我都做了些什么</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>