<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>灵感的小窝 | 生活琐碎、前端杂谈、诗情画意、随心笔记</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">灵感的小窝</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h2 class="post-title"><a href="/2014/11/03/为标签正名之“也谈语义化”/">为标签正名之“也谈语义化”</a></h2><div class="post-meta">2014-11-03</div><div class="post-content"><p>&#x6807;&#x7B7E;&#x8BED;&#x4E49;&#x5316;&#x8FD9;&#x4E2A;&#x8BCD;&#x513F;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x63D0;&#xFF0C;&#x4E5F;&#x63D0;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x81F3;&#x4E8E;&#x597D;&#x5904;&#x5462;&#xFF0C;&#x4E5F;&#x90FD;&#x81F3;&#x5C11;&#x80FD;&#x7F57;&#x5217;&#x4E2A;&#x4E24;&#x4E09;&#x6761;&#xFF0C;&#x8B6C;&#x5982;&#xFF1A;&#x6709;&#x5229;&#x4E8E;seo&#xFF08;&#x8FD9;&#x6761;&#x5FEB;&#x88AB;&#x8BF4;&#x574F;&#x4E86;~&#xFF09;&#x3001;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x589E;&#x5F3A;&#x4E86;&#x53EF;&#x8BFB;&#x6027;&#x7B49;&#x7B49;&#x3002;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x63D0;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#xFF0C;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x7684;&#x4EE3;&#x7801;&#x8BED;&#x4E49;&#x5316;&#x505A;&#x5F97;&#x8FD8;&#x662F;&#x5F88;&#x4E0D;&#x591F;&#x5462;&#xFF0C;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E5F;&#x201C;&#x5F52;&#x548E;&#x201D;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x8C01;&#x5B83;&#x4E0D;&#x7BA1;&#x4E09;&#x4E03;&#x4E8C;&#x5341;&#x4E00;&#x53EA;&#x8981;&#x8BA4;&#x8BC6;&#xFF0C;&#x54EA;&#x6015;&#x4E0D;&#x89C4;&#x8303;&#x4E0D;&#x6807;&#x51C6;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x5C3D;&#x91CF;&#x597D;&#x597D;&#x663E;&#x793A;&#x51FA;&#x6765;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x5B83;&#x7684;&#x597D;&#xFF0C;&#x5374;&#x4E5F;&#x7EB5;&#x5BB9;&#x4E86;&#x9875;&#x9762;&#x4ED4;&#x7684;&#x574F;&#x4E60;&#x60EF;&#x3002;&#x9664;&#x4E86;&#x8FD9;&#x4E2A;&#x5462;&#xFF0C;&#x4E0B;&#x9762;&#x4E24;&#x4E2A;&#x4F30;&#x8BA1;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#x3002;</p></div><p class="readmore"><a href="/2014/11/03/为标签正名之“也谈语义化”/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/10/05/轻松入门css3之border-image/">轻松入门css3之border-image</a></h2><div class="post-meta">2014-10-05</div><div class="post-content"><p>&#x8BDD;&#x8BF4;&#x5927;&#x5BB6;&#x4E0D;&#x7BA1;&#x7528;&#x8FC7;&#x6CA1;&#x7528;&#x8FC7;&#xFF0C;&#x5BF9;border-image&#x5E94;&#x8BE5;&#x90FD;&#x6709;&#x6240;&#x8033;&#x95FB;&#xFF0C;&#x76F8;&#x6BD4;css2.1&#xFF0C;css3&#x7684;&#x65B0;&#x4E1C;&#x897F;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6311;&#x8FD9;&#x4E2A;&#x6765;&#x8BF4;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x8F83;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x90A3;&#x5B83;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x7528;&#x5462;&#xFF0C;&#x6709;&#x54EA;&#x4E9B;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF1F;&#x8FD9;&#x65B9;&#x9762;&#x4E5F;&#x6709;&#x4E66;&#x7C4D;&#x548C;&#x6587;&#x7AE0;&#x8BB2;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x770B;&#x8FC7;&#xFF0C;&#x5374;&#x89C9;&#x5F97;&#x6CA1;&#x641E;&#x61C2;&#xFF0C;&#x4E5F;&#x6CA1;&#x5F04;&#x660E;&#x767D;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x90A3;&#x4E48;&#x5E0C;&#x671B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x53EF;&#x4EE5;&#x5E2E;&#x5230;&#x4F60;&#xFF01;&#x6211;&#x4E0D;&#x4F1A;&#x6309;&#x5E38;&#x7406;&#x51FA;&#x724C;~</p></div><p class="readmore"><a href="/2014/10/05/轻松入门css3之border-image/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/10/03/你不该忽视的小问题之margin叠加篇/">你不该忽视的小问题之margin叠加篇</a></h2><div class="post-meta">2014-10-03</div><div class="post-content"><p>&#x5728;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;html&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4F1A;&#x7684;&#x4EBA;&#x90FD;&#x8BF4;&#x6700;&#x591A;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x5B66;&#x4F1A;&#x4E86;&#x3002;&#x5F53;&#x6211;&#x5B66;&#x4E60;css&#x5230;&#x4E86;&#x4E00;&#x5B9A;&#x9636;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x89C9;&#x5F97;&#x4E5F;&#x633A;&#x5BB9;&#x6613;&#x7684;&#x5440;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x4EBA;&#x90FD;&#x505A;&#x4E86;&#x90A3;&#x4E48;&#x4E45;&#xFF0C;&#x8FD8;&#x5728;&#x90A3;&#x513F;&#x7814;&#x7A76;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x53BB;&#x5410;&#x69FD;jquery&#xFF0C;&#x8BF4;&#x5B83;&#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x73A9;&#x513F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x524D;&#x7AEF;&#x6572;&#x4EE3;&#x7801;&#x7684;&#x4F60;&#x5E94;&#x8BE5;&#x53BB;&#x7814;&#x7A76;js&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x6846;&#x67B6;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7B49;&#x7B49;&#xFF0C;&#x53CD;&#x6B63;&#x4F60;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x5728;&#x641E;&#x7684;&#x4E1C;&#x897F;&#x522B;&#x4EBA;&#x542C;&#x4E86;&#x89C9;&#x5F97;&#x9AD8;&#x5927;&#x4E0A;&#x3001;&#x4E0D;&#x660E;&#x89C9;&#x5389;&#x5C31;&#x5BF9;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x73B0;&#x8C61;&#x4E5F;&#x4E0D;&#x80FD;&#x8BF4;&#x4E0D;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD5;&#x7ADF;&#x8FD8;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x4E5F;&#x662F;&#x6D6E;&#x8E81;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x9AD8;&#x624B;&#x7528;&#x6811;&#x53F6;&#x90FD;&#x80FD;&#x6740;&#x4EBA;&#xFF0C;&#x4F60;&#x5374;&#x4E00;&#x76F4;&#x53EA;&#x60F3;&#x8981;&#x7EDD;&#x4E16;&#x597D;&#x5251;&#xFF0C;&#x5728;&#x9119;&#x89C6;&#x81EA;&#x5DF1;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x524D;&#x8FDB;&#x4E0D;&#x6B62;~&#x95EE;&#x9898;&#x662F;&#x4F60;&#x4E5F;&#x987A;&#x4FBF;&#x9119;&#x89C6;&#x4E86;&#x522B;&#x4EBA;&#xFF0C;&#x5475;&#x5475;&#x3002;</p></div><p class="readmore"><a href="/2014/10/03/你不该忽视的小问题之margin叠加篇/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/08/30/万丈高楼平地起——实践为王，应需而生/">万丈高楼平地起——实践为王，应需而生</a></h2><div class="post-meta">2014-08-30</div><div class="post-content"><p>&#x5728;&#x6587;&#x7AE0;&#x5F00;&#x5934;&#xFF0C;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF08;&#x54EA;&#x513F;&#x6765;&#x7684;&#x60EF;&#x4F8B;~&#xFF09;&#xFF0C;&#x5148;&#x95F2;&#x804A;&#x4E00;&#x4E0B;&#x6292;&#x53D1;&#x4E00;&#x70B9;&#x70B9;&#x611F;&#x60F3;&#x5427;&#x3002;</p></div><p class="readmore"><a href="/2014/08/30/万丈高楼平地起——实践为王，应需而生/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/08/16/初谈怎样更好的去规划CSS/">初谈怎样更好的去规划CSS</a></h2><div class="post-meta">2014-08-16</div><div class="post-content"><p>&#x6211;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x90FD;&#x8C08;&#x4E0D;&#x4E0A;&#x7684;&#x4E0D;&#x5408;&#x683C;&#x7684;&#x524D;&#x7AEF;~&#x4F46;&#x8FD8;&#x7B97;&#x662F;&#x4E2A;&#x6709;&#x70B9;&#x8FFD;&#x6C42;&#x3001;&#x4E0D;&#x65AD;&#x524D;&#x8FDB;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x5408;&#x7406;&#x3001;&#x66F4;&#x9AD8;&#x6548;&#x3001;&#x66F4;&#x4F18;&#x7F8E;&#x3002;&#x4E3A;&#x4E86;&#x7167;&#x987E;&#x4E00;&#x4E0B;&#x57FA;&#x7840;&#x7A0D;&#x5FAE;&#x8584;&#x5F31;&#x4E00;&#x4E9B;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4F1A;&#x4ECE;&#x6D45;&#x5230;&#x6DF1;&#x7684;&#x9010;&#x6B65;&#x53BB;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E8B;&#x513F;&#x3002;</p></div><p class="readmore"><a href="/2014/08/16/初谈怎样更好的去规划CSS/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/08/09/你还在坚持吗？~/">你还在坚持吗？</a></h2><div class="post-meta">2014-08-09</div><div class="post-content"><p>&#x8FD1;&#x671F;&#x7684;&#x5DE5;&#x4F5C;&#x4F9D;&#x7136;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#x65B0;&#x4E8B;&#x7269;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x89C9;&#x5F97;&#x538B;&#x529B;&#x5C71;&#x5927;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x90FD;&#x633A;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6210;&#x957F;&#x7684;&#x5FC5;&#x7ECF;&#x4E4B;&#x8DEF;&#x3002;&#x5404;&#x65B9;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x4ECD;&#x5728;&#x6301;&#x7EED;&#x7740;&#xFF0C;&#x4F46;&#x4F3C;&#x4E4E;&#x4ECD;&#x7136;&#x654C;&#x4E0D;&#x8FC7;&#x65F6;&#x95F4;&#x5BF9;&#x8010;&#x6027;&#x7684;&#x8003;&#x9A8C;~&#x8FD8;&#x597D;&#xFF0C;&#x6211;&#x8FD8;&#x5728;&#x575A;&#x6301;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x4E00;&#x76F4;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x3002;</p></div><p class="readmore"><a href="/2014/08/09/你还在坚持吗？~/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/08/09/再谈移动页面之移动开发方面新的小收获/">再谈移动页面之移动开发方面新的小收获</a></h2><div class="post-meta">2014-08-09</div><div class="post-content"><p>&#x4E0A;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x9879;&#x76EE;&#x5DF2;&#x7ECF;&#x662F;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x7684;&#x4E8B;&#x4E86;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x672C;&#x60F3;&#x90A3;&#x65F6;&#x5019;&#x5C31;&#x8D81;&#x70ED;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x5FC3;&#x7EEA;&#x5404;&#x79CD;&#x6CE2;&#x6298;&#xFF0C;&#x803D;&#x6401;&#x5230;&#x73B0;&#x5728;&#x3002;&#x4E89;&#x53D6;&#x80FD;&#x591F;&#x6700;&#x5927;&#x53EF;&#x80FD;&#x7684;&#x53BB;&#x6316;&#x6398;&#x8BB0;&#x5FC6;&#x628A;&#x5B83;&#x4EEC;&#x6316;&#x51FA;&#x6765;&#x5427;&#xFF01;~</p></div><p class="readmore"><a href="/2014/08/09/再谈移动页面之移动开发方面新的小收获/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/">初接触移动开发可能遇到的一部分问题（一无所知的可以看看）</a></h2><div class="post-meta">2014-07-05</div><div class="post-content"><h2 id="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"><a href="#&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"></a>&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;</h2><p>&#x662F;&#x7684;&#xFF0C;&#x7535;&#x8111;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5927;&#x81F4;&#x662F;&#x80CC;&#x666F;&#x5BBD;&#x5EA6;100%&#xFF0C;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x5C45;&#x4E2D;&#xFF0C;&#x5206;&#x680F;&#x5E03;&#x5C40;&#x6D6E;&#x52A8;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x5185;&#x5916;&#x8FB9;&#x8DDD;&#x7B49;&#x4FBF;&#x53EF;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x5230;&#x4E86;&#x79FB;&#x52A8;&#x7AEF;&#x5462;&#xFF1F;&#x5C4F;&#x5E55;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x5C0F;&#xFF0C;&#x4F60;&#x522B;&#x544A;&#x8BC9;&#x6211;&#x8981;&#x628A;&#x56FE;&#x7247;&#x548C;&#x6587;&#x5B57;&#x90FD;&#x8C03;&#x6574;&#x5230;&#x5F88;&#x5C0F;&#x7136;&#x540E;&#x628A;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x7ECF;&#x9A8C;&#x518D;&#x5168;&#x90E8;&#x642C;&#x8FC7;&#x6765;&#xFF0C;&#x663E;&#x7136;&#x4E0D;&#x9760;&#x8C31;&#xFF0C;&#x672C;&#x8EAB;&#x624B;&#x673A;&#x7F51;&#x9875;&#x6709;&#x7740;&#x5C4F;&#x5E55;&#x5C0F;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4FFA;&#x5C31;&#x610F;&#x5473;&#x7740;&#x7A7A;&#x95F4;&#x975E;&#x5E38;&#x5B9D;&#x8D35;&#xFF0C;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5730;&#x65B9;&#x7ED9;&#x4F60;&#x7559;&#x767D;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x533A;&#x57DF;&#x8981;&#x4E48;&#x53EF;&#x64CD;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x7528;&#x6765;&#x5C55;&#x793A;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x611F;&#x5B98;&#x548C;&#x64CD;&#x4F5C;&#x4FBF;&#x5229;&#x3002;</p></div><p class="readmore"><a href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/07/04/新工作一个月，深圳工作一周年记/">新工作一个月，深圳工作一周年记</a></h2><div class="post-meta">2014-07-04</div><div class="post-content"><p>&#x524D;&#x51E0;&#x5929;&#x9519;&#x8FC7;&#x4E86;&#x6BD5;&#x4E1A;&#x548C;&#x6765;&#x6DF1;&#x5733;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x4ECA;&#x5929;&#x4E00;&#x770B;&#x65F6;&#x95F4;&#xFF0C;&#x6070;&#x662F;&#x5DE5;&#x4F5C;&#x4E00;&#x5468;&#x5E74;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x80FD;&#x518D;&#x9519;&#x8FC7;&#x4E86;~</p></div><p class="readmore"><a href="/2014/07/04/新工作一个月，深圳工作一周年记/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/07/04/inser工作一月/">inser工作一月</a></h2><div class="post-meta">2014-07-04</div><div class="post-content"><p>&#x8F9E;&#x53BB;&#x65E7;&#x7684;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x6CA1;&#x60F3;&#x8FC7;&#x518D;&#x6B21;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x521B;&#x4E1A;&#x578B;&#x516C;&#x53F8;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x4EBA;&#x4E0D;&#x60F3;&#x53BB;&#x8FFD;&#x6C42;&#x884C;&#x4E1A;&#x91CC;&#x7684;&#x201C;&#x9AD8;&#x5BCC;&#x5E05;&#x201D;&#x751A;&#x81F3;&#x5DE8;&#x5934;&#xFF0C;&#x60F3;&#x53BB;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x73AF;&#x5883;&#x7ED9;&#x81EA;&#x5DF1;&#x9540;&#x91D1;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x597D;&#x7684;&#x73AF;&#x5883;&#x548C;&#x5F85;&#x9047;&#xFF0C;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x53EA;&#x7ED9;&#x8DB3;&#x591F;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x51C6;&#x5907;&#x7684;&#xFF0C;&#x5F53;&#x4F60;&#x6EE1;&#x6000;&#x4FE1;&#x5FC3;&#x548C;&#x70ED;&#x5FF1;&#x7684;&#x53BB;&#xFF0C;&#x751A;&#x81F3;&#x80CC;&#x540E;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x4E0D;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x52AA;&#x529B;&#x53BB;&#x60F3;&#x4E3A;&#x81EA;&#x5DF1;&#x4E89;&#x53D6;&#x54EA;&#x6015;&#x4E00;&#x70B9;&#x5E0C;&#x671B;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x90FD;&#x8D77;&#x4E0D;&#x4E86;&#x591A;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x516C;&#x53F8;&#x4E0D;&#x662F;&#x6536;&#x517B;&#x6240;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7AD9;&#x5728;&#x8001;&#x677F;&#x6216;&#x8005;HR&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x60F3;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x804C;&#x4F4D;&#x540D;&#x989D;&#x4E5F;&#x662F;&#x6709;&#x9650;&#x800C;&#x4E14;&#x5B9D;&#x8D35;&#x7684;&#xFF0C;&#x7406;&#x5E94;&#x4E0D;&#x5BF9;&#x4EFB;&#x4F55;&#x4E0D;&#x8FBE;&#x8981;&#x6C42;&#x7684;&#x4EBA;&#x624B;&#x8F6F;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x88AB;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x592A;&#x591A;&#x7684;&#x90C1;&#x95F7;&#x548C;&#x62B1;&#x6028;&#xFF0C;&#x90A3;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x4E5F;&#x66FE;&#x6709;&#x670B;&#x53CB;&#x6258;&#x6211;&#x4ECB;&#x7ECD;&#x5DE5;&#x4F5C;&#xFF0C;&#x6700;&#x5E38;&#x542C;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x662F;&#xFF1A;&#x201C;&#x8BA9;&#x6211;&#x53BB;&#x5C31;&#x884C;&#xFF0C;&#x505A;&#x4EC0;&#x4E48;&#x90FD;&#x53EF;&#x4EE5;&#x201D;&#x3002;&#x90A3;&#x4E14;&#x95EE;&#xFF0C;&#x7A76;&#x7ADF;&#x8BA9;&#x4F60;&#x505A;&#x4EC0;&#x4E48;&#x5462;~&#x6CA1;&#x516C;&#x53F8;&#x4F1A;&#x63D0;&#x4F9B;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x6A21;&#x7CCA;&#x7684;&#x804C;&#x4F4D;&#xFF0C;&#x7ED9;&#x201C;&#x505A;&#x4EC0;&#x4E48;&#x90FD;&#x884C;&#x201D;&#x7684;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x8FD8;&#x662F;&#x60F3;&#x597D;&#x4F60;&#x5230;&#x5E95;&#x8981;&#x5E72;&#x561B;&#x5427;~</p></div><p class="readmore"><a href="/2014/07/04/inser工作一月/">阅读更多</a></p></div><nav class="page-navigator"><a class="extend prev" rel="prev" href="/page/2/">上一页</a><a class="page-number" href="/">1</a><a class="page-number" href="/page/2/">2</a><span class="page-number current">3</span><a class="page-number" href="/page/4/">4</a><a class="extend next" rel="next" href="/page/4/">下一页</a></nav></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/02/18/one/">博客搬新家了</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/14/自学者需要具备的基本技能和素质/">自学者需要具备的基本技能和素质</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/01/说说基本的布局观/">说说基本的布局观</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/09/13/醉牛前端诞生记/">醉牛前端诞生记</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/08/07/margin那些事儿/">图片以及其他替换元素的空隙问题</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/22/再谈css/">再谈css</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/19/浅析line-height和vertical/">浅析line-height和vertical</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/12/z-index和zoom这哥俩/">z-index和zoom这哥俩</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/05/09/小叙透明/">小叙透明</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/04/18/图片以及其他替换元素的空隙问题/">图片以及其他替换元素的空隙问题</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>