<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="经历," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x524D;&amp;#x8A00;&amp;#x8BF4;&amp;#x5230;&amp;#x524D;&amp;#x7AEF;&amp;#x5BFC;&amp;#x822A;&amp;#x7AD9;&amp;#xFF0C;&amp;#x65E9;&amp;#x8BFB;&amp;#x541B;&amp;#x5728;11&amp;#x5E74;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x5C31;&amp;#x505A;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;ux265.net&amp;#x76">
<meta property="og:type" content="article">
<meta property="og:title" content="前端早读课专访">
<meta property="og:url" content="http://yoursite.com/2015/10/23/zaoduke-visit/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x8BF4;&amp;#x5230;&amp;#x524D;&amp;#x7AEF;&amp;#x5BFC;&amp;#x822A;&amp;#x7AD9;&amp;#xFF0C;&amp;#x65E9;&amp;#x8BFB;&amp;#x541B;&amp;#x5728;11&amp;#x5E74;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x5C31;&amp;#x505A;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;ux265.net&amp;#x76">
<meta property="og:updated_time" content="2016-02-26T14:06:00.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="前端早读课专访">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x8A00;&amp;#x8BF4;&amp;#x5230;&amp;#x524D;&amp;#x7AEF;&amp;#x5BFC;&amp;#x822A;&amp;#x7AD9;&amp;#xFF0C;&amp;#x65E9;&amp;#x8BFB;&amp;#x541B;&amp;#x5728;11&amp;#x5E74;&amp;#x7684;&amp;#x65F6;&amp;#x5019;&amp;#x5C31;&amp;#x505A;&amp;#x4E86;&amp;#x4E00;&amp;#x4E2A;ux265.net&amp;#x76">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 前端早读课专访 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                前端早读课专访
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-10-23T00:00:00+08:00" content="2015-10-23">
              2015-10-23
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/分享交流/" itemprop="url" rel="index">
                    <span itemprop="name">分享交流</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x524D;&#x8A00;"><a href="#&#x524D;&#x8A00;" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h2><p>&#x8BF4;&#x5230;&#x524D;&#x7AEF;&#x5BFC;&#x822A;&#x7AD9;&#xFF0C;&#x65E9;&#x8BFB;&#x541B;&#x5728;11&#x5E74;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x505A;&#x4E86;&#x4E00;&#x4E2A;ux265.net&#x7684;&#xFF0C;&#x4F46;&#x540E;&#x9762;&#x7531;&#x4E8E;&#x7EF4;&#x62A4;&#x7684;&#x529B;&#x5EA6;&#x539F;&#x56E0;&#xFF0C;&#x6CA1;&#x5728;&#x7EE7;&#x7EED;&#x505A;&#x4E0B;&#x53BB;&#x4E86;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x8981;&#x804A;&#x7684;&#x8FD9;&#x4E2A;&#x4EBA;&#xFF0C;&#x662F;&#x524D;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5728;&#x5FAE;&#x535A;&#x4E0A;&#x88AB;&#x5404;&#x5927;&#x5FAE;&#x535A;&#x53F7;&#x63A8;&#x8350;&#x7684;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x5BFC;&#x822A;&#x7AD9;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#x7075;&#x611F;_idea&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4ECA;&#x5929;&#x5C31;&#x6765;&#x8BA9;&#x4ED6;&#x6765;&#x5206;&#x4EAB;&#x8FD9;&#x4E2A;&#x5BFC;&#x822A;&#x7AD9;&#x662F;&#x5982;&#x4F55;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
<p>&#x5148;&#x6765;&#x8BA4;&#x8BC6;&#x4E0B;&#x8FD9;&#x4E2A;&#x4EBA;&#xFF1A;<br>&#x6635;&#x79F0;&#xFF1A;&#x7075;&#x611F;_idea&#xFF0C;&#x73B0;&#x4EFB;&#x804C;&#x4E8E;&#x817E;&#x8BAF;&#x7406;&#x8D22;&#x901A;&#x4EA7;&#x54C1;&#x90E8;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7EC4;<br>&#x804C;&#x4F4D;&#xFF1A;UI&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;<br>&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#xFF1A;&#x8D1F;&#x8D23;&#x7406;&#x8D22;&#x901A;&#x65E5;&#x5E38;&#x6D3B;&#x52A8;&#x9875;&#x7684;UI&#x5F00;&#x53D1;&#x548C;&#x7406;&#x8D22;&#x901A;&#x5B98;&#x7F51;&#x7684;&#x7EF4;&#x62A4;<br>&#x5F00;&#x6E90;&#x9879;&#x76EE;&#xFF1A;&#x9189;&#x725B;&#x524D;&#x7AEF;&#x7F51;&#x5740;&#x5BFC;&#x822A;<a href="http://f2er.club/" target="_blank" rel="external">http://f2er.club/</a></p>
<h2 id="&#x7531;&#x6765;"><a href="#&#x7531;&#x6765;" class="headerlink" title="&#x7531;&#x6765;"></a>&#x7531;&#x6765;</h2><p>&#x73B0;&#x5728;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x4E0D;&#x7BA1;&#x662F;&#x4ECE;&#x4E1A;&#x8005;&#x8FD8;&#x662F;&#x666E;&#x901A;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x90FD;&#x5DF2;&#x7ECF;&#x6216;&#x8005;&#x6B63;&#x5728;&#x88AB;&#x5B83;&#x7684;&#x5A01;&#x529B;&#x6240;&#x9707;&#x64BC;&#x5E76;&#x4E14;&#x53D7;&#x76CA;&#x3002;&#x4ECE;&#x5F53;&#x5E74;&#x521D;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x8001;&#x5E08;&#x5F00;&#x73A9;&#x7B11;&#x8BF4;&#x4E0D;&#x7528;&#x51FA;&#x95E8;&#x5C31;&#x53EF;&#x4EE5;&#x8D2D;&#x7269;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x6210;&#x4E86;&#x5BB6;&#x5E38;&#x4FBF;&#x996D;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x66FE;&#x6709;&#x8FC7;&#x4E00;&#x4E2A;&#x201C;&#x795E;&#x5947;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#x2014;&#x2014;&#x201C;&#x5982;&#x679C;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x80FD;&#x5E72;&#x561B;&#xFF0C;&#x5C31;&#x597D;&#x4E86;&#x201D;&#x3002;&#x73B0;&#x5728;&#x90FD;&#x5728;&#x4E00;&#x6B65;&#x6B65;&#x7684;&#x6210;&#x4E3A;&#x73B0;&#x5B9E;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x626F;&#x8FD9;&#x4E9B;&#x5462;&#xFF0C;&#x8C8C;&#x4F3C;&#x8DDF;&#x8BDD;&#x9898;&#x65E0;&#x5173;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#xFF0C;&#x90A3;&#x4E2A;&#x7406;&#x60F3;&#x4E2D;&#x7684;&#x201C;&#x4E1C;&#x897F;&#x201D;&#xFF0C;&#x8BF4;&#x4E13;&#x4E1A;&#x70B9;&#x5C31;&#x662F;&#x4EA7;&#x54C1;&#x3002;&#x6211;&#x4E5F;&#x66FE;&#x505A;&#x8FC7;&#x505A;&#x4E00;&#x6B3E;&#x5B8C;&#x7F8E;&#x7684;&#x4EA7;&#x54C1;&#x7136;&#x540E;&#x66B4;&#x5BCC;&#x7684;&#x7F8E;&#x68A6;&#xFF0C;&#x663E;&#x7136;&#x76EE;&#x524D;&#x8FD8;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#x3002;&#x90A3;&#x4E48;&#x4F5C;&#x4E3A;&#x524D;&#x7AEF;&#x4ECE;&#x4E1A;&#x8005;&#xFF0C;&#x6211;&#x6BD4;&#x90A3;&#x4E9B;&#x5165;&#x884C;&#x65F6;&#x95F4;&#x66F4;&#x77ED;&#xFF0C;&#x548C;&#x5E73;&#x65F6;&#x4E0D;&#x592A;&#x5173;&#x6CE8;&#x884C;&#x4E1A;&#x52A8;&#x6001;&#x7684;&#x540C;&#x884C;&#x4EEC;&#x53EF;&#x80FD;&#x63A5;&#x89E6;&#x7684;&#x3001;&#x4E86;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#x66F4;&#x591A;&#xFF0C;&#x6211;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x4E3A;&#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x5417;&#xFF1F;&#x4E8E;&#x662F;&#x5C31;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x7684;&#x601D;&#x8003;&#x3002;</p>
<h2 id="&#x601D;&#x8003;&#x7528;&#x52A0;&#x6CD5;&#xFF0C;&#x505A;&#x4E8B;&#x7528;&#x51CF;&#x6CD5;"><a href="#&#x601D;&#x8003;&#x7528;&#x52A0;&#x6CD5;&#xFF0C;&#x505A;&#x4E8B;&#x7528;&#x51CF;&#x6CD5;" class="headerlink" title="&#x601D;&#x8003;&#x7528;&#x52A0;&#x6CD5;&#xFF0C;&#x505A;&#x4E8B;&#x7528;&#x51CF;&#x6CD5;"></a>&#x601D;&#x8003;&#x7528;&#x52A0;&#x6CD5;&#xFF0C;&#x505A;&#x4E8B;&#x7528;&#x51CF;&#x6CD5;</h2><p>&#x5B66;&#x4E60;&#x524D;&#x7AEF;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#xFF0C;&#x6211;&#x8DDF;&#x5F88;&#x591A;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x901B;&#x4E86;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#xFF0C;&#x627E;&#x4E86;&#x5F88;&#x591A;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x60F3;&#x628A;&#x5B83;&#x4EEC;&#x5206;&#x4EAB;&#x51FA;&#x53BB;&#xFF0C;&#x4E8E;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;QQ&#x7FA4;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x81EA;&#x5DF1;&#x5199;&#x4E86;&#x4E2A;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x717D;&#x52A8;&#x529B;&#x7684;&#x6587;&#x6848;&#xFF0C;&#x5230;&#x7FA4;&#x91CC;&#x6216;&#x8005;&#x8D34;&#x5427;&#x91CC;&#x53D1;&#x4E86;&#x51E0;&#x6B21;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x4EBA;&#x591A;&#x4E86;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x5F88;&#x8FFD;&#x6C42;&#x4EBA;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x540E;&#x6765;&#x5C31;&#x6CA1;&#x600E;&#x4E48;&#x63A8;&#x8FC7;&#x3002;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#x6211;&#x5DF2;&#x7ECF;&#x5728;&#x7FA4;&#x91CC;&#x5206;&#x4EAB;&#x8FC7;&#x5F88;&#x591A;&#x597D;&#x7684;&#x8D44;&#x6599;&#x548C;&#x6587;&#x7AE0;&#xFF0C;&#x5F88;&#x591A;&#x4F1A;&#x8BAE;&#x548C;&#x6D3B;&#x52A8;&#x7684;&#x8D44;&#x6599;&#x4E5F;&#x90FD;&#x662F;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x732E;&#x4E0A;&#x3002;&#x6162;&#x6162;&#x7684;&#x6211;&#x53D1;&#x73B0;&#xFF0C;&#x8FD9;&#x6837;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x56DE;&#x7B54;&#x8FC7;&#x5F88;&#x591A;&#x6B21;&#x7684;&#x95EE;&#x9898;&#x603B;&#x8FD8;&#x6709;&#x4EBA;&#x5728;&#x95EE;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x67D0;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#x5B58;&#x5728;&#x6216;&#x8005;&#x627E;&#x4E0D;&#x5230;&#x67D0;&#x4E2A;&#x8D44;&#x6599;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x6B21;&#x90FD;&#x91CD;&#x65B0;&#x8BF4;&#x4E00;&#x904D;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x65B0;&#x5E2E;&#x4ED6;&#x627E;&#x4E00;&#x904D;&#xFF0C;&#x8FD9;&#x6210;&#x672C;&#x5C31;&#x5927;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x89C9;&#x5F97;&#x6CA1;&#x5FC5;&#x8981;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x5C31;&#x5F00;&#x59CB;&#x60F3;&#x522B;&#x7684;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x6211;&#x6700;&#x521D;&#x60F3;&#x505A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5B66;&#x4E60;&#x7F51;&#x7AD9;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x6587;&#x7AE0;&#xFF0C;&#x6709;&#x6559;&#x7A0B;&#xFF0C;&#x6709;&#x5F88;&#x6E05;&#x6670;&#x7684;&#x680F;&#x76EE;&#x5206;&#x7C7B;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x6709;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8DDF;&#x76F8;&#x5173;&#x7684;&#x4EBA;&#x8FDB;&#x884C;&#x5B9E;&#x65F6;&#x6C9F;&#x901A;&#x3002;&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x9F50;&#x5168;&#x7684;&#x5B66;&#x4E60;&#x8D44;&#x6599;&#x4F9B;&#x5927;&#x5BB6;&#x67E5;&#x627E;&#xFF0C;&#x63D0;&#x4F9B;&#x5F88;&#x4FBF;&#x6377;&#x7684;&#x6E20;&#x9053;&#x4E3A;&#x5927;&#x5BB6;&#x89E3;&#x60D1;&#x3002;&#x4F7F;&#x5F97;&#x4E00;&#x4E9B;&#x88AB;&#x95EE;&#x4E86;&#x65E0;&#x6570;&#x904D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x88AB;&#x627E;&#x4E86;&#x65E0;&#x6570;&#x904D;&#x7684;&#x8D44;&#x6599;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x53CD;&#x590D;&#x7684;&#x53BB;&#x8017;&#x8D39;&#x5927;&#x5BB6;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5B83;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x4F1A;&#x6536;&#x8D39;&#xFF0C;&#x6211;&#x5BF9;&#x4E00;&#x6B3E;&#x4EA7;&#x54C1;&#x7684;&#x8FFD;&#x6C42;&#x5C31;&#x662F;&#x96F6;&#x95E8;&#x69DB;&#xFF0C;&#x4F53;&#x9A8C;&#x597D;&#xFF0C;&#x5185;&#x5BB9;&#x5145;&#x5B9E;&#x3002;</p>
<p>&#x53EF;&#x662F;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x4E94;&#x810F;&#x4FF1;&#x5168;&#x5B8C;&#x6574;&#x7684;&#x7F51;&#x7AD9;&#x554A;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x5168;&#x80FD;&#x6218;&#x58EB;&#xFF0C;&#x81EA;&#x5DF1;&#x53EF;&#x641E;&#x4E0D;&#x5B9A;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x5C31;&#x5230;&#x81EA;&#x5DF1;&#x52A0;&#x7684;&#x4E00;&#x4E9B;&#x7FA4;&#x91CC;&#x53BB;&#x53D1;&#x5E7F;&#x544A;&#x4E86;&#x2026;&#x4E5F;&#x662F;&#x627E;&#x6765;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#xFF0C;&#x751A;&#x81F3;&#x5206;&#x6210;&#x4E86;&#x8BBE;&#x8BA1;&#x3001;&#x524D;&#x7AEF;&#x3001;&#x540E;&#x53F0;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x5462;&#xFF0C;&#x7EC8;&#x7A76;&#x8FD8;&#x662F;&#x9047;&#x5230;&#x4E86;&#x4E24;&#x4E2A;&#x62E6;&#x8DEF;&#x864E;&#xFF0C;&#x6C9F;&#x901A;&#x548C;&#x6267;&#x884C;&#xFF0C;&#x6162;&#x6162;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x592D;&#x6298;&#x4E86;&#x3002;&#x53EF;&#x662F;&#x6211;&#x4E0D;&#x7518;&#x5FC3;&#xFF0C;&#x5C31;&#x60F3;&#x505A;&#x51FA;&#x4E2A;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#x51FA;&#x6765;&#x3002;&#x4E8E;&#x662F;&#x5F00;&#x59CB;&#x65B0;&#x4E00;&#x8F6E;&#x7684;&#x601D;&#x8003;&#x3002;</p>
<h2 id="&#x4ECE;&#x96CF;&#x5F62;&#x5230;&#x6210;&#x5F62;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x5C31;&#x4E0D;&#x7B80;&#x5355;"><a href="#&#x4ECE;&#x96CF;&#x5F62;&#x5230;&#x6210;&#x5F62;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x5C31;&#x4E0D;&#x7B80;&#x5355;" class="headerlink" title="&#x4ECE;&#x96CF;&#x5F62;&#x5230;&#x6210;&#x5F62;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x5C31;&#x4E0D;&#x7B80;&#x5355;"></a>&#x4ECE;&#x96CF;&#x5F62;&#x5230;&#x6210;&#x5F62;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x5C31;&#x4E0D;&#x7B80;&#x5355;</h2><p>&#x590D;&#x6742;&#x7684;&#x7F51;&#x7AD9;&#x505A;&#x4E0D;&#x4E86;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x505A;&#x7B80;&#x5355;&#x7684;&#x5417;&#xFF1F;&#x60F3;&#x8FC7;&#x505A;&#x50CF;html&#x3001;css&#x3001;js&#x5728;&#x7EBF;&#x624B;&#x518C;&#x4E4B;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x5DF2;&#x7ECF;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x4F3C;&#x4E4E;&#x518D;&#x9020;&#x4E2A;&#x8F6E;&#x5B50;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x610F;&#x4E49;&#xFF0C;&#x4E5F;&#x60F3;&#x8FC7;&#x5199;&#x7535;&#x5B50;&#x4E66;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x9700;&#x8981;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x7684;&#xFF0C;&#x5468;&#x671F;&#x957F;&#xFF0C;&#x5F62;&#x5F0F;&#x53D7;&#x9650;&#xFF0C;&#x5185;&#x5BB9;&#x4E5F;&#x53D7;&#x9650;&#x3002;&#x7136;&#x540E;&#x6211;&#x5C31;&#x56DE;&#x60F3;&#x4E86;&#x4E00;&#x4E0B;&#x5E73;&#x65F6;&#x81EA;&#x5DF1;&#x6216;&#x8005;&#x540C;&#x884C;&#x6240;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x9700;&#x8981;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4ECE;&#x9700;&#x6C42;&#x51FA;&#x53D1;&#xFF0C;&#x800C;&#x975E;&#x6700;&#x7EC8;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5BF9;&#x7684;&#xFF0C;&#x4E00;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3001;&#x7EC4;&#x4EF6;&#x3001;&#x5E93;&#x7B49;&#x7B49;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x793E;&#x533A;&#x5E73;&#x53F0;&#xFF0C;&#x4E1A;&#x754C;&#x77E5;&#x540D;&#x725B;&#x4EBA;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x867D;&#x7136;&#x5927;&#x5BB6;&#x591A;&#x591A;&#x5C11;&#x5C11;&#x90FD;&#x4F1A;&#x77E5;&#x9053;&#x4E00;&#x4E9B;&#xFF0C;&#x4E5F;&#x4F1A;&#x81EA;&#x5DF1;&#x6709;&#x6536;&#x85CF;&#xFF0C;&#x4F46;&#x6211;&#x8003;&#x8651;&#x7684;&#x8FD8;&#x662F;&#xFF0C;&#x591F;&#x4E0D;&#x591F;&#x5168;&#xFF0C;&#x8981;&#x7528;&#x7684;&#x65F6;&#x5019;&#x627E;&#x8D77;&#x6765;&#x591F;&#x4E0D;&#x591F;&#x65B9;&#x4FBF;&#xFF0C;&#x8FD9;&#x4E24;&#x70B9;&#x5C31;&#x662F;&#x6838;&#x5FC3;&#x4EF7;&#x503C;&#x6240;&#x5728;&#xFF0C;&#x600E;&#x6837;&#x505A;&#x5230;&#x5168;&#xFF1F;&#x4E0D;&#x65AD;&#x79EF;&#x7D2F;&#x52A0;&#x96C6;&#x601D;&#x5E7F;&#x76CA;&#xFF0C;&#x600E;&#x6837;&#x6700;&#x65B9;&#x4FBF;&#xFF1F;&#x505A;&#x6210;&#x5206;&#x7C7B;&#x6E05;&#x6670;&#x7684;&#x7F51;&#x5740;&#x5BFC;&#x822A;&#x653E;&#x5230;&#x6536;&#x85CF;&#x680F;&#x3002;&#x518D;&#x52A0;&#x4E0A;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x6709;&#x5229;&#x7528;&#x767E;&#x5EA6;&#x7684;&#x9996;&#x9875;&#x53BB;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x5B58;&#x653E;&#x5BFC;&#x822A;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x5C31;&#x5F00;&#x59CB;&#x6784;&#x601D;&#x548C;&#x884C;&#x52A8;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x5728;&#x6700;&#x521D;&#x505A;&#x7684;&#x65F6;&#x5019;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x5185;&#x5BB9;&#x5206;&#x7C7B;&#x4E5F;&#x6CA1;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x90FD;&#x662F;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x5BFB;&#x627E;&#xFF0C;&#x518D;&#x52A0;&#x8FDB;&#x53BB;&#x7684;&#xFF0C;UI&#x53C2;&#x8003;&#x4E86;&#x4E00;&#x70B9;&#x522B;&#x7684;&#x6210;&#x719F;UI&#xFF0C;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x4ECE;&#x6587;&#x6848;&#x5230;&#x56FE;&#x6807;&#xFF0C;&#x5230;&#x7ED3;&#x6784;&#x90FD;&#x662F;&#x4E00;&#x9488;&#x4E00;&#x7EBF;&#x7F16;&#x7EC7;&#x800C;&#x6210;&#x3002;&#x6709;&#x4EBA;&#x95EE;&#x8FC7;&#x6211;&#xFF1A;&#x5C31;&#x53EA;&#x662F;link&#xFF1F;&#x6211;&#x8BF4;&#x662F;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x5355;&#xFF0C;&#x8981;&#x60F3;&#x505A;&#x597D;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x7B80;&#x5355;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x89C9;&#x5F97;&#x94FE;&#x63A5;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x5929;&#x7136;&#x4F18;&#x52BF;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x628A;&#x65B0;&#x7684;&#x597D;&#x8D44;&#x6E90;&#x52A0;&#x8FDB;&#x6765;&#xFF0C;&#x4E5F;&#x5C31;&#x53EA;&#x662F;&#x52A0;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x641E;&#x5B9A;&#xFF0C;&#x805A;&#x5408;&#x6210;&#x672C;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x4E5F;&#x662F;&#x6700;&#x5F3A;&#x5927;&#x3002;&#x7136;&#x540E;&#x6211;&#x8FD8;&#x5F88;&#x591A;&#x904D;&#x7684;&#x95EE;&#x8FC7;&#x81EA;&#x5DF1;&#xFF1A;&#x8981;&#x4E0D;&#x8981;&#x518D;&#x4E30;&#x5BCC;&#x70B9;&#xFF1F;&#x53EA;&#x505A;&#x94FE;&#x63A5;&#x5417;&#xFF1F;&#x53EA;&#x505A;&#x524D;&#x7AEF;&#x5417;&#xFF1F;&#x7136;&#x540E;&#x53C8;&#x4E00;&#x6B21;&#x6B21;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#xFF1A;&#x662F;&#x7684;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x628A;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#xFF0C;&#x5C31;&#x4E0D;&#x7B80;&#x5355;&#xFF0C;&#x4E13;&#x6CE8;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x8D8A;&#x505A;&#x8D8A;&#x597D;&#xFF0C;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x81EA;&#x5DF1;&#x5C31;&#x662F;&#x505A;&#x524D;&#x7AEF;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x628A;&#x5B83;&#x505A;&#x5F97;&#x201C;&#x6700;&#x4E13;&#x4E1A;&#x3001;&#x6700;&#x61C2;&#x4F60;&#x201D;&#x3002;</p>
<h2 id="&#x5206;&#x7C7B;&#x548C;&#x4F53;&#x9A8C;"><a href="#&#x5206;&#x7C7B;&#x548C;&#x4F53;&#x9A8C;" class="headerlink" title="&#x5206;&#x7C7B;&#x548C;&#x4F53;&#x9A8C;"></a>&#x5206;&#x7C7B;&#x548C;&#x4F53;&#x9A8C;</h2><p><strong>&#x5206;&#x7C7B;&#x65B9;&#x9762;</strong></p>
<p>&#x4ECE;&#x6700;&#x521D;&#x4E0A;&#x7EBF;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x5206;&#x7C7B;&#x88AB;&#x65B0;&#x52A0;&#x5165;&#x4E86;&#x8FDB;&#x6765;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x56E0;&#x4E3A;&#x6700;&#x521D;&#x6CA1;&#x6709;&#x60F3;&#x5230;&#x8981;&#x505A;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x56E0;&#x4E3A;&#x8D44;&#x6E90;&#x5F88;&#x5C11;&#xFF0C;&#x8FD8;&#x4E0D;&#x9002;&#x5408;&#x62FF;&#x6765;&#x505A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x5176;&#x5B9E;&#x4E0A;&#x7EBF;&#x4E4B;&#x524D;&#x5C31;&#x5728;&#x8FDB;&#x884C;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x51FA;&#x4E8E;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x8003;&#x8651;&#x5462;&#xFF1F;</p>
<p>&#x4E00;&#x3001;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x3001;&#x5B9E;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x548C;&#x5E38;&#x89C1;&#x95EE;&#x9898;&#x3001;&#x89E3;&#x51B3;&#x65B9;&#x6848;<br>&#x4E8C;&#x3001;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x76F8;&#x5173;&#x4E13;&#x4E1A;&#x5E72;&#x8D27;&#x7684;&#x6E20;&#x9053;<br>&#x4E09;&#x3001;&#x53EF;&#x4EE5;&#x53C2;&#x4E0E;&#x5176;&#x4E2D;&#x7684;&#x4E1A;&#x754C;&#x6D3B;&#x52A8;<br>&#x56DB;&#x3001;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x597D;&#x6559;&#x7A0B;<br>&#x4E94;&#x3001;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x548C;&#x501F;&#x9274;&#x7684;&#x56E2;&#x961F;/&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x3001;&#x535A;&#x6587;&#x3001;demo&#x7B49;</p>
<p>&#x4EE5;&#x4E0A;&#x5206;&#x7C7B;&#x57FA;&#x672C;&#x6DB5;&#x76D6;&#x4E86;&#x53EF;&#x4EE5;&#x805A;&#x96C6;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7F51;&#x7EDC;&#x8D44;&#x6E90;&#x5165;&#x53E3;</p>
<p><strong>&#x4F53;&#x9A8C;&#x65B9;&#x9762;</strong></p>
<p>&#x4E00;&#x3001;&#x8272;&#x5F69;&#x4E0D;&#x8981;&#x592A;&#x624E;&#x773C;<br>&#x4E8C;&#x3001;&#x54EA;&#x4E9B;&#x6700;&#x5E38;&#x7528;&#x5230;&#xFF0C;&#x653E;&#x5728;&#x524D;&#x9762;&#x6216;&#x8005;&#x6253;&#x5F00;&#x5C31;&#x662F;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x7A7A;&#x95F2;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x6162;&#x6162;&#x7FFB;&#x7FFB;&#x770B;<br>&#x4E09;&#x3001;&#x600E;&#x6837;&#x8BA9;&#x7528;&#x6237;&#x4E5F;&#x80FD;&#x591F;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x7684;&#x53C2;&#x4E0E;&#x8FDB;&#x6765;<br>&#x56DB;&#x3001;&#x70B9;&#x7F00;&#x6548;&#x679C;&#x9002;&#x5F53;&#x5C31;&#x597D;&#xFF0C;&#x8FC7;&#x72B9;&#x4E0D;&#x53CA;</p>
<p>&#x4E0A;&#x7EBF;&#x4E4B;&#x524D;&#x6709;&#x8FC7;&#x8C03;&#x6574;&#xFF0C;&#x4E0A;&#x7EBF;&#x4E4B;&#x540E;&#x6839;&#x636E;&#x5927;&#x5BB6;&#x7684;&#x53CD;&#x9988;&#x53C8;&#x6709;&#x4E00;&#x4E9B;&#x6539;&#x8FDB;&#xFF0C;&#x4EE5;&#x540E;&#x8FD8;&#x4F1A;&#x4E0D;&#x65AD;&#x7684;&#x6539;&#x5584;</p>
<h2 id="&#x4EBA;&#x751F;&#x5728;&#x4E8E;&#x6298;&#x817E;"><a href="#&#x4EBA;&#x751F;&#x5728;&#x4E8E;&#x6298;&#x817E;" class="headerlink" title="&#x4EBA;&#x751F;&#x5728;&#x4E8E;&#x6298;&#x817E;"></a>&#x4EBA;&#x751F;&#x5728;&#x4E8E;&#x6298;&#x817E;</h2><p>&#x5728;&#x5BFC;&#x822A;&#x53D1;&#x51FA;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x6709;&#x670B;&#x53CB;&#x8BF4;&#x6211;&#xFF0C;&#x4F60;&#x8FD8;&#x633A;&#x559C;&#x6B22;&#x6363;&#x817E;&#x7F51;&#x9875;&#x7684;&#x554A;&#xFF0C;&#x6211;&#x8BF4;&#x90A3;&#x5F53;&#x7136;&#xFF0C;&#x5C31;&#x662F;&#x5E72;&#x8FD9;&#x4E2A;&#x7684;&#x561B;&#x3002;&#x5176;&#x5B9E;&#x4E0D;&#x53EA;&#x662F;&#x7F51;&#x9875;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x505A;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x5C31;&#x5E94;&#x8BE5;&#x51FA;&#x4E8E;&#x7231;&#x597D;&#xFF0C;&#x73A9;&#x51FA;&#x4E50;&#x8DA3;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4EBA;&#x4EBA;&#x90FD;&#x6709;&#x60F0;&#x6027;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x5026;&#x6020;&#x671F;&#xFF0C;&#x6216;&#x8005;&#x79F0;&#x4E4B;&#x4E3A;&#x74F6;&#x9888;&#x3002;&#x600E;&#x4E48;&#x770B;&#x5F85;&#x74F6;&#x9888;&#x5462;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x662F;&#x4EBA;&#x6027;&#x7684;&#x5F31;&#x70B9;&#x5728;&#x4F5C;&#x602A;&#xFF0C;&#x8DDF;&#x6280;&#x672F;&#x672C;&#x8EAB;&#x5173;&#x7CFB;&#x4E0D;&#x5927;&#xFF0C;&#x4F60;&#x4E0D;&#x6562;&#x53BB;&#x5C1D;&#x8BD5;&#x65B0;&#x7684;&#x964C;&#x751F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x603B;&#x5728;&#x719F;&#x6089;&#x7684;&#x8303;&#x56F4;&#x5185;&#x6D3B;&#x52A8;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8FF7;&#x8DEF;&#xFF0C;&#x6C38;&#x8FDC;&#x53D1;&#x73B0;&#x4E0D;&#x4E86;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x627E;&#x4E0D;&#x5230;&#x65B0;&#x7684;&#x4E50;&#x8DA3;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x5E76;&#x4E0D;&#x662F;&#x9F13;&#x52B1;&#x4E00;&#x5473;&#x7684;&#x8FFD;&#x6C42;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x4EBA;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x4E8B;&#x7269;&#x7684;&#x8BA4;&#x77E5;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x7247;&#x9762;&#x7684;,&#x77E5;&#x8BC6;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x5F20;&#x62FC;&#x56FE;&#xFF0C;&#x7ECF;&#x5E38;&#x662F;&#x6CA1;&#x6709;&#x786E;&#x5B9A;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x6211;&#x4EEC;&#x627E;&#x5230;&#x4E00;&#x5757;&#x5C31;&#x5F80;&#x4E0A;&#x62FC;&#x4E00;&#x5757;&#xFF0C;&#x90FD;&#x662F;&#x9010;&#x6E10;&#x7684;&#x53BB;&#x5B8C;&#x5584;&#xFF0C;&#x4ECE;&#x5E7F;&#x5EA6;&#x3001;&#x6DF1;&#x5EA6;&#x3001;&#x7EC6;&#x5EA6;&#x3001;&#x7075;&#x6D3B;&#x5EA6;&#x3001;&#x6280;&#x5DE7;&#x3001;&#x91CF;&#x7EA7;&#x3001;&#x5F62;&#x5F0F;&#x7B49;&#xFF0C;&#x603B;&#x6709;&#x6211;&#x4EEC;&#x672A;&#x66FE;&#x89E6;&#x53CA;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x53BB;&#x5BFB;&#x627E;&#x548C;&#x63A2;&#x7D22;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x65E0;&#x6CD5;&#x524D;&#x8FDB;&#x4E00;&#x8BF4;&#xFF0C;&#x6562;&#x4E8E;&#x7A81;&#x7834;&#x81EA;&#x5DF1;&#xFF0C;&#x6562;&#x4E8E;&#x6298;&#x817E;~</p>
<h2 id="&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x65B9;&#x80FD;&#x6210;&#x4E8B;"><a href="#&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x65B9;&#x80FD;&#x6210;&#x4E8B;" class="headerlink" title="&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x65B9;&#x80FD;&#x6210;&#x4E8B;"></a>&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x65B9;&#x80FD;&#x6210;&#x4E8B;</h2><p>&#x8FD9;&#x53E5;&#x8BDD;&#x662F;&#x6211;&#x6700;&#x8FD1;&#x521A;&#x611F;&#x609F;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x5177;&#x4F53;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x7ED9;&#x4EBA;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x7B80;&#x5355;&#x8BF4;&#x53EF;&#x4EE5;&#x5F52;&#x4E3A;&#x4E09;&#x4E2A;&#x5B57;&#x201C;&#x60F3;&#x5F97;&#x7F8E;&#x201D;&#xFF0C;&#x5475;&#x5475;&#x3002;&#x60F3;&#x5F97;&#x7F8E;=&#x4E0D;&#x73B0;&#x5B9E;&#x5417;&#xFF1F;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#x3002;&#x60F3;&#x5F97;&#x7F8E;&#x4F1A;&#x5E26;&#x6765;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x9996;&#x5148;&#x662F;&#x601D;&#x8003;&#xFF0C;&#x601D;&#x8003;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x601D;&#x8003;&#x600E;&#x6837;&#x80FD;&#x591F;&#x628A;&#x5B83;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x65E2;&#x7136;&#x60F3;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E0D;&#x53BB;&#x52A8;&#x624B;&#x628A;&#x5B83;&#x505A;&#x51FA;&#x6765;&#x53C8;&#x618B;&#x5F97;&#x96BE;&#x53D7;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x4F1A;&#x6574;&#x7406;&#x601D;&#x8DEF;&#xFF0C;&#x7740;&#x624B;&#x89C4;&#x5212;&#xFF0C;&#x5C06;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x4E1C;&#x897F;&#x8054;&#x7CFB;&#x5B9E;&#x9645;&#xFF0C;&#x600E;&#x6837;&#x80FD;&#x5728;&#x73B0;&#x6709;&#x6761;&#x4EF6;&#x4E0B;&#x771F;&#x6B63;&#x7684;&#x628A;&#x5B83;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x505A;&#xFF0C;&#x8FB9;&#x505A;&#x8FB9;&#x8865;&#x5145;&#xFF0C;&#x8FB9;&#x4FEE;&#x6539;&#xFF0C;&#x8FD9;&#x5F53;&#x4E2D;&#x5FC5;&#x5B9A;&#x4F1A;&#x7ECF;&#x5386;&#x4E00;&#x4E9B;&#x7EA0;&#x7ED3;&#x7684;&#x601D;&#x60F3;&#x6597;&#x4E89;&#xFF0C;&#x8981;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF1F;&#x8FD9;&#x5757;&#x662F;&#x4E0D;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x91CD;&#x8981;&#x7684;&#xFF1F;&#x751A;&#x81F3;&#x505A;&#x5230;&#x4E00;&#x534A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56DE;&#x8FC7;&#x5934;&#x6765;&#x53BB;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x7684;&#x521D;&#x8877;&#xFF0C;&#x8FD9;&#x4E48;&#x8D39;&#x529B;&#x7684;&#x505A;&#x7684;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x4F55;&#x82E6;&#xFF1F;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x4EE5;&#x524D;&#x60F3;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x597D;&#x7684;idea&#x540E;&#x6765;&#x8981;&#x780D;&#x6389;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x75DB;&#x7684;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x6700;&#x7EC8;&#x7684;&#x5927;&#x5C40;&#xFF0C;&#x4F9D;&#x7136;&#x80FD;&#x575A;&#x5B9A;&#x7684;&#x8D70;&#x4E0B;&#x53BB;&#x3002;&#x201C;&#x7406;&#x60F3;&#x201D;&#x5C31;&#x662F;&#x575A;&#x6301;&#x53BB;&#x628A;&#x4E00;&#x4EF6;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x6210;&#xFF0C;&#x505A;&#x597D;&#x7684;&#x52A8;&#x529B;&#x6240;&#x5728;&#x3002;</p>
<h2 id="&#x5173;&#x4E8E;&#x8BFB;&#x4E66;"><a href="#&#x5173;&#x4E8E;&#x8BFB;&#x4E66;" class="headerlink" title="&#x5173;&#x4E8E;&#x8BFB;&#x4E66;"></a>&#x5173;&#x4E8E;&#x8BFB;&#x4E66;</h2><p>&#x6211;&#x672C;&#x4EBA;&#x4E70;&#x7684;&#x4E66;&#x4E0D;&#x7B97;&#x5C11;&#x4E86;&#xFF0C;&#x4E86;&#x89E3;&#x7684;&#x4E5F;&#x4E0D;&#x5C11;&#xFF0C;&#x5BFC;&#x822A;&#x4E0A;&#x9762;&#x5217;&#x51FA;&#x6765;&#x7684;&#x90A3;&#x4E9B;&#x4E66;&#x7C4D;&#xFF0C;&#x4E0D;&#x6562;&#x8BF4;&#x5168;&#x90E8;&#xFF0C;90%&#x90FD;&#x662F;&#x70ED;&#x9500;&#x7ECF;&#x5178;&#x4E66;&#x3002;&#x4E0D;&#x8FC7;&#x771F;&#x6B63;&#x80FD;&#x8BFB;&#x5F97;&#x8FDB;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5B9E;&#x9645;&#x8FD0;&#x7528;&#x4E2D;&#x7528;&#x5F97;&#x4E5F;&#x4E0D;&#x591A;&#xFF0C;&#x5B66;&#x4E60;&#x662F;&#x4E2A;&#x5F88;&#x5FAE;&#x5999;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x5438;&#x6536;&#x5230;&#x4E86;&#x591A;&#x5C11;&#xFF0C;&#x80FD;&#x505A;&#x51FA;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E0D;&#x53D6;&#x51B3;&#x4E8E;&#x4E66;&#x4E0A;&#x7684;&#x94C5;&#x5B57;&#xFF0C;&#x800C;&#x662F;&#x4F60;&#x672C;&#x8EAB;&#x7684;&#x6295;&#x5165;&#x7A0B;&#x5EA6;&#x548C;&#x601D;&#x8003;&#x6DF1;&#x5EA6;&#xFF0C;&#x8FD8;&#x5F88;&#x91CD;&#x8981;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5B9E;&#x8DF5;&#x3002;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x4E00;&#x6BB5;&#x6211;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x7684;&#x56DE;&#x7B54;&#xFF1A;</p>
<p>&#x201C;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x7684;&#x4EBA;&#x95EE;&#x7684;&#x6700;&#x591A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x63A8;&#x8350;&#x597D;&#x7F51;&#x7AD9;&#xFF0C;&#x597D;&#x7684;&#x5728;&#x7EBF;&#x6559;&#x7A0B;&#xFF0C;&#x597D;&#x7684;&#x4E66;&#x7C4D;&#x7B49;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x4F1A;&#x89C9;&#x5F97;&#x8BFE;&#x7A0B;&#x6216;&#x8005;&#x4E66;&#x7C4D;&#x7B80;&#x5355;&#xFF0C;&#x4ECB;&#x7ECD;&#x7684;&#x90FD;&#x662F;&#x6982;&#x5FF5;&#x6027;&#x6216;&#x7406;&#x8BBA;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6D45;&#x5C1D;&#x8F84;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x7EBF;&#x4E0A;&#x7684;&#x7F51;&#x7AD9;&#x6216;&#x8005;demo&#x6E90;&#x7801;&#xFF0C;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x590D;&#x6742;&#x2014;&#x2014;&#x77E5;&#x8BC6;&#x4E00;&#x770B;&#x90FD;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x5B9E;&#x9645;&#x5199;&#x4EE3;&#x7801;&#x5374;&#x6CA1;&#x6709;&#x601D;&#x8DEF;&#xFF0C;&#x66F4;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x6837;&#x5199;&#x662F;&#x66F4;&#x597D;&#x7684;&#xFF0C;&#x597D;&#x50CF;&#x4E8C;&#x8005;&#x4E4B;&#x95F4;&#x6709;&#x7740;&#x8DE8;&#x8D8A;&#x4E0D;&#x8FC7;&#x7684;&#x9E3F;&#x6C9F;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x5C31;&#x662F;&#x6709;&#x4E9B;&#x6D6E;&#x8E81;&#xFF0C;&#x7F3A;&#x4E4F;&#x5B9E;&#x8DF5;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x7406;&#x8BBA;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5B83;&#x80FD;&#x4FDD;&#x969C;&#x4F60;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x7684;&#x7CFB;&#x7EDF;&#x548C;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x4F46;&#x4E0D;&#x52A8;&#x624B;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;&#x201D;&#xFF08;&#x6709;&#x5220;&#x51CF;&#xFF09;</p>
<p>&#x4E66;&#x6709;&#x4F18;&#x52A3;&#x4E4B;&#x5206;&#x5417;&#xFF1F;&#x5F53;&#x7136;&#x6709;&#xFF0C;&#x4E0A;&#x9762;&#x8BF4;&#x4E0D;&#x53D6;&#x51B3;&#x4E8E;&#x5B83;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x80FD;&#x591F;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x6536;&#x83B7;&#x548C;&#x542F;&#x53D1;&#xFF0C;&#x5173;&#x952E;&#x770B;&#x4E66;&#x7C4D;&#x7684;&#x7AE0;&#x8282;&#x5185;&#x5BB9;&#x5B89;&#x6392;&#x3001;&#x793A;&#x4F8B;&#x548C;&#x8BED;&#x8A00;&#x63CF;&#x8FF0;&#xFF0C;&#x662F;&#x5426;&#x8DDF;&#x4F60;&#x73B0;&#x6709;&#x6C34;&#x5E73;&#x76F8;&#x543B;&#x5408;&#xFF0C;&#x662F;&#x5426;&#x80FD;&#x628A;&#x4F60;&#x5E26;&#x5165;&#x8FDB;&#x53BB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x8BF4;&#x597D;&#xFF0C;&#x90FD;&#x8BF4;&#x7ECF;&#x5178;&#x7684;&#x4E66;&#x5C31;&#x9002;&#x5408;&#x4F60;&#x9A6C;&#x4E0A;&#x62FF;&#x6765;&#x8BFB;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x6BCF;&#x672C;&#x4E66;&#x90FD;&#x4F1A;&#x6709;&#x5B83;&#x7684;&#x4FA7;&#x91CD;&#x548C;&#x8BE6;&#x7565;&#xFF0C;&#x4E5F;&#x90FD;&#x4F1A;&#x56E0;&#x4E3A;&#x4E66;&#x672C;&#x9650;&#x5236;&#xFF0C;&#x5185;&#x5BB9;&#x6709;&#x6240;&#x4FDD;&#x7559;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6BCF;&#x672C;&#x4E66;&#x90FD;&#x662F;&#x4EBA;&#x5199;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4E0D;&#x53EF;&#x5426;&#x8BA4;&#x4F5C;&#x8005;&#x4F1A;&#x5C3D;&#x81EA;&#x5DF1;&#x6700;&#x5927;&#x7684;&#x667A;&#x6167;&#x548C;&#x52AA;&#x529B;&#x53BB;&#x89E3;&#x91CA;&#x548C;&#x8868;&#x8FBE;&#x6E05;&#x695A;&#x4E66;&#x8981;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F46;&#x4E5F;&#x591A;&#x5C11;&#x4F1A;&#x7528;&#x81EA;&#x5DF1;&#x66F4;&#x64C5;&#x957F;&#x7684;&#x65B9;&#x5F0F;&#x548C;&#x52A0;&#x5165;&#x4E00;&#x4E9B;&#x81EA;&#x5DF1;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x8BFB;&#x8005;&#x8BFB;&#x8D77;&#x6765;&#x662F;&#x5426;&#x80FD;&#x5BF9;&#x7B49;&#xFF0C;&#x5C31;&#x5F53;&#x53E6;&#x8BF4;&#x4E86;&#x3002;&#x4ECE;&#x79EF;&#x6781;&#x5C42;&#x9762;&#x6765;&#x8BF4;&#xFF0C;&#x597D;&#x4E66;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x591A;&#x8BFB;&#xFF0C;&#x4F46;&#x8981;&#x4E66;&#x5C3D;&#x5176;&#x7528;&#x3002;</p>
<h2 id="&#x5173;&#x4E8E;&#x5927;&#x516C;&#x53F8;"><a href="#&#x5173;&#x4E8E;&#x5927;&#x516C;&#x53F8;" class="headerlink" title="&#x5173;&#x4E8E;&#x5927;&#x516C;&#x53F8;"></a>&#x5173;&#x4E8E;&#x5927;&#x516C;&#x53F8;</h2><p>&#x80FD;&#x8FDB;&#x5165;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x6BCF;&#x4E2A;&#x6280;&#x672F;&#x5458;&#x6216;&#x8005;&#x5C06;&#x8981;&#x6BD5;&#x4E1A;&#x7684;&#x5B66;&#x751F;&#x6700;&#x521D;&#x7684;&#x7406;&#x60F3;&#x613F;&#x666F;&#xFF0C;&#x6709;&#x4E9B;&#x4F18;&#x79C0;&#x7684;&#x5E78;&#x8FD0;&#x513F;&#x6BD4;&#x8F83;&#x987A;&#x5229;&#x7684;&#x5C31;&#x83B7;&#x5F97;&#x4E86;&#x673A;&#x4F1A;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x8FD8;&#x662F;&#x6CA1;&#x6709;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x4F1A;&#x53BB;&#x60F3;&#x3002;</p>
<p>&#x6216;&#x8005;&#x81EA;&#x5DF1;&#x5C1D;&#x8BD5;&#x8FC7;&#xFF0C;&#x6216;&#x8005;&#x542C;&#x4EBA;&#x8BF4;&#xFF0C;&#x603B;&#x4F1A;&#x89C9;&#x5F97;&#xFF0C;&#x95E8;&#x69DB;&#x9AD8;&#xFF0C;&#x5DE5;&#x4F5C;&#x538B;&#x529B;&#x5927;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x4EBA;&#x4EEC;&#x5BF9;&#x4E8E;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x5BF9;&#x4E8E;&#x540D;&#x4F01;&#x7684;&#x5370;&#x8C61;&#x3002;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x90FD;&#x8FD8;&#x60F3;&#x53BB;&#xFF0C;&#x76F4;&#x63A5;&#x4E00;&#x70B9;&#xFF0C;&#x51B2;&#x7740;&#x597D;&#x7684;&#x798F;&#x5229;&#x5F85;&#x9047;&#x548C;&#x6240;&#x8C13;&#x5149;&#x73AF;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x6700;&#x8FD1;&#x4E24;&#x5E74;&#xFF0C;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x4E5F;&#x90FD;&#x6709;&#x611F;&#x89C9;&#xFF0C;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x70ED;&#x6F6E;&#xFF0C;&#x4E92;&#x8054;&#x7F51;+&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x5411;&#x4F20;&#x7EDF;&#x884C;&#x4E1A;&#x75AF;&#x72C2;&#x6E17;&#x900F;&#xFF0C;IT&#x4EBA;&#x4E5F;&#x968F;&#x4E4B;&#x75AF;&#x72C2;&#xFF0C;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x5982;&#x96E8;&#x540E;&#x6625;&#x7B0B;&#x822C;&#x51FA;&#x73B0;&#xFF0C;&#x52A8;&#x8F84;&#x878D;&#x8D44;&#x5343;&#x4E07;&#x6216;&#x4EBF;&#x7EA7;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x4ECE;&#x529E;&#x516C;&#x73AF;&#x5883;&#x3001;&#x8BBE;&#x5907;&#xFF0C;&#x8FD8;&#x662F;&#x5F85;&#x9047;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x5927;&#x516C;&#x53F8;&#x4F3C;&#x4E4E;&#x5DF2;&#x7ECF;&#x6CA1;&#x4E86;&#x4F18;&#x52BF;&#xFF0C;&#x4EC5;&#x5B58;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x5C31;&#x662F;&#x5149;&#x73AF;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5149;&#x73AF;&#x662F;&#x5426;&#x4E5F;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x663E;&#x7136;&#x4E0D;&#x662F;&#xFF0C;&#x6709;&#x53E5;&#x8BDD;&#x8BF4;&#x5F97;&#x597D;&#x2014;&#x2014;&#x201C;&#x4F60;&#x8BA4;&#x8BC6;&#x725B;&#x4EBA;&#x4E0D;&#x4EE3;&#x8868;&#x4F60;&#x725B;&#xFF0C;&#x4F60;&#x5728;&#x7684;&#x516C;&#x53F8;&#x725B;&#x4E5F;&#x4E0D;&#x4EE3;&#x8868;&#x4F60;&#x725B;&#x201D;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x662F;&#x53BB;&#x5728;&#x610F;&#x90A3;&#x4E2A;&#x5149;&#x73AF;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x4ECE;&#x81EA;&#x8EAB;&#x6709;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x804C;&#x4E1A;&#x89C4;&#x5212;&#x548C;&#x76EE;&#x6807;&#xFF0C;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x8FFD;&#x6C42;&#x8FDB;&#x6B65;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x53EA;&#x662F;&#x80CC;&#x4E86;&#x4E00;&#x4E2A;&#x865A;&#x7684;&#x58F3;&#x800C;&#x5DF2;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8F7B;&#x6613;&#x7684;&#x7834;&#x6389;&#x3002;&#x771F;&#x6B63;&#x80FD;&#x4EE3;&#x8868;&#x4F60;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E2A;&#x4EBA;&#x6BD4;&#x8F83;&#x6B23;&#x8D4F;&#x6700;&#x8FD1;&#x5728;&#x4F59;&#x679C;&#x535A;&#x6587;&#x91CC;&#x770B;&#x5230;&#x7684;&#x4E00;&#x6BB5;&#x8BDD;&#xFF1A;</p>
<p><strong>&#x201C;&#x4F18;&#x8D8A;&#x611F;&#x5E94;&#x8BE5;&#x6765;&#x81EA;&#x8F93;&#x51FA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8F93;&#x5165;&#x3002;&#x9605;&#x8BFB;&#x4E00;&#x672C;&#x4E66;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x4F18;&#x8D8A;&#x611F;&#xFF0C;&#x8981;&#x81EA;&#x5DF1;&#x5199;&#x4E00;&#x672C;&#xFF1B;&#x4F7F;&#x7528;&#x67D0;&#x79CD;&#x65B0;&#x6F6E;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x4F18;&#x8D8A;&#x611F;&#xFF0C;&#x8981;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF1B;&#x4E70;&#x4E86;&#x6444;&#x5F71;&#x5668;&#x6750;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x4F18;&#x8D8A;&#x611F;&#xFF0C;&#x8981;&#x62CD;&#x51FA;&#x4F1F;&#x5927;&#x7684;&#x7167;&#x7247;&#x3002;&#x201D;</strong></p>
<p>&#x8FD9;&#x6BB5;&#x8BDD;&#x540E;&#x9762;&#x5F53;&#x7136;&#x53EA;&#x662F;&#x4E3E;&#x4F8B;&#x5B50;&#xFF0C;&#x91CD;&#x70B9;&#x662F;&#x7B2C;&#x4E00;&#x53E5;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x5F88;&#x591A;&#x901F;&#x98DF;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x770B;&#x8FC7;&#xFF0C;&#x4E86;&#x89E3;&#x8FC7;&#xFF0C;&#x5927;&#x6982;&#x77E5;&#x9053;&#xFF0C;&#x7B49;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x8F93;&#x51FA;&#x4EC0;&#x4E48;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4EE3;&#x8868;&#x5BF9;&#x5176;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x3002;</p>
<p>&#x6211;&#x6240;&#x77E5;&#x9053;&#x7684;&#x4E0D;&#x5728;&#x5927;&#x516C;&#x53F8;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x4E0D;&#x5C11;&#x4F18;&#x79C0;&#x7684;&#x56E2;&#x961F;&#x548C;&#x4E2A;&#x4EBA;&#xFF0C;&#x5DE5;&#x4F5C;&#x7684;&#x5F88;&#x597D;&#xFF0C;&#x4E5F;&#x6709;&#x7740;&#x4E0D;&#x9519;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x5927;&#x516C;&#x53F8;&#x7684;&#x4E1A;&#x52A1;&#x91CF;&#x7EA7;&#x66F4;&#x5927;&#xFF0C;&#x7528;&#x6237;&#x66F4;&#x591A;&#xFF0C;&#x8D5A;&#x94B1;&#x66F4;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x76F8;&#x5E94;&#x7684;&#x80FD;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x4E50;&#x4E8E;&#x5438;&#x7EB3;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x624D;&#x3002;&#x4F46;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x4F60;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5B83;&#x6765;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x3002;&#x5C31;&#x50CF;&#x6211;QQ&#x7B7E;&#x540D;&#x4E00;&#x6837;&#xFF0C;&#x201C;&#x4FDD;&#x6301;&#x4E00;&#x9897;&#x7EAF;&#x7CB9;&#x7684;&#x5FC3;&#x201D;&#xFF0C;&#x505A;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7B80;&#x5355;&#x5FEB;&#x4E50;&#x5C31;&#x597D;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x8C08;&#x7684;&#x662F;&#x4E0D;&#x76F2;&#x76EE;&#x8FFD;&#x6C42;&#x8FDB;&#x5165;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5E78;&#x5230;&#x4E86;&#x5927;&#x516C;&#x53F8;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x610F;&#x548C;&#x53EF;&#x4EE5;&#x4E3A;&#x6211;&#x6240;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x4E00;&#x3001;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;<br>&#x4E8C;&#x3001;&#x5DE5;&#x5177;&#x3001;&#x89C4;&#x8303;<br>&#x4E09;&#x3001;&#x5E73;&#x53F0;&#x8D44;&#x6E90;&#x3001;&#x4F18;&#x79C0;&#x7684;&#x4EBA;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x4F60;&#x4F1A;&#x63A5;&#x89E6;&#x5230;&#x5F88;&#x591A;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6709;&#x673A;&#x4F1A;&#x548C;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x4E00;&#x8D77;&#x8BA8;&#x8BBA;&#x95EE;&#x9898;&#xFF0C;&#x770B;&#x5230;&#x66F4;&#x591A;&#x597D;&#x6587;&#x7AE0;&#xFF0C;&#x542C;&#x4E00;&#x4E9B;&#x5206;&#x4EAB;&#x3002;&#x4EFF;&#x4F5B;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x7247;&#x66F4;&#x52A0;&#x5E7F;&#x9614;&#x7684;&#x6D77;&#x6D0B;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x4E5F;&#x663E;&#x5F97;&#x66F4;&#x52A0;&#x6E3A;&#x5C0F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x66F4;&#x52A0;&#x7684;&#x8C26;&#x900A;&#x548C;&#x66F4;&#x52A0;&#x79EF;&#x6781;&#x7684;&#x5438;&#x53D6;&#x8425;&#x517B;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x5F97;&#x5230;&#x6210;&#x957F;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x8DDF;f2er.club&#x76F4;&#x63A5;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x53D7;&#x60C5;&#x5C01;&#x4E4B;&#x9080;&#x626F;&#x626F;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA9;&#x5927;&#x5BB6;&#x66F4;&#x6E05;&#x695A;&#x7684;&#x77E5;&#x9053;&#x80CC;&#x540E;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4E5F;&#x987A;&#x4FBF;&#x8C08;&#x4E86;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x7ED9;&#x4E00;&#x4E9B;&#x540C;&#x884C;&#x4E00;&#x70B9;&#x70B9;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x6B22;&#x8FCE;&#x591A;&#x4EA4;&#x6D41;&#x3002;</p>
<h2 id="&#x540E;&#x8BED;"><a href="#&#x540E;&#x8BED;" class="headerlink" title="&#x540E;&#x8BED;"></a>&#x540E;&#x8BED;</h2><p>&#x65E9;&#x8BFB;&#x541B;&#x5C31;&#x662F;&#x7FA1;&#x6155;&#x90A3;&#x79CD;&#x80FD;&#x628A;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x60C5;&#x505A;&#x597D;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x3002;&#x505A;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#x5BFC;&#x822A;&#x7AD9;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x82B1;&#x6211;&#x4EEC;&#x592A;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x5185;&#x5BB9;&#x7684;&#x7EF4;&#x62A4;&#xFF0C;&#x5206;&#x4EAB;&#x7684;&#x52A8;&#x529B;&#x90FD;&#x8FD8;&#x662F;&#x5F88;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#x7684;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5BFC;&#x822A;&#x7AD9;&#x6CE8;&#x5165;&#x4E86;&#x592A;&#x591A;&#x7684;&#x611F;&#x60C5;&#x5728;&#x91CC;&#x9762;&#x3002;</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/经历/" rel="tag">#经历</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/10/17/those-year-i-do-bad/" rel="next" title="那些年我干过的矬事">
                <i class="fa fa-chevron-left"></i> 那些年我干过的矬事
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/12/01/basic-layout/" rel="prev" title="说说基本的布局观">
                说说基本的布局观 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#前言"><span class="nav-number">1.</span> <span class="nav-text">前言</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#由来"><span class="nav-number">2.</span> <span class="nav-text">由来</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#思考用加法，做事用减法"><span class="nav-number">3.</span> <span class="nav-text">思考用加法，做事用减法</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#从雏形到成形，简单的事情做好，就不简单"><span class="nav-number">4.</span> <span class="nav-text">从雏形到成形，简单的事情做好，就不简单</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#分类和体验"><span class="nav-number">5.</span> <span class="nav-text">分类和体验</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#人生在于折腾"><span class="nav-number">6.</span> <span class="nav-text">人生在于折腾</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#理想主义者方能成事"><span class="nav-number">7.</span> <span class="nav-text">理想主义者方能成事</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#关于读书"><span class="nav-number">8.</span> <span class="nav-text">关于读书</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#关于大公司"><span class="nav-number">9.</span> <span class="nav-text">关于大公司</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#后语"><span class="nav-number">10.</span> <span class="nav-text">后语</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
