<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="经历," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x5929;&amp;#x5B89;&amp;#x6570;&amp;#x7801;&amp;#x57CE;&amp;#xFF1A;&amp;#x4ECE;&amp;#x8F66;&amp;#x516C;&amp;#x5E99;&amp;#x4E0B;&amp;#x8F66;&amp;#xFF0C;&amp;#x6325;&amp;#x6C57;&amp;#x5982;&amp;#x96E8;&amp;#xFF0C;&amp;#x8D70;&amp;#x4E86;&amp;#x4E0D;&amp;#x5C11;&amp;#x5F2F;&amp;#x8DEF;&amp;#xFF0C;">
<meta property="og:type" content="article">
<meta property="og:title" content="五天面试（5.24—5.28）">
<meta property="og:url" content="http://yoursite.com/2014/05/28/五天面试（5.24—5.28）/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x5929;&amp;#x5B89;&amp;#x6570;&amp;#x7801;&amp;#x57CE;&amp;#xFF1A;&amp;#x4ECE;&amp;#x8F66;&amp;#x516C;&amp;#x5E99;&amp;#x4E0B;&amp;#x8F66;&amp;#xFF0C;&amp;#x6325;&amp;#x6C57;&amp;#x5982;&amp;#x96E8;&amp;#xFF0C;&amp;#x8D70;&amp;#x4E86;&amp;#x4E0D;&amp;#x5C11;&amp;#x5F2F;&amp;#x8DEF;&amp;#xFF0C;">
<meta property="og:updated_time" content="2016-02-24T12:54:26.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="五天面试（5.24—5.28）">
<meta name="twitter:description" content="&amp;#x5929;&amp;#x5B89;&amp;#x6570;&amp;#x7801;&amp;#x57CE;&amp;#xFF1A;&amp;#x4ECE;&amp;#x8F66;&amp;#x516C;&amp;#x5E99;&amp;#x4E0B;&amp;#x8F66;&amp;#xFF0C;&amp;#x6325;&amp;#x6C57;&amp;#x5982;&amp;#x96E8;&amp;#xFF0C;&amp;#x8D70;&amp;#x4E86;&amp;#x4E0D;&amp;#x5C11;&amp;#x5F2F;&amp;#x8DEF;&amp;#xFF0C;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 五天面试（5.24—5.28） | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                五天面试（5.24—5.28）
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-05-28T00:00:00+08:00" content="2014-05-28">
              2014-05-28
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经历/" itemprop="url" rel="index">
                    <span itemprop="name">经历</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;"><a href="#&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;" class="headerlink" title="&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;"></a>&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;</h2><p>&#x4ECE;&#x8F66;&#x516C;&#x5E99;&#x4E0B;&#x8F66;&#xFF0C;&#x6325;&#x6C57;&#x5982;&#x96E8;&#xFF0C;&#x8D70;&#x4E86;&#x4E0D;&#x5C11;&#x5F2F;&#x8DEF;&#xFF0C;&#x5230;&#x4E86;&#x697C;&#x4E0B;&#xFF0C;&#x4E58;&#x7535;&#x68AF;&#x4E0A;&#x53BB;&#xFF0C;&#x626D;&#x5934;&#x4E00;&#x770B;&#x5BF9;&#x9762;&#x662F;&#x730E;&#x8058;&#x7F51;&#xFF0C;&#x7740;&#x5B9E;&#x60CA;&#x8BB6;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x7136;&#x540E;&#x5C31;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;xx&#x603B;&#xFF0C;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x8001;&#x5927;&#x3002;&#x7B11;&#x5BB9;&#x53EF;&#x63AC;&#x7684;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x63D0;&#x95EE;&#x7684;&#x5957;&#x8DEF;&#x4ECE;&#x4E13;&#x4E1A;&#x5230;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF0C;&#x5230;&#x4E3A;&#x4EC0;&#x4E48;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E74;&#x9F84;&#x7B49;&#x7B49;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x95EE;&#x4E86;&#x6280;&#x672F;&#x5458;&#x76F8;&#x5173;&#xFF1A;&#x56FE;&#x7247;&#x5904;&#x7406;&#x3001;&#x524D;&#x7AEF;&#x3001;&#x540E;&#x53F0;&#x3002;&#x5177;&#x4F53;&#x662F;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x4E2D;&#x628A;&#x4E00;&#x4E2A;&#x73BB;&#x7483;&#x7F38;&#x6316;&#x51FA;&#x6765;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x675F;&#x82B1;&#xFF0C;&#x4E0D;&#x52A8;&#x53F6;&#x5B50;&#xFF0C;&#x600E;&#x4E48;&#x628A;&#x82B1;&#x4ECE;&#x7EA2;&#x8272;&#x53D8;&#x6210;&#x53D8;&#x6210;&#x9EC4;&#x8272;&#x3002;&#x3002;&#x3002;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x4E8B;&#x513F;&#x4E48;~&#xFF09;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x70B9;&#x504F;&#x4E86;&#xFF0C;&#x6CA1;&#x7B54;&#x51FA;&#x6765;&#xFF0C;&#x540E;&#x6765;&#x77E5;&#x9053;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x62A0;&#x51FA;&#x6765;&#x6539;&#x989C;&#x8272;&#x7684;&#xFF0C;&#x64E6;&#x3002;&#x3002;&#x3002;&#x518D;&#x7136;&#x540E;&#xFF0C;&#x8C08;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#xFF0C;&#x624D;&#x516D;&#x4E2A;&#x4EBA;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x6708;&#x5DE6;&#x53F3;&#xFF0C;&#x505A;&#x5A5A;&#x5E86;&#x5E73;&#x53F0;&#x7684;&#xFF0C;&#x597D;&#x5427;&#x3002;&#x6280;&#x672F;&#x8FD9;&#x5757;&#x513F;&#x7B97;&#x662F;&#x6CA1;&#x987A;&#x5229;&#x8FC7;&#x5173;&#x3002;&#x63A5;&#x7740;&#x4F83;&#x4F83;&#x800C;&#x8C08;&#x516C;&#x53F8;&#x548C;&#x7F51;&#x7AD9;&#x65B9;&#x9762;&#xFF0C;&#x5012;&#x662F;&#x5F15;&#x8D77;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x597D;&#x611F;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x54E5;&#x8EAB;&#x4E0A;&#x8FD8;&#x7B97;&#x6709;&#x70B9;&#x4EAE;&#x70B9;&#x4E48;&#xFF08;&#x54C8;&#x54C8;&#xFF09;&#x3002;&#x6CA1;&#x62D2;&#x7EDD;&#x4E5F;&#x6CA1;&#x540C;&#x610F;&#xFF0C;&#x5F85;&#x5B9A;&#x3002;</p>
<h2 id="&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;"><a href="#&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;" class="headerlink" title="&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;"></a>&#x73CD;&#x7231;&#x65D7;&#x4E0B;&#x7F18;&#x6765;&#x7F51;&#xFF1A;</h2><p>&#x8FD9;&#x4E2A;&#xFF0C;&#x5728;&#x79D1;&#x6280;&#x56ED;&#x540C;&#x65B9;&#x4FE1;&#x606F;&#x6E2F;&#x4E09;&#x697C;&#xFF0C;&#x529E;&#x516C;&#x73AF;&#x5883;&#x86EE;&#x597D;&#x3002;&#x56E2;&#x961F;&#x5E74;&#x8F7B;&#x6709;&#x6D3B;&#x529B;&#xFF0C;&#x53EA;&#x4E00;&#x4E2A;&#x4E8B;&#x4E1A;&#x90E8;&#x5C31;60&#x591A;&#x4EBA;&#xFF0C;&#x505A;&#x4E86;&#x4E00;&#x4E0B;&#x8BD5;&#x9898;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x53EF;&#x601C;&#x7684;&#x4E24;&#x9053;css&#x9898;&#xFF0C;&#x5269;&#x4E0B;&#x51E0;&#x4E4E;&#x5168;&#x662F;js&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x9898;html5&#xFF0C;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x516C;&#x53F8;&#x5F88;&#x91CD;&#x89C6;&#x7684;js&#x6211;&#x7ED9;&#x3002;&#x3002;&#x8BF4;&#x591A;&#x4E86;&#x90FD;&#x662F;&#x6CEA;&#x3002;&#x521A;&#x8BE2;&#x95EE;&#x5230;&#x7ED3;&#x679C;&#xFF0C;&#x5E0C;&#x671B;&#x7834;&#x706D;&#x4E86;&#x3002;</p>
<h2 id="&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;"><a href="#&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;" class="headerlink" title="&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;"></a>&#x798F;&#x65AF;&#x5EB7;&#x59C6;&#xFF1A;</h2><p>&#x4F60;&#x6CA1;&#x542C;&#x8FC7;&#x8FD9;&#x540D;&#x5B57;&#x5427;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x542C;&#x8FC7;&#x3002;&#x53EF;&#x662F;&#x5B83;&#x5C31;&#x662F;&#x90A3;&#x6837;&#x7684;&#x5B58;&#x5728;&#x4E8E;&#x79D1;&#x6280;&#x56ED;&#x5A01;&#x65B0;&#x8F6F;&#x4EF6;&#x56ED;1&#x680B;&#xFF0C;&#x4E8C;&#x697C;&#xFF0C;&#x90A3;&#x4E48;&#x9A84;&#x50B2;&#xFF0C;&#x768E;&#x6D01;&#x3001;&#x9AD8;&#x8D35;&#xFF08;&#x6211;&#x600E;&#x4E48;&#x6CA1;&#x53BB;&#x5F53;&#x4F5C;&#x5BB6;&#xFF0C;&#x54C8;&#x54C8;&#xFF09;&#x3002;&#x53BB;&#x5230;&#x524D;&#x53F0;&#x5148;&#x8BA9;&#x6211;&#x586B;&#x8868;&#xFF0C;&#x516C;&#x53F8;&#x4EBA;&#x6765;&#x4EBA;&#x5F80;&#x7684;&#xFF0C;&#x4EBA;&#x4E8B;&#x662F;&#x6211;&#x8001;&#x4E61;&#xFF0C;&#x90A3;&#x4E2A;&#x7A81;&#x7136;&#x4EB2;&#x8FD1;&#x5450;&#xFF0C;&#x804A;&#x4E86;&#x804A;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x6280;&#x672F;&#x6765;&#x4E86;&#xFF0C;&#x4F9D;&#x7136;&#x90A3;&#x4E48;&#x5E74;&#x8F7B;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x597D;&#x50CF;&#x8FD8;&#x633A;&#x5389;&#x5BB3;&#xFF0C;&#x5389;&#x5BB3;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x5462;&#xFF0C;&#x63D0;&#x7684;&#x95EE;&#x9898;&#x6211;&#x6240;&#x7ED9;&#x7684;&#x7B54;&#x6848;&#x597D;&#x50CF;&#x662F;&#x5728;&#x80CC;&#x62DB;&#x8058;&#x5E7F;&#x544A;&#xFF0C;&#x95EE;&#x6211;&#x517C;&#x5BB9;&#x6027;&#x3001;&#x524D;&#x7AEF;&#x9664;&#x4E86;css&#x3001;html&#x3001;js&#x8FD8;&#x9700;&#x8981;&#x638C;&#x63E1;&#x4EC0;&#x4E48;&#xFF0C;&#x95EE;&#x6211;&#x6DFB;&#x52A0;&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;&#x65B9;&#x9762;&#xFF0C;&#xFF0C;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4ED6;&#x4E5F;&#x6CA1;&#x770B;&#x6211;&#x51E0;&#x773C;&#xFF0C;&#x5C31;&#x4E24;&#x9875;&#x7B80;&#x5386;&#x6765;&#x6765;&#x56DE;&#x56DE;&#x7684;&#x7FFB;&#x7740;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8BF4;&#x5B8C;&#x4E86;&#x5C31;&#x8BA9;&#x6211;&#x518D;&#x5750;&#x4E00;&#x4F1A;&#x513F;&#x8BA9;&#x4EBA;&#x4E8B;&#x8FC7;&#x6765;&#x8DDF;&#x6211;&#x804A;&#xFF0C;&#x4EBA;&#x4E8B;&#x8FC7;&#x6765;&#x4E86;&#xFF08;&#x5176;&#x5B9E;&#x6211;&#x77E5;&#x9053;&#x7ED3;&#x679C;&#xFF09;&#x3002;&#x4ED6;&#x5012;&#x662F;&#x663E;&#x5F97;&#x6BD4;&#x6211;&#x8FD8;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x6211;&#x5F88;&#x5927;&#x5EA6;&#xFF08;&#x4E0D;&#x7136;&#x80FD;&#x600E;&#x4E48;&#x6837;&#x3002;&#x3002;&#xFF09;&#x7684;&#x8BF4;&#xFF0C;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5C31;&#x5F53;&#x662F;&#x4E00;&#x6B21;&#x7ECF;&#x5386;&#xFF0C;&#x5B66;&#x4E60;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x4ED6;&#x5B89;&#x6170;&#x548C;&#x9F13;&#x52B1;&#x4E86;&#x6211;&#x51E0;&#x53E5;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x5C31;&#x6F47;&#x6D12;&#x8D70;&#x4E00;&#x56DE;&#x4E86;&#xFF0C;&#x8DDF;&#x7F8E;&#x5973;&#x524D;&#x53F0;&#x9053;&#x4E86;&#x4E2A;&#x522B;&#xFF0C;&#x5979;&#x8FD8;&#x60CA;&#x8BB6;&#x8BF4;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x5FEB;&#xFF0C;&#x54B1;&#x80FD;&#x4E0D;&#x8868;&#x73B0;&#x7684;&#x50CF;&#x88AB;&#x79D2;&#x6740;&#x4E00;&#x6837;&#x5417;&#xFF1F;&#xFF01;~</p>
<h2 id="&#x8C37;&#x7F8E;&#xFF1A;"><a href="#&#x8C37;&#x7F8E;&#xFF1A;" class="headerlink" title="&#x8C37;&#x7F8E;&#xFF1A;"></a>&#x8C37;&#x7F8E;&#xFF1A;</h2><p>&#x8FD9;&#x662F;&#x4E00;&#x5BB6;&#x5916;&#x5305;&#x516C;&#x53F8;&#xFF0C;&#x6765;&#x4E4B;&#x524D;&#x6709;&#x4E9B;&#x72B9;&#x8C6B;&#xFF0C;&#x8981;&#x4E0D;&#x8981;&#x518D;&#x505A;&#x5916;&#x5305;&#x554A;&#xFF0C;&#x53EF;&#x5B83;&#x4EEC;&#x5B98;&#x7F51;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x8C8C;&#x4F3C;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;&#x6211;&#x5C31;&#x53BB;&#x4E86;&#xFF0C;&#x5357;&#x5C71;&#xFF0C;&#x65B0;&#x80FD;&#x6E90;&#x5927;&#x53A6;&#xFF0C;&#x5916;&#x9762;&#x770B;&#x8D77;&#x6765;&#x771F;&#x4E0D;&#x600E;&#x6837;&#xFF0C;&#x91CC;&#x9762;&#x5012;&#x4E5F;&#x8FD8;&#x884C;&#x5427;&#x3002;&#x53BB;&#x5230;&#x633A;&#x987A;&#x5229;&#x89C1;&#x5230;&#x4E86;&#x9762;&#x8BD5;&#x5B98;&#xFF0C;&#x4E00;&#x4E2A;&#x56DB;&#x5341;&#x5C81;&#x4E0A;&#x4E0B;&#x7684;&#x5973;&#x58EB;&#xFF0C;&#x4EBA;&#x5BB6;&#x53EF;&#x662F;&#x6267;&#x884C;&#x603B;&#x76D1;&#xFF0C;&#x53C8;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5C0F;&#x5C4B;&#x91CC;&#xFF0C;&#x6BCF;&#x5BB6;&#x516C;&#x53F8;&#x9762;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x662F;&#x5C0F;&#x5C4B;&#x3002;&#x3002;&#x3002;&#x9762;&#x5BF9;&#x9762;&#x5750;&#x4E0B;&#xFF0C;&#x7B80;&#x5386;&#x5949;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x804A;&#x3002;&#x7ECF;&#x8FC7;&#x51E0;&#x6B21;&#x9762;&#x8BD5;&#x540E;&#xFF0C;&#x65E9;&#x5C31;&#x66F4;&#x52A0;&#x7684;&#x8001;&#x7EC3;&#x548C;&#x81EA;&#x7136;&#xFF08;&#x8865;&#x5145;&#x4E00;&#x4E0B;&#xFF0C;&#x4E4B;&#x524D;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#x6210;&#x529F;&#x7684;~&#xFF09;&#xFF0C;&#x5750;&#x4E0B;&#x6325;&#x6D12;&#x7740;&#x6211;&#x7684;&#x201C;&#x624D;&#x534E;&#x201D;&#xFF0C;&#x8DDF;&#x5979;&#x4EA4;&#x6D41;&#x78B0;&#x649E;&#x51FA;&#x633A;&#x591A;&#x7684;&#x706B;&#x82B1;&#xFF0C;&#x8FBE;&#x6210;&#x4E86;&#x82E5;&#x5E72;&#x5171;&#x8BC6;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5979;&#x6BD4;&#x6211;&#x81EA;&#x5DF1;&#x90FD;&#x66F4;&#x76F8;&#x4FE1;&#x6211;&#x80FD;&#x505A;&#x597D;&#x3002;&#x6211;&#x6CA1;&#x7528;&#x4EC0;&#x4E48;&#x9B54;&#x6CD5;&#x5427;&#xFF0C;&#x8FD9;&#x662F;&#x600E;&#x4E48;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x54C8;&#x54C8;&#xFF01;&#x7136;&#x540E;&#xFF0C;&#x5979;&#x8BA9;&#x6211;&#x770B;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x5165;&#x804C;&#x3002;&#x6211;&#x53BB;&#xFF0C;&#x65F6;&#x95F4;&#x4E5F;&#x4E0D;&#x957F;&#x5450;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x88AB;&#x79D2;&#x6740;&#xFF0C;&#x4E00;&#x4E2A;&#x5374;&#x662F;&#x76F4;&#x63A5;&#x664B;&#x7EA7;&#x3002;&#x8FD9;&#x5DEE;&#x8DDD;&#xFF0C;&#x5883;&#x754C;&#x554A;&#xFF0C;&#x683C;&#x5C40;&#x554A;&#xFF01;~&#x597D;&#x5427;&#xFF0C;&#x4E0D;&#x8BF4;&#x90A3;&#x4E48;&#x591A;&#x6D6E;&#x5938;&#x7684;&#x8BDD;&#x4E86;&#x3002;<br>&#x4EE5;&#x4E0A;&#x53EA;&#x662F;&#x8FD1;&#x51E0;&#x5929;&#x9762;&#x8BD5;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x540E;&#x7EED;&#x5982;&#x679C;&#x6709;&#x66F4;&#x7CBE;&#x5F69;&#x7684;&#xFF0C;&#x518D;&#x5949;&#x4E0A;&#x5427;&#xFF01;~</p>
<p>&#x6CE8;&#x660E;&#x4E00;&#x53E5;&#xFF1A;&#x65E0;&#x8BBA;&#x53D7;&#x8FC7;&#x591A;&#x5C11;&#x6253;&#x51FB;&#xFF0C;&#x88AB;&#x8F7B;&#x89C6;&#x591A;&#x5C11;&#x6B21;&#xFF0C;&#x6211;&#x4F9D;&#x7136;&#x4F1A;&#x6BCF;&#x5929;&#x884C;&#x8D70;&#x5728;&#x524D;&#x8FDB;&#x7684;&#x8DEF;&#x4E0A;&#xFF0C;never stop&#xFF01;~</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/经历/" rel="tag">#经历</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2014/05/03/“看起来不错”其实挺重要！/" rel="next" title="“看起来不错”其实挺重要！">
                <i class="fa fa-chevron-left"></i> “看起来不错”其实挺重要！
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2014/07/04/inser工作一月/" rel="prev" title="inser工作一月">
                inser工作一月 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#天安数码城："><span class="nav-number">1.</span> <span class="nav-text">天安数码城：</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#珍爱旗下缘来网："><span class="nav-number">2.</span> <span class="nav-text">珍爱旗下缘来网：</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#福斯康姆："><span class="nav-number">3.</span> <span class="nav-text">福斯康姆：</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#谷美："><span class="nav-number">4.</span> <span class="nav-text">谷美：</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
