<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="Hexo, NexT" />





  <link rel="alternate" href="/atom.xml" title="灵感的小窝" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description">
<meta property="og:type" content="website">
<meta property="og:title" content="灵感的小窝">
<meta property="og:url" content="http://yoursite.com/page/5/index.html">
<meta property="og:site_name" content="灵感的小窝">
<meta property="og:description">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="灵感的小窝">
<meta name="twitter:description">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 灵感的小窝 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left 
   page-home 
 ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感的小窝</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            
  <section id="posts" class="posts-expand">

    

    
    

    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/12/27/webrebuild_2015/" itemprop="url">
                  第八届webrebuild年会总结暨“如何做一个理想主义者”
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-12-27T00:00:00+08:00" content="2014-12-27">
              2014-12-27
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/分享交流/" itemprop="url" rel="index">
                    <span itemprop="name">分享交流</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x4ECA;&#x5929;&#x53C2;&#x52A0;&#x4E86;webrebuild&#x5E74;&#x4F1A;&#xFF0C;&#x4E00;&#x4E2A;&#x591A;&#x6708;&#x6CA1;&#x6709;&#x5199;&#x8FC7;&#x6587;&#x7AE0;&#x4E86;&#xFF0C;&#x4E4B;&#x524D;&#x662F;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x6362;&#x5B8C;&#x5DE5;&#x4F5C;&#x9002;&#x5E94;&#x65B0;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x63A5;&#x53D7;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x60F3;&#x6309;&#x7167;&#x5F53;&#x521D;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6BCF;&#x5468;&#x66F4;&#x65B0;&#x4E00;&#x7BC7;&#x6765;&#x7ED9;&#x81EA;&#x5DF1;&#x4F5C;&#x603B;&#x7ED3;&#xFF0C;&#x505A;&#x77E5;&#x8BC6;&#x5206;&#x4EAB;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x6700;&#x8FD1;&#x4E00;&#x4E2A;&#x591A;&#x6708;&#x6765;&#x6709;&#x4E00;&#x79CD;&#x5947;&#x602A;&#x7684;&#x611F;&#x89C9;&#x3002;&#x6BCF;&#x5929;&#x8FD8;&#x662F;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x67E5;&#x8D44;&#x6599;&#xFF0C;&#x770B;&#x4E66;&#x7B49;&#x7B49;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x611F;&#x89C9;&#x5230;&#x4E00;&#x70B9;&#x65B0;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x4E00;&#x6765;&#x4E8C;&#x53BB;&#x4EFF;&#x4F5B;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5708;&#x5B50;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x74F6;&#x9888;&#x201D;&#x5427;&#xFF0C;&#x4E0D;&#x5149;&#x662F;&#x6280;&#x672F;&#x4E0A;&#xFF0C;&#x8FD8;&#x6709;&#x5FC3;&#x7406;&#x3002;</p>
<p>&#x8FD9;&#x6B21;webrebuild&#x5E74;&#x4F1A;&#x7684;&#x4E3B;&#x9898;&#x662F;&#x201C;&#x521D;&#x5FC3;&#x201D;&#xFF0C;&#x90A3;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x52A0;&#x4E0A;&#x4E86;&#x540E;&#x9762;&#x7684;&#x201C;&#x5982;&#x4F55;&#x505A;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x201D;&#x5462;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x60F3;&#x5199;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x8FD9;&#x6B21;&#x5E74;&#x4F1A;&#xFF0C;&#x4E5F;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x5F00;&#x7BC7;"><a href="#&#x4E00;&#x3001;&#x5F00;&#x7BC7;" class="headerlink" title="&#x4E00;&#x3001;&#x5F00;&#x7BC7;"></a>&#x4E00;&#x3001;&#x5F00;&#x7BC7;</h2><p>&#x5F53;&#x7136;&#x662F;&#x5F6A;&#x53D4;~&#x5927;&#x6982;&#x4E5F;&#x5C31;&#x4ED6;&#x80FD;hold&#x4F4F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x7684;&#x5F00;&#x7BC7;&#xFF0C;&#x8C08;&#x5230;&#x7684;&#x8BDD;&#x9898;&#x4E5F;&#x662F;&#x6D89;&#x53CA;&#x601D;&#x60F3;&#xFF0C;&#x5FC3;&#x6001;&#xFF0C;&#x8FFD;&#x6C42;&#x65B9;&#x9762;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p><img src="/2014/12/27/webrebuild_2015/1.jpg" alt=""></p>
<p><img src="/2014/12/27/webrebuild_2015/2.jpg" alt=""></p>
<p><img src="/2014/12/27/webrebuild_2015/3.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/4.jpg" alt=""></p>
<p>&#x521D;&#x5B66;&#x8005;&#x7684;&#x5FC3;&#xFF0C;&#x6700;&#x521D;&#x7684;&#x5DE5;&#x5320;&#x4E4B;&#x5FC3;&#x3002;&#x91CD;&#x6784;&#x4ECE;&#x201C;&#x5BF9;&#x8BBE;&#x8BA1;&#x7A3F;&#x7684;&#x8FD8;&#x539F;&#x201D;&#xFF0C;&#x4E0A;&#x5347;&#x5230;&#x201C;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x7684;&#x8FD8;&#x539F;&#x201D;&#x3002;</p>
<p>&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x804C;&#x4E1A;&#x7ECF;&#x5386;&#x4E0D;&#x957F;&#xFF0C;&#x4F46;&#x4E5F;&#x5DF2;&#x7ECF;&#x5728;&#x65F6;&#x523B;&#x63D0;&#x9192;&#x7740;&#x81EA;&#x5DF1;&#xFF0C;&#x4FDD;&#x6301;&#x521D;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x96BE;&#x514D;&#x5728;&#x751F;&#x6D3B;&#x3001;&#x5DE5;&#x4F5C;&#x3001;&#x793E;&#x4F1A;&#x3001;&#x5BB6;&#x5EAD;&#x7B49;&#x7B49;&#x8BF8;&#x591A;&#x4E8B;&#x52A1;&#x7684;&#x6D6A;&#x6F6E;&#x4E4B;&#x4E2D;&#x8FF7;&#x5931;&#xFF0C;&#x59A5;&#x534F;&#x7B49;&#x7B49;&#xFF0C;&#x6E10;&#x6E10;&#x7684;&#xFF0C;&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x9752;&#x6625;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x6574;&#x5929;&#x4E5F;&#x5FD9;&#x5FD9;&#x788C;&#x788C;&#xFF0C;&#x53EF;&#x662F;&#x80FD;&#x4E0D;&#x80FD;&#x6536;&#x83B7;&#x5230;&#x6211;&#x4EEC;&#x5F53;&#x521D;&#x60F3;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x5462;&#xFF1F;&#x6211;&#x7684;QQ&#x7B7E;&#x540D;&#x91CC;&#x4E5F;&#x662F;&#x5199;&#x6709;&#x201C;&#x4FDD;&#x6301;&#x4E00;&#x9897;&#x7EAF;&#x7CB9;&#x7684;&#x5FC3;&#x201D;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#xFF0C;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x751F;&#x6D3B;&#xFF0C;&#x4EBA;&#x60C5;&#x4E16;&#x6545;&#x7B49;&#x7B49;&#xFF0C;&#x6270;&#x4E71;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x7EEA;&#xFF0C;&#x6539;&#x53D8;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x521D;&#x8877;&#x548C;&#x524D;&#x8FDB;&#x65B9;&#x5411;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EA;&#x80FD;&#x662F;&#x7F8E;&#x597D;&#x7684;&#x613F;&#x671B;&#xFF0C;&#x56E0;&#x4E3A;&#x751F;&#x6D3B;&#x662F;&#x4E30;&#x5BCC;&#x7684;&#xFF0C;&#x4F60;&#x660E;&#x5929;&#x9700;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#x6216;&#x8BB8;&#x81EA;&#x5DF1;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x552F;&#x72EC;&#x80FD;&#x591F;&#x628A;&#x63E1;&#x7684;&#x662F;&#x5927;&#x65B9;&#x5411;&#x4E0D;&#x53D8;&#xFF0C;&#x5FC3;&#x91CC;&#x90A3;&#x80A1;&#x52B2;&#x513F;&#x4E00;&#x76F4;&#x5728;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x9664;&#x4E86;&#x5F15;&#x53D1;&#x6211;&#x5BF9;&#x201C;&#x521D;&#x5FC3;&#x201D;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x201C;&#x5DE5;&#x5320;&#x201C;&#x7CBE;&#x795E;&#xFF0C;&#x5F6A;&#x53D4;&#x4E3E;&#x4E86;&#x4ED6;&#x81EA;&#x5DF1;&#x548C;&#x516C;&#x53F8;&#x7684;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#xFF0C;&#x5F88;&#x751F;&#x52A8;&#x5F62;&#x8C61;&#xFF0C;&#x4E5F;&#x7ED9;&#x4E86;&#x6211;&#x5F88;&#x5927;&#x89E6;&#x52A8;&#xFF0C;&#x63D0;&#x9192;&#x4E86;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x773C;&#x5149;&#x4E0D;&#x8981;&#x592A;&#x5C40;&#x9650;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5F88;&#x591A;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x4F1A;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x5F88;&#x591A;&#xFF0C;but&#x8C01;&#x90FD;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x90FD;&#x901A;&#xFF0C;&#x505A;&#x4EC0;&#x4E48;&#x5C31;&#x4E00;&#x5B9A;&#x4F1A;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x5B9D;&#x8D35;&#x7684;&#x662F;&#x63A2;&#x7D22;&#x3001;&#x5B9E;&#x8DF5;&#x7684;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C1D;&#x8BD5;&#x5C31;&#x6709;&#x6536;&#x83B7;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x5341;&#x5E74;&#xFF08;&#x8D3A;&#x5F6C;&#xFF09;"><a href="#&#x4E8C;&#x3001;&#x5341;&#x5E74;&#xFF08;&#x8D3A;&#x5F6C;&#xFF09;" class="headerlink" title="&#x4E8C;&#x3001;&#x5341;&#x5E74;&#xFF08;&#x8D3A;&#x5F6C;&#xFF09;"></a>&#x4E8C;&#x3001;&#x5341;&#x5E74;&#xFF08;&#x8D3A;&#x5F6C;&#xFF09;</h2><p>&#x7531;&#x6765;&#x81EA;&#x817E;&#x8BAF;&#x4E92;&#x5A31;&#x7684;&#x524D;&#x8F88;&#xFF0C;&#x8BB2;&#x8FF0;&#x4E86;&#x4E00;&#x4E0B;&#x4ED6;&#x7684;&#x5341;&#x5E74;&#xFF0C;&#x5185;&#x5BB9;&#x8BB0;&#x5F97;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5341;&#x5E74;&#x90FD;&#x4E0D;&#x662F;&#x7B80;&#x7B80;&#x5355;&#x5355;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x8FD9;&#x79CD;&#x5BF9;&#x81EA;&#x5DF1;&#x4EBA;&#x751F;&#xFF0C;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#x7684;&#x8BB2;&#x8FF0;&#xFF0C;&#x66F4;&#x662F;&#x53EF;&#x80FD;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#xFF0C;&#x4F34;&#x968F;&#x7740;&#x5F88;&#x591A;&#x7684;&#x6545;&#x4E8B;&#x3002;&#x5176;&#x5B9E;&#x6BCF;&#x6B21;&#x542C;&#x5230;&#x53F0;&#x4E0A;&#x7684;&#x5609;&#x5BBE;&#x5728;&#x8BB2;&#x8BF4;&#xFF0C;&#x54EA;&#x4E00;&#x5E74;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x54EA;&#x4E00;&#x5E74;&#x6765;&#x5230;&#x817E;&#x8BAF;&#xFF0C;&#x6211;&#x4E5F;&#x540C;&#x65F6;&#x5728;&#x60F3;&#x90A3;&#x5E74;&#x6211;&#x5728;&#x5E72;&#x561B;&#xFF0C;&#x5728;&#x8BFB;&#x521D;&#x4E2D;&#x3001;&#x9AD8;&#x4E2D;&#xFF1F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5386;&#x53F2;&#x4E0D;&#x957F;&#xFF0C;&#x5728;&#x4E2D;&#x56FD;&#x7684;&#x5386;&#x53F2;&#x66F4;&#x77ED;&#xFF0C;&#x4E5F;&#x5C31;&#x5341;&#x51E0;&#x5E74;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x5C31;&#x662F;&#x8FD9;&#x5341;&#x51E0;&#x5E74;&#x5F7B;&#x5E95;&#x6539;&#x53D8;&#x4E86;&#x4EBA;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F97;&#x5F53;&#x65F6;&#x4E0A;&#x7535;&#x8111;&#x8BFE;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x662F;&#x53BB;&#x73A9;&#x513F;&#xFF0C;&#x73A9;&#x513F;&#x7684;&#x6700;&#x591A;&#x7684;&#x65E0;&#x975E;&#x662F;&#x6251;&#x514B;&#xFF0C;&#x626B;&#x96F7;&#x8FD9;&#x4E9B;&#xFF0C;&#x800C;&#x6211;&#x5F53;&#x65F6;&#x89C1;&#x5230;&#x7535;&#x8111;&#x7684;&#x673A;&#x4F1A;&#x5F88;&#x5C11;&#xFF0C;&#x952E;&#x76D8;&#x4E0A;&#x7684;&#x6309;&#x952E;&#x4EC0;&#x4E48;&#x7684;&#x8FD8;&#x8BA4;&#x4E0D;&#x5168;&#xFF0C;&#x5C31;&#x559C;&#x6B22;&#x6253;&#x5B57;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x6BD4;&#x8F83;&#x65F6;&#x5174;&#x201D;&#x667A;&#x80FD;ABC&#x201C;&#x3001;&#x4E94;&#x7B14;&#x7B49;&#x7B49;&#xFF0C;&#x66FE;&#x7ECF;&#x80CC;&#x8FC7;&#x51E0;&#x6B21;&#x4E94;&#x7B14;&#x7684;&#x5B57;&#x6839;&#xFF0C;&#x80CC;&#x4E00;&#x6B21;&#x6CA1;&#x5B66;&#x4F1A;&#xFF0C;&#x4E5F;&#x6CA1;&#x7535;&#x8111;&#xFF0C;&#x8FC7;&#x4E2A;&#x4E00;&#x4E24;&#x5E74;&#x5FD8;&#x4E86;&#xFF0C;&#x53C8;&#x6709;&#x8001;&#x5E08;&#x6559;&#xFF0C;&#x53C8;&#x80CC;&#xFF0C;&#x53C8;&#x5FD8;&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x6EDA;&#x74DC;&#x70C2;&#x719F;&#x7684;&#xFF0C;&#x4F46;&#x6BCF;&#x6B21;&#x53C8;&#x5FD8;&#x7684;&#x4E00;&#x5E72;&#x4E8C;&#x51C0;&#xFF0C;&#x8FD9;&#x4E48;&#x5FAA;&#x73AF;&#x51E0;&#x6B21;&#x2026;..&#x73B0;&#x5728;&#x4F9D;&#x7136;&#x662F;&#x5FD8;&#x8BB0;&#x4E86;&#x3002;&#x8FD9;&#x6BB5;&#x5386;&#x53F2;&#x9664;&#x4E86;&#x7528;&#x6765;&#x56DE;&#x5FC6;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x53EF;&#x4EE5;&#x8BF4;&#x660E;&#x7684;&#x662F;&#xFF0C;&#x6280;&#x672F;&#x4E0D;&#x662F;&#x7528;&#x6765;&#x6B7B;&#x8BB0;&#x6982;&#x5FF5;&#xFF0C;&#x8BED;&#x6CD5;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x843D;&#x5230;&#x5B9E;&#x5904;&#x5E94;&#x7528;&#xFF0C;&#x52A0;&#x5F3A;&#x5B9E;&#x8DF5;&#xFF0C;&#x4E0D;&#x7136;&#x4E5F;&#x662F;&#x5728;&#x80CC;&#x5929;&#x4E66;&#x3002;</p>
<p>&#x6162;&#x6162;&#x7684;&#xFF0C;&#x8857;&#x4E0A;&#x7684;&#x7F51;&#x5427;&#x591A;&#x4E86;&#x4E9B;&#xFF0C;&#x66FF;&#x4EE3;&#x4E86;&#x6211;&#x4E5F;&#x66FE;&#x7ECF;&#x75F4;&#x8FF7;&#x7684;&#x201D;&#x8857;&#x673A;&#x201C;&#xFF0C;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x6E38;&#x620F;&#xFF0C;&#x6BD4;&#x5982;&#x62F3;&#x7687;&#xFF0C;&#x534A;&#x6761;&#x547D;&#xFF0C;&#x7EA2;&#x8272;&#x8B66;&#x6212;&#x7B49;&#x7B49;&#xFF0C;&#x4ECA;&#x5929;&#x7684;&#x4F1A;&#x4E0A;&#x8FD8;&#x6709;&#x5609;&#x5BBE;&#x7528;&#x201D;&#x7EA2;&#x8272;&#x8B66;&#x6212;&#x201C;&#x6765;&#x9274;&#x5B9A;&#x201D;80&#x540E;&#x201C;&#x8EAB;&#x4EFD;&#xFF0C;&#x96BE;&#x9053;&#x90FD;&#x8FC7;&#x53BB;&#x90A3;&#x4E48;&#x4E45;&#x4E86;&#x5417;&#xFF1F;~&#x5BF9;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x4E0D;&#x80FD;&#x4E0D;&#x8BF4;&#x7684;QQ&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x53F7;&#x7801;&#x4E5F;&#x662F;&#x4E0D;&#x597D;&#x62FF;&#x7684;&#xFF0C;&#x8C8C;&#x4F3C;&#x540E;&#x6765;&#x770B;&#x4F20;&#x8BB0;&#x6709;&#x5199;&#x90A3;&#x65F6;&#x5019;&#x7684;&#x8D26;&#x53F7;&#x662F;&#x6709;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x8C01;&#x6709;&#x53F7;&#x7801;&#x5C31;&#x597D;&#x7FA1;&#x6155;&#x554A;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x53EF;&#x4EE5;&#x4E70;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x80FD;&#x4E70;&#x5230;&#x3002;&#x540E;&#x6765;&#x77E5;&#x9053;&#x59D0;&#x59D0;&#x6709;&#xFF0C;&#x5C31;&#x8DDF;&#x7740;&#x5979;&#x4E00;&#x8D77;&#x53BB;&#x770B;&#x5979;&#x73A9;&#xFF0C;&#x600E;&#x6837;&#x804A;&#x5929;&#x7B49;&#x7B49;&#x3002;&#x4E00;&#x6643;&#x5341;&#x5E74;&#x6709;&#x4F59;&#x4E86;~</p>
<h2 id="&#x4E09;&#x3001;css3&#x52A8;&#x753B;&#xFF08;&#x9648;&#x5728;&#x771F;&#xFF09;"><a href="#&#x4E09;&#x3001;css3&#x52A8;&#x753B;&#xFF08;&#x9648;&#x5728;&#x771F;&#xFF09;" class="headerlink" title="&#x4E09;&#x3001;css3&#x52A8;&#x753B;&#xFF08;&#x9648;&#x5728;&#x771F;&#xFF09;"></a>&#x4E09;&#x3001;css3&#x52A8;&#x753B;&#xFF08;&#x9648;&#x5728;&#x771F;&#xFF09;</h2><p>&#x6587;&#x7AE0;&#x7684;&#x5F00;&#x5934;&#x6211;&#x4E5F;&#x8BF4;&#x4E86;&#xFF0C;&#x6700;&#x8FD1;&#x867D;&#x7136;&#x4E5F;&#x662F;&#x4E00;&#x76F4;&#x5728;&#x5B66;&#x4E60;&#xFF0C;&#x53EF;&#x662F;&#x5374;&#x89C9;&#x5F97;&#x6B62;&#x6B65;&#x4E0D;&#x524D;&#xFF0C;css3&#x5C31;&#x7B97;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x6211;&#x4ECE;&#x53BB;&#x5E74;&#x5E95;&#x5F00;&#x59CB;&#x6162;&#x6162;&#x63A5;&#x89E6;&#x6BD4;&#x8F83;&#x591A;css3&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x662F;&#x521A;&#x8D77;&#x6B65;&#x9636;&#x6BB5;&#xFF0C;&#x5230;&#x4E86;&#x4ECA;&#x5E74;&#x7684;&#x4E0A;&#x534A;&#x5E74;&#x63A5;&#x89E6;&#x548C;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x73A9;&#x7684;&#x7A0D;&#x5FAE;&#x591A;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x4E5F;&#x53C8;&#x4E70;&#x4E24;&#x672C;&#x4E66;&#x770B;&#xFF0C;&#x8FC7;&#x6E21;&#x5230;&#x4E0B;&#x534A;&#x5E74;&#xFF0C;&#x89C9;&#x5F97;&#x6574;&#x4F53;&#x4E0A;&#x90FD;&#x7B97;&#x4E86;&#x89E3;&#x4E86;&#xFF0C;&#x5176;&#x4E2D;&#x5F53;&#x7136;&#x4E5F;&#x5305;&#x62EC;css3&#x52A8;&#x753B;&#xFF0C;&#x5728;&#x771F;&#x6240;&#x5217;&#x51FA;&#x7684;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x81EA;&#x5DF1;&#x8FD8;&#x7B97;&#x89C9;&#x5F97;&#x86EE;&#x719F;&#x6089;&#xFF0C;&#x53EA;&#x662F;&#x53EF;&#x80FD;&#x8FD0;&#x7528;&#x548C;&#x7406;&#x89E3;&#x5C1A;&#x9700;&#x52A0;&#x5F3A;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x6280;&#x672F;&#x53EA;&#x662F;&#x624B;&#x6BB5;&#xFF0C;&#x505A;&#x51FA;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#x81F3;&#x5C11;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x4F60;&#x61C2;&#x5F97;&#x8BE5;&#x600E;&#x4E48;&#x53BB;&#x505A;&#x3002;&#x5728;&#x771F;&#x5217;&#x51FA;&#x4E86;&#x4ED6;&#x6240;&#x603B;&#x7ED3;&#x7684;&#x201D;&#x5341;&#x56DB;&#x6761;&#x201C;&#x3002;</p>
<p><img src="/2014/12/27/webrebuild_2015/5.jpg" alt=""></p>
<p><img src="/2014/12/27/webrebuild_2015/6.jpg" alt=""></p>
<p>&#x5F53;&#x65F6;&#x4ED6;&#x8FD8;&#x7ED9;&#x51FA;&#x4E86;&#x51E0;&#x4E2A;demo&#x548C;&#x4E00;&#x4E9B;&#x7528;&#x4E8E;&#x8BF4;&#x660E;&#x539F;&#x59D4;&#x7684;&#x52A8;&#x753B;&#x8BA9;&#x5927;&#x5BB6;&#x53BB;&#x611F;&#x53D7;&#xFF0C;&#x6211;&#x5C31;&#x4E0D;&#x5217;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p>&#x6211;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x51FA;&#x8FD9;&#x4E48;&#x51E0;&#x70B9;&#xFF1A;</p>
<p>1&#x3001;&#x4EFF;&#x771F;&#xFF0C;&#x7565;&#x5E26;&#x5938;&#x5F20;&#x624B;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#x4EBA;&#x5728;&#x505A;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x80A2;&#x4F53;&#x52A8;&#x4F5C;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF1F;&#x4EBA;&#x7684;&#x884C;&#x4E3A;&#x4E60;&#x60EF;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF0C;&#x600E;&#x6837;&#x80FD;&#x8BA9;&#x4EBA;&#x660E;&#x767D;&#x4F60;&#x7684;&#x52A8;&#x753B;&#x8981;&#x4F20;&#x8FBE;&#x4EC0;&#x4E48;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x771F;&#x6240;&#x8BF4;&#x7684;&#x201D;&#x91CD;&#x70B9;&#x201C;&#x3002;&#x7136;&#x540E;&#x5C31;&#x662F;&#x5E73;&#x65F6;&#x7684;&#x4E00;&#x4E9B;&#x5F88;&#x7EC6;&#x5FAE;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7A0D;&#x52A0;&#x653E;&#x5927;&#xFF0C;&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x7269;&#x4F53;&#x4ECE;&#x4E0A;&#x5F80;&#x4E0B;&#x843D;&#xFF0C;&#x843D;&#x5230;&#x6700;&#x4E0B;&#x9762;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x73B0;&#x5B9E;&#x4E2D;&#xFF0C;&#x662F;&#x4F1A;&#x7A0D;&#x5FAE;&#x7684;&#x52A8;&#x4E00;&#x4E0B;&#xFF0C;&#x6CA1;&#x4EBA;&#x4F1A;&#x53BB;&#x5728;&#x610F;&#xFF0C;&#x4F46;&#x653E;&#x5728;&#x52A8;&#x753B;&#x91CC;&#xFF0C;&#x5B83;&#x5C31;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x4E2A;&#x89C6;&#x89C9;&#x7684;&#x7126;&#x70B9;&#xFF0C;&#x52A8;&#x7684;&#x5E45;&#x5EA6;&#x5C31;&#x8981;&#x7A0D;&#x5FAE;&#x52A0;&#x5927;&#xFF0C;&#x6216;&#x8005;&#x81F3;&#x5C11;&#x53D1;&#x751F;&#x4E00;&#x70B9;&#x70B9;&#x5F62;&#x53D8;&#x518D;&#x6062;&#x590D;&#x539F;&#x6837;&#xFF1B;</p>
<p>2&#x3001;&#x7269;&#x7406;&#x539F;&#x7406;&#x3002;&#x6BD4;&#x5982;&#x629B;&#x7269;&#x7EBF;&#xFF0C;&#x5F88;&#x5C11;&#x6709;&#x4E1C;&#x897F;&#x80FD;&#x591F;&#x7EDD;&#x5BF9;&#x7684;&#x76F4;&#x4E0A;&#x76F4;&#x4E0B;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x629B;&#x7269;&#x7EBF;&#x5E94;&#x8BE5;&#x662F;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x5728;&#x52A8;&#x753B;&#x4E2D;&#x8FD0;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F1A;&#x7275;&#x626F;&#x5230;&#x7269;&#x7406;&#x7684;&#x539F;&#x7406;&#x548C;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x52A8;&#x753B;&#x8981;&#x60F3;&#x505A;&#x597D;&#xFF0C;&#x903C;&#x771F;&#x6BD4;&#x8F83;&#x91CD;&#x8981;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x8FC7;&#x6E21;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;&#x5F88;&#x81EA;&#x7136;&#xFF0C;&#x6216;&#x8005;&#x6709;&#x7075;&#x611F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x6BD4;&#x8F83;&#x521B;&#x65B0;&#x7684;&#x6548;&#x679C;&#x3002; &#x6709;&#x65F6;&#x95F4;&#x6216;&#x8005;&#x6709;&#x9700;&#x6C42;&#x7684;&#x8BDD;&#x73A9;&#x73A9;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x8FD8;&#x662F;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x8D70;&#x8FDB;canvas&#x2014;&#x2014;&#x5B9E;&#x6218;&#x65B9;&#x6CD5;&#x4F53;&#x7CFB;&#xFF08;&#x8FC5;&#x96F7;&#x2014;&#x2014;&#x8983;&#x5353;&#x5802;&#xFF09;"><a href="#&#x56DB;&#x3001;&#x8D70;&#x8FDB;canvas&#x2014;&#x2014;&#x5B9E;&#x6218;&#x65B9;&#x6CD5;&#x4F53;&#x7CFB;&#xFF08;&#x8FC5;&#x96F7;&#x2014;&#x2014;&#x8983;&#x5353;&#x5802;&#xFF09;" class="headerlink" title="&#x56DB;&#x3001;&#x8D70;&#x8FDB;canvas&#x2014;&#x2014;&#x5B9E;&#x6218;&#x65B9;&#x6CD5;&#x4F53;&#x7CFB;&#xFF08;&#x8FC5;&#x96F7;&#x2014;&#x2014;&#x8983;&#x5353;&#x5802;&#xFF09;"></a>&#x56DB;&#x3001;&#x8D70;&#x8FDB;canvas&#x2014;&#x2014;&#x5B9E;&#x6218;&#x65B9;&#x6CD5;&#x4F53;&#x7CFB;&#xFF08;&#x8FC5;&#x96F7;&#x2014;&#x2014;&#x8983;&#x5353;&#x5802;&#xFF09;</h2><p>&#x8FD9;&#x5757;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4E0D;&#x80FD;&#x8BF4;&#x4E0D;&#x7CBE;&#x5F69;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5E73;&#x65F6;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x8FD9;&#x65B9;&#x9762;&#xFF0C;&#x4E5F;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x521D;&#x6B65;&#x7684;&#x4E86;&#x89E3;&#x548C;&#x505A;&#x8FC7;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6240;&#x8BB2;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x6CA1;&#x6709;&#x80FD;&#x5B8C;&#x5168;&#x7684;&#x5438;&#x6536;&#x5230;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4E5F;&#x7B97;&#x7ED9;&#x6211;&#x6307;&#x51FA;&#x4E86;&#x4E00;&#x70B9;&#x8981;&#x52AA;&#x529B;&#x7684;&#x65B9;&#x5411;&#x5427;&#x3002;&#x4E0A;&#x51E0;&#x5F20;&#x6548;&#x679C;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#x7684;&#x56FE;&#x7ED9;&#x5927;&#x5BB6;&#x770B;&#x3002;</p>
<p><img src="/2014/12/27/webrebuild_2015/7.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/8.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/9.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/10.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/11.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/12.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/13.jpg" alt=""> </p>
<p><img src="/2014/12/27/webrebuild_2015/14.jpg" alt=""> </p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;canvas&#x5C31;&#x662F;html&#x6765;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7A7A;&#x95F4;&#xFF0C;js&#x5728;&#x4E0A;&#x9762;&#x7FE9;&#x7FE9;&#x8D77;&#x821E;~</p>
<h2 id="&#x4E94;&#x3001;&#x201D;&#x60DF;&#x5FD7;&#x3001;&#x60DF;&#x52E4;&#x201C;&#xFF08;ISUX&#x2014;&#x2014;&#x201D;&#x5F20;&#x4EC1;&#x5BFF;&#x3001;&#x8D1D;&#x4FCA;&#x8FBE;&#x3001;&#x6881;&#x5FD7;&#x6770;&#x201C;&#xFF09;"><a href="#&#x4E94;&#x3001;&#x201D;&#x60DF;&#x5FD7;&#x3001;&#x60DF;&#x52E4;&#x201C;&#xFF08;ISUX&#x2014;&#x2014;&#x201D;&#x5F20;&#x4EC1;&#x5BFF;&#x3001;&#x8D1D;&#x4FCA;&#x8FBE;&#x3001;&#x6881;&#x5FD7;&#x6770;&#x201C;&#xFF09;" class="headerlink" title="&#x4E94;&#x3001;&#x201D;&#x60DF;&#x5FD7;&#x3001;&#x60DF;&#x52E4;&#x201C;&#xFF08;ISUX&#x2014;&#x2014;&#x201D;&#x5F20;&#x4EC1;&#x5BFF;&#x3001;&#x8D1D;&#x4FCA;&#x8FBE;&#x3001;&#x6881;&#x5FD7;&#x6770;&#x201C;&#xFF09;"></a>&#x4E94;&#x3001;&#x201D;&#x60DF;&#x5FD7;&#x3001;&#x60DF;&#x52E4;&#x201C;&#xFF08;ISUX&#x2014;&#x2014;&#x201D;&#x5F20;&#x4EC1;&#x5BFF;&#x3001;&#x8D1D;&#x4FCA;&#x8FBE;&#x3001;&#x6881;&#x5FD7;&#x6770;&#x201C;&#xFF09;</h2><p>&#x4E0B;&#x5348;&#x7684;&#x7B2C;&#x4E00;&#x6BB5;&#x662F;&#x7531;ISUX&#x7684;&#x540C;&#x4E8B;&#x4EEC;&#x5F00;&#x542F;&#x7684;&#xFF0C;&#x4E09;&#x4E2A;&#x4EBA;&#x8BB2;&#x4E86;&#x4E09;&#x6BB5;&#x6545;&#x4E8B;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E00;&#x65F6;&#x95F4;&#x5438;&#x6536;&#x4E0D;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x5927;&#x6982;&#x662F;&#x8BB2;&#x4E86;&#x4E00;&#x4E0B;&#x5173;&#x4E8E;&#x624B;Q&#xFF0C;&#x5173;&#x4E8E;&#x52A8;&#x753B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5173;&#x4E8E;&#x56FE;&#x7247;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x7684;&#x804C;&#x4E1A;&#x7ECF;&#x5386;&#xFF0C;&#x5176;&#x4E2D;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x62FF;&#x89C6;&#x89C9;&#x7A3F;&#x7528;ps&#x76F4;&#x63A5;&#x751F;&#x6210;&#x9875;&#x9762;&#x7684;&#x201D;&#x795E;&#x5947;&#x201C;&#x5DE5;&#x5177;&#xFF0C;&#x5176;&#x4ED6;&#x6CA1;&#x6709;&#x8BB0;&#x592A;&#x6E05;&#x695A;&#xFF0C;&#x4F46;&#x662F;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x9898;&#x76EE;&#x5012;&#x662F;&#x77E5;&#x9053;&#x4E86;&#x4E00;&#x4E9B;&#xFF0C;&#x51FA;&#x81EA;&#x4E60;&#x4E3B;&#x5E2D;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x8425;&#x517B;&#x6CA1;&#x6709;&#x5438;&#x6536;&#x5230;&#xFF0C;&#x8981;&#x68C0;&#x8BA8;&#x4E86;~</p>
<h2 id="&#x516D;&#x3001;&#x201D;&#x6E90;&#x4E8E;&#x4F18;&#x5316;&#xFF0C;&#x59CB;&#x4E8E;&#x5E26;&#x5BBD;&#x201C;&#xFF08;&#x5434;&#x73CD;&#x59AE;&#xFF09;"><a href="#&#x516D;&#x3001;&#x201D;&#x6E90;&#x4E8E;&#x4F18;&#x5316;&#xFF0C;&#x59CB;&#x4E8E;&#x5E26;&#x5BBD;&#x201C;&#xFF08;&#x5434;&#x73CD;&#x59AE;&#xFF09;" class="headerlink" title="&#x516D;&#x3001;&#x201D;&#x6E90;&#x4E8E;&#x4F18;&#x5316;&#xFF0C;&#x59CB;&#x4E8E;&#x5E26;&#x5BBD;&#x201C;&#xFF08;&#x5434;&#x73CD;&#x59AE;&#xFF09;"></a>&#x516D;&#x3001;&#x201D;&#x6E90;&#x4E8E;&#x4F18;&#x5316;&#xFF0C;&#x59CB;&#x4E8E;&#x5E26;&#x5BBD;&#x201C;&#xFF08;&#x5434;&#x73CD;&#x59AE;&#xFF09;</h2><p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4E3B;&#x8BB2;&#x8005;&#x65E9;&#x6709;&#x8033;&#x95FB;&#xFF0C;&#x535A;&#x5BA2;&#x4E5F;&#x770B;&#x8FC7;&#x51E0;&#x6B21;&#xFF0C;&#x7ED9;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x5F88;&#x597D;&#xFF0C;&#x535A;&#x6587;&#x4E5F;&#x6709;&#x4E0D;&#x5C11;&#x7684;&#x5E72;&#x8D27;&#x3002;&#x8FD9;&#x6B21;&#x7A0D;&#x5FAE;&#x8FD1;&#x8DDD;&#x79BB;&#x7684;&#x770B;&#x5230;&#xFF0C;&#x89C9;&#x5F97;&#x8DDF;&#x60F3;&#x8C61;&#x7684;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x5DEE;&#x522B;&#x3002;&#x66F4;&#x6709;&#x610F;&#x601D;&#x7684;&#x662F;&#xFF0C;&#x5979;&#x5230;&#x817E;&#x8BAF;&#x4E4B;&#x524D;&#x662F;&#x5728;&#x73CD;&#x7231;&#x7F51;&#x5DE5;&#x4F5C;&#x8FC7;&#xFF0C;&#x800C;&#x6211;&#x4E4B;&#x524D;&#x4E5F;&#x662F;&#x5E94;&#x8058;&#x8FC7;&#x73CD;&#x7231;&#x7684;&#x524D;&#x7AEF;&#x804C;&#x4F4D;&#xFF08;&#x597D;&#x5427;&#x8FD9;&#x91CC;&#x5141;&#x8BB8;&#x62CD;&#x7816;&#xFF0C;&#x53C8;&#x5F80;&#x81EA;&#x5DF1;&#x8138;&#x4E0A;&#x8D34;&#x91D1;&#x4E86;&#xFF09;&#xFF0C;&#x6211;&#x8FD9;&#x6837;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;&#x5DEE;&#x8DDD;&#x76F8;&#x5F53;&#x5927;&#x4E86;&#x3002;&#x5E9F;&#x8BDD;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;~<br>&#x5979;&#x8BB2;&#x5230;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x6709;&#x5173;&#x56FE;&#x7247;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#x597D;&#x50CF;&#x73B0;&#x5728;&#x662F;&#x5728;&#x8D1F;&#x8D23;Qzone&#xFF0C;&#x800C;Qzone&#x662F;&#x6709;&#x4E0D;&#x5C11;&#x56FE;&#x7247;&#x9700;&#x8981;&#x53BB;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x8BB2;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x56FE;&#x7247;&#x683C;&#x5F0F;&#x548C;&#x538B;&#x7F29;&#x56FE;&#x7247;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x56E2;&#x961F;&#x5728;&#x7528;&#x7684;&#x56FE;&#x7247;&#x5DE5;&#x5177;&#x548C;&#x52A8;&#x753B;&#x7D20;&#x6750;&#x7F51;&#x3002;</p>
<h2 id="&#x4E03;&#x3001;&#x5BFB;&#x627E;&#x9002;&#x5408;&#x91CD;&#x6784;&#x7684;&#x7406;&#x8BBA;&#xFF08;&#x5F20;&#x7678;&#x946B;&#xFF09;"><a href="#&#x4E03;&#x3001;&#x5BFB;&#x627E;&#x9002;&#x5408;&#x91CD;&#x6784;&#x7684;&#x7406;&#x8BBA;&#xFF08;&#x5F20;&#x7678;&#x946B;&#xFF09;" class="headerlink" title="&#x4E03;&#x3001;&#x5BFB;&#x627E;&#x9002;&#x5408;&#x91CD;&#x6784;&#x7684;&#x7406;&#x8BBA;&#xFF08;&#x5F20;&#x7678;&#x946B;&#xFF09;"></a>&#x4E03;&#x3001;&#x5BFB;&#x627E;&#x9002;&#x5408;&#x91CD;&#x6784;&#x7684;&#x7406;&#x8BBA;&#xFF08;&#x5F20;&#x7678;&#x946B;&#xFF09;</h2><p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x7EC8;&#x4E8E;&#x5230;&#x4E86;&#x9B3C;&#x54E5;&#x7684;&#x73AF;&#x8282;&#xFF0C;&#x4EF0;&#x6155;&#x9B3C;&#x54E5;&#x5DF2;&#x4E45;&#xFF0C;&#x8FD9;&#x6B21;&#x7EC8;&#x4E8E;&#x6709;&#x673A;&#x4F1A;&#x8FD1;&#x8DDD;&#x79BB;&#x7684;&#x8046;&#x542C;&#xFF0C;&#x7ED9;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x611F;&#x89C9;&#x662F;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5E74;&#x8F7B;&#xFF08;&#x5176;&#x5B9E;&#x4E5F;&#x53EA;&#x662F;30&#x51FA;&#x5934;&#xFF09;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x8FD9;&#x6B21;&#x9B3C;&#x54E5;&#x6240;&#x5206;&#x4EAB;&#x7684;&#x5185;&#x5BB9;&#x4E4B;&#x524D;&#x5728;&#x4ED6;&#x7684;&#x535A;&#x5BA2;&#x6216;&#x8005;&#x7535;&#x5B50;&#x4E66;&#x91CC;&#x770B;&#x5230;&#x8FC7;&#x5927;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4E14;&#x90A3;&#x4E9B;&#x4E5F;&#x662F;&#x6709;&#x4E9B;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x4ED6;&#x600E;&#x4E48;&#x53C8;&#x62FF;&#x51FA;&#x6765;&#x8BB2;&#x3002;&#x6211;&#x5E76;&#x6CA1;&#x6709;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x5C31;&#x53BB;&#x6000;&#x7591;&#x4ED6;&#x6240;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x662F;&#x5F15;&#x8D77;&#x4E86;&#x5BF9;&#x81EA;&#x8EAB;&#x7684;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x9B3C;&#x54E5;&#x6240;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x4ECA;&#x5929;&#x624D;&#x6709;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x61C2;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x95EE;&#x201D;&#x8BF4;&#x4E86;&#x5F88;&#x591A;&#x6B21;&#x7684;&#x4E1C;&#x897F;&#x5C31;&#x4EE3;&#x8868;&#x4F60;&#x4F1A;&#x7528;&#x4E86;&#x5417;&#xFF1F;&#x4F60;&#x5B8C;&#x5168;&#x9886;&#x609F;&#x4E86;&#x5417;&#xFF1F;&#x6B63;&#x786E;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x597D;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x600E;&#x4E48;&#x5C31;&#x4E0D;&#x503C;&#x5F97;&#x53CD;&#x590D;&#x7684;&#x53BB;&#x8BB2;&#xFF0C;&#x53BB;&#x56DE;&#x5473;&#xFF1F;&#x201C;&#x597D;&#x5427;&#xFF0C;&#x95EE;&#x4E86;&#x81EA;&#x5DF1;&#x51E0;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x65E0;&#x534A;&#x70B9;&#x7591;&#x60D1;&#x3002;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x4E0D;&#x662F;&#x8D25;&#x7ED9;&#x4E86;&#x522B;&#x4EBA;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x8D25;&#x7ED9;&#x4E86;&#x56F0;&#x96BE;&#xFF0C;&#x800C;&#x662F;&#x8D25;&#x7ED9;&#x4E86;&#x81EA;&#x5DF1;&#x3002;&#x81F3;&#x4E8E;&#x4ED6;&#x5230;&#x5E95;&#x8BB2;&#x4E86;&#x4E9B;&#x4EC0;&#x4E48;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x5230;&#x4ED6;&#x7684;&#x535A;&#x5BA2;&#x53BB;&#x770B;&#x770B;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x597D;&#x50CF;&#x90FD;&#x662F;&#x5728;&#x8BF4;&#x4ECA;&#x5929;&#x7684;&#x4F1A;&#x8BAE;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x62FF;&#x6211;&#x81EA;&#x5DF1;&#x4E3E;&#x4F8B;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x8981;&#x600E;&#x6837;&#x505A;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x5462;&#xFF1F;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x662F;&#x5E78;&#x798F;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x75DB;&#x82E6;&#x7684;&#xFF0C;&#x5E78;&#x798F;&#x5728;&#x4E8E;&#xFF0C;&#x662F;&#x6709;&#x201D;&#x7406;&#x60F3;&#x201C;&#x7684;&#xFF0C;&#x75DB;&#x82E6;&#x5728;&#x4E8E;&#xFF0C;&#x7406;&#x60F3;&#x4F55;&#x5904;&#x5B89;&#x653E;&#xFF1F;&#x4F55;&#x65F6;&#x5B9E;&#x73B0;&#xFF1F;&#x600E;&#x6837;&#x5B9E;&#x73B0;&#xFF1F;&#x6211;&#x4EEC;&#x603B;&#x4F1A;&#x9047;&#x5230;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E0D;&#x987A;&#x5229;&#xFF0C;&#x751F;&#x6D3B;&#x7410;&#x4E8B;&#xFF0C;&#x548C;&#x4EBA;&#x6C9F;&#x901A;&#x5408;&#x4F5C;&#x7684;&#x4E0D;&#x987A;&#x5229;&#xFF0C;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x88AB;&#x8FEB;&#x505C;&#x4E0B;&#xFF0C;&#x88AB;&#x8FEB;&#x6539;&#x6389;&#xFF0C;&#x8981;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x90A3;&#x79CD;&#x653B;&#x575A;&#x7684;&#x714E;&#x71AC;&#x7B49;&#x7B49;&#x3002; &#x90A3;&#x8FD8;&#x8981;&#x575A;&#x6301;&#x6211;&#x4EEC;&#x7684;&#x7406;&#x60F3;&#x5417;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF0C;&#x521A;&#x8BF4;&#x4E86;&#x54EA;&#x4E9B;&#x75DB;&#x82E6;&#xFF0C;&#x5176;&#x5B9E;&#x7406;&#x60F3;&#x4E3B;&#x4E49;&#x8005;&#x56E0;&#x4E3A;&#x6562;&#x4E8E;&#x7AD9;&#x5728;&#x6B8B;&#x9177;&#x7684;&#x73B0;&#x5B9E;&#x9762;&#x524D;&#x53BB;&#x60F3;&#x8C61;&#x7F8E;&#x597D;&#xFF0C;&#x6562;&#x4E8E;&#x628A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4ECE;&#x65E0;&#x5230;&#x6709;&#x7684;&#x53BB;&#x505A;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x575A;&#x5F3A;&#x548C;&#x4E0D;&#x670D;&#x8F93;&#xFF0C;&#x6240;&#x4EE5;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x4E9B;&#x56F0;&#x96BE;&#x90FD;&#x53EA;&#x662F;&#x6682;&#x65F6;&#x7684;&#xFF0C;&#x5916;&#x754C;&#x7684;&#x6761;&#x4EF6;&#x548C;&#x4EBA;&#x6211;&#x4EEC;&#x5DE6;&#x53F3;&#x4E0D;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x505A;&#x5230;&#x7684;&#x5C31;&#x662F;&#x81EA;&#x5DF1;&#x4E0D;&#x65AD;&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x53CD;&#x601D;&#xFF0C;&#x79EF;&#x7D2F;&#xFF0C;&#x4EE5;&#x671F;&#x6211;&#x4EEC;&#x80FD;&#x505A;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x597D;&#xFF0C;&#x6700;&#x7EC8;&#x53D6;&#x5F97;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5199;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x7B97;&#x662F;&#x7ED9;&#x81EA;&#x5DF1;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5230;&#x4ECA;&#x5929;&#x53C2;&#x52A0;&#x5B8C;&#x4F1A;&#x8BAE;&#x4E4B;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x7ED3;&#x3002;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x76F4;&#x63A5;&#x7684;&#x6280;&#x672F;&#x5E72;&#x8D27;&#xFF0C;&#x54B1;&#x4EEC;&#x4E0B;&#x6B21;&#x518D;&#x8BE6;&#x804A;~&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x52A0;&#x6CB9;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/11/23/fequan_2014/" itemprop="url">
                  《前端圈技术论坛-腾讯互娱专场》观后感
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-11-23T00:00:00+08:00" content="2014-11-23">
              2014-11-23
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/分享交流/" itemprop="url" rel="index">
                    <span itemprop="name">分享交流</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x81EA;&#x4ECE;&#x77E5;&#x9053;&#x4E86;<a href="http://www.fequan.com/" target="_blank" rel="external">&#x524D;&#x7AEF;&#x5708;</a>&#x4F1A;&#x6709;&#x8D70;&#x8FDB;&#x540D;&#x4F01;&#x7684;&#x8BBA;&#x575B;&#xFF0C;&#x5C31;&#x671F;&#x5F85;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x53BB;&#x53C2;&#x52A0;&#xFF0C;10&#x6708;&#x4EFD;&#x6709;&#x4E00;&#x6B21;&#x5728;&#x5E7F;&#x5DDE;vip&#xFF0C;&#x4E0D;&#x7B97;&#x8FDC;&#xFF0C;&#x672C;&#x6765;&#x8981;&#x53BB;&#x7684;&#xFF0C;&#x4F46;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x672A;&#x80FD;&#x53BB;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x5076;&#x7136;&#x77E5;&#x9053;&#x4E86;&#x8D70;&#x8FDB;&#x4E92;&#x5A31;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x8BB2;&#x91CD;&#x6784;&#x548C;H5&#x6E38;&#x620F;&#x65B9;&#x9762;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x521A;&#x6765;&#x5230;&#x4F01;&#x9E45;&#x505A;&#x91CD;&#x6784;&#xFF0C;&#x4F3C;&#x4E4E;&#x6CA1;&#x7406;&#x7531;&#x4E0D;&#x53BB;&#x4E86;~</p>
<p>&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p>1&#x3001;TGideas&#x526F;&#x603B;&#x76D1;PANTHER&#x81F4;&#x8F9E;<br>2&#x3001;TGideas&#x91CD;&#x6784;&#x56DB;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x9EC4;&#x52C7;&#x5C24;&#xFF1A;<strong>Can I use webp&#xFF1F;</strong></p>
<p>&#x9996;&#x5148;&#x4E0D;&#x5F97;&#x4E0D;&#x5766;&#x8BDA;&#x7684;&#x8BF4;&#x7B2C;&#x4E00;&#x6B21;&#x5230;&#x4E92;&#x5A31;&#x53BB;&#xFF0C;&#x800C;&#x4E14;&#x4EA4;&#x901A;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x8FDF;&#x5230;&#x4E86;&#xFF0C;&#x5F88;&#x9057;&#x61BE;&#x7684;&#x9519;&#x8FC7;&#x4E86;&#x524D;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x7B49;&#x6211;&#x53BB;&#x4E86;&#x4E4B;&#x540E;&#x5DF2;&#x7ECF;&#x5230;&#x4E86;&#x7B2C;&#x4E09;&#x4E2A;&#x8BDD;&#x9898;&#x7684;&#x63D0;&#x95EE;&#x73AF;&#x8282;&#x3002;&#x7ACB;&#x5373;&#x5750;&#x4E0B;&#x4E13;&#x5FC3;&#x542C;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x90E8;&#x5206;&#x7684;&#x5982;&#x679C;&#x540E;&#x9762;&#x6709;&#x8D44;&#x6599;&#x653E;&#x51FA;&#xFF0C;&#x4F1A;&#x505A;&#x4E2A;&#x5F25;&#x8865;&#x3002;</p>
<p>3&#x3001;TGideas&#x91CD;&#x6784;&#x4E00;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x8C2D;&#x6770;&#x4FCA;&#xFF1A;<strong>&#x9010;&#x5E27;&#x52A8;&#x753B;-&#x8BA9;&#x9B54;&#x6CD5;&#x5C0F;&#x7CBE;&#x7075;&#x5728;&#x4F60;&#x7684;&#x9875;&#x9762;&#x4E0A;&#x8D77;&#x821E;</strong></p>
<p>&#x8FD9;&#x4E2A;&#x90E8;&#x5206;&#x53EA;&#x542C;&#x5230;&#x4E86;&#x63D0;&#x95EE;&#x7684;&#x73AF;&#x8282;&#xFF0C;&#x4E5F;&#x7A0D;&#x6709;&#x9057;&#x61BE;&#xFF0C;&#x63D0;&#x95EE;&#x7684;&#x65F6;&#x5019;&#x6709;&#x95EE;&#x5230;&#x56FE;&#x7247;&#x538B;&#x7F29;&#x548C;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x505A;&#x52A8;&#x753B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x4F55;&#x9009;&#x62E9;css3&#x548C;js&#xFF0C;&#x8981;&#x628A;&#x6587;&#x4EF6;&#x6700;&#x597D;&#x63A7;&#x5236;&#x5230;&#x591A;&#x5927;&#x3002;&#x8FD9;&#x65B9;&#x9762;&#x4E4B;&#x524D;&#x4E5F;&#x6709;&#x4E86;&#x89E3;&#xFF0C;&#x8BB2;&#x5E08;&#x4E3B;&#x5F20;&#x4F18;&#x5148;&#x9009;&#x62E9;css3&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x505A;&#x4E00;&#x4E9B;&#x964D;&#x7EA7;&#x7684;&#x5904;&#x7406;&#x3002;&#x8FD8;&#x6709;&#x63D0;&#x5230;&#x4E86;Gpu&#x52A0;&#x901F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x6709;&#x4E9B;css3&#x7684;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x89E6;&#x53D1;gpu&#x52A0;&#x901F;&#x7684;&#x3002;</p>
<p>4&#x3001;TGideas&#x591A;&#x5A92;&#x4F53;&#x5F00;&#x53D1;&#x7EC4;&#xFF08;&#x591A;&#x5A92;&#x4F53;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09; &#x7F57;&#x98DE;&#x864E;</p>
<p>&#x8FD9;&#x6BB5;&#x662F;&#x6211;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4E0D;&#x719F;&#x6089;&#x624D;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x5E73;&#x65F6;&#x4E5F;&#x7231;&#x73A9;&#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x9177;&#x8DD1;~&#x6E38;&#x620F;&#x6CA1;&#x6709;&#x505A;&#x8FC7;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x6536;&#x83B7;&#xFF0C;&#x6BD4;&#x5982;&#x6E38;&#x620F;&#x5927;&#x6982;&#x8981;&#x505A;&#x7684;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x52A0;&#x8F7D;&#x72B6;&#x6001;&#x3001;&#x6B22;&#x8FCE;&#x72B6;&#x6001;&#x3001;&#x65B0;&#x624B;&#x5F15;&#x5BFC;&#x3001;&#x6E38;&#x620F;&#x4E2D;&#x3001;&#x7ED3;&#x7B97;&#x5206;&#x6570;&#x3001;&#x5206;&#x4EAB;&#x6218;&#x7EE9;&#x7B49;&#x7B49;&#xFF0C;&#x7A81;&#x7136;&#x4E00;&#x4E0B;&#x5B50;&#x4F7F;&#x5F97;&#x5BF9;&#x4E8E;&#x6E38;&#x620F;&#x7684;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#x53D8;&#x5F97;&#x660E;&#x6717;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD8;&#x89C1;&#x8BC6;&#x5230;&#x4E86;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#x5F53;&#x4E2D;&#x8981;&#x7528;&#x5230;&#x591A;&#x5C11;&#x79CD;&#x7C7B;&#x548C;&#x72B6;&#x6001;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x63D0;&#x5230;&#x4E86;&#x4E24;&#x79CD;&#x5F15;&#x64CE;&#xFF0C;cocos2d-html5&#x548C;createjs&#x3002;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x5BF9;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E86;&#x89E3;&#x4E0D;&#x591A;&#xFF0C;&#x4EE5;&#x540E;&#x8981;&#x52A0;&#x5F3A;&#x4E86;&#x3002; &#x63D0;&#x95EE;&#x73AF;&#x8282;&#x6709;&#x4EBA;&#x95EE;&#x5230;&#x4E86;&#x5982;&#x4F55;&#x505A;&#x5230;&#x624B;&#x673A;&#x4E0A;&#x548C;ipad&#x4E0A;&#x7684;&#x9002;&#x914D;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x65F6;&#x4ED6;&#x672A;&#x505A;&#x8FC7;&#x591A;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x540E;&#x6765;&#x53E6;&#x4E00;&#x4F4D;&#x5609;&#x5BBE;&#x8865;&#x5145;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x4E24;&#x5957;&#x65B9;&#x6848;&#xFF0C;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x8BBE;&#x5907;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;css&#x6216;&#x56FE;&#x7247;&#x3002;</p>
<p>5&#x3001;TGideas&#x91CD;&#x6784;&#x4E8C;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x4E01;&#x4EAE;&#x4EAE;&#xFF1A;<strong>&#x91CD;&#x6784;&#x4EE3;&#x7801;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;</strong></p>
<p>&#x8FD9;&#x4E00;&#x6BB5;&#x662F;&#x4E2D;&#x95F4;&#x4F11;&#x606F;&#x4E4B;&#x540E;&#x7684;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E00;&#x4E2A;&#x8BDD;&#x9898;&#x52A0;&#x4E0A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#xFF0C;&#x662F;&#x8DDF;&#x6211;&#x5E73;&#x65F6;&#x5DE5;&#x4F5C;&#x6700;&#x8D34;&#x5207;&#x7684;&#x3002;smallni&#x7684;&#x535A;&#x5BA2;&#x5E73;&#x65F6;&#x4E5F;&#x5E38;&#x770B;&#xFF0C;whycss&#x7F51;&#x5740;&#x5BFC;&#x822A;&#x5E94;&#x8BE5;&#x4E5F;&#x662F;&#x4ED6;&#x505A;&#x7684;&#xFF0C;&#x90FD;&#x5F88;&#x4E0D;&#x9519;&#xFF0C;&#x8FD9;&#x6B21;&#x6709;&#x5E78;&#x542C;&#x5230;&#x4ED6;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x5F88;&#x8363;&#x5E78;&#x3002;&#x8BED;&#x901F;&#x9002;&#x4E2D;&#xFF0C;&#x4E0D;&#x662F;&#x90A3;&#x79CD;&#x8BA9;&#x4EBA;&#x60F3;&#x7761;&#x7740;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x633A;&#x597D;~</p>
<p>&#x4ED6;&#x63D0;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x4F18;&#x96C5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4ED6;&#x91C7;&#x7528;&#x4E86;&#x4EE3;&#x7801;&#x622A;&#x56FE;&#x4F5C;&#x5BF9;&#x6BD4;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C55;&#x793A;&#x4E86;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x7F29;&#x8FDB;&#xFF0C;&#x4E0D;&#x540C;&#x7C7B;&#x547D;&#x540D;&#x65B9;&#x6CD5;&#x4E4B;&#x4E0B;&#x7684;html&#x548C;css&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0D;&#x4EC5;&#x4EC5;&#x505A;&#x5230;&#x6807;&#x7B7E;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x540C;&#x6837;&#x7C7B;&#x7684;&#x547D;&#x540D;&#x4E5F;&#x8981;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x5229;&#x7528;&#x597D;&#x57FA;&#x7C7B;&#xFF0C;&#x6269;&#x5C55;&#x7C7B;&#xFF0C;&#x5B9E;&#x4F8B;&#x7C7B;&#x8FD9;&#x4E9B;&#x6280;&#x5DE7;&#x3002;&#x600E;&#x6837;&#x5199;&#x4EE3;&#x7801;&#x66F4;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF0C;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x4FBF;&#x80FD;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x4F18;&#x96C5;&#x3002;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6CE8;&#x91CA;&#xFF0C;&#x63D0;&#x51FA;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x4E0D;&#x8981;&#x6CE8;&#x91CA;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x7EF4;&#x62A4;&#x6216;&#x8005;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#xFF0C;&#x8981;&#x52A0;&#x4E0A;&#x5408;&#x7406;&#x7684;&#x6CE8;&#x91CA;&#x3002;&#x786E;&#x8BA4;&#x8BBE;&#x8BA1;&#x7A3F;&#x4E2D;&#x4EA4;&#x4E92;&#x662F;&#x5426;&#x5B8C;&#x6574;&#xFF0C;&#x6BD4;&#x5982;&#x662F;&#x5426;&#x5177;&#x6709;&#x4E86;&#x5404;&#x79CD;&#x72B6;&#x6001;&#x4E0B;&#x5E94;&#x6709;&#x7684;UI&#xFF0C;&#x786E;&#x8BA4;&#x56FA;&#x5B9A;&#x6807;&#x9898;&#x5B57;&#x6570;&#x3001;&#x56FA;&#x5B9A;&#x56FE;&#x7247;&#x4F4D;&#x5927;&#x5C0F;&#x89C4;&#x8303;&#x7B49;&#x7B49;&#x3002;&#x4E5F;&#x63D0;&#x5230;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x6BD4;&#x5982;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x770B;&#x8D77;&#x6765;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x6807;&#x9898;&#x548C;&#x5185;&#x5BB9;&#xFF0C;&#x90A3;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x53EA;&#x6709;&#x8DDF;&#x5B83;&#x76F8;&#x4F3C;&#x7684;&#x6807;&#x9898;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x53EA;&#x6709;&#x8DDF;&#x5B83;&#x76F8;&#x4F3C;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x53BB;&#x628A;&#x6574;&#x4E2A;&#x4E00;&#x5927;&#x5757;&#x6A21;&#x5757;&#x5316;&#x660E;&#x663E;&#x5C31;&#x884C;&#x4E0D;&#x901A;&#x4E86;&#xFF0C;&#x4E5F;&#x505A;&#x4E0D;&#x5230;&#x5F88;&#x597D;&#x7684;&#x590D;&#x7528;&#x3002;&#x7531;&#x6B64;&#x5F15;&#x51FA;&#x4E86;&#x5230;&#x5E95;&#x600E;&#x6837;&#x53BB;&#x5212;&#x5206;&#xFF0C;&#x4EE5;&#x600E;&#x6837;&#x7684;&#x6807;&#x51C6;&#x53BB;&#x5212;&#x5206;&#xFF0C;&#x63D0;&#x5230;&#x4E86;&#x9897;&#x7C92;&#x5316;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x4F60;&#x8981;&#x6A21;&#x5757;&#x5316;&#x7684;&#x4E1C;&#x897F;&#x8303;&#x56F4;&#x7F29;&#x5C0F;&#xFF0C;&#x53E6;&#x5916;&#x7684;&#x90E8;&#x5206;&#x5212;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x9897;&#x7C92;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x5C31;&#x50CF;&#x662F;&#x9897;&#x7C92;&#x548C;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x534F;&#x4F5C;&#x4E00;&#x6837;&#x53BB;&#x5B8C;&#x6210;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x3002;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x601D;&#x8DEF;&#x3002;</p>
<p>6&#x3001;TGideas&#x91CD;&#x6784;&#x4E8C;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x8096;&#x946B;&#x88D5;&#xFF1A;<strong>&#x524D;&#x7AEF;&#x722C;&#x5751;&#x6307;&#x5357;</strong></p>
<p>&#x6B64;&#x4EBA;&#x98CE;&#x683C;&#x5E7D;&#x9ED8;&#x8BD9;&#x8C10;&#xFF0C;&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#x662F;css&#x68EE;&#x6797;&#x7FA4;&#x91CC;&#x9762;&#x7684;&#x201C;&#x602A;&#x517D;&#x201D;&#xFF0C;PPT&#x80CC;&#x666F;&#x662F;&#x7C89;&#x7EA2;&#x8272;&#xFF0C;&#x81EA;&#x6211;&#x8C03;&#x4F83;&#x6BD4;&#x8F83;&#x201C;&#x9A9A;&#x201D;&#x3002;&#x6CA1;&#x6709;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#xFF0C;&#x4E0D;&#x4F1A;&#x663E;&#x5F97;&#x5F88;&#x95F7;&#x3002;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x4ECE;&#x4E1A;&#x7ECF;&#x5386;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x517C;&#x5BB9;IE&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x76F8;&#x5173;&#x4F60;&#x7684;&#x7528;&#x6237;&#x7FA4;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x90E8;&#x5206;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x8FD8;&#x6709;&#x8BB2;&#x5230;&#x8BF4;&#x5982;&#x679C;&#x91CD;&#x6784;&#x6BD4;&#x8F83;&#x65E9;&#x7684;&#x8FDB;&#x5165;&#x5230;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x62FF;&#x5230;&#x8BBE;&#x8BA1;&#x7A3F;&#x4E4B;&#x524D;&#xFF0C;&#x5982;&#x4F55;&#x53BB;&#x786E;&#x5B9A;&#x516C;&#x7528;&#x6216;&#x8005;&#x53EF;&#x590D;&#x7528;&#x548C;&#x6269;&#x5C55;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x4E4B;&#x524D;&#x4E00;&#x4E2A;&#x7AE5;&#x978B;&#x63D0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x505A;&#x4E86;&#x8865;&#x5145;&#x89E3;&#x7B54;&#xFF0C;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4ED6;&#x7ED9;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x628A;&#x6240;&#x6709;&#x7684;&#x90FD;&#x505A;&#x6210;&#x516C;&#x7528;&#x90E8;&#x5206;~&#x5475;&#x5475;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x662F;&#x5426;&#x53EF;&#x884C;&#x8FD8;&#x662F;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x8003;&#x91CF;&#x4E86;&#x3002;&#x7136;&#x540E;&#x8FD8;&#x4E3E;&#x4E86;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4EA7;&#x54C1;&#x4F8B;&#x5B50;&#x6BD4;&#x5982;Qzone&#xFF0C;&#x6211;&#x53CB;&#x7F51;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x6B3E;&#x4EA7;&#x54C1;&#x8BB0;&#x4E0D;&#x5927;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x6765;&#x4E3E;&#x4F8B;&#x5B50;&#x53BB;&#x5206;&#x6790;&#x5728;&#x4E0D;&#x540C;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x4E0D;&#x7528;&#x91CF;&#x7EA7;&#x7528;&#x6237;&#x7FA4;&#xFF0C;&#x4E0D;&#x540C;&#x4EA7;&#x54C1;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#xFF0C;&#x4E0D;&#x540C;&#x89C4;&#x6A21;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x600E;&#x6837;&#x53D6;&#x820D;&#x3002;&#x5728;&#x8DDF;&#x540C;&#x4E8B;&#x4E4B;&#x95F4;&#x7684;&#x5408;&#x4F5C;&#x4E5F;&#x662F;&#x4E0D;&#x80FD;&#x201C;&#x8A00;&#x542C;&#x5373;&#x4ECE;&#x201D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x522B;&#x4EBA;&#x8BA9;&#x4F60;&#x6539;&#x4F60;&#x5C31;&#x6539;&#xFF0C;&#x522B;&#x4EBA;&#x8BA9;&#x4F60;&#x52A0;&#x73ED;&#x91CD;&#x505A;&#xFF0C;&#x4F60;&#x5C31;&#x52A0;&#x73ED;&#x91CD;&#x505A;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x4E2A;&#x4EBA;&#x548C;&#x56E2;&#x961F;&#x90FD;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x597D;&#x4E8B;&#x60C5;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x8981;&#x4F1A;&#x9002;&#x5F53;&#x7684;&#x4E3A;&#x81EA;&#x5DF1;&#x53BB;&#x4E89;&#x53D6;&#x800C;&#x62D2;&#x7EDD;&#x4E00;&#x4E9B;&#x8981;&#x6C42;&#x3002;&#x8FD8;&#x4E3E;&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x53BB;&#x8BF4;&#x660E;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x4E1C;&#x897F;&#x8DDF;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x540C;&#xFF0C;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x8DDF;&#x5BA2;&#x6237;&#x771F;&#x6B63;&#x60F3;&#x8981;&#x7684;&#x53EF;&#x80FD;&#x53C8;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x66F4;&#x597D;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x591A;&#x7684;&#x53BB;&#x5173;&#x6CE8;&#x7528;&#x6237;&#xFF0C;&#x5173;&#x6CE8;&#x6570;&#x636E;&#x5206;&#x6790;&#x7B49;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x8981;&#x505A;&#x5230;&#x6709;&#x7406;&#x6709;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x4EA7;&#x54C1;&#x8BA4;&#x4E3A;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x6216;&#x8005;&#x8BBE;&#x8BA1;&#x8BA4;&#x4E3A;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x4F60;&#x4E0D;&#x540C;&#x610F;&#xFF0C;&#x4ED6;&#x4EEC;&#x95EE;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x56DE;&#x7B54;&#xFF1A;&#x6211;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#x90A3;&#x6837;&#x6BD4;&#x8FD9;&#x6837;&#x597D;&#x3002;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x80FD;&#x591F;&#x6709;&#x8BF4;&#x670D;&#x529B;&#x7684;&#xFF0C;&#x8BA8;&#x8BBA;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F88;&#x5FEB;&#x6709;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x62FF;&#x51FA;&#x5B9E;&#x4F8B;&#x6216;&#x8005;&#x5B9E;&#x9645;&#x7684;&#x5E02;&#x573A;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F88;&#x660E;&#x663E;&#x7684;&#x770B;&#x51FA;&#x5B70;&#x4F18;&#x5B70;&#x52A3;&#x3002;<br>&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x6240;&#x8BB2;&#x7684;&#x662F;&#x4E00;&#x4E9B;&#x722C;&#x5751;&#xFF0C;&#x5185;&#x5BB9;&#x4E0D;&#x6B62;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x4FE1;&#x606F;&#x91CF;&#x7A0D;&#x5927;&#xFF0C;&#x5F53;&#x65F6;&#x53C8;&#x53BB;&#x665A;&#x4E86;&#x5750;&#x5728;&#x540E;&#x6392;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x6CA1;&#x62CD;&#x7167;&#xFF0C;&#x540E;&#x671F;&#x524D;&#x7AEF;&#x7FA4;&#x5E94;&#x8BE5;&#x4F1A;&#x6709;PPT&#x53D1;&#x5E03;&#x51FA;&#x6765;&#x5230;&#x65F6;&#x518D;&#x56DE;&#x5473;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x6B21;&#x7684;&#x5206;&#x4EAB;&#x5C31;&#x5148;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x628A;&#x8BBA;&#x575B;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x542C;&#x5B8C;&#xFF0C;&#x4F46;&#x6536;&#x83B7;&#x4E5F;&#x662F;&#x86EE;&#x5927;&#x7684;&#x3002;&#x89C1;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x725B;&#x4EBA;&#x4EEC;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4E5F;&#x53C2;&#x52A0;&#x4E86;&#x6700;&#x540E;&#x7684;&#x6E38;&#x620F;&#x73AF;&#x8282;&#x5E76;&#x62FF;&#x5230;&#x4E86;&#x4E00;&#x4EFD;&#x793C;&#x7269;&#x54E6;&#xFF01;&#x4E0B;&#x9762;&#x5949;&#x4E0A;&#x7167;&#x7247;&#x3002;</p>
<p>&#x96C6;&#x4F53;&#x5408;&#x7167;&#x7559;&#x5FF5;&#xFF08;&#x5973;&#x751F;&#x540E;&#x9762;&#x90A3;&#x6392;&#x4E2D;&#x95F4;&#x5DE6;&#x624B;&#x62FF;&#x793C;&#x7269;&#x7684;&#x683C;&#x683C;&#x77ED;&#x8896;&#x7537;&#x751F;&#x5C31;&#x662F;&#x6211;&#x54E6;~&#xFF09;</p>
<p><img src="/2014/11/23/fequan_2014/1.jpg" alt="&#x5927;&#x5408;&#x5F71;"><br>&#x5F97;&#x5230;&#x7684;&#x5C0F;&#x793C;&#x7269;</p>
<p><img src="/2014/11/23/fequan_2014/2.jpg" alt="&#x5145;&#x7535;&#x5B9D;"> </p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/11/14/导航类“不定宽水平居中”的几种思路/" itemprop="url">
                  导航类“不定宽水平居中”的几种思路
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-11-14T00:00:00+08:00" content="2014-11-14">
              2014-11-14
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x5B9A;&#x5BBD;&#x5C45;&#x4E2D;&#x6211;&#x4EEC;&#x89C1;&#x7684;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;width&#x3001;text-align&#x3001;margin&#x7B49;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5BBD;&#x5EA6;&#x5462;&#xFF1F;<br>&#x4E0B;&#x9762;&#x63D0;&#x4F9B;&#x51E0;&#x79CD;&#x601D;&#x8DEF;&#x4F9B;&#x5927;&#x5BB6;&#x53C2;&#x8003;&#xFF0C;&#x7ED9;&#x51FA;&#x57FA;&#x672C;&#x7684;html&#x7ED3;&#x6784;&#x548C;&#x601D;&#x8DEF;&#xFF0C;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x9053;&#x7406;&#x641E;&#x61C2;&#x4E86;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x80FD;&#x591F;&#x7075;&#x6D3B;&#x53D8;&#x901A;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x9879;&#x662F;&#x6709;&#x56FA;&#x5B9A;&#x5BBD;&#x548C;&#x9AD8;&#x7684;&#x3002;</p>
  <header><br>    <nav><br>        <ul><br>       <li>a</li><br>             <li>b</li><br>       <li>c</li><br>      </ul><br>    </nav><br>  </header>

<h2 id="&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDD;&#x5BF9;&#x3001;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#x6216;&#x8005;translateX"><a href="#&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDD;&#x5BF9;&#x3001;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#x6216;&#x8005;translateX" class="headerlink" title="&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDD;&#x5BF9;&#x3001;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#x6216;&#x8005;translateX"></a>&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x7EDD;&#x5BF9;&#x3001;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#x6216;&#x8005;translateX</h2><pre><code>nav{position:absolute;left:50%;}
nav ul{position:relative;left:-50%;overflow:hidden;}
nav ul li{width:150px;height: 300px;float: left;background: #0F0;}
</code></pre><p>header&#x9ED8;&#x8BA4;&#x5BBD;&#x5EA6;100%&#xFF0C;&#x628A;nav&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;left:50%;&#x7136;&#x540E;&#x91CC;&#x9762;&#x7684;ul&#x8FDB;&#x884C;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;left:-50%;&#x5728;&#x8FD9;&#x70B9;&#x4E0A;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x662F;&#x529E;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x628A;&#x5E03;&#x5C40;&#x7834;&#x574F;&#x6389;&#x4E86;&#xFF0C;&#x5BB9;&#x5668;&#x5BBD;&#x5EA6;&#x6CA1;&#x6709;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x5C31;&#x9762;&#x76EE;&#x5168;&#x975E;&#xFF0C;&#x4E5F;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;left:-50%&#x3002;&#x53EF;&#x80FD;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;margin-left:-50%:&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x5427;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x73B0;&#x6709;&#x6761;&#x4EF6;&#x4E0B;&#x662F;&#x4E0D;&#x884C;&#x6EF4;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x7236;&#x5BB9;&#x5668;&#x5BBD;&#x5EA6;&#x56FA;&#x5B9A;&#x3002;&#x90A3;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4E48;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4F7F;&#x7528;translateX&#xFF08;-50%&#xFF09;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x6548;&#x679C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x7236;&#x5BB9;&#x5668;&#x7684;&#x5BBD;&#x5EA6;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5B9A;&#x7684;&#x5916;&#x5C42;&#x5BB9;&#x5668;left:50%;&#x5982;&#x679C;&#x4F60;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#x9879;&#x8FDB;&#x53BB;&#xFF0C;&#x6216;&#x8005;&#x6BCF;&#x4E00;&#x9879;&#x7684;&#x5BBD;&#x5EA6;&#x8FC7;&#x5BBD;&#xFF0C;&#x5BFC;&#x81F4;&#x90A3;&#x4E2A;&#x201C;&#x9690;&#x5F62;&#x201D;&#x7684;&#x5BB9;&#x5668;&#xFF08;nav&#xFF09;&#x53F3;&#x4FA7;&#x8D85;&#x8FC7;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x6EA2;&#x51FA;&#x4E86;&#x7684;&#x8BDD;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4F1A;&#x88AB;&#x6324;&#x4E0B;&#x53BB;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x8FDD;&#x80CC;&#x521D;&#x8877;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x8981;&#x5C0F;&#x5FC3;&#x54E6;&#xFF01;~</p>
<h2 id="&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;Flexbox&#x6765;&#x5B9E;&#x73B0;"><a href="#&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;Flexbox&#x6765;&#x5B9E;&#x73B0;" class="headerlink" title="&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;Flexbox&#x6765;&#x5B9E;&#x73B0;"></a>&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x4F7F;&#x7528;Flexbox&#x6765;&#x5B9E;&#x73B0;</h2><p>&#x5982;&#x679C;&#x6709;&#x8FC7;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#x7684;&#x4EBA;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x8D77;&#x6765;so easy&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x9700;&#x8981;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x5B83;&#x7F62;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;&#x6B64;&#x6CD5;&#xFF0C;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x5B9A;&#x4F4D;&#x4E86;&#x3002;</p>
<p>css&#x5982;&#x4E0B;</p>
<pre><code>ul{
     display: -webkit-flex;
     -webkit-flex-direction: row;
     -webkit-justify-content: center;
    }
</code></pre><p>&#x6B64;&#x6CD5;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5E72;&#x51C0;&#x5229;&#x843D;&#x4E0D;&#x7559;&#x75D5;&#x5450;&#xFF0C;just&#x4F4E;&#x7248;&#x672C;IE&#x4E0D;&#x517C;&#x5BB9;~&#x6B64;&#x5904;&#x4EC5;&#x52A0;&#x4E86;webkit&#x524D;&#x7F00;&#xFF0C;&#x4E0D;&#x4E86;&#x89E3;&#x7684;&#x7AE5;&#x978B;&#x4E14;&#x52FF;&#x76F4;&#x63A5;&#x7167;&#x642C;&#x4F7F;&#x7528;&#x54E6;&#x3002;</p>
<p>&#x66F4;&#x591A;flexbox&#x76F8;&#x5173;&#x53EF;&#x53C2;&#x8003;<a href="http://www.w3cplus.com/blog/tags/157.html" target="_blank" rel="external">flexbox</a></p>
<h2 id="&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;js&#x83B7;&#x53D6;&#x9879;&#x76EE;&#x6570;&#x8BBE;&#x7F6E;&#x5BBD;&#x5EA6;"><a href="#&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;js&#x83B7;&#x53D6;&#x9879;&#x76EE;&#x6570;&#x8BBE;&#x7F6E;&#x5BBD;&#x5EA6;" class="headerlink" title="&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;js&#x83B7;&#x53D6;&#x9879;&#x76EE;&#x6570;&#x8BBE;&#x7F6E;&#x5BBD;&#x5EA6;"></a>&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;js&#x83B7;&#x53D6;&#x9879;&#x76EE;&#x6570;&#x8BBE;&#x7F6E;&#x5BBD;&#x5EA6;</h2><p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6709;&#x70B9;&#x7B28;&#xFF0C;&#x53EA;&#x662F;&#x7ED5;&#x4E86;&#x4E2A;&#x5F2F;&#x5B50;&#xFF0C;&#x4ECD;&#x7136;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5E38;&#x89C4;&#x56FA;&#x5B9A;&#x5BBD;&#x5EA6;&#x6C34;&#x5E73;&#x5C45;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;js&#x83B7;&#x53D6;li&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x4E58;&#x4EE5;&#x5355;&#x9879;&#x5BBD;&#x5EA6;&#xFF0C;&#x5F97;&#x5230;&#x5E94;&#x6709;&#x7684;&#x603B;&#x5BBD;&#x5EA6;&#xFF0C;&#x628A;&#x603B;&#x5BBD;&#x5EA6;&#x503C;&#x8D4B;&#x7ED9;&#x5916;&#x5C42;ul&#x5373;&#x53EF;&#xFF0C;&#x867D;&#x7136;&#x6B64;&#x6CD5;&#x7565;&#x663E;&#x7B28;&#x62D9;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5728;&#x4F60;&#x4E0D;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x5931;&#x4E3A;&#x4E00;&#x79CD;&#x53EF;&#x884C;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x65B9;&#x6CD5;&#x56DB;&#xFF1A;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;float&#xFF1A;center"><a href="#&#x65B9;&#x6CD5;&#x56DB;&#xFF1A;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;float&#xFF1A;center" class="headerlink" title="&#x65B9;&#x6CD5;&#x56DB;&#xFF1A;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;float&#xFF1A;center"></a>&#x65B9;&#x6CD5;&#x56DB;&#xFF1A;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;float&#xFF1A;center</h2><pre><code>nav{
     text-align:center;
     overflow:hidden;
}
nav ul{
     position:relative;
     left:50%;
     float:left;
}
nav ul li{
     float:left;
     width:150px;
     height: 300px;
     position:relative;
     right:50%;
}
</code></pre><p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x4F4D;&#x524D;&#x8F88;&#x4ECB;&#x7ECD;&#x7684;&#x201C;&#x53E4;&#x8001;&#x201D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x7B80;&#x5355;&#x8BF4;&#x6765;&#xFF0C;&#x662F;&#x7528;&#x4E86;&#x4E24;&#x6B21;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;,ul&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;left:50%;li&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#xFF0C;right:50%&#x6216;left:-50%&#x4E5F;&#x53EF;&#x3002;&#x7528;&#x6211;&#x7684;&#x8BDD;&#x6982;&#x62EC;&#x4E00;&#x4E0B;&#x5C31;&#x662F;&#xFF1A;&#x6574;&#x4F53;&#x53F3;&#x79FB;&#xFF0C;&#x9010;&#x9879;&#x5DE6;&#x79FB;&#x3002;&#x54A6;&#xFF1F;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x8DDF;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x5F02;&#x66F2;&#x540C;&#x5DE5;&#x4E4B;&#x5904;&#x3002;&#x5475;&#x5475;&#x3002;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x672C;&#x4EBA;&#x80FD;&#x529B;&#x6709;&#x9650;&#xFF0C;&#x66F4;&#x6DF1;&#x523B;&#x7684;&#x9053;&#x7406;&#x4E5F;&#x8BB2;&#x4E0D;&#x51FA;&#x6765;&#x3002;&#x5982;&#x679C;&#x6709;&#x5176;&#x4ED6;&#x7384;&#x673A;&#xFF0C;&#x8FD8;&#x8BF7;&#x9AD8;&#x624B;&#x4E0D;&#x541D;&#x8D50;&#x6559;&#x3002;</p>
<p>&#x5230;&#x6700;&#x540E;&#x4E86;&#xFF0C;&#x8BF4;&#x8BF4;&#x6211;&#x662F;&#x600E;&#x4E48;&#x60F3;&#x8D77;&#x8C08;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x7684;&#x5427;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x4F01;&#x9E45;&#x7684;&#x524D;&#x8F88;&#x8003;&#x6211;&#x7684;&#xFF0C;&#x5F53;&#x65F6;&#xFF0C;&#x6211;&#x672C;&#x6765;&#x662F;&#x53EF;&#x4EE5;&#x60F3;&#x5230;&#x7B2C;&#x4E8C;&#x3001;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x987E;&#x53CA;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x6027;&#x548C;&#x201C;&#x7B28;&#x201D;&#x65B9;&#x6CD5;&#x7684;&#x7F18;&#x6545;&#xFF0C;&#x6211;&#x7528;&#x4E86;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x60DC;&#x8FD8;&#x7D27;&#x5F20;&#x6CA1;&#x5199;&#x5BF9;~&#x6240;&#x4EE5;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x5BFB;&#x6C42;&#x66F4;&#x591A;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4EE5;&#x4E0A;&#x662F;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6240;&#x77E5;&#x7684;&#x51E0;&#x79CD;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x601D;&#x8DEF;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x7455;&#x75B5;&#x8FD8;&#x6709;&#x7EC6;&#x8282;&#x6CA1;&#x6709;&#x8BF4;&#x5230;&#xFF0C;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#x5427;&#x3002;&#x4F1A;&#x6536;&#x83B7;&#x66F4;&#x591A;&#x3002;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/11/12/section和article,向左还是向右？ /" itemprop="url">
                  section和article,向左还是向右？
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-11-12T00:00:00+08:00" content="2014-11-12">
              2014-11-12
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/HTML/" itemprop="url" rel="index">
                    <span itemprop="name">HTML</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>html5&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x8BA9;&#x524D;&#x7AEF;&#x4EBA;&#x5458;&#x773C;&#x524D;&#x4E00;&#x4EAE;&#xFF0C;&#x5927;&#x558A;&#x65B9;&#x4FBF;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x7A7A;&#x524D;&#x91CD;&#x89C6;&#x6807;&#x7B7E;&#x4F7F;&#x7528;&#x7684;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x4EBA;&#x4EEC;&#x6068;&#x4E0D;&#x5F97;&#x4E00;&#x4E0B;&#x5C31;&#x53BB;&#x6539;&#x53D8;&#x7531;div+css&#x6240;&#x5E26;&#x6765;&#x6EE1;&#x773C;&#x7684;div&#x3002;&#x65B0;&#x589E;&#x7684;&#x7ED3;&#x6784;&#x6027;&#x6807;&#x7B7E;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;header&#x3001;nav&#x3001;footer&#x3001;aside&#x3001;section&#x3001;article&#x7B49;&#x3002;</p>
<p>&#x4F46;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x4EE4;&#x4E0D;&#x5C11;&#x4EBA;&#x72AF;&#x96BE;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x51E0;&#x4E2A;&#x90FD;&#x8FD8;&#x6BD4;&#x8F83;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x540E;&#x9762;&#x4E24;&#x4E2A;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF0C;&#x5982;&#x679C;&#x6309;&#x7167;&#x76F4;&#x8BD1;&#x8FC7;&#x6765;&#x7684;&#x610F;&#x601D;&#x3002;section&#xFF1A;&#x201C;&#x90E8;&#x5206;&#x201D;&#xFF0C;article&#xFF1A;&#x201C;&#x6587;&#x7AE0;&#x201D;&#x3002;&#x8FD9;&#x663E;&#x7136;&#x65E0;&#x6CD5;&#x5F88;&#x597D;&#x7684;&#x53BB;&#x533A;&#x5206;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x201C;&#x90E8;&#x5206;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x513F;&#xFF0C;&#x610F;&#x601D;&#x592A;&#x6A21;&#x7CCA;&#xFF0C;&#x201C;&#x6587;&#x7AE0;&#x201D;&#x91CC;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x201C;&#x90E8;&#x5206;&#x201D;&#xFF0C;&#x201C;&#x90E8;&#x5206;&#x201D;&#x91CC;&#x9762;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x201C;&#x6587;&#x7AE0;&#x201D;&#x3002;&#x6743;&#x5A01;&#x6307;&#x5357;&#x91CC;&#x662F;&#x8FD9;&#x4E48;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x7684;&#x3002;</p>
<p>article&#xFF1A;&#x4EE3;&#x8868;&#x6587;&#x6863;&#x3001;&#x9875;&#x9762;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x72EC;&#x7ACB;&#x7684;&#x3001;&#x5B8C;&#x6574;&#x7684;&#x3001;&#x53EF;&#x4EE5;&#x72EC;&#x81EA;&#x88AB;&#x5916;&#x754C;&#x5F15;&#x7528;&#x7684;&#x5185;&#x5BB9;&#x3002;<br>section&#xFF1A;&#x7528;&#x4E8E;&#x5BF9;&#x7F51;&#x7AD9;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x5206;&#x5757;&#x3002;</p>
<p>&#x5927;&#x5BB6;&#x6CE8;&#x610F;&#x4E24;&#x4E2A;&#x5B57;&#x773C;&#x5C31;&#x53EF;&#x4EE5;&#x8F83;&#x597D;&#x53BB;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#x7684;&#x7528;&#x6CD5;&#xFF1A;&#x201C;&#x72EC;&#x7ACB;&#x3001;&#x5B8C;&#x6574;&#x201D;&#x548C;&#x201C;&#x5206;&#x5757;&#x201D;&#x3002;<br>&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x7684;&#x786E;&#x50CF;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x5B83;&#x4EEC;&#x4FE9;&#x53EF;&#x4EE5;&#x4E92;&#x76F8;&#x5305;&#x542B;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x4EE3;&#x8868;&#x662F;&#x53EF;&#x4EE5;&#x66FF;&#x6362;&#xFF0C;&#x5B8C;&#x5168;&#x662F;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x3002;&#x8FD8;&#x662F;&#x4E3E;&#x4F8B;&#x5B50;&#x770B;&#x7684;&#x66F4;&#x76F4;&#x89C2;&#x3002;</p>
<pre><code> &lt;article&gt;
  &lt;header&gt;
    &lt;h1&gt;&#x82F9;&#x679C;&lt;/h1&gt;
  &lt;/header&gt;
  &lt;p&gt;&#x82F9;&#x679C;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x6C34;&#x679C;&#x3002;&lt;/p&gt;
  &lt;section&gt;
    &lt;h2&gt;&#x8BC4;&#x8BBA;&lt;/h2&gt;
    &lt;article&gt;
      &lt;header&gt;
        &lt;h3&gt;&#x53D1;&#x8868;&#x8005;&#xFF1A;&#x5F20;&#x4E09;&lt;/h3&gt;
      &lt;/header&gt;
      &lt;p&gt;&#x82F9;&#x679C;&#x597D;&#x5403;&lt;/p&gt;
    &lt;/article&gt;
    &lt;article&gt;
      &lt;header&gt;
        &lt;h3&gt;&#x53D1;&#x8868;&#x8005;&#xFF1A;&#x674E;&#x56DB;&lt;/h3&gt;
      &lt;/header&gt;
      &lt;p&gt;&#x82F9;&#x679C;&#x5BF9;&#x8EAB;&#x4F53;&#x597D;&lt;/p&gt;
    &lt;/article&gt;
  &lt;/section&gt;
&lt;/article&gt;
</code></pre><p>&#x8FD9;&#x91CC;&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x6BB5;&#x8BDD;&#x662F;&#x63CF;&#x8FF0;&#x82F9;&#x679C;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x8BC4;&#x8BBA;&#x4E5F;&#x662F;&#x5173;&#x4E8E;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6574;&#x4E2A;&#x662F;&#x4E00;&#x4F53;&#x7684;&#xFF0C;&#x6B64;&#x6240;&#x8C13;&#x201C;&#x72EC;&#x7ACB;&#xFF0C;&#x5B8C;&#x6574;&#x201D;&#xFF0C;&#x800C;section&#x5728;&#x8FD9;&#x91CC;&#x8D1F;&#x8D23;&#x7684;&#x662F;&#x8BC4;&#x8BBA;&#x533A;&#x8FD9;&#x4E00;&#x5757;&#x513F;&#xFF0C;&#x628A;&#x8BC4;&#x8BBA;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x513F;&#x7ED9;&#x5206;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x8DDF;&#x4E0A;&#x9762;&#x7684;&#x6807;&#x9898;&#x548C;&#x6B63;&#x6587;&#x505A;&#x4E2A;&#x533A;&#x5206;&#x3002;&#x90A3;&#x6216;&#x8BB8;&#x6709;&#x4EBA;&#x53C8;&#x8981;&#x95EE;&#x4E86;&#xFF0C;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x662F;&#x633A;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x90A3;&#x4E0B;&#x9762;&#x7684;&#x8BC4;&#x8BBA;&#x533A;&#xFF0C;&#x600E;&#x4E48;&#x8FD8;&#x7528;&#x5230;&#x4E86;article&#x5462;&#xFF1F;&#x5C31;&#x90A3;&#x4E48;&#x4E00;&#x5C0F;&#x5757;&#x513F;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x8981;&#x6D88;&#x9664;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x8D70;&#x8FDB;&#x7684;&#x8BEF;&#x533A;&#x4E86;&#xFF0C;&#x6807;&#x7B7E;&#x4E0D;&#x662F;&#x6309;&#x5185;&#x5BB9;&#x7684;&#x591A;&#x5C11;&#x548C;&#x770B;&#x8D77;&#x6765;&#x5360;&#x7684;&#x5757;&#x513F;&#x5927;&#x5C0F;&#x6765;&#x5206;&#x7684;&#xFF0C;&#x8BED;&#x4E49;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x5B83;&#x4EE3;&#x8868;&#x7740;&#x4EC0;&#x4E48;&#xFF0C;&#x8981;&#x8868;&#x793A;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x8BC4;&#x8BBA;&#x533A;&#x91CC;&#x7528;article&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x674E;&#x56DB;&#x6240;&#x53D1;&#x8868;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x8DDF;&#x5F20;&#x4E09;&#x6BEB;&#x65E0;&#x5173;&#x8054;&#xFF0C;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5B8C;&#x6574;&#x7684;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x518D;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;</p>
<pre><code>&lt;article&gt;
  &lt;h1&gt;&#x82F9;&#x679C;&lt;/h1&gt;
  &lt;section&gt;
    &lt;h2&gt;&#x7EA2;&#x5BCC;&#x58EB;&lt;/h2&gt;
    &lt;p&gt; &#x7EA2;&#x5BCC;&#x58EB;&#x662F;&#x4ECE;&#x666E;&#x901A;&#x7684;&#x5BCC;&#x58EB;&#x9009;&#x80B2;&#x51FA;&#x7684;&#x7740;&#x8272;&#x7CFB;&#x5BCC;&#x7684;&#x7EDF;&#x79F0; &lt;/p&gt;
  &lt;/section&gt;
  &lt;section&gt;
    &lt;h2&gt;&#x56FD;&#x5149;&lt;/h2&gt;
    &lt;p&gt; &#x53C8;&#x540D;&#x5C0F;&#x56FD;&#x5149;&#x3001;&#x4E07;&#x5BFF; &lt;/p&gt;
  &lt;/section&gt;
&lt;/article&gt;
</code></pre><p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;section&#x5E76;&#x6CA1;&#x6709;&#x7528;&#x6765;&#x533A;&#x5206;&#x6587;&#x7AE0;&#x4E3B;&#x4F53;&#x548C;&#x5176;&#x4ED6;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x6765;&#x5BF9;&#x6587;&#x7AE0;&#x8FDB;&#x884C;&#x6BB5;&#x843D;&#x5212;&#x5206;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x4E5F;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x91CC;&#x9762;&#x662F;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x6807;&#x9898;&#x548C;&#x4E00;&#x6BB5;&#x6587;&#x5B57;&#x3002;&#x4E0B;&#x9762;&#x8BF4;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x3002;</p>
<p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x8FD8;&#x662F;&#x89C9;&#x5F97;&#x4E8C;&#x8005;&#x533A;&#x522B;&#x4E0D;&#x5927;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;article&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;section&#x7684;&#x7279;&#x6B8A;&#x79CD;&#x7C7B;&#xFF0C;&#x5B83;&#x540C;&#x6837;&#x662F;&#x5206;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x201C;&#x72EC;&#x7ACB;&#x6027;&#x201D;&#x3002;</p>
<p>section&#x4F7F;&#x7528;&#x7684;&#x51E0;&#x70B9;&#x7981;&#x5FCC;&#xFF1A;</p>
<p>1&#x3001;&#x4E0D;&#x8981;&#x5C06;&#x5B83;&#x4F5C;&#x4E3A;&#x8BBE;&#x7F6E;&#x6837;&#x5F0F;&#x7684;&#x9875;&#x9762;&#x5BB9;&#x5668;&#xFF0C;&#x90A3;&#x4E2A;&#x662F;div&#x8981;&#x505A;&#x7684;&#x4E8B;&#x3002;<br>2&#x3001;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6BD4;&#x5982;article&#x3001;aside&#x3001;nav&#x7B49;&#x66F4;&#x5408;&#x9002;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x7528;section&#x3002;<br>3&#x3001;&#x4E0D;&#x8981;&#x4E3A;&#x6CA1;&#x6709;&#x6807;&#x9898;&#x7684;&#x5185;&#x5BB9;&#x533A;&#x5757;&#x4F7F;&#x7528;section&#x3002;&#xFF08;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x5904;&#x6709;&#x63D0;&#x8FC7;&#x54E6;~&#xFF09;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x5173;&#x4E8E;&#x8FD9;&#x5144;&#x5F1F;&#x4FE9;&#x7684;&#x7528;&#x6CD5;&#x95EE;&#x9898;&#x5C31;&#x5148;&#x8BF4;&#x5230;&#x8FD9;&#x513F;&#x4E86;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x4F60;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;&#x3002;</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/11/09/在不是终点的”终点“，等风来~/" itemprop="url">
                  在不是终点的”终点“，等风来~
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-11-09T00:00:00+08:00" content="2014-11-09">
              2014-11-09
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x96C4;&#x9738;&#x5929;&#x4E0B;&#xFF0C;&#x6210;&#x4E5F;&#x98CE;&#x4E91;&#xFF0C;&#x8D25;&#x4E5F;&#x98CE;&#x4E91;&#xFF01;<br>&#x4E3A;&#x4EC0;&#x4E48;&#x7559;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8D70;&#xFF1F;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x6211;&#x53C8;&#x8D70;&#x4E86;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8D70;&#x662F;5&#x4E2A;&#x6708;&#x524D;&#xFF0C;&#x6BCF;&#x6B21;&#x79BB;&#x5F00;&#xFF0C;&#x6211;&#x90FD;&#x633A;&#x7EA0;&#x7ED3;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x5185;&#x5FC3;&#x7684;&#x7B54;&#x6848;&#x662F;&#x6E05;&#x6670;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x5BF9;&#x6BCF;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x6709;&#x611F;&#x60C5;&#x7684;&#xFF0C;&#x5F53;&#x5E0C;&#x671B;&#x53D8;&#x6210;&#x4E86;&#x5931;&#x671B;&#xFF0C;&#x65E0;&#x529B;&#x518D;&#x633D;&#x56DE;&#x3002;</p>
<p>&#x77E5;&#x9053;&#x7684;&#x90FD;&#x4F1A;&#x95EE;&#x6211;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x6362;&#x5DE5;&#x4F5C;&#x8FD9;&#x4E48;&#x9891;&#x7E41;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x4E24;&#x4EFD;&#x5DE5;&#x4F5C;&#x6240;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x6216;&#x8BB8;&#x8FD8;&#x6CA1;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x4E45;&#xFF0C;&#x53EF;&#x6211;&#x53C8;&#x4F55;&#x66FE;&#x4E0D;&#x60F3;&#x6709;&#x4E00;&#x4EFD;&#x957F;&#x671F;&#x7A33;&#x5B9A;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x597D;&#x597D;&#x53D1;&#x5C55;&#x5462;&#xFF1F;&#x81F3;&#x4E8E;&#x539F;&#x56E0;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4E5F;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#x3002;&#x6211;&#x81EA;&#x8BA4;&#x4E3A;&#x662F;&#x4E2A;&#x6709;&#x8010;&#x6027;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x5230;&#x8FEB;&#x4E0D;&#x5F97;&#x5DF2;&#x4E0D;&#x4F1A;&#x505A;&#x51FA;&#x544A;&#x522B;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x65E2;&#x4ECE;&#x6211;&#x5FC3;&#xFF0C;&#x4FBF;&#x4E5F;&#x65E0;&#x6094;&#xFF01;</p>
<p>&#x8FD9;&#x4E00;&#x5E74;&#x591A;&#x4EE5;&#x6765;&#xFF0C;&#x6211;&#x5F88;&#x5C11;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x5047;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x653E;&#x5047;&#x3002;&#x7531;&#x4E8E;&#x4E00;&#x4E9B;&#x4E0D;&#x582A;&#x56DE;&#x9996;&#x7684;&#x5F80;&#x4E8B;&#xFF0C;&#x7ED9;&#x6211;&#x9020;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x9700;&#x8981;&#x53BB;&#x5F25;&#x8865;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6709;&#x592A;&#x591A;&#x4E0D;&#x8DB3;&#xFF0C;&#x592A;&#x591A;&#x8425;&#x517B;&#x9700;&#x8981;&#x5438;&#x53D6;&#xFF0C;&#x89C9;&#x5F97;&#x54EA;&#x6015;&#x4E00;&#x5929;48&#x5C0F;&#x65F6;&#x4E5F;&#x5403;&#x4E0D;&#x9971;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x8FD9;&#x4E48;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x4E94;&#x4E00;&#x3001;&#x4E2D;&#x79CB;&#x3001;&#x5341;&#x4E00;&#x3002;&#x3002;&#x6240;&#x6709;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#xFF0C;&#x521A;&#x8FC7;&#x4E86;&#x5341;&#x4E00;&#xFF0C;11&#x6708;&#x6211;&#x51B3;&#x5B9A;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x4E2A;&#x5047;&#xFF0C;&#x8D81;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x7ED9;&#x8111;&#x5B50;&#x51CF;&#x51CF;&#x8D1F;&#xFF0C;&#x6574;&#x7406;&#x4E00;&#x4E0B;&#x5934;&#x7EEA;&#xFF0C;&#x56E0;&#x4E3A;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x4F1A;&#x6BD4;&#x4E4B;&#x524D;&#x7684;&#x66F4;&#x8F7B;&#x677E;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x53EA;&#x4F1A;&#x66F4;&#x91CD;&#x3002;&#x4F46;&#xFF0C;&#x65E2;&#x5DF2;&#x9009;&#x62E9;&#xFF0C;&#x4FBF;&#x6B23;&#x7136;&#x524D;&#x5F80;&#xFF01;~</p>
<p>&#x5728;&#x4E0D;&#x7B97;&#x957F;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x7ECF;&#x5386;&#x4E86;&#x4E24;&#x5BB6;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;&#x7B2C;&#x4E00;&#x5BB6;&#x7ED9;&#x4E86;&#x6211;&#x5165;&#x884C;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x867D;&#x7136;&#x85AA;&#x6C34;&#x4E0D;&#x9AD8;&#xFF0C;&#x4F46;&#x610F;&#x4E49;&#x5F88;&#x5927;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8E0F;&#x5165;&#x804C;&#x573A;&#xFF0C;&#x611F;&#x53D7;&#x804C;&#x573A;&#x6C1B;&#x56F4;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x6B63;&#x5F0F;&#x505A;&#x7F51;&#x7AD9;&#x2026;&#x2026;.&#x5F88;&#x591A;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x7BA1;&#x6700;&#x540E;&#x6211;&#x79BB;&#x5F00;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5BF9;&#x5B83;&#x7684;&#x611F;&#x8C22;&#x662F;&#x4E0D;&#x4F1A;&#x53D8;&#x7684;&#x3002;&#x7B2C;&#x4E8C;&#x5BB6;&#xFF0C;&#x867D;&#x77ED;&#x6682;&#xFF0C;&#x60C5;&#x611F;&#x4E5F;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x66FE;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#x611F;&#x5230;&#x5E86;&#x5E78;&#xFF0C;&#x89C9;&#x5F97;&#x516C;&#x53F8;&#x592A;&#x597D;&#x4E86;&#xFF0C;&#x8001;&#x677F;&#x592A;&#x597D;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x90FD;&#x7ED9;&#x529E;&#x7684;&#x5F88;&#x9F50;&#x5907;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x65B9;&#x4FBF;&#x529E;&#x516C;&#x63D0;&#x4F9B;&#x4E86;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x6700;&#x597D;&#x6761;&#x4EF6;&#xFF0C;&#x85AA;&#x6C34;&#x4E5F;&#x6BD4;&#x4E4B;&#x524D;&#x7684;&#x9AD8;&#xFF0C;&#x56E2;&#x961F;&#x6210;&#x5458;&#x4E5F;&#x591A;&#x6837;&#x5316;&#xFF0C;&#x8BBE;&#x8BA1;&#xFF0C;&#x540E;&#x53F0;&#xFF0C;&#x524D;&#x7AEF;&#xFF0C;&#x5B89;&#x5353;&#xFF0C;ios&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x53EA;&#x86EE;&#x6709;&#x6218;&#x6597;&#x529B;&#xFF0C;&#x89E6;&#x89D2;&#x4F38;&#x5230;&#x5168;&#x5E73;&#x53F0;&#x7684;&#x56E2;&#x961F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x6084;&#x6084;&#x6539;&#x53D8;&#xFF0C;&#x76F4;&#x5230;&#xFF0C;&#x53D8;&#x5316;&#x5230;&#x6211;&#x65E0;&#x6CD5;&#x627F;&#x53D7;&#x4E4B;&#x91CD;&#x3002;&#x867D;&#x7136;&#x538B;&#x529B;&#x4E0D;&#x5927;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E0D;&#x5FD9;&#xFF0C;&#x4F46;&#x5185;&#x5FC3;&#x544A;&#x8BC9;&#x6211;&#x90A3;&#x4E0D;&#x662F;&#x6211;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x9879;&#x76EE;&#x66F4;&#x6362;&#xFF0C;&#x4EBA;&#x5458;&#x6D41;&#x5931;&#xFF0C;&#x770B;&#x4E0D;&#x5230;&#x4E00;&#x4E1D;&#x4F1A;&#x597D;&#x8F6C;&#x7684;&#x8FF9;&#x8C61;&#x3002;&#x5C31;&#x5230;&#x4E86;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x518D;&#x89C1;&#x7684;&#x65F6;&#x5019;&#x3002;&#x540C;&#x6837;&#x5F88;&#x611F;&#x8C22;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x524D;&#x7AEF;&#x7531;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x5168;&#x6743;&#x8D1F;&#x8D23;&#xFF0C;&#x6709;&#x53E5;&#x8BDD;&#x53EB;&#x201D;&#x80FD;&#x529B;&#x8D8A;&#x5927;&#xFF0C;&#x8D23;&#x4EFB;&#x5C31;&#x8D8A;&#x5927;&#x201C;&#xFF0C;&#x800C;&#x6211;&#x6070;&#x76F8;&#x53CD;&#xFF0C;&#x56E0;&#x4E3A;&#x8D23;&#x4EFB;&#x5927;&#x4E86;&#xFF0C;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x8BA9;&#x81EA;&#x5DF1;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6709;&#x80FD;&#x529B;&#xFF0C;&#x9876;&#x7740;&#x538B;&#x529B;&#x53BB;&#x4E00;&#x6B21;&#x6B21;&#x7684;&#x653B;&#x514B;&#x96BE;&#x9898;&#xFF0C;&#x521D;&#x6B21;&#x63A5;&#x89E6;&#x79FB;&#x52A8;&#x7AEF;&#x9875;&#x9762;&#x5236;&#x4F5C;&#xFF0C;&#x9760;&#x81EA;&#x5DF1;&#x6478;&#x7D22;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x90FD;&#x89C9;&#x5F97;&#x8981;&#x5B8C;&#x4E86;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#x90FD;&#x633A;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x5728;&#x63D0;&#x5347;&#x4E86;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x79EF;&#x7D2F;&#x4E86;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x5F88;&#x597D;&#x7684;&#x953B;&#x70BC;&#x4E86;&#x6297;&#x538B;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x51E0;&#x6B21;&#x5047;&#x671F;&#xFF0C;&#x90FD;&#x6709;&#x670B;&#x53CB;&#x6216;&#x8005;&#x5BB6;&#x4EBA;&#x8BA9;&#x6211;&#x597D;&#x597D;&#x653E;&#x677E;&#x4E00;&#x4E0B;&#xFF0C;&#x51FA;&#x53BB;&#x73A9;&#x513F;&#x73A9;&#x513F;&#xFF0C;&#x53EF;&#x6211;&#x6EE1;&#x8111;&#x5B50;&#x90FD;&#x662F;&#x6280;&#x672F;&#xFF0C;&#x4E66;&#x7C4D;&#xFF0C;&#x4EE3;&#x7801;&#xFF0C;&#x4E8B;&#x4E1A;&#x3002;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x4EC0;&#x4E48;&#x5927;&#x7684;&#x6E38;&#x73A9;&#x513F;&#x8BA1;&#x5212;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x5374;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x5047;&#x4E86;~</p>
<p>&#x7B49;&#x98CE;&#x6765;&#xFF0C;&#x662F;&#x51E0;&#x4E2A;&#x6708;&#x524D;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x7ED9;&#x6211;&#x63A8;&#x8350;&#x7684;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x8BF4;&#x597D;&#x770B;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x6CA1;&#x770B;&#xFF0C;&#x4E5F;&#x60F3;&#x8C61;&#x7740;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x6709;&#x591A;&#x597D;&#x770B;&#xFF1F;&#x52A8;&#x4F5C;&#x7247;&#xFF1F;&#x7279;&#x6548;&#x5F88;&#x70AB;&#xFF1F;&#x60C5;&#x8282;&#x5F88;&#x7CBE;&#x5F69;&#xFF1F;&#x6216;&#x8005;&#x5F88;&#x641E;&#x7B11;&#xFF1F;&#x5F53;&#x6211;&#x8FD9;&#x6B21;&#x6709;&#x65F6;&#x95F4;&#x4E5F;&#x6709;&#x5FC3;&#x601D;&#x53BB;&#x770B;&#x4E86;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x8BB2;&#x4E86;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6545;&#x4E8B;&#x5462;&#xFF1F;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4EBA;&#xFF0C;&#x5171;&#x540C;&#x5230;&#x4E86;&#x5C3C;&#x6CCA;&#x5C14;&#xFF0C;&#x53BB;&#x6D17;&#x6DA4;&#x7075;&#x9B42;&#xFF0C;&#x53D9;&#x8FF0;&#x4E86;&#x51E0;&#x6BB5;&#x5F80;&#x4E8B;&#x548C;&#x5185;&#x5FC3;&#x72EC;&#x767D;&#xFF0C;&#x8FD9;&#x793E;&#x4F1A;&#x591A;&#x6B8B;&#x9177;&#xFF0C;&#x4EBA;&#x9762;&#x6709;&#x591A;&#x5047;&#xFF0C;&#x4EBA;&#x6709;&#x591A;&#x65E0;&#x5948;~&#x6216;&#x8BB8;&#x8FD9;&#x90E8;&#x8D70;&#x8FDB;&#x539F;&#x751F;&#x6001;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x4E00;&#x90E8;&#x597D;&#x7535;&#x5F71;&#x5427;&#x3002;&#x5267;&#x4E2D;&#x6709;&#x53E5;&#x8BDD;&#xFF1A;&#x522B;&#x778E;&#x6298;&#x817E;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;~&#xFF08;&#x5BF9;&#x6211;&#x8FD9;&#x7C7B;&#x4EBA;&#x8BF4;&#x7684;&#x4E48;&#xFF0C;&#x5475;&#x5475;&#xFF09;</p>
<p>&#x201D;&#x4F60;&#x53EF;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x6709;&#x4EBA;&#x7FA1;&#x6155;&#x4F60;  &#x53EA;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x66FE;&#x7ECF;&#x4E5F;&#x5E74;&#x8F7B;&#xFF0C;&#x4F60;&#x53EF;&#x660E;&#x767D;&#x4EC0;&#x4E48;&#x9053;&#x7406;&#x6709;&#x4EBA;&#x5AC9;&#x5992;&#x4F60; &#x53EA;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x6293;&#x5F97;&#x7D27;&#x201C;</p>
<p>&#x8981;&#x5F00;&#x59CB;&#x4E00;&#x6BB5;&#x65B0;&#x7684;&#x672A;&#x77E5;&#x65C5;&#x7A0B;&#x4E86;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x8FD8;&#x5E74;&#x8F7B;&#xFF0C;&#x6211;&#x4E5F;&#x8981;&#x6293;&#x7D27;&#xFF01;&#x671F;&#x5F85;&#x51FA;&#x53D1;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/11/03/为标签正名之“也谈语义化”/" itemprop="url">
                  为标签正名之“也谈语义化”
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-11-03T00:00:00+08:00" content="2014-11-03">
              2014-11-03
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/HTML/" itemprop="url" rel="index">
                    <span itemprop="name">HTML</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x6807;&#x7B7E;&#x8BED;&#x4E49;&#x5316;&#x8FD9;&#x4E2A;&#x8BCD;&#x513F;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x63D0;&#xFF0C;&#x4E5F;&#x63D0;&#x4E86;&#x5F88;&#x4E45;&#xFF0C;&#x81F3;&#x4E8E;&#x597D;&#x5904;&#x5462;&#xFF0C;&#x4E5F;&#x90FD;&#x81F3;&#x5C11;&#x80FD;&#x7F57;&#x5217;&#x4E2A;&#x4E24;&#x4E09;&#x6761;&#xFF0C;&#x8B6C;&#x5982;&#xFF1A;&#x6709;&#x5229;&#x4E8E;seo&#xFF08;&#x8FD9;&#x6761;&#x5FEB;&#x88AB;&#x8BF4;&#x574F;&#x4E86;~&#xFF09;&#x3001;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x589E;&#x5F3A;&#x4E86;&#x53EF;&#x8BFB;&#x6027;&#x7B49;&#x7B49;&#x3002;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x63D0;&#x4E86;&#x8FD9;&#x4E48;&#x4E45;&#xFF0C;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x7684;&#x4EE3;&#x7801;&#x8BED;&#x4E49;&#x5316;&#x505A;&#x5F97;&#x8FD8;&#x662F;&#x5F88;&#x4E0D;&#x591F;&#x5462;&#xFF0C;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E5F;&#x201C;&#x5F52;&#x548E;&#x201D;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x8C01;&#x5B83;&#x4E0D;&#x7BA1;&#x4E09;&#x4E03;&#x4E8C;&#x5341;&#x4E00;&#x53EA;&#x8981;&#x8BA4;&#x8BC6;&#xFF0C;&#x54EA;&#x6015;&#x4E0D;&#x89C4;&#x8303;&#x4E0D;&#x6807;&#x51C6;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x5C3D;&#x91CF;&#x597D;&#x597D;&#x663E;&#x793A;&#x51FA;&#x6765;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x5B83;&#x7684;&#x597D;&#xFF0C;&#x5374;&#x4E5F;&#x7EB5;&#x5BB9;&#x4E86;&#x9875;&#x9762;&#x4ED4;&#x7684;&#x574F;&#x4E60;&#x60EF;&#x3002;&#x9664;&#x4E86;&#x8FD9;&#x4E2A;&#x5462;&#xFF0C;&#x4E0B;&#x9762;&#x4E24;&#x4E2A;&#x4F30;&#x8BA1;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x5143;&#x7D20;&#x6E32;&#x67D3;&#x65B9;&#x5F0F;&#x7B80;&#x5355;"><a href="#&#x4E00;&#x3001;&#x5143;&#x7D20;&#x6E32;&#x67D3;&#x65B9;&#x5F0F;&#x7B80;&#x5355;" class="headerlink" title="&#x4E00;&#x3001;&#x5143;&#x7D20;&#x6E32;&#x67D3;&#x65B9;&#x5F0F;&#x7B80;&#x5355;"></a>&#x4E00;&#x3001;&#x5143;&#x7D20;&#x6E32;&#x67D3;&#x65B9;&#x5F0F;&#x7B80;&#x5355;</h2><p>&#x6309;&#x5927;&#x7684;&#x7C7B;&#x6765;&#x5206;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x7ED3;&#x6784;&#xFF0C;&#x5C31;&#x4E24;&#x79CD;&#xFF0C;&#x201C;&#x5757;&#x7EA7;&#x201D;&#x548C;&#x201C;&#x884C;&#x5185;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x5BFC;&#x81F4;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x6B63;&#x5E38;&#x7684;&#xFF0C;&#x6309;&#x7167;&#x60F3;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x7ED9;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x4F1A;&#x53BB;&#x592A;&#x5728;&#x610F;&#x662F;&#x4E0D;&#x662F;&#x8BED;&#x4E49;&#x5408;&#x9002;&#xFF0C;&#x6216;&#x8BB8;&#x5F88;&#x591A;&#x4EBA;&#x8BF4;&#xFF0C;&#x6211;&#x80FD;&#x505A;&#x597D;&#x4EE3;&#x7801;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x4F18;&#x5316;&#xFF0C;&#x80FD;&#x505A;&#x597D;&#x6D4F;&#x89C8;&#x5668;&#x826F;&#x597D;&#x517C;&#x5BB9;&#x6027;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x7ED3;&#x6784;&#x4E0D;&#x5FC5;&#x90A3;&#x4E48;&#x8F83;&#x771F;&#xFF0C;&#x4EA4;&#x7ED9;css&#x53BB;&#x81EA;&#x7531;&#x53D1;&#x6325;&#x5457;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x5176;&#x5B9E;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x6765;&#x201C;&#x5BA1;&#x8BAF;&#x201D;CSS~&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x8868;&#x73B0;&#x5206;&#x79BB;"><a href="#&#x4E8C;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x8868;&#x73B0;&#x5206;&#x79BB;" class="headerlink" title="&#x4E8C;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x8868;&#x73B0;&#x5206;&#x79BB;"></a>&#x4E8C;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x8868;&#x73B0;&#x5206;&#x79BB;</h2><p>&#x8FD9;&#x540C;&#x6837;&#x662F;&#x9664;&#x4E86;&#x5C0F;&#x767D;&#x662F;&#x4E2A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x6709;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#x591A;&#x5C11;&#x4EBA;&#x56E0;&#x4E3A;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x5C31;&#x5206;&#x79BB;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x201C;&#x4EF7;&#x503C;&#x89C2;&#x201D;&#xFF1F;~&#x4E3A;&#x4EC0;&#x4E48;&#x5206;&#x79BB;&#xFF1F;&#x5206;&#x79BB;&#x4E86;&#x4E4B;&#x540E;&#x6211;&#x4EEC;&#x5C31;&#x53EA;&#x9700;&#x8981;&#x53BB;&#x7EF4;&#x62A4;css&#xFF1F;css&#x529F;&#x529B;&#x591F;&#x597D;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x4E48;&#xFF1F;&#x6211;&#x66FE;&#x7ECF;&#x8DDF;&#x4E00;&#x4E2A;&#x4EBA;&#x804A;&#x5929;&#xFF0C;&#x5F53;&#x65F6;&#x633A;&#x6B63;&#x5E38;&#x7684;&#x804A;&#x5929;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x90A3;&#x65F6;&#x516C;&#x53F8;&#x4E5F;&#x51C6;&#x5907;&#x62DB;&#x4EBA;&#xFF0C;&#x6211;&#x5C31;&#x95EE;&#x4ED6;&#x6709;&#x6CA1;&#x6709;&#x610F;&#x5411;&#xFF0C;&#x7136;&#x540E;&#x95EE;&#x4E86;&#x4E00;&#x70B9;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE4;&#x6211;&#x611F;&#x5230;&#x8BE7;&#x5F02;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x7ED9;&#x51FA;&#x4EFB;&#x4F55;&#x8981;&#x6C42;&#x548C;&#x63D0;&#x793A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED6;&#x5C31;&#x8DDF;&#x6211;&#x8BF4;&#x4E86;&#x4E00;&#x5806;&#x600E;&#x4E48;&#x5C45;&#x4E2D;&#xFF0C;&#x54EA;&#x5757;&#x513F;&#x6D6E;&#x52A8;&#x5230;&#x54EA;&#x8FB9;&#xFF0C;&#x518D;&#x7136;&#x540E;&#xFF0C;&#x51E0;&#x53E5;&#x8BDD;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x5C31;&#x88AB;&#x5B83;&#x201C;&#x8BF4;&#x201D;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x5728;&#x60F3;&#xFF0C;&#x7F51;&#x9875;&#x771F;&#x5982;&#x5B83;&#x6240;&#x8BF4;&#x7684;&#x53EF;&#x4EE5;&#x4FE1;&#x201C;&#x5634;&#x201D;&#x62C8;&#x6765;&#xFF1F;&#x4ED6;&#x771F;&#x7684;&#x5F88;&#x5389;&#x5BB3;&#xFF1F;&#x6211;&#x5F53;&#x7136;&#x76F8;&#x4FE1;&#x4ED6;&#x80FD;&#x5199;&#x51FA;&#x7F51;&#x9875;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x80AF;&#x5B9A;&#x4E0D;&#x76F8;&#x4FE1;&#x5B83;&#x80FD;&#x628A;html&#x7ED9;&#x5199;&#x597D;&#x3002;&#x7ED3;&#x6784;&#x548C;&#x8868;&#x73B0;&#x5206;&#x79BB;&#x5E76;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x5199;&#x597D;css&#x66F4;&#x6CA1;&#x6709;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x54B1;&#x80FD;&#x4E0D;&#x80FD;&#x5148;&#x628A;&#x7ED3;&#x6784;&#x5199;&#x597D;&#x5462;&#xFF1F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x7ED3;&#x6784;&#x4E0D;&#x4EC5;&#x589E;&#x5F3A;&#x4E86;&#x4EE3;&#x7801;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5927;&#x5927;&#x51CF;&#x8F7B;&#x4E86;css&#x7684;&#x538B;&#x529B;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x5E38;&#x5E38;&#x56E0;&#x4E3A;&#x8981;&#x52A0;&#x5F3A;&#x4E00;&#x6761;&#x6837;&#x5F0F;&#x89C4;&#x5219;&#x7684;&#x6743;&#x91CD;&#x800C;&#x53BB;&#x589E;&#x52A0;&#x5D4C;&#x5957;&#x5C42;&#x7EA7;&#xFF1F;&#x4F60;&#x662F;&#x5426;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x91CC;&#x5305;&#x542B;&#x4E86;&#x592A;&#x591A;&#x7684;p&#x6216;&#x8005;span&#xFF0C;&#x4F46;&#x4F60;&#x5374;&#x8981;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x90E8;&#x5206;&#x5E94;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x65E0;&#x5948;&#x4E4B;&#x4E0B;&#x591A;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#xFF1F;&#x589E;&#x52A0;&#x4E86;html&#x4EE3;&#x7801;&#x7684;&#x201C;&#x8865;&#x4E01;&#x2018;&#x4E0D;&#x8BF4;&#xFF0C;&#x8FD8;&#x8981;&#x4E3A;&#x8D77;&#x4E2A;&#x7C7B;&#x540D;&#x60F3;&#x534A;&#x5BBF;&#xFF08;&#x90FD;&#x61C2;&#x7684;&#xFF0C;&#x5F88;&#x86CB;&#x75BC;&#xFF09;&#x3002;&#x5176;&#x5B9E;&#x7528;&#x597D;&#x4E86;&#x6807;&#x7B7E;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x4E3A;&#x5B83;&#x7701;&#x6389;&#x4E86;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x7701;&#x53BB;&#x4E86;&#x4E8C;&#x6B21;&#x8BF4;&#x660E;&#x3002;&#x968F;&#x7740;css3&#x9009;&#x62E9;&#x5668;&#x7684;&#x589E;&#x5F3A;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x4F1A;&#x6709;&#x6240;&#x7F13;&#x89E3;&#xFF0C;&#x4F46;&#x662F;&#x5426;&#x80FD;&#x8BA9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x91CD;&#x89C6;&#x7ED3;&#x6784;&#x8FD8;&#x6709;&#x5F85;&#x89C2;&#x5BDF;&#x3002;</p>
<h2 id="html&#x7B80;&#x5355;&#xFF1F;"><a href="#html&#x7B80;&#x5355;&#xFF1F;" class="headerlink" title="html&#x7B80;&#x5355;&#xFF1F;"></a>html&#x7B80;&#x5355;&#xFF1F;</h2><p>&#x5708;&#x513F;&#x91CC;&#x6D41;&#x884C;&#x8FD9;&#x4E48;&#x4E2A;&#x8BF4;&#x6CD5;&#x2014;&#x2014;&#x201C;html&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x6807;&#x7B7E;&#x4E0D;&#x591A;&#x201D;&#x3002;&#x8FD9;&#x53E5;&#x8BDD;&#x4E00;&#x822C;&#x7528;&#x6765;&#x5B89;&#x6170;&#x548C;&#x9F13;&#x52B1;&#x6CA1;&#x4EC0;&#x4E48;&#x57FA;&#x7840;&#xFF0C;&#x53C8;&#x6709;&#x6050;&#x82F1;&#x8BED;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4EBA;&#x7684;&#x601D;&#x60F3;&#x603B;&#x662F;&#x4E60;&#x60EF;&#x6027;&#x5F80;&#x524D;&#x8D70;&#xFF0C;&#x4E5F;&#x662F;&#x4F1A;&#x81EA;&#x52A8;&#x53D1;&#x6563;&#x7684;&#xFF0C;&#x5F53;&#x8BD5;&#x7528;&#x4E86;&#x90A3;&#x4EC5;&#x6709;&#x7684;&#x51E0;&#x4E2A;&#x6807;&#x7B7E;&#x5C31;&#x80FD;&#x6EE1;&#x8DB3;&#x81EA;&#x5DF1;&#x7684;&#x5E38;&#x89C1;&#x9700;&#x6C42;&#xFF0C;&#x7D27;&#x63A5;&#x7740;css&#xFF0C;&#x5F53;&#x53C8;&#x9047;&#x5230;&#x4E86;js&#xFF0C;jq&#x2026;&#x2026;&#x5076;My God&#xFF01;&#x8FD9;&#x4F3C;&#x4E4E;&#x4E00;&#x4E2A;&#x6BD4;&#x4E00;&#x4E2A;&#x9AD8;&#x7AEF;&#x5927;&#x6C14;&#x4E0A;&#x6863;&#x6B21;&#xFF0C;&#x4E5F;&#x4E00;&#x4E2A;&#x6BD4;&#x4E00;&#x4E2A;&#x96BE;&#x5543;&#xFF0C;&#x4E8E;&#x662F;&#x503E;&#x529B;&#x4E3A;&#x4E4B;&#xFF0C;&#x9676;&#x9189;&#x5176;&#x4E2D;&#xFF0C;&#x4E5F;&#x8FF7;&#x5931;&#x5176;&#x4E2D;&#xFF0C;&#x4E45;&#x800C;&#x4E45;&#x4E4B;&#xFF0C;&#x5FD8;&#x4E86;&#x770B;&#x770B;&#x6765;&#x65F6;&#x7684;&#x8DEF;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x8DDF;&#x522B;&#x4EBA;&#x804A;&#x8D77;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E09;&#x8A00;&#x4E24;&#x8BED;&#x5E26;&#x8FC7;&#x4E86;html&#xFF0C;&#x5927;&#x8C08;css&#xFF0C;js&#xFF0C;&#x7279;&#x522B;&#x662F;&#x73B0;&#x5728;&#x201C;&#x65B0;&#x201D;&#x6280;&#x672F;&#x76DB;&#x884C;&#xFF0C;css3&#xFF0C;&#x5404;&#x79CD;css&#xFF0C;js&#x6846;&#x67B6;&#xFF0C;&#x54EA;&#x6709;&#x529F;&#x592B;&#x53BB;&#x7406;html&#xFF1F;&#x4EBA;&#x4EEC;&#x66F4;&#x52A0;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#x591A;&#x4E48;&#x725B;&#x63B0;&#xFF0C;&#x4E00;&#x4E2A;&#x6548;&#x679C;&#x70AB;&#x5230;&#x591A;&#x4E48;&#x4E0D;&#x53EF;&#x601D;&#x8BAE;&#x3002;html&#x771F;&#x7684;&#x7B80;&#x5355;&#x4E48;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x6B63;&#x5728;&#x8FDB;&#x5165;&#x7684;html5&#x65F6;&#x4EE3;&#xFF0C;&#x5B83;&#x5C31;&#x66F4;&#x4E0D;&#x7B80;&#x5355;&#xFF0C;&#x73B0;&#x5728;&#x91CD;&#x89C6;&#x8D77;&#x6765;&#x8FD8;&#x6765;&#x5F97;&#x53CA;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF08;&#x4E0D;&#x662F;&#x6316;&#x6398;&#x673A;&#x54C8;&#xFF01;~&#xFF09;</p>
<p>&#x5F53;&#x8981;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x653E;&#x5165;&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x8981;&#x7528;&#x4EC0;&#x4E48;&#x6807;&#x7B7E;&#xFF1F;&#x64AD;&#x653E;&#x591A;&#x5A92;&#x4F53;&#x6587;&#x4EF6;&#x5462;&#xFF1F;&#x56FE;&#x8C61;&#x70ED;&#x533A;&#x5462;&#xFF1F;&#x6587;&#x7AE0;&#x6807;&#x9898;&#x9664;&#x4E86;h1~h6&#x8FD8;&#x80FD;&#x7528;&#x4EC0;&#x4E48;&#xFF1F;&#x8054;&#x7CFB;&#x4EBA;&#x4FE1;&#x606F;&#x8981;&#x7528;&#x4EC0;&#x4E48;&#xFF1F;<em>&#x548C;<strong>&#x7684;&#x533A;&#x522B;&#x662F;&#xFF1F;&#x4F60;&#x77E5;&#x9053;&#x5B58;&#x5728;<code>&#x548C;<var>&#x8FD9;&#x6837;&#x7684;&#x6807;&#x7B7E;&#x4E48;&#xFF1F;&#x8868;&#x683C;&#x9664;&#x4E86;<table>,<tr>,<td>,<th>&#x4F60;&#x8FD8;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x5462;&#xFF1F;&#x4F60;&#x77E5;&#x9053;<p>&#x662F;&#x5427;&#xFF1F;&#x90A3;<q>&#x662F;&#x795E;&#x9A6C;&#xFF1F;&#x4F60;&#x77E5;&#x9053;&#x67D0;&#x4E9B;&#x6807;&#x7B7E;&#x5DF2;&#x7ECF;&#x88AB;&#x629B;&#x5F03;&#x4E86;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x529F;&#x80FD;&#x88AB;&#x52A0;&#x5165;&#x4E86;css3&#x7684;&#x5C5E;&#x6027;&#x4E48;&#xFF1F;&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x4E9B;&#x54B1;&#x4EE5;&#x540E;&#x6162;&#x6162;&#x804A;&#x3002;</q></p>
<p>&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;html&#x603B;&#x5171;&#x591A;&#x5C11;&#x6807;&#x7B7E;&#xFF1F;&#xFF08;&#x81EA;&#x5DF1;&#x6162;&#x6162;&#x6570;&#x53BB;&#x5427;~&#xFF09;</p>
</th></td></tr></table></var></code></strong></em></p>
          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/10/05/border-image/" itemprop="url">
                  轻松入门css3之border-image
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-10-05T00:00:00+08:00" content="2014-10-05">
              2014-10-05
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x8BDD;&#x8BF4;&#x5927;&#x5BB6;&#x4E0D;&#x7BA1;&#x7528;&#x8FC7;&#x6CA1;&#x7528;&#x8FC7;&#xFF0C;&#x5BF9;border-image&#x5E94;&#x8BE5;&#x90FD;&#x6709;&#x6240;&#x8033;&#x95FB;&#xFF0C;&#x76F8;&#x6BD4;css2.1&#xFF0C;css3&#x7684;&#x65B0;&#x4E1C;&#x897F;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6311;&#x8FD9;&#x4E2A;&#x6765;&#x8BF4;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x8F83;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x90A3;&#x5B83;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x7528;&#x5462;&#xFF0C;&#x6709;&#x54EA;&#x4E9B;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF1F;&#x8FD9;&#x65B9;&#x9762;&#x4E5F;&#x6709;&#x4E66;&#x7C4D;&#x548C;&#x6587;&#x7AE0;&#x8BB2;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x770B;&#x8FC7;&#xFF0C;&#x5374;&#x89C9;&#x5F97;&#x6CA1;&#x641E;&#x61C2;&#xFF0C;&#x4E5F;&#x6CA1;&#x5F04;&#x660E;&#x767D;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x90A3;&#x4E48;&#x5E0C;&#x671B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x53EF;&#x4EE5;&#x5E2E;&#x5230;&#x4F60;&#xFF01;&#x6211;&#x4E0D;&#x4F1A;&#x6309;&#x5E38;&#x7406;&#x51FA;&#x724C;~</p>
<p>&#x9996;&#x5148;&#x8981;&#x8DDF;&#x5927;&#x5BB6;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x5148;&#x5165;&#x4E3A;&#x4E3B;&#x7684;&#x8D70;&#x5165;&#x4E00;&#x4E2A;&#x6B7B;&#x80E1;&#x540C;&#xFF0C;&#x4E0D;&#x7136;&#x5F88;&#x96BE;&#x8D70;&#x51FA;&#x6765;&#xFF0C;&#x56FE;&#x7247;&#x8FB9;&#x6846;&#xFF0C;&#x8DDF;&#x4F7F;&#x7528;&#x7EBF;&#x578B;&#x8FB9;&#x6846;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x601D;&#x7EF4;&#x8981;&#x8F6C;&#x6362;&#x8FC7;&#x6765;&#xFF0C;&#x4F7F;&#x7528;&#x7EBF;&#x578B;&#x8FB9;&#x6846;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x201C;&#x8FB9;&#x6846;&#x5BBD;&#x5EA6;&#x201D;&#x3001;&#x201C;&#x7C7B;&#x578B;&#x201D;&#x548C;&#x201C;&#x989C;&#x8272;&#x201D;&#x3002;&#x90A3;&#x4E48;&#x8FB9;&#x6846;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x4E0D;&#x80FD;&#x7167;&#x642C;&#xFF0C;&#x5B83;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5957;&#x89C4;&#x5219;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8BF7;&#x6E05;&#x7A7A;&#x4F60;&#x7684;&#x8111;&#x888B;&#xFF0C;&#x5FD8;&#x5374;&#x624D;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x5B66;&#x4E60;&#xFF08;&#x8FD9;&#x8BDD;&#x597D;&#x50CF;&#x5728;&#x6B66;&#x4FA0;&#x7247;&#x91CC;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#xFF09;~</p>
<p>&#x4F60;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x8981;&#x9886;&#x53EA;&#x6709;&#x4E24;&#x70B9;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x56FE;&#x7247;&#x88C1;&#x526A;&#x7684;&#x65B9;&#x5F0F;<br>&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x88C1;&#x526A;&#xFF0C;&#x88C1;&#x526A;&#x5B8C;&#x4E4B;&#x540E;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x52A8;&#x4F5C;&#xFF1F;</p>
<h2 id="&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;"><a href="#&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;" class="headerlink" title="&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;"></a>&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;</h2><p>&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x6709;&#x591A;&#x9EBB;&#x70E6;&#xFF0C;&#x591A;&#x6DF1;&#x5965;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x73A9;&#x513F;&#x8FC7;&#x4E00;&#x79CD;&#x667A;&#x529B;&#x6E38;&#x620F;&#x5427;&#xFF0C;&#x53EB;&#x505A;&#x201C;&#x4F60;&#x80FD;&#x7528;&#x51E0;&#x5200;&#x628A;&#x4E00;&#x4E2A;&#x6B63;&#x65B9;&#x5F62;&#x5207;&#x6210;&#x4E5D;&#x5757;&#xFF1F;&#x201D;&#x6216;&#x8005;&#x8BF4;&#x201C;&#x53EA;&#x7528;&#x51E0;&#x5200;&#x4F60;&#x80FD;&#x628A;&#x4EC0;&#x4E48;&#x5207;&#x6210;&#x591A;&#x5C11;&#x5757;&#x201D;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x56FE;&#x7247;&#x88C1;&#x526A;&#x662F;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x77AC;&#x95F4;&#x89C9;&#x5F97;&#x4EB2;&#x5207;&#x5F88;&#x591A;&#xFF1F;&#x5B83;&#x5C31;&#x662F;&#x6A2A;&#x7AD6;&#x5404;&#x4E24;&#x5200;&#x6765;&#x628A;&#x4F60;&#x6240;&#x9009;&#x53D6;&#x7684;&#x56FE;&#x7247;&#x5207;&#x6210;&#x4E5D;&#x4EFD;&#xFF0C;&#x5C31;&#x662F;&#x5F88;&#x591A;&#x8D44;&#x6599;&#x91CC;&#x8BF4;&#x7684;&#x201C;&#x4E5D;&#x5BAB;&#x683C;&#x201D;&#x6A21;&#x6837;&#xFF0C;&#x662F;&#x600E;&#x4E48;&#x5207;&#x7684;&#x5462;&#xFF1F;&#x6CE8;&#x610F;&#xFF0C;&#x5207;&#x7684;&#x6B21;&#x6570;&#x662F;4&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x86EE;&#x719F;&#x6089;&#x7684;&#x5427;&#xFF0C;margin&#x3001;padding&#x3001;border&#x7B49;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6709;&#x56DB;&#x4E2A;&#x65B9;&#x5411;&#x7684;&#x89C4;&#x5219;&#x5427;&#xFF0C;&#x6B64;&#x5904;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x9075;&#x5FAA;&#x4E0A;&#x3001;&#x53F3;&#x3001;&#x4E0B;&#x3001;&#x5DE6;&#xFF0C;&#x90A3;&#x662F;&#x600E;&#x4E48;&#x6D4B;&#x91CF;&#x7684;&#x5462;&#xFF1F;&#x4F60;&#x5E94;&#x8BE5;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x662F;&#x4ECE;&#x8FB9;&#x7F18;&#x5411;&#x91CC;&#x6D4B;&#x91CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0A;&#x8FB9;&#x7F18;&#x5411;&#x4E0B;&#xFF0C;&#x53F3;&#x8FB9;&#x7F18;&#x5411;&#x5DE6;&#xFF0C;&#x4F9D;&#x6B21;&#x7C7B;&#x63A8;&#x3002;&#x50CF;&#x5176;&#x4ED6;&#x89C4;&#x5219;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7B80;&#x5199;&#x4E4B;&#xFF0C;&#x5199;&#x4E00;&#x4E2A;&#xFF0C;&#x4E24;&#x4E2A;&#x3001;&#x4E09;&#x4E2A;&#x90FD;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4F1A;&#x5728;&#x4E0B;&#x9762;&#x5949;&#x4E0A;&#xFF01;~</p>
<h2 id="&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;"><a href="#&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;" class="headerlink" title="&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;"></a>&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;</h2><p>&#x6216;&#x8BB8;&#x4F1A;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x6211;&#x770B;&#x4F60;&#x8BF4;&#x600E;&#x4E48;&#x6D4B;&#x91CF;&#xFF0C;&#x600E;&#x4E48;&#x88C1;&#x526A;&#xFF0C;&#x5934;&#x90FD;&#x5927;&#x4E86;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x8981;&#x5E72;&#x561B;&#x554A;&#xFF1F;&#x6211;&#x5C31;&#x7528;&#x4E2A;&#x8FB9;&#x6846;&#x8FD8;&#x641E;&#x8FD9;&#x4E48;&#x590D;&#x6742;&#x3002;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x8BF4;&#x660E;&#x88C1;&#x526A;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x5E72;&#x561B;&#xFF0C;&#x6765;&#x62FF;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;w3c&#x6559;&#x7A0B;&#x7F51;&#x7684;&#x56FE;&#x7247;</p>
<p><img src="/2014/10/05/border-image/1.png" alt=""></p>
<p>&#x5148;&#x8FD9;&#x4E48;&#x7C97;&#x7CD9;&#x7684;&#x7ED9;&#x5927;&#x5BB6;&#x753B;&#x4E00;&#x5E45;&#xFF0C;&#x5DF2;&#x7ECF;&#x5207;&#x6210;&#x4E5D;&#x5757;&#x4E86;&#x5BF9;&#x5427;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8981;&#x5E72;&#x561B;&#x5462;&#xFF0C;&#x8981;&#x53D1;&#x529F;&#x4E86;&#xFF01;&#x5475;&#x5475;&#xFF0C;&#x5F00;&#x73A9;&#x7B11;&#x3002;</p>
<p>&#x56FE;&#x7247;&#x8FB9;&#x6846;&#x7684;&#x7ED8;&#x5236;&#x8FDB;&#x5165;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#x4E00;&#x6B65;&#xFF1A;</p>
<p>&#x5207;&#x8BB0;&#xFF0C;&#x56DB;&#x4E2A;&#x89D2;&#x662F;&#x4E0D;&#x52A8;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x4F60;&#x5E94;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x8FB9;&#x6846;&#xFF0C;&#x56DB;&#x4E2A;&#x89D2;&#x8FD8;&#x662F;&#x7EA2;&#x8272;&#x83F1;&#x5F62;&#xFF0C;&#x4F60;&#x4E5F;&#x63A7;&#x5236;&#x4E0D;&#x4E86;&#x5B83;&#xFF08;&#x9664;&#x4E86;&#x5C3A;&#x5BF8;&#xFF09;&#x3002;&#x90A3;&#x4E2D;&#x95F4;&#x5462;&#xFF0C;&#x4E2D;&#x95F4;&#x4E5F;&#x662F;&#x4E0D;&#x663E;&#x793A;&#x7684;&#xFF0C;&#x5927;&#x6F20;&#x54E5;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#x628A;&#x5B83;&#x79F0;&#x4E3A;&#x201C;&#x76F2;&#x533A;&#x201D;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x62FF;&#x6389;&#xFF01;&#x5C31;&#x53EA;&#x5269;&#x56DB;&#x4E2A;&#x9EC4;&#x8272;&#x83F1;&#x5F62;&#x4E86;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x6B63;&#x7ECF;&#x7684;&#x8BB2;&#x4E00;&#x4E0B;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x505A;&#x4E00;&#x4E2A;&#x5F62;&#x8C61;&#x7684;&#x6BD4;&#x55BB;&#x5427;&#xFF0C;&#x7ED9;&#x5143;&#x7D20;&#x52A0;&#x4E0A;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8FB9;&#x6846;&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x533A;&#x57DF;&#x628A;&#x4E2D;&#x95F4;&#x638F;&#x7A7A;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5411;&#x56DB;&#x5468;&#x6491;&#x5F00;&#xFF01;</p>
<p>&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x683C;&#x5F0F;&#xFF1A;<br>border-image:url(&#x56FE;&#x7247;&#x8DEF;&#x5F84;)    &#x88C1;&#x526A;&#x5C3A;&#x5BF8;   &#x88C1;&#x526A;&#x8FC7;&#x540E;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#xFF08;&#x5C31;&#x4E0A;&#x56FE;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x56DB;&#x4E2A;&#x9EC4;&#x8272;&#x83F1;&#x5F62;&#x7684;&#x6392;&#x5217;&#x65B9;&#x5F0F;&#xFF09;</p>
<p>&#x6392;&#x5217;&#x65B9;&#x5F0F;&#x6709;&#x4E09;&#x79CD;round&#x3001;repeat&#x3001;stretch&#x5206;&#x522B;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x662F;&#x4EC0;&#x4E48;&#x6548;&#x679C;</p>
<p>round&#xFF08;&#x5E73;&#x94FA;&#xFF09;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 round;border-width:27px;width:800px;height:100px;background:#0CC;}
</code></pre><p>&#x6548;&#x679C;</p>
<p><img src="/2014/10/05/border-image/2.png" alt=""> </p>
<p>repeat&#xFF08;&#x91CD;&#x590D;&#xFF09;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 repeat;border-width:27px;width:800px;height:100px;background:#0CC;}
</code></pre><p>&#x6548;&#x679C;</p>
<p><img src="/2014/10/05/border-image/3.png" alt=""> </p>
<p>stretch&#xFF08;&#x62C9;&#x4F38;&#xFF09;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 stretch;border-width:27px;width:800px;height:100px;background:#0CC;}
</code></pre><p>&#x6548;&#x679C;</p>
<p><img src="/2014/10/05/border-image/4.png" alt=""></p>
<p>&#x6CE8;&#xFF1A;IE&#x5F00;&#x53D1;&#x8005;&#x5E73;&#x53F0;&#x8FD8;&#x7ED9;&#x51FA;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;space&#xFF0C;&#x636E;&#x6211;&#x6D4B;&#x8BD5;&#xFF0C;&#x8DDF;repeat&#x6CA1;&#x770B;&#x51FA;&#x6765;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x65B0;&#x53D1;&#x73B0;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;~</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x4E09;&#x79CD;&#x5C55;&#x793A;&#x5B8C;&#x4E86;&#xFF0C;&#x76F8;&#x4FE1;&#x7528;&#x8FC7;&#x80CC;&#x666F;&#x56FE;&#x7247;&#x6216;&#x8005;&#x8BBE;&#x7F6E;&#x8FC7;&#x7535;&#x8111;&#x684C;&#x9762;&#x56FE;&#x7247;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x5E73;&#x94FA;&#x548C;&#x62C9;&#x4F38;&#x90FD;&#x5F88;&#x719F;&#x6089;&#x5427;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x73B0;&#x5728;&#x8BE5;&#x8BF4;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4E86;&#x3002;</p>
<p>&#x77ED;&#x77ED;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5230;&#x5E95;&#x85CF;&#x6709;&#x591A;&#x5C11;&#x7384;&#x673A;&#x5462;&#xFF1F;&#xFF08;&#x6545;&#x5F04;&#x7384;&#x865A;&#x4E86;&#x54C8;~&#xFF09;</p>
<p>1&#x3001;&#x56FE;&#x7247;&#x8DEF;&#x5F84;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x9519;&#xFF0C;&#x53EF;&#x4E3A;&#x7EDD;&#x5BF9;&#x6216;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;<br>2&#x3001;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5230;&#x88C1;&#x526A;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x7528;&#x4E86;27&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x56FE;&#x7247;&#x7684;&#x5BBD;&#x9AD8;&#x5747;&#x4E3A;81&#xFF0C;&#x4F7F;&#x7528;27&#x80FD;&#x628A;&#x5B83;&#x7684;&#x8FB9;&#x8FDB;&#x884C;&#x4E09;&#x7B49;&#x5206;&#xFF0C;&#x526A;&#x51FA;&#x4E09;&#x4E2A;&#x5B8C;&#x6574;&#x83F1;&#x5F62;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x597D;&#x770B;&#xFF0C;&#x4F60;&#x60F3;&#x7528;&#x591A;&#x5927;&#x7528;&#x591A;&#x5927;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x5F71;&#x54CD;&#x4F60;&#x6210;&#x529F;&#x7684;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8981;&#x5728;&#x539F;&#x56FE;&#x5C3A;&#x5BF8;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;0&#x6216;&#x8005;81&#x662F;&#x4EC0;&#x4E48;&#x6548;&#x679C;~&#x53E6;&#x5916;&#xFF0C;&#x5B83;&#x6CA1;&#x5E26;&#x5355;&#x4F4D;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x5B83;&#x9ED8;&#x8BA4;&#x5355;&#x4F4D;&#x5C31;&#x662F;&#x201C;px&#x201D;&#xFF0C;&#x5E26;&#x4E0A;&#x5355;&#x4F4D;&#x53CD;&#x800C;&#x4F1A;&#x9519;&#xFF01;&#xFF01;<br>3&#x3001;&#x4F7F;&#x7528;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x4EE5;&#x53EA;&#x5199;&#x4E00;&#x4E2A;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4E0A;&#x9762;&#x90A3;&#x6837;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x4E24;&#x4E2A;&#xFF0C;&#x4F46;&#x5207;&#x8BB0;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x7684;&#x8BF4;&#xFF0C;&#x53EF;&#x4E0D;&#x53EF;&#x4EE5;&#x5199;&#x4E09;&#x4E2A;&#x6216;&#x8005;&#x56DB;&#x4E2A;&#x5462;&#xFF1F;&#x4E0D;&#x884C;&#xFF01;&#x4E0D;&#x4EC5;&#x8BF8;&#x5982; round repeat stretch&#x8FD9;&#x6837;&#x7684;&#x4E0D;&#x884C;&#xFF0C;round repeat round&#x548C;round repeat round repeat&#x8FD9;&#x6837;&#x770B;&#x4F3C;&#x5408;&#x7406;&#x7684;&#x4E5F;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF01;&#xFF01;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E0D;&#x5199;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x662F; stretch&#x3002;</p>
<p>&#x7ED9;&#x51FA;stretch round &#x7ED3;&#x5408;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x524D;&#x9762;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x4E0A;&#x4E0B;&#xFF0C;&#x540E;&#x9762;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x5DE6;&#x53F3;&#x3002;</p>
<p><img src="/2014/10/05/border-image/5.png" alt=""></p>
<p>4&#x3001;&#x8FB9;&#x6846;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x9996;&#x5148;&#x8FD9;&#x4E2A;&#x662F;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x4E0D;&#x7136;&#x662F;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x53CD;&#x5E94;&#x7684;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x8FB9;&#x6846;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x65E0;&#x5173;&#xFF0C;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x53EA;&#x662F;&#x4F60;&#x7528;&#x6765;&#x505A;&#x9009;&#x53D6;&#x7684;&#xFF0C;&#x4F60;&#x6240;&#x8BBE;&#x7F6E;&#x7684;&#x8FB9;&#x6846;&#x5BBD;&#x5EA6;&#x6BD4;&#x9009;&#x53D6;&#x7684;&#x90E8;&#x5206;&#x66F4;&#x5927;&#x6216;&#x8005;&#x66F4;&#x5C0F;&#x90FD;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x6B63;&#x5E38;&#x6570;&#x503C;&#xFF0C;&#x4F60;&#x6240;&#x9009;&#x53D6;&#x7684;&#x90E8;&#x5206;&#x56FE;&#x7247;&#x4F1A;&#x7B49;&#x6BD4;&#x4F8B;&#x7F29;&#x653E;&#x4EE5;&#x6B63;&#x5E38;&#x663E;&#x793A;</p>
<p>&#x4EE5;&#x4E0A;&#x56DB;&#x70B9;&#xFF0C;&#x4FBF;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x57FA;&#x672C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x70B9;&#x51FA;&#x9519;&#x4F60;&#x90FD;&#x5C06;&#x770B;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x6548;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x7EC3;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x6CE8;&#x610F;&#x5355;&#x8BCD;&#x7684;&#x62FC;&#x5199;&#x8FD9;&#x6837;&#x7684;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#x4E0D;&#x8981;&#x72AF;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x56F0;&#x60D1;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x4E48;</p>
<h2 id="&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;"><a href="#&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;"></a>&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;</h2><p>&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x54E5;&#x4FE9;&#x662F;&#x5F88;&#x50CF;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF0C;repeat&#x4F3C;&#x4E4E;&#x4E0D;&#x50CF;round&#x90A3;&#x4E48;&#x5B8C;&#x7F8E;&#xFF0C;&#x662F;&#x4F1A;&#x5728;&#x4E24;&#x7AEF;&#x7559;&#x6709;&#x7455;&#x75B5;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x5B83;&#x4EC5;&#x4EC5;&#x627F;&#x62C5;&#x4E86;&#x91CD;&#x590D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6709;&#x4E2D;&#x95F4;&#x5411;&#x4E24;&#x7AEF;&#x8FDB;&#x884C;&#x91CD;&#x590D;&#xFF0C;&#x800C;round&#x4E0D;&#x4EC5;&#x627F;&#x62C5;&#x4E86;&#x91CD;&#x590D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD8;&#x5E73;&#x8861;&#x4E86;&#x4E00;&#x4E0B;&#x603B;&#x5BBD;&#x5EA6;&#x548C;&#x6240;&#x9009;&#x53D6;&#x90E8;&#x5206;&#x56FE;&#x7247;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x8BA9;&#x56FE;&#x7247;&#x521A;&#x521A;&#x597D;&#x80FD;&#x5B8C;&#x6574;&#x7684;&#x5E73;&#x94FA;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;"><a href="#&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;" class="headerlink" title="&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;"></a>&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;</h2><p> &#x5982;&#x679C;&#x771F;&#x7684;&#x662F;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x80FD;&#x5B8C;&#x6210;&#x66F4;&#x591A;&#x66F4;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x4F7F;&#x7528;&#x597D;&#x8FB9;&#x6846;&#x56FE;&#x7247;&#x9700;&#x8981;&#x505A;&#x597D;&#x4E24;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x505A;&#x51FA;&#x4E00;&#x5F20;&#x597D;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7B2C;&#x4E8C;&#x662F;&#x4EE5;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x88C1;&#x526A;&#xFF0C;&#x8FD9;&#x6837;&#x8D4B;&#x4E88;&#x4E86;&#x5B83;&#x66F4;&#x591A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x548C;&#x521B;&#x9020;&#x529B;&#xFF0C;&#x5B83;&#x7684;&#x5F3A;&#x5927;&#x8D85;&#x4E4E;&#x4F60;&#x60F3;&#x8C61;&#xFF01;&#x4E0A;&#x9762;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x56DB;&#x6761;&#x8FB9;&#x548C;&#x56DB;&#x89D2;&#x6362;&#x6210;&#x4EFB;&#x610F;&#x56FE;&#x8C61;&#xFF0C;&#x8FD9;&#x90FD;&#x7531;&#x4F60;&#x6765;&#x51B3;&#x5B9A;&#xFF01;~&#x6BD4;&#x5982;&#x4E0A;&#x4F8B;&#xFF0C;&#x4F60;&#x628A;&#x83F1;&#x5F62;&#x5168;&#x90FD;&#x505A;&#x6210;&#x7EA2;&#x8272;&#x6216;&#x8005;&#x9EC4;&#x8272;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x56DB;&#x8FB9;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x7684;&#x56FE;&#x7247;&#x8FB9;&#x6846;&#x4E86;&#xFF0C;so easy&#xFF01;~</p>
<p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E0A;&#x9762;&#x662F;&#x8981;&#x505A;&#x51FA;&#x8FB9;&#x6846;&#x7684;&#x5FC5;&#x5907;&#x4E8B;&#x7269;&#xFF0C;&#x8BE5;&#x732E;&#x4E0A;border-image&#x7684;&#x5B8C;&#x6574;&#x683C;&#x5F0F;&#x4E86;</p>
<p>border-image: url(&#x201C;&#x56FE;&#x7247;&#x8DEF;&#x5F84;&#x201D;) &#x88C1;&#x526A;&#x5C3A;&#x5BF8; /&#x8FB9;&#x6846;&#x5BBD;&#x5EA6; /&#x8FB9;&#x6846;&#x56FE;&#x8C61;&#x8D85;&#x51FA;&#x8FB9;&#x6846;&#x7684;&#x91CF; &#x663E;&#x793A;&#x65B9;&#x5F0F;;</p>
<p>&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x600E;&#x4E48;&#x6BD4;&#x521A;&#x624D;&#x591A;&#x51FA;&#x4E24;&#x4E2A;&#x5462;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x628A;&#x6240;&#x6709;&#x7684;&#x90FD;&#x7F29;&#x5199;&#x5230;&#x4E00;&#x6761;&#x89C4;&#x5219;&#x91CC;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x6309;&#x7167;&#x683C;&#x5F0F;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#x201C;/&#x201D;&#x662F;<br>&#x4E0D;&#x80FD;&#x53BB;&#x6389;&#x7684;&#xFF0C;&#x4E0D;&#x7136;&#x6574;&#x6761;&#x89C4;&#x5219;&#x53C8;&#x4E00;&#x547D;&#x545C;&#x547C;&#x4E86;&#xFF0C;&#x90A3;&#x8FB9;&#x6846;&#x56FE;&#x8C61;&#x8D85;&#x51FA;&#x8FB9;&#x6846;&#x7684;&#x91CF;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x6240;&#x8BBE;&#x5B9A;&#x7684;&#x8FB9;&#x6846;&#x56FE;&#x8C61;&#x662F;&#x5360;&#x636E;&#x4E86;&#x6240;&#x5B9A;<br>&#x4E49;&#x7684;&#x56FA;&#x5B9A;&#x5BBD;&#x5EA6;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x9ED8;&#x8BA4;&#x8D85;&#x51FA;&#x4E3A;0&#xFF1B;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x8D85;&#x51FA;5px&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 /30px /5px stretch round;
</code></pre><p><img src="/2014/10/05/border-image/6.png" alt=""></p>
<p>&#x770B;&#x5230;&#x533A;&#x522B;&#x4E86;&#x4E48;&#xFF1F;&#x56DB;&#x8FB9;&#x90FD;&#x8D85;&#x51FA;&#x53BB;&#x4E86;5px&#xFF0C;&#x4F5C;&#x4E3A;&#x5E38;&#x7406;&#xFF0C;&#x50CF;&#x8FD9;&#x79CD;&#x7528;&#x6765;&#x63A7;&#x5236;&#x8DDD;&#x79BB;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x4EE5;&#x6B63;<br>&#x5C31;&#x53EF;&#x4EE5;&#x8D1F;&#x54AF;&#xFF1F;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x8FD9;&#x4E2A;&#x771F;&#x6CA1;&#x6709;&#xFF01;~&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x9075;&#x5FAA;&#x4E0A;&#x3001;&#x53F3;&#x3001;&#x4E0B;&#x3001;&#x5DE6;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7B80;&#x5199;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7B80;&#x5199;</p>
<p>border-image: url(&#x201C;&#x56FE;&#x7247;&#x8DEF;&#x5F84;&#x201D;) &#x88C1;&#x526A;&#x5C3A;&#x5BF8; /&#x8FB9;&#x6846;&#x5BBD;&#x5EA6;;</p>
<p>&#x8FD9;&#x4E2A;&#x7EC4;&#x5408;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x4E86;&#x3002;&#x5176;&#x4ED6;&#x7528;&#x6765;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#x3002;</p>
<p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E0D;&#x77E5;&#x4F60;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x660E;&#x4E86;&#xFF1F;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x6CA1;&#x660E;&#x767D;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x52A8;&#x624B;&#x505A;&#x4E00;&#x4E0B;&#x5427;&#xFF0C;&#x53EA;&#x8981;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x56DB;&#x6761;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4E0D;&#x51FA;&#x9519;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x53E6;&#x9644;&#x5927;&#x6F20;&#x54E5;&#x6587;&#x7AE0;<a href="http://www.w3cplus.com/content/css3-border-image" target="_blank" rel="external">css3-border-image</a>&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4F60;&#x5148;&#x80FD;&#x505A;&#x51FA;&#x6765;&#x57FA;&#x672C;&#x7684;&#x6548;&#x679C;&#x518D;&#x770B;&#x6536;&#x83B7;&#x4F1A;&#x66F4;&#x5927;&#xFF0C;&#x8FD8;&#x6709;&#x60CA;&#x559C;&#xFF0C;&#x4E0D;&#x7136;&#x53EF;&#x80FD;&#x5F88;&#x6655;&#x3002;</p>
<p>IE&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E2D;&#x5FC3;<a href="http://msdn.microsoft.com/library/ie/dn384064.aspx" target="_blank" rel="external">&#x76F8;&#x5173;&#x5185;&#x5BB9;</a></p>
<p>&#x6B22;&#x8FCE;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#x5B66;&#x4E60;&#xFF0C;&#x52A0;&#x5165;&#x6211;&#x7684;&#x4F01;&#x9E45;&#x7FA4;&#x4F60;&#x5C06;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x54E6;&#xFF01;~web&#x524D;&#x7AEF;~&#x7F8E;&#x662F;&#x7F16;&#x51FA;&#x6765;&#x7684;&#xFF1A;152128548</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/10/03/你不该忽视的小问题之margin叠加篇/" itemprop="url">
                  你不该忽视的小问题之margin叠加篇
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-10-03T00:00:00+08:00" content="2014-10-03">
              2014-10-03
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x5728;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;html&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4F1A;&#x7684;&#x4EBA;&#x90FD;&#x8BF4;&#x6700;&#x591A;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x5B66;&#x4F1A;&#x4E86;&#x3002;&#x5F53;&#x6211;&#x5B66;&#x4E60;css&#x5230;&#x4E86;&#x4E00;&#x5B9A;&#x9636;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x89C9;&#x5F97;&#x4E5F;&#x633A;&#x5BB9;&#x6613;&#x7684;&#x5440;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x4EBA;&#x90FD;&#x505A;&#x4E86;&#x90A3;&#x4E48;&#x4E45;&#xFF0C;&#x8FD8;&#x5728;&#x90A3;&#x513F;&#x7814;&#x7A76;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x53BB;&#x5410;&#x69FD;jquery&#xFF0C;&#x8BF4;&#x5B83;&#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x73A9;&#x513F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x524D;&#x7AEF;&#x6572;&#x4EE3;&#x7801;&#x7684;&#x4F60;&#x5E94;&#x8BE5;&#x53BB;&#x7814;&#x7A76;js&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x6846;&#x67B6;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7B49;&#x7B49;&#xFF0C;&#x53CD;&#x6B63;&#x4F60;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x5728;&#x641E;&#x7684;&#x4E1C;&#x897F;&#x522B;&#x4EBA;&#x542C;&#x4E86;&#x89C9;&#x5F97;&#x9AD8;&#x5927;&#x4E0A;&#x3001;&#x4E0D;&#x660E;&#x89C9;&#x5389;&#x5C31;&#x5BF9;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x73B0;&#x8C61;&#x4E5F;&#x4E0D;&#x80FD;&#x8BF4;&#x4E0D;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD5;&#x7ADF;&#x8FD8;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x4E5F;&#x662F;&#x6D6E;&#x8E81;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x9AD8;&#x624B;&#x7528;&#x6811;&#x53F6;&#x90FD;&#x80FD;&#x6740;&#x4EBA;&#xFF0C;&#x4F60;&#x5374;&#x4E00;&#x76F4;&#x53EA;&#x60F3;&#x8981;&#x7EDD;&#x4E16;&#x597D;&#x5251;&#xFF0C;&#x5728;&#x9119;&#x89C6;&#x81EA;&#x5DF1;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x524D;&#x8FDB;&#x4E0D;&#x6B62;~&#x95EE;&#x9898;&#x662F;&#x4F60;&#x4E5F;&#x987A;&#x4FBF;&#x9119;&#x89C6;&#x4E86;&#x522B;&#x4EBA;&#xFF0C;&#x5475;&#x5475;&#x3002;</p>
<p>&#x6BCF;&#x79CD;&#x6280;&#x672F;&#x786E;&#x5B9E;&#x90FD;&#x5B58;&#x5728;&#x7740;&#x4E00;&#x4E9B;&#x4E0D;&#x8DB3;&#xFF0C;&#x4F46;&#x4EAE;&#x70B9;&#x4E5F;&#x7EDD;&#x5BF9;&#x662F;&#x5927;&#x4E8E;&#x4E0D;&#x8DB3;&#x7684;&#xFF0C;&#x8FD8;&#x8FDC;&#x6CA1;&#x5230;&#x88AB;&#x4F60;&#x8BF4;&#x70C2;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x4E0D;&#x7136;&#x5B83;&#x4E5F;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x6D41;&#x884C;&#x5E76;&#x4E14;&#x88AB;&#x4F60;&#x77E5;&#x9053;&#x548C;&#x613F;&#x610F;&#x5B66;&#x4E60;&#x3002;<br>&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#xFF0C;&#x56DE;&#x5230;&#x6B63;&#x9898;&#x2014;&#x2014;margin&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x62FF;&#x4E00;&#x4E2A;&#x8BCD;&#x7528;&#x6765;&#x5F62;&#x5BB9;&#x663E;&#x793A;&#x5F02;&#x5E38;&#xFF0C;&#x53EB;&#x201C;bug&#x201D;&#x3002;bug&#x5B83;&#x4E5F;&#x5206;&#x4E3A;&#x201C;&#x4EBA;&#x4E3A;&#x201D;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x3002;margin&#x7684;&#x8FD9;&#x4E2A;&#x53E0;&#x52A0;&#x7B97;&#x4E0D;&#x7B97;&#x5462;&#xFF1F;~&#x5728;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7EDD;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x662F;&#x89C9;&#x5F97;&#x4E0D;&#x5BF9;&#x52B2;&#xFF0C;&#x6216;&#x8005;&#x4EE5;&#x4E00;&#x53E5;&#x201C;&#x5E94;&#x8BE5;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x95EE;&#x9898;&#x5427;&#x201C;&#x53BB;&#x6577;&#x884D;&#x8FC7;&#x53BB;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x5BFB;&#x6C42;&#x771F;&#x76F8;&#x3002;</p>
<h2 id="margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;"><a href="#margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;" class="headerlink" title="margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;"></a>margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;</h2><p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x6211;&#x89C9;&#x5F97;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x4F1A;&#x53BB;&#x5FFD;&#x89C6;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x4E0A;&#x4E0B;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4E0A;&#x8FB9;&#x5143;&#x7D20;&#x7684;&#x4E0B;&#x5916;&#x8FB9;&#x8DDD;&#x4F1A;&#x4E0E;&#x4E0B;&#x8FB9;&#x5143;&#x7D20;&#x7684;&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#xFF0C;&#x53E0;&#x52A0;&#x7684;&#x610F;&#x601D;&#x4E0D;&#x662F;&#x4E8C;&#x8005;&#x76F8;&#x52A0;&#xFF0C;&#x800C;&#x662F;&#x53D6;&#x66F4;&#x5927;&#x8005;&#x3002;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p>&#x7EFF;&#x8272;&#x8FB9;&#x6846;&#x662F;h2&#x6807;&#x9898;&#xFF0C;&#x672A;&#x6D88;&#x9664;&#x5E95;&#x5916;&#x8FB9;&#x8DDD;&#xFF0C;&#x8BA1;&#x7B97;&#x4E4B;&#x540E;&#x8FD1;&#x4F3C;12px&#xFF0C;&#x4F46;&#x7EA2;&#x8272;&#x7BAD;&#x5934;&#x6240;&#x6807;&#x51FA;&#x7684;&#x5916;&#x8FB9;&#x8DDD;&#x4E3A;30px&#xFF0C;&#x662F;&#x84DD;&#x8272;&#x8FB9;&#x6846;&#x5BB9;&#x5668;&#x6240;&#x6DFB;&#x52A0;&#x7684;&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#x3002;&#x6B64;&#x4E3A;&#x4E0D;&#x540C;&#x5143;&#x7D20;&#x95F4;&#x7684;&#x4E0A;&#x4E0B;&#x91CD;&#x5408;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x6709;&#x5BB9;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5D4C;&#x5957;&#xFF0C;&#x7236;&#x5143;&#x7D20;&#x548C;&#x5B50;&#x5143;&#x7D20;&#x5916;&#x8FB9;&#x8DDD;&#x4E5F;&#x4F1A;&#x76F8;&#x53E0;&#x52A0;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x662F;&#xFF0C;&#x4E2D;&#x95F4;&#x6CA1;&#x6709;&#x8FB9;&#x6846;&#x548C;&#x5916;&#x8FB9;&#x8DDD;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x5230;&#x5E95;&#x662F;&#x8C01;&#x6CA1;&#x6709;&#x8FB9;&#x6846;&#x6216;&#x8005;&#x5185;&#x8FB9;&#x8DDD;&#x5462;&#xFF0C;&#x7236;&#x5143;&#x7D20;&#x8FD8;&#x662F;&#x5B50;&#x5143;&#x7D20;&#xFF1F;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x6B64;&#x56FE;&#x4E2D;&#xFF0C;&#x84DD;&#x8272;&#x8FB9;&#x6846;30px&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#x672A;&#x53D8;&#x3002;&#x7EA2;&#x8272;&#x8FB9;&#x6846;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x4E86;50px&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x628A;&#x7EA2;&#x8272;&#x8FB9;&#x6846;&#x7684;&#x4E0A;&#x8FB9;&#x6846;&#x53BB;&#x6389;&#x4E86;&#xFF0C;&#x4E5F;&#x6B63;&#x5E38;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x6B64;&#x56FE;&#x4E2D;&#xFF0C;&#x84DD;&#x8272;&#x8FB9;&#x6846;&#x53BB;&#x9664;&#xFF0C;&#x54C7;&#x5076;&#xFF0C;&#x7236;&#x5B50;&#x7D27;&#x7D27;&#x8D34;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#x4EB2;&#x5BC6;&#x65E0;&#x95F4;~&#x800C;&#x4E14;&#x7236;&#x5143;&#x7D20;&#x548C;&#x4E0A;&#x9762;&#x7684;&#x5143;&#x7D20;&#x7684;&#x8FB9;&#x8DDD;&#x53D8;&#x6210;&#x4E86;50px&#xFF01;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x7236;&#x5143;&#x7D20;&#x7684;&#x8FB9;&#x6846;~&#x90A3;&#x4E48;&#xFF0C;&#x52A0;&#x4E2A;&#x5185;&#x8FB9;&#x8DDD;&#x8BD5;&#x8BD5;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p>&#x54B1;&#x7ED9;&#x7236;&#x5143;&#x7D20;&#x52A0;&#x4E86;10px&#x7684;&#x5185;&#x8FB9;&#x8DDD;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x7236;&#x5B50;&#x53C8;&#x5206;&#x79BB;&#x4E86;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x5185;&#x8FB9;&#x8DDD;&#x4E5F;&#x662F;&#x53D6;&#x51B3;&#x4E8E;&#x7236;&#x5143;&#x7D20;&#x3002;<br>&#x5B50;&#x5143;&#x7D20;&#x52A0;&#x5185;&#x8FB9;&#x8DDD;&#x548C;&#x53BB;&#x9664;&#x8FB9;&#x6846;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x8DDF;&#x5927;&#x5BB6;&#x5C55;&#x793A;&#x4E86;&#xFF0C;&#x5DF2;&#x6D4B;&#x5BF9;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x65E0;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x79CD;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x81EA;&#x5DF1;&#x8DDF;&#x81EA;&#x5DF1;&#x6253;&#x67B6;&#x3002;&#x540C;&#x6837;&#x8981;&#x6C42;&#x65E0;&#x8FB9;&#x6846;&#x548C;&#x5185;&#x8FB9;&#x8DDD;&#x3002;<br>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x65B9;&#x4FBF;&#x6211;&#x81EA;&#x5DF1;&#x7F62;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#xFF09;&#xFF0C;&#x54B1;&#x5728;&#x521A;&#x624D;&#x90A3;&#x4E2A;&#x7EA2;&#x8272;&#x8FB9;&#x6846;&#x5BB9;&#x5668;&#x91CC;&#x52A0;&#x4E0A;&#x4E2A;&#x5BB9;&#x5668;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x518D;&#x6F84;&#x6E05;&#x4E00;&#x4E0B;&#x7EAF;&#x5C5E;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x54C8;&#xFF0C;&#x8DDF;&#x53E6;&#x5916;&#x4FE9;&#x5BB9;&#x5668;&#x6CA1;&#x4EFB;&#x4F55;&#x5173;&#x7CFB;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5BF9;&#x6BD4;&#x3002;&#x4E0D;&#x8FC7;&#x3002;&#x3002;&#x54A6;&#xFF0C;&#x4F60;&#x52A0;&#x7684;&#x662F;&#x5565;&#xFF1F;&#x5BB9;&#x5668;&#x5462;&#xFF1F;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x53EF;&#x4E0D;&#x597D;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#x600E;&#x4E48;&#x80FD;&#x660E;&#x767D;&#x5462;&#xFF1F;&#xFF01;<br>&#x597D;&#x5427;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x602A;&#x6211;&#xFF0C;&#x4E0B;&#x9762;&#x5206;&#x5F00;&#x89E3;&#x91CA;</p>
<p>&#x4E00;&#x3001;&#x81EA;&#x5DF1;&#x8DDF;&#x81EA;&#x5DF1;&#x6253;&#x67B6;&#x662F;&#x6709;&#x4E2A;&#x524D;&#x63D0;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x5143;&#x7D20;&#x4E3A;&#x7A7A;&#xFF0C;&#x7A7A;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF0C;&#x5185;&#x5BB9;&#x4E3A;&#x7A7A;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x9AD8;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x4E0A;&#x4E0B;&#x5916;&#x8FB9;&#x8DDD;&#x5C31;&#x78B0;&#x9762;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6253;&#x4E86;~&#x6240;&#x4EE5;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x4F60;&#x8BF4;&#x4EC0;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#xFF0C;&#x4F46;&#x6211;&#x660E;&#x660E;&#x770B;&#x5230;&#x4E86;&#x554A;&#xFF0C;&#x7EA2;&#x8272;&#x5BB9;&#x5668;&#x4E0D;&#x662F;&#x88AB;&#x6491;&#x5F00;&#x4E86;&#x4E48;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5965;&#x5999;&#x6240;&#x5728;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x5728;&#x91CC;&#x9762;&#x653E;&#x4E86;&#x4FE9;&#x5BB9;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x90FD;&#x52A0;&#x4E86;&#x5916;&#x8FB9;&#x8DDD;&#xFF0C;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x90FD;&#x5404;&#x52A0;&#x4E86;30px&#x7684;&#x4E0A;&#x4E0B;&#x8FB9;&#x8DDD;&#xFF0C;&#x4EC0;&#x4E48;&#xFF1F;&#xFF01;&#x662F;&#x7684;&#xFF0C;&#x4F60;&#x6CA1;&#x770B;&#x9519;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x8BB2;&#xFF0C;&#x8FD9;&#x91CC;&#x5E94;&#x8BE5;&#x6709;120px&#x50CF;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#x51FA;&#x6765;&#xFF0C;&#x5C31;&#x7B97;&#x52A0;&#x4E0A;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x4E0A;&#x4E0B;&#x5143;&#x7D20;&#x7684;&#x8FB9;&#x8DDD;&#x4F1A;&#x53D1;&#x751F;&#x53E0;&#x52A0;&#xFF0C;&#x90A3;&#x4E5F;&#x6709;90px&#x5427;&#xFF1F;&#x597D;&#x5427;&#xFF0C;&#x54B1;&#x5C31;&#x7B97;&#x518D;&#x9000;&#x4E00;&#x6B65;&#x8BB2;&#xFF0C;&#x4E2D;&#x95F4;30px&#x4E5F;&#x6CA1;&#x4E86;&#xFF0C;&#x90A3;&#x54B1;&#x5F97;&#x6709;60px&#x5427;&#x81F3;&#x5C11;&#xFF0C;&#x53EF;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x6709;30px&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x89C1;&#x4EBA;&#x6740;&#x4EBA;&#xFF0C;&#x89C1;&#x4F5B;&#x6740;&#x4F5B;&#x7684;&#x8282;&#x594F;&#x554A;&#xFF0C;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x7A7A;&#x767D;&#x4FE1;&#x606F;&#x91CF;&#x4E5F;&#x592A;&#x4E30;&#x5BCC;&#x4E86;&#x5427;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x9189;&#x4E86;&#xFF1F;~&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x4E0D;&#x76F8;&#x4FE1;&#x5B83;&#x7684;&#x6B8B;&#x5FCD;&#xFF0C;&#x518D;&#x52A0;&#x51E0;&#x4E2A;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x8FD8;&#x662F;30px&#x3002;</p>
<p>&#x53CB;&#x60C5;&#x63D0;&#x793A;&#xFF0C;&#x8FD9;&#x79CD;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x53EA;&#x662F;&#x5728;&#x666E;&#x901A;&#x6D41;&#x7684;&#x5757;&#x6846;&#x5143;&#x7D20;&#x624D;&#x5B58;&#x5728;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5782;&#x76F4;&#x5916;&#x8FB9;&#x8DDD;&#xFF01;&#x884C;&#x5185;&#x6846;&#x3001;&#x6D6E;&#x52A8;&#x6846;&#x3001;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x6846;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x53E0;&#x52A0;&#x7684;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;margin&#x53E0;&#x52A0;&#x7684;&#x4E8B;&#x513F;&#x54B1;&#x5C31;&#x5148;&#x8BF4;&#x5230;&#x8FD9;&#x513F;&#xFF0C;&#x5176;&#x4E2D;&#x5947;&#x5999;&#x8FD8;&#x5F97;&#x5404;&#x4F4D;&#x81EA;&#x5DF1;&#x53BB;&#x611F;&#x53D7;&#x4E86;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x5E94;&#x8BE5;&#x662F;&#x6781;&#x5C11;&#x4F1A;&#x78B0;&#x5230;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x7528;&#x9014;&#x7684;&#x7A7A;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x77E5;&#x9053;&#x7B2C;&#x4E00;&#x79CD;&#x800C;&#x4E0D;&#x77E5;&#x9053;&#x7B2C;&#x4E8C;&#x79CD;&#xFF0C;&#x90A3;&#x8BF7;&#x76F8;&#x4FE1;&#x4F60;&#x65E9;&#x665A;&#x4F1A;&#x78B0;&#x5230;&#x7B2C;&#x4E8C;&#x79CD;&#x7684;&#xFF0C;&#x78B0;&#x5230;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x7D22;&#x6027;&#x4E0D;&#x7528;&#x5916;&#x8FB9;&#x8DDD;&#x4E86;&#xFF1F;&#x8FD9;&#x7684;&#x786E;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x4F1A;&#x603B;&#x662F;&#x80FD;&#x8EB2;&#x8FC7;&#x53BB;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x662F;&#x6587;&#x7AE0;&#x5F00;&#x5934;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5F15;&#x5B50;&#x3002;&#x5176;&#x5B9E;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x7684;&#x63D0;&#x9AD8;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x4E0D;&#x8981;&#x52E4;&#x4E8E;&#x53BB;&#x8BF4;&#x201D;&#x77E5;&#x4E86;&#x201C;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x52E4;&#x4E8E;&#x53D1;&#x95EE;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x771F;&#x7684;&#x662F;&#x8FD9;&#x6837;&#x4E48;&#xFF1F;&#x8FD8;&#x53EF;&#x4EE5;&#x600E;&#x6837;&#xFF1F;&#x7136;&#x540E;&#x53BB;&#x5B9E;&#x8DF5;&#x3001;&#x9A8C;&#x8BC1;&#x3002;&#x518D;&#x8005;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4E0D;&#x4F1A;&#x662F;&#x5168;&#x9762;&#x7CFB;&#x7EDF;&#x7684;&#x5B66;&#x4E60;&#x4E86;&#x4E4B;&#x540E;&#x624D;&#x5F00;&#x59CB;&#x505A;&#x9875;&#x9762;&#x7684;&#xFF0C;&#x90FD;&#x4F1A;&#x65F6;&#x5E38;&#x5E26;&#x7740;&#x4E00;&#x79CD;&#x5174;&#x594B;&#x53BB;&#x5C1D;&#x8BD5;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x96BE;&#x514D;&#x53EA;&#x770B;&#x5230;&#x4E86;&#x77E5;&#x8BC6;&#x7684;&#x4E00;&#x9762;&#x800C;&#x6F0F;&#x6389;&#x4E86;&#x5176;&#x4ED6;&#xFF0C;&#x6216;&#x8005;&#x7406;&#x89E3;&#x4E0D;&#x5230;&#x4F4D;&#x3002;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#x5C31;&#x4F1A;&#x9047;&#x5230;&#x6240;&#x8C13;&#x7684;&#x201D;&#x74F6;&#x9888;&#x201C;~&#x65F6;&#x5E38;&#x7684;&#x53BB;&#x56DE;&#x987E;&#xFF0C;&#x6216;&#x8005;&#x591A;&#x627E;&#x8D44;&#x6599;&#x591A;&#x65B9;&#x5B66;&#x4E60;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x4E0D;&#x65AD;&#x53D1;&#x73B0;&#x81EA;&#x8EAB;&#x4E0D;&#x8DB3;&#xFF0C;&#x4E0D;&#x65AD;&#x8FDB;&#x6B65;&#xFF0C;&#x66F4;&#x5168;&#x9762;&#xFF0C;&#x529F;&#x592B;&#x66F4;&#x6DF1;&#x3002;&#x4E0E;&#x5927;&#x5BB6;&#x5171;&#x52C9;&#xFF01;~&#x6B22;&#x8FCE;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#x3002;</p>
<p>&#x53E6;&#x63A8;&#x8350;&#x300A;&#x7CBE;&#x901A;css&#xFF1A;&#x9AD8;&#x7EA7;web&#x6807;&#x51C6;&#x89E3;&#x51B3;&#x65B9;&#x6848;(&#x7B2C;2&#x7248;)&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x66F4;&#x9002;&#x5408;&#x6709;&#x4E00;&#x5B9A;css&#x7F16;&#x5199;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x770B;&#xFF0C;&#x6536;&#x83B7;&#x4F1A;&#x66F4;&#x5927;</p>
<p>&#x56E0;&#x670B;&#x53CB;&#x63D0;&#x9192;&#xFF0C;&#x53C8;&#x53C2;&#x8003;&#x4E86;&#x4E00;&#x4E0B;&#x522B;&#x4EBA;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x5728;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#x65B9;&#x9762;&#x505A;&#x5982;&#x4E0B;&#x4FEE;&#x6B63;&#xFF1A;<br><a href="http://www.smallni.com/collapsing-margin/" target="_blank" rel="external">&#x76F8;&#x5173;&#x94FE;&#x63A5;</a></p>
<h2 id="1-&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"><a href="#1-&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;" class="headerlink" title="1.&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"></a>1.&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;</h2><p>&#x7236;&#x5143;&#x7D20;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x53D1;&#x751F;margin-top&#x53E0;&#x52A0;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x521B;&#x5EFA;BFC&#xFF08;&#x6587;&#x7AE0;&#x5E95;&#x90E8;&#x5BF9;BFC&#x6709;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#xFF09;<br>&#x7236;&#x5143;&#x7D20;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x975E;&#x7A7A;&#x5185;&#x5BB9;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;border-top<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;padding-top</p>
<p>&#x7236;&#x5143;&#x7D20;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x53D1;&#x751F;margin-bottom&#x53E0;&#x52A0;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x521B;&#x5EFA;BFC<br>&#x7236;&#x5143;&#x7D20;height&#x4E3A;auto&#x3001;min-height&#x4E3A;0<br>&#x7236;&#x5143;&#x7D20;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x975E;&#x7A7A;&#x5185;&#x5BB9;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;border-bottom<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;padding-bottom</p>
<p>2&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x603B;&#x7ED3;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E0D;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x4E5F;&#x5C31;&#x663E;&#x5F97;&#x5F88;&#x5BB9;&#x6613;&#x4E86;&#xFF1A;</p>
<p>&#x4E3A;&#x7236;&#x5143;&#x7D20;&#x521B;&#x5EFA;BFC<br>&#x4E3A;&#x7236;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x76F8;&#x5E94;&#x7684;padding&#x6216;&#x8005;border</p>
<h2 id="2-&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"><a href="#2-&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;" class="headerlink" title="2.&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"></a>2.&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;</h2><p>&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x662F;float&#x5143;&#x7D20;<br>&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x662F;absolute&#x5143;&#x7D20;<br>&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x662F;inline-block&#x5143;&#x7D20;</p>
<h2 id="&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC-&#x2014;&#x2014;Block-Formatting-Context-&#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC-&#x2014;&#x2014;Block-Formatting-Context-&#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC &#x2014;&#x2014;Block Formatting Context &#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC &#x2014;&#x2014;Block Formatting Context &#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;</h2><p>CSS &#x89C4;&#x8303;&#x8BF4;&#x660E;&#x4E86;&#x5728;&#x4E0B;&#x5217;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;&#x65B0;&#x7684; block formatting context&#xFF1A;<br>&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#xFF08;float: left | right&#xFF09;&#xFF1B;<br> &#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x5143;&#x7D20;&#xFF08;position: absolute | fixed&#xFF09;&#xFF1B;          &#x884C;&#x5185;&#x5757;&#x5143;&#x7D20;&#xFF08;display: inline-block&#xFF09;&#xFF1B;<br>&#x8868;&#x683C;&#x7684;&#x5355;&#x5143;&#x683C;&#xFF08;display: table-cells&#xFF0C;TD&#x3001;TH&#xFF09;&#xFF1B;  &#x8868;&#x683C;&#x7684;&#x6807;&#x9898;&#xFF08;display: table-captions&#xFF0C;CAPTION&#xFF09;&#xFF1B;<br>&#x2018;overflow&#x2019; &#x7279;&#x6027;&#x4E0D;&#x4E3A; visible &#x7684;&#x5143;&#x7D20;&#xFF08;&#x9664;&#x975E;&#x8BE5;&#x503C;&#x5DF2;&#x7ECF;&#x4F20;&#x64AD;&#x5230;viewport&#xFF09;&#xFF1B; &#x8868;&#x683C;&#x5143;&#x7D20;&#x521B;&#x5EFA;&#x7684; &#x201C;&#x533F;&#x540D;&#x6846;&#x201D;  </p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x201D;display:table&#x201D; &#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x4EA7;&#x751F; &#x201C;block formatting contexts&#x201D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x533F;&#x540D;&#x6846; 6&#xFF0C; &#x5176;&#x4E2D;&#x5305;&#x542B; &#x201C;display:table-cell&#x201D; &#x7684;&#x6846;&#x4F1A;&#x4EA7;&#x751F;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x3002; &#x603B;&#x4E4B;&#xFF0C;&#x5BF9;&#x4E8E; &#x201C;display:table&#x201D; &#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4EA7;&#x751F;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x662F;&#x533F;&#x540D;&#x6846;&#x800C;&#x4E0D;&#x662F; &#x201C;display:table&#x201D;<br>&#x6CE8;&#x610F;&#xFF0C;&#x662F;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x521B;&#x5EFA;&#x4E86;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5B83;&#x4EEC;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
<p>&#x4FEE;&#x6B63;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#xFF0C;&#x5177;&#x4F53;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x6B22;&#x8FCE;&#x5B66;&#x4E60;&#x4EA4;&#x6D41;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/08/30/need-practice/" itemprop="url">
                  万丈高楼平地起——实践为王，应需而生
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-08-30T00:00:00+08:00" content="2014-08-30">
              2014-08-30
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x5728;&#x6587;&#x7AE0;&#x5F00;&#x5934;&#xFF0C;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF08;&#x54EA;&#x513F;&#x6765;&#x7684;&#x60EF;&#x4F8B;~&#xFF09;&#xFF0C;&#x5148;&#x95F2;&#x804A;&#x4E00;&#x4E0B;&#x6292;&#x53D1;&#x4E00;&#x70B9;&#x70B9;&#x611F;&#x60F3;&#x5427;&#x3002;</p>
<p>&#x6B64;&#x6B21;&#x6587;&#x7AE0;&#x7684;&#x60F3;&#x6CD5;&#x6765;&#x6E90;&#x4E8E;&#x6211;&#x6B63;&#x5728;&#x505A;&#x7684;&#x9879;&#x76EE;&#x5F53;&#x4E2D;&#x7684;&#x4F5C;&#x54C1;&#x8BC4;&#x8BBA;&#x529F;&#x80FD;&#xFF0C;&#x6B64;&#x524D;&#x6211;&#x662F;&#x6CA1;&#x505A;&#x8FC7;&#x7684;&#xFF0C;&#x5F53;&#x65F6;&#x62FF;&#x5230;&#x8BBE;&#x8BA1;&#x7A3F;&#x4E4B;&#x540E;&#xFF0C;&#x611F;&#x89C9;&#xFF0C;&#x633A;&#x7B80;&#x5355;&#xFF0C;&#x4E0D;&#x5C31;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x800C;&#x5DF2;&#xFF0C;&#x540E;&#x6765;&#xFF0C;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x4E5F;&#x771F;&#x7684;&#x633A;&#x7B80;&#x5355;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4E5F;&#x771F;&#x7684;&#xFF0C;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x3002;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x8FC7;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x53CD;&#x590D;&#x7684;&#x53BB;&#x67E5;&#x770B;&#x624B;&#x518C;&#xFF0C;&#x5411;&#x540C;&#x884C;&#x3001;&#x524D;&#x8F88;&#x4EEC;&#x8BF7;&#x6559;&#xFF0C;&#x5728;&#x6B64;&#x4E00;&#x5E76;&#x611F;&#x8C22;&#x4E86;~&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x540C;&#x884C;&#x8BF4;&#xFF1A;&#x4E0D;&#x662F;&#x6709;&#x63D2;&#x4EF6;&#x4E48;&#xFF0C;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x633A;&#x65B9;&#x4FBF;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x8981;&#x8BF4;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x6CA1;&#x6709;&#x7528;&#x90A3;&#x4E9B;&#x63D2;&#x4EF6;&#xFF0C;&#x9996;&#x5148;&#x5C31;&#x662F;&#xFF0C;&#x521D;&#x770B;&#x89C9;&#x5F97;&#x633A;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x81EA;&#x5DF1;&#x5E94;&#x8BE5;&#x80FD;&#x641E;&#x5B9A;&#xFF0C;&#x518D;&#x8005;&#xFF0C;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x60F3;&#x518D;&#x53BB;&#x642C;&#x4EE3;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x8981;&#x53BB;&#x7814;&#x7A76;&#xFF0C;&#x53BB;&#x628A;&#x5B83;&#x6539;&#x6210;&#x81EA;&#x5DF1;&#x9879;&#x76EE;&#x5F53;&#x4E2D;&#x8981;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x591A;&#x4F59;&#x7684;&#x8FD8;&#x8981;&#x53BB;&#x6389;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5C31;&#x8FD9;&#x4E48;&#x4E0A;&#x8DEF;&#x4E86;&#xFF0C;&#x4E5F;&#x5C31;&#x6709;&#x4E86;&#x73B0;&#x5728;&#x6EE1;&#x6EE1;&#x7684;&#x6536;&#x83B7;&#x3002;&#x6280;&#x672F;&#x5708;&#x6C38;&#x8FDC;&#x90A3;&#x4E48;&#x548C;&#x8C10;&#x53C8;&#x5145;&#x6EE1;&#x7231;&#x5BF9;&#x5427;&#xFF0C;so&#xFF0C;&#x62FF;&#x6765;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6B64;&#x6587;&#x53EA;&#x6D89;&#x53CA;&#x524D;&#x7AEF;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x6D89;&#x53CA;&#x540E;&#x53F0;&#x3002;&#x987A;&#x5E8F;&#x662F;&#xFF1A;&#x6848;&#x4F8B;&#x529F;&#x80FD;&#x5206;&#x6790;&#x3001;&#x6240;&#x7528;&#x6280;&#x672F;&#x7F57;&#x5217;&#xFF08;jq&#xFF09;&#x3001;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x3001;&#x7ED3;&#x675F;&#x8BED;~</p>
<p>&#x5148;&#x6765;&#x8BF4;&#x529F;&#x80FD;&#xFF0C;&#x6309;&#x533A;&#x57DF;&#x4E00;&#x4E00;&#x9053;&#x6765;&#xFF1A;</p>
<h2 id="&#x4E00;&#x3001;&#x8F93;&#x5165;&#x6846;"><a href="#&#x4E00;&#x3001;&#x8F93;&#x5165;&#x6846;" class="headerlink" title="&#x4E00;&#x3001;&#x8F93;&#x5165;&#x6846;"></a>&#x4E00;&#x3001;&#x8F93;&#x5165;&#x6846;</h2><p><img src="/2014/08/30/need-practice/1.png" alt=""></p>
<p><img src="/2014/08/30/need-practice/2.png" alt=""></p>
<p>&#x501F;&#x7528;&#x4E00;&#x4E0B;&#x5927;&#x5BB6;&#x7070;&#x5E38;&#x719F;&#x6089;&#x7684;QQ&#x7A7A;&#x95F4;&#x8BC4;&#x8BBA;&#x6846;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8C08;&#x7684;&#x529F;&#x80FD;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x53EA;&#x8981;&#x8F93;&#x5165;&#xFF0C;&#x53D1;&#x8868;&#xFF0C;&#x5373;&#x53EF;&#xFF0C;&#x4F60;&#x8981;&#x8BB0;&#x5F97;&#x6211;&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x662F;&#x201C;&#x5373;&#x53EF;&#x201D;&#x54E6;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x8F93;&#x5165;&#x6846;&#x6211;&#x4EEC;&#x8981;&#x7528;&#x4EC0;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x4F60;&#x89C9;&#x5F97;&#x8FD9;&#x4E0D;&#x662F;&#x4E2A;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x4E8B;&#x513F;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;textarea&#xFF0C;&#x4F46;&#x662F;&#xFF0C;div&#x53EF;&#x4E0D;&#x53EF;&#x4EE5;&#x5462;&#xFF0C;&#x8FD9;&#x4E5F;&#x53EF;&#x4EE5;&#x5417;&#xFF1F;&#xFF01;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53BB;&#x770B;&#x770B;&#x201C;contenteditable&#x201D;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x70B9;&#x5230;&#x4E3A;&#x6B62;&#x3002;&#x7136;&#x540E;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#xFF0C;&#x672C;&#x4EE5;&#x4E3A;&#x6211;&#x77E5;&#x9053;&#x7684;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x5230;&#x5E95;&#x8FD8;&#x6709;&#x591A;&#x5C11;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x554A;&#xFF1F;</p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#xFF0C;&#x5B83;&#x91CC;&#x9762;&#x597D;&#x50CF;&#x6709;&#x5B57;&#x5462; &#x2014;&#x2014;&#x201C;&#x8BF4;&#x70B9;&#x4EC0;&#x4E48;&#x5427;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x5462;&#xFF0C;&#x4F60;&#x77E5;&#x9053;QQ&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#x5417;&#xFF1F;&#x8FD9;&#x54E5;&#x4EEC;&#x513F;&#x7528;&#x4E86;&#x4E24;&#x4E2A;div&#xFF0C;my god&#xFF01;&#x5F53;&#x65F6;&#x6211;&#x90A3;&#x4E2A;&#x5BF9;&#x5B83;&#x6EE1;&#x6EE1;&#x7684;&#x94A6;&#x4F69;&#xFF0C;&#x70B9;&#x51FB;&#x4E4B;&#x524D;&#x662F;&#x4E00;&#x4E2A;div&#x91CC;&#x9762;&#x88C5;&#x7684;&#x662F;&#x201C;&#x8BF4;&#x70B9;&#x4EC0;&#x4E48;&#x5427;&#x201D;&#xFF0C;&#x70B9;&#x51FB;&#x4E4B;&#x540E;&#x9690;&#x85CF;&#x4E4B;&#xFF0C;&#x663E;&#x793A;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;div&#x3002;&#x8BF4;&#x5B9E;&#x8BDD;&#x6211;&#x7528;&#x7684;&#x4E5F;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x53EA;&#x56E0;&#x90A3;&#x4E00;&#x77AC;&#x95F4;&#x7684;&#x9707;&#x64BC;&#xFF0C;&#x65B9;&#x6CD5;&#x5343;&#x767E;&#x79CD;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x6562;&#x60F3;&#x5450;&#xFF0C;&#x4E0D;&#x8FC7;&#x540E;&#x6765;&#x6211;&#x5C31;&#x609F;&#x5230;&#xFF0C;&#x5176;&#x5B9E;&#x6CA1;&#x5FC5;&#x8981;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x53EA;&#x7528;&#x4E00;&#x4E2A;div&#xFF0C;&#x7ED9;&#x91CC;&#x9762;&#x586B;&#x4E0A;&#x51E0;&#x4E2A;&#x5B57;&#xFF0C;&#x83B7;&#x53D6;&#x7126;&#x70B9;&#x7684;&#x65F6;&#x5019;&#x6E05;&#x7A7A;&#x5373;&#x53EF;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x9677;&#x9631;&#x54E6;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#x662F;&#x83B7;&#x53D6;&#x7126;&#x70B9;&#x7684;&#x65F6;&#x5019;&#x6E05;&#x7A7A;&#xFF0C;&#x90A3;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x8F93;&#x5165;&#x4E86;&#x6587;&#x5B57;&#xFF0C;&#x9F20;&#x6807;&#x70B9;&#x51FB;&#x4E86;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x518D;&#x56DE;&#x6765;&#xFF0C;oh&#xFF0C;&#x5B83;&#x4E5F;&#x7A7A;&#x4E86;&#xFF0C;&#x8FD9;&#x53EF;&#x4E0D;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#xFF0C;&#x5224;&#x65AD;&#x4EC0;&#x4E48;&#xFF1F;&#x5185;&#x5BB9;&#xFF0C;&#x600E;&#x4E48;&#x5224;&#x65AD;&#xFF0C;&#x53EF;&#x7231;&#x7684;&#x2014;&#x2014;if&#xFF01;&#x7C89;&#x672B;&#x767B;&#x573A;&#x54AF;&#xFF01;&#x70B9;&#x5230;&#x4E3A;&#x6B62;&#xFF01;~&#x54E6;&#xFF0C;&#x5BF9;&#x4E86;&#xFF0C;&#x5FD8;&#x4E86;&#x4E00;&#x4E2A;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x6587;&#x672C;&#x5185;&#x5BB9;&#xFF01;~</p>
<p>&#x7B2C;&#x4E09;&#x6B65;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x70B9;&#x51FB;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x5565;&#x4E5F;&#x6CA1;&#x8F93;&#x5165;&#xFF0C;&#x53C8;&#x70B9;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x662F;&#x518D;&#x6B63;&#x5E38;&#x4E0D;&#x8FC7;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x91CC;&#x53EF;&#x80FD;&#x4F1A;&#x6D89;&#x53CA;&#x4E24;&#x4E2A;&#x4E1C;&#x4E1C;&#xFF0C;&#x4E00;&#x3001;&#x70B9;&#x51FB;&#x6B64;&#x7269;&#x4E00;&#x4E2A;&#x53CD;&#x5E94;&#xFF0C;&#x70B9;&#x51FB;&#x9664;&#x6B64;&#x7269;&#x4E4B;&#x5916;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x53CD;&#x5E94;&#x3002;&#x4E8C;&#x3001;&#x83B7;&#x5F97;&#x7126;&#x70B9;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x4E2A;&#x53CD;&#x5E94;&#xFF0C;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x7684;&#x65F6;&#x5019;&#x53E6;&#x4E00;&#x4E2A;&#x53CD;&#x5E94;&#x3002;<br>&#x70B9;&#x5230;&#x4E3A;&#x6B62;&#xFF01;~</p>
<p>&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x6211;&#x70B9;&#x51FB;&#x4E86;&#xFF0C;&#x4E5F;&#x8F93;&#x5165;&#x5185;&#x5BB9;&#x4E86;&#xFF0C;&#x90A3;&#x5C31;&#x53D1;&#x8868;&#x5427;&#xFF0C;&#x723D;&#x6B6A;&#x6B6A;&#xFF0C;&#x5F88;&#x591A;&#x7AE5;&#x978B;&#x90FD;&#x77E5;&#x9053;&#x4E0B;&#x9762;&#x8981;&#x5E72;&#x561B;&#xFF0C;&#x8BC4;&#x8BBA;&#x561B;&#xFF0C;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x561B;&#xFF0C;&#x70B9;&#x51FB;&#x53D1;&#x8868;&#x65B0;&#x5EFA;&#x5217;&#x8868;&#x9879;&#xFF0C;&#x63D2;&#x5165;&#x561B;&#xFF01;&#x505C;&#xFF01;because&#xFF0C;&#x54EA;&#x91CC;&#x6765;&#x7684;&#x5217;&#x8868;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x8BC4;&#x8BBA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x6728;&#x6709;&#x5217;&#x8868;&#x6EF4;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x65B0;&#x5EFA;&#x5217;&#x8868;&#xFF01;&#x5EFA;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x5F97;&#x628A;&#x5B83;&#x63D2;&#x5165;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x4E2A;&#x63D2;&#x5165;&#xFF0C;&#x5217;&#x8868;&#x63D2;&#x5165;&#x548C;&#x5217;&#x8868;&#x9879;&#x63D2;&#x5165;&#xFF0C;&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x63D2;&#x5165;&#xFF0C;&#x5185;&#x90E8;&#x8FD8;&#x662F;&#x5916;&#x90E8;&#xFF1F;&#x6700;&#x524D;&#x8FD8;&#x662F;&#x6700;&#x540E;&#xFF0C;&#x8FD8;&#x662F;&#x5728;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x4F4D;&#x7F6E;&#xFF1F;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x70B9;&#x5230;&#x4E3A;&#x6B62;&#xFF01;~oh&#xFF0C;&#x505C;&#xFF01;&#x6211;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x5217;&#x8868;&#x5728;&#x4E0D;&#x5728;&#x5440;&#xFF0C;&#x96BE;&#x9053;&#x6BCF;&#x6B21;&#x53D1;&#x8868;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x53BB;&#x65B0;&#x5EFA;&#x554A;&#xFF1F;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#xFF0C;&#x90A3;&#xFF0C;&#x4F60;&#x8FD8;&#x9700;&#x8981;&#x5224;&#x65AD;ul&#x662F;&#x5426;&#x5B58;&#x5728;&#xFF0C;&#x65B9;&#x6CD5;&#x4E0D;&#x6B62;&#x4E00;&#x79CD;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;oh&#xFF0C;&#x597D;&#x50CF;&#x8FD8;&#x6F0F;&#x4E86;&#x4E00;&#x70B9;&#xFF0C;&#x5230;&#x5E95;&#x6709;&#x5B8C;&#x6CA1;&#x5B8C;&#x554A;&#xFF1F;&#xFF01;~&#x6211;&#x53D1;&#x8868;&#x4E4B;&#x540E;&#xFF0C;&#x8F93;&#x5165;&#x6846;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF0C;&#x6587;&#x5B57;&#x8981;&#x8D4B;&#x7ED9;&#x65B0;&#x5EFA;&#x5217;&#x8868;&#x9879;&#xFF0C;&#x7136;&#x540E;&#x5462;&#xFF0C;&#x5C06;&#x5176;&#x6E05;&#x7A7A;&#x8FD8;&#x662F;&#x600E;&#x6837;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x7A81;&#x7136;&#x89C9;&#x5F97;&#xFF0C;&#x6211;&#x70B9;&#x51FB;&#x5B8C;&#x53D1;&#x8868;&#xFF0C;&#x90A3;&#x8F93;&#x5165;&#x6846;&#x4E0D;&#x5C31;&#x7B97;&#x662F;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x4E86;&#x5417;&#xFF1F;&#x90A3;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x548C;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x4E8B;&#x4EF6;&#xFF0C;&#x5230;&#x5E95;&#x54EA;&#x4E2A;&#x8BF4;&#x4E86;&#x7B97;&#x554A;&#xFF1F;&#x5B83;&#x662F;&#x4E0D;&#x662F;&#x4F1A;&#x81EA;&#x52A8;&#x7684;&#x56DE;&#x5230;&#x201D;&#x8BF4;&#x70B9;&#x4EC0;&#x4E48;&#x5427;&#x201D;&#x5462;&#xFF1F;&#x80FD;&#x4E0D;&#x80FD;&#x5462;&#xFF0C;&#x4F60;&#x53BB;&#x8BD5;&#x8BD5;&#x5427;&#xFF01;~</p>
<p>&#x5230;&#x6B64;&#xFF0C;&#x5173;&#x4E8E;&#x8F93;&#x5165;&#x6846;&#x7684;&#x4E1C;&#x897F;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x6CA1;&#x5B8C;&#xFF0C;&#x53EF;&#x80FD;~&#x989D;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F97;&#x4E4B;&#x524D;&#x8BF4;&#x7684;&#x90A3;&#x4E2A;&#x201D;&#x5373;&#x53EF;&#x201C;&#x4E48;&#xFF0C;&#x522B;&#x6253;&#x6211;&#x54C8;&#xFF01;</p>
<h2 id="&#x4E8C;&#x3001;&#x5217;&#x8868;"><a href="#&#x4E8C;&#x3001;&#x5217;&#x8868;" class="headerlink" title="&#x4E8C;&#x3001;&#x5217;&#x8868;"></a>&#x4E8C;&#x3001;&#x5217;&#x8868;</h2><p><img src="/2014/08/30/need-practice/3.png" alt=""></p>
<p>&#x4E3A;&#x4E86;&#x4E0D;&#x66B4;&#x9732;&#x4ED6;&#x4EBA;&#x9690;&#x79C1;&#xFF0C;&#x6211;&#x5C31;&#x62FF;&#x6211;&#x548C;&#x97EC;&#x54E5;&#x7684;&#x4E00;&#x6BB5;&#x6765;&#x7ED9;&#x5927;&#x5BB6;&#x770B;&#x770B;&#x5427;&#xFF0C;&#x4ED6;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x4ECB;&#x610F;~&#x5148;&#x8BF4;&#x660E;&#x6211;&#x4EEC;&#x505A;&#x7684;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x968F;&#x4F60;&#x505A;&#x6210;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x4F46;&#x9053;&#x7406;&#x90FD;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#x3001;&#x9996;&#x5148;&#xFF0C;&#x5217;&#x8868;&#x9879;&#x5927;&#x5BB6;&#x90FD;&#x61C2;&#x5BF9;&#x5427;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x5F62;&#x5F0F;&#x4E00;&#x6837;&#xFF0C;&#x529F;&#x80FD;&#x4E00;&#x6837;&#xFF0C;&#x957F;&#x5F97;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x65E2;&#x7136;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x60F3;&#x5230;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x53EF;&#x4EE5;&#x5BF9;&#x5176;&#x4E2D;&#x7684;&#x6837;&#x5F0F;&#x90FD;&#x7528;&#x201D;&#x7C7B;&#x201C;&#x5B9A;&#x4E49;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x201D;&#x514B;&#x9686;&#x201C;&#xFF0C;&#x800C;&#x4E14;&#x5982;&#x679C;&#x4F60;&#x7528;&#x514B;&#x9686;&#xFF08;clone&#xFF09;&#xFF0C;&#x91CC;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x53D6;&#x201D;true&#x201C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x7B80;&#x76F4;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x6389;&#x8FDB;&#x4E0B;&#x9762;&#x6211;&#x8981;&#x8BF4;&#x7684;&#x4E00;&#x4E2A;&#x5927;&#x5751;&#x91CC;&#x4E86;&#xFF0C;&#x6211;&#x8BF4;&#x7684;&#x662F;&#x53EF;&#x80FD;&#xFF0C;&#x6211;&#x7684;&#x9879;&#x76EE;&#x91CC;&#x5E76;&#x6CA1;&#x6709;&#x7528;&#xFF0C;&#x81F3;&#x4E8E;&#x539F;&#x56E0;&#x6211;&#x8BB0;&#x4E0D;&#x8D77;&#x4E86;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x8BD5;&#x8BD5;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x6B65;&#x3001;&#x6BCF;&#x6761;&#x8BC4;&#x8BBA;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x64CD;&#x4F5C;&#x7684;&#x662F;&#x5427;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x53D1;&#x8868;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x522B;&#x4EBA;&#x662F;&#x53EF;&#x4EE5;&#x56DE;&#x590D;&#x7684;&#xFF0C;&#x5982;&#x679C;&#xFF0C;&#x8BF8;&#x5982;&#xFF1A;&#x56DE;&#x590D;&#x3001;&#x5220;&#x9664;&#x7B49;&#x7B49;&#x4E0D;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x79FB;&#x5165;&#x54EA;&#x6761;&#x8BC4;&#x8BBA;&#x533A;&#xFF0C;&#x90A3;&#x6761;&#x8BC4;&#x8BBA;&#x7684;&#x64CD;&#x4F5C;&#x624D;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF0C;&#x79FB;&#x51FA;&#x5C31;&#x6D88;&#x5931;&#x6389;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x4E0D;&#x96BE;&#xFF0C;&#x52A0;&#x4E0A;&#x79FB;&#x5165;&#x79FB;&#x51FA;&#x4E8B;&#x4EF6;&#x3002;<br>&#x70B9;&#x5230;&#x3002;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x6B65;&#x3001;&#x600E;&#x4E48;&#x56DE;&#x590D;&#x5462;&#xFF0C;&#x9700;&#x8981;&#x8F93;&#x5165;&#x6846;&#xFF0C;&#x2026;&#x2026;.&#x53C8;&#x662F;&#x8F93;&#x5165;&#x6846;&#xFF0C;&#x6CA1;&#x9519;&#xFF0C;&#x8FD9;&#x4E2A;&#x5012;&#x9709;&#x86CB;&#x53C8;&#x88AB;&#x6211;&#x4EEC;&#x78B0;&#x5230;&#x4E86;,&#x8F93;&#x5165;&#x6587;&#x5B57;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5904;&#x7406;&#x597D;&#x8FD9;&#x6837;&#x51E0;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#xFF0C;&#x90A3;&#x5982;&#x679C;&#x6211;&#x8981;&#x56DE;&#x590D;&#x7684;&#x8F93;&#x5165;&#x6846;&#x4E00;&#x5F00;&#x59CB;&#x4E0D;&#x663E;&#x793A;&#xFF0C;&#x70B9;&#x51FB;&#x56DE;&#x590D;&#x624D;&#x663E;&#x793A;&#xFF0C;&#x518D;&#x70B9;&#x51FB;&#x5C31;&#x53C8;&#x4E0D;&#x663E;&#x793A;&#x4E86;&#x5462;&#xFF1F;&#x597D;&#x529E;&#xFF0C;&#x52A0;&#x4E2A;&#x4EA4;&#x66FF;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x6709;&#x5751;&#xFF0C;&#x4E0B;&#x9762;&#x8BB2;&#x3002;&#x90A3;&#xFF0C;&#x8F93;&#x5165;&#x6846;&#x662F;&#x8BA9;&#x5B83;&#x76F4;&#x63A5;&#x663E;&#x793A;&#x9690;&#x85CF;&#x5462;&#xFF0C;&#x8FD8;&#x662F;&#x6DE1;&#x5165;&#x6DE1;&#x51FA;&#x5462;&#xFF0C;&#x8FD8;&#x662F;&#x5C55;&#x5F00;&#x6536;&#x8D77;&#x5462;&#xFF1F;&#x597D;&#x591A;&#x65B9;&#x6CD5;&#x554A;&#xFF0C;&#x90A3;&#x4E2A;&#x9AD8;&#x5174;&#xFF0C;&#x53EF;&#x4E5F;&#xFF0C;&#x90A3;&#x4E2A;&#x7EA0;&#x7ED3;&#xFF0C;&#x563F;&#x563F;&#xFF0C;&#x968F;&#x4F60;&#x559C;&#x6B22;&#x54EA;&#x79CD;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x6237;&#x559C;&#x6B22;&#x54EA;&#x79CD;&#xFF01;~</p>
<p>&#x7B2C;&#x56DB;&#x6B65;&#xFF0C;&#x8865;&#x4E0A;&#x7B2C;&#x4E09;&#x6B65;&#x91CC;&#x9762;&#x8BE5;&#x8BF4;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x653E;&#x5728;&#x7B2C;&#x56DB;&#x6B65;&#x8BF4;&#x662F;&#x56E0;&#x4E3A;&#x70B9;&#x592A;&#x5C0F;&#x4E86;~&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x8F93;&#x5165;&#x6846;&#x5728;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x6536;&#x8D77;&#xFF0C;&#x4EA4;&#x66FF;&#x70B9;&#x51FB;&#x65F6;&#xFF0C;&#x53D6;&#x6D88;&#x56DE;&#x590D;&#x65F6;&#xFF0C;&#x53D1;&#x8868;&#x56DE;&#x590D;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6F0F;&#x4E86;&#xFF0C;&#x4F60;&#x81EA;&#x5DF1;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x90A3;&#x4E48;&#x522B;&#x626D;&#xFF0C;&#x5F53;&#x7136;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7B2C;&#x56DB;&#x6B65;&#x8981;&#x8BB2;&#x7684;&#x91CD;&#x70B9;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x56DE;&#x590D;&#x7684;&#x6846;&#x4E5F;&#x662F;&#x8981;&#x6709;&#x9884;&#x586B;&#x6587;&#x5B57;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x201D;&#x56DE;&#x590D;@XX&#x201C;&#xFF0C;&#x5148;&#x8BF4;&#x70B9;&#x51FB;&#x56DE;&#x590D;&#xFF0C;&#x70B9;&#x51FB;&#x56DE;&#x590D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C55;&#x5F00;&#xFF0C;&#x91CC;&#x9762;&#x6709;&#x6587;&#x5B57;&#xFF0C;&#x8F93;&#x5165;&#x6846;&#x83B7;&#x53D6;&#x548C;&#x5931;&#x53BB;&#x7126;&#x70B9;&#x8DDF;&#x8BC4;&#x8BBA;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8BF4;&#x3002;&#x70B9;&#x51FB;&#x53D6;&#x6D88;&#xFF0C;&#x5219;&#x6E05;&#x7A7A;&#x8F93;&#x5165;&#x6846;&#x5E76;&#x6536;&#x8D77;&#xFF0C;&#x5176;&#x4ED6;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x3002;&#x70B9;&#x51FB;&#x53D1;&#x8868;&#xFF0C;&#x90A3;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x76F8;&#x5F53;&#x4E8E;&#x6211;&#x4EEC;&#x53C8;&#x5728;&#x91CD;&#x590D;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x65F6;&#x5019;&#x7684;&#x90A3;&#x4E00;&#x5957;&#x5462;&#xFF1F;&#x6211;&#x77E5;&#x9053;&#x4F60;&#x4E0D;&#x60F3;&#x56DE;&#x5230;&#x90A3;&#x6761;&#x8DEF;~&#x4F46;&#x5C31;&#x662F;&#x90A3;&#x6837;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5224;&#x65AD;&#xFF0C;&#x63D2;&#x5165;&#x7B49;&#x7B49;&#x7B49;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x5728;&#x5217;&#x8868;&#x4E3A;&#x4E8C;&#x7EA7;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8BC4;&#x8BBA;&#x548C;&#x56DE;&#x590D;&#x90FD;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x5FC5;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5217;&#x8868;&#xFF0C;&#x4F60;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x56DE;&#x590D;&#x7684;&#xFF0C;so&#x4E0D;&#x9700;&#x8981;&#x5224;&#x65AD;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x8981;&#x628A;&#x6846;&#x5185;&#x6587;&#x5B57;&#x8D4B;&#x7ED9;&#x65B0;&#x5EFA;&#x7684;&#x5217;&#x8868;&#x9879;&#xFF0C;&#x7136;&#x540E;&#x6E05;&#x7A7A;&#x5B83;&#xFF0C;&#x6536;&#x8D77;&#x8F93;&#x5165;&#x6846;&#xFF01;~</p>
<p>&#x7B2C;&#x4E94;&#x6B65;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6709;&#x7B2C;&#x4E94;&#x6B65;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x5927;&#x529F;&#x544A;&#x6210;&#x4E86;&#x4E48;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x5BF9;&#x8BC4;&#x8BBA;&#x53D1;&#x8868;&#x56DE;&#x590D;&#xFF0C;&#x7834;&#x8D39;&#x79D1;&#x7279;&#x5440;&#xFF01;~&#x54E5;&#x4EEC;&#x513F;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x56DE;&#x590D;&#x662F;&#x600E;&#x4E48;&#x6765;&#x7684;&#x4E48;&#xFF0C;&#x662F;&#x65B0;&#x5EFA;&#x6765;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x65E2;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x8981;&#x544A;&#x8BC9;&#x4F60;&#x4E00;&#x4EF6;&#x4E0D;&#x5E78;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x4F60;&#x6240;&#x52A0;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x5728;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x7684;&#x65B0;&#x5143;&#x7D20;&#x91CC;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x6CA1;&#x4E86;&#xFF0C;&#x8FD9;&#x53EF;&#x600E;&#x4E48;&#x529E;&#x5450;&#xFF01;&#x8981;&#x547D;&#x554A;&#xFF01;~&#x522B;&#x6025;&#xFF0C;&#x8FD8;&#x6709;&#x4E2A;&#x4E1C;&#x897F;&#x53EB;&#x2014;&#x2014;&#x201D;&#x4E8B;&#x4EF6;&#x4EE3;&#x7406;&#x201C;&#xFF0C;&#x4EE3;&#x7406;&#x53EF;&#x7528;&#x65B9;&#x6CD5;&#x79CD;&#x79CD;&#xFF0C;<br>&#x70B9;&#x5230;&#x3002;&#x3002;~</p>
<p>&#x7B2C;&#x516D;&#x6B65;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x4F60;&#x6CA1;&#x770B;&#x9519;&#xFF0C;&#x8FD8;&#x6709;&#x7B2C;&#x516D;&#x6B65;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x5E73;&#x65F6;&#x81EA;&#x5DF1;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x51FA;&#x73B0;&#x8FC7;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x6846;&#x540C;&#x65F6;&#x6253;&#x5F00;&#x4F7F;&#x7528;&#x7684;&#x60C5;&#x51B5;&#xFF1F;&#x5BF9;&#x7684;&#xFF0C;&#x5F53;&#x6709;&#x591A;&#x4E2A;&#x5217;&#x8868;&#x9879;&#xFF0C;&#x4F60;&#x64CD;&#x4F5C;&#x4E86;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6846;&#x5E76;&#x8F93;&#x5165;&#x4E86;&#x6587;&#x5B57;&#xFF0C;&#x6CA1;&#x53D1;&#x8868;&#x4E4B;&#x524D;&#xFF0C;&#x53C8;&#x53BB;&#x64CD;&#x4F5C;&#x522B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x6253;&#x5F00;&#x53E6;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6846;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x6709;&#x63D0;&#x793A;&#x4F60;&#x2014;&#x2014;&#x201D;&#x662F;&#x5426;&#x653E;&#x5F03;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x7F16;&#x8F91;&#x7684;&#x6587;&#x5B57;&#x201C;&#xFF0C;&#x9009;&#x62E9;&#x653E;&#x5F03;&#x6216;&#x8005;&#x4E0D;&#x653E;&#x5F03;&#xFF0C;&#x90A3;&#x53C8;&#x662F;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;jq&#x91CC;&#x63D0;&#x793A;&#x6846;&#x5927;&#x6982;&#x6709;&#x4E09;&#x7C7B;&#x2014;&#x2014;&#x76F4;&#x63A5;&#x8B66;&#x793A;&#x3001;&#x7ED9;&#x63D0;&#x793A;&#x8BED;&#x53EF;&#x786E;&#x5B9A;&#x6216;&#x53D6;&#x6D88;&#x3001;&#x4F60;&#x8981;&#x8F93;&#x5165;&#x6587;&#x5B57;&#x8FDB;&#x884C;&#x786E;&#x8BA4;&#x3002;&#x8FD9;&#x91CC;&#x5F53;&#x7136;&#x662F;&#x7B2C;&#x4E8C;&#x79CD;&#xFF0C;&#x5982;&#x679C;&#x786E;&#x5B9A;&#xFF0C;&#x5219;&#x6E05;&#x7A7A;&#x4E4B;&#x524D;&#x8F93;&#x5165;&#x6846;&#x5E76;&#x6536;&#x8D77;&#xFF0C;&#x53D6;&#x6D88;&#x5219;&#x539F;&#x5C01;&#x4E0D;&#x52A8;&#x3002;</p>
<p>&#x8C8C;&#x4F3C;&#xFF0C;&#x529F;&#x80FD;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#x4E86;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x5F00;&#x59CB;&#x7F57;&#x5217;&#x6240;&#x7528;&#x6280;&#x672F;&#xFF0C;&#x5206;&#x7C7B;&#x7F57;&#x5217;&#xFF08;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x90E8;&#x5206;&#xFF0C;&#x5177;&#x4F53;&#x81EA;&#x884C;&#x67E5;&#x770B;&#x624B;&#x518C;&#x4E86;&#x89E3;&#xFF09;&#xFF1A;</p>
<p>&#x663E;&#x793A;&#x9690;&#x85CF;&#xFF1A;css&#xFF1A;display&#x2014;&#x2014;block/none       show()/hide(),   fadeIn()/fadeOut()   slideDown()/slideUp()<br>&#x7126;&#x70B9;&#xFF1A;focus()/blur()<br>&#x83B7;&#x53D6;(&#x4EE3;&#x7801;/&#x6587;&#x672C;)&#xFF1A;html() / text()<br>&#x65B0;&#x5EFA;&#xFF1A;$(&#x201C;&#x4EE3;&#x7801;&#x201D;)<br>&#x63D2;&#x5165;&#xFF1A;append()/appendTo()    insertBefore()/insertAfter()<br>&#x79FB;&#x5165;&#x79FB;&#x51FA;&#xFF1A;mouseenter()/mouseleave()  &#x53EF;&#x7528;hover(fn(),fn())&#x66FF;&#x4EE3;<br>&#x4EA4;&#x66FF;&#x70B9;&#x51FB;&#xFF1A;toggle(fn(),fn());<br>&#x514B;&#x9686;&#xFF1A;clone();<br>&#x4E8B;&#x4EF6;&#x4EE3;&#x7406;&#xFF1A;live()   delegate()   on()<br>&#x540C;&#x8F88;&#x5143;&#x7D20;&#x9009;&#x62E9;&#xFF1A;sibling()<br>&#x63D0;&#x793A;&#x6846;&#xFF1A;alert()  confirm()   prompt()<br>&#x5F53;&#x524D;&#x9879;&#x9009;&#x62E9;&#xFF1A;$(this)<br>&#x7B5B;&#x9009;&#xFF1A;next()/nextAll()    prev()/prevAll   parent()/parents()/parentsUntil()  closest()   children()<br>&#x5224;&#x65AD;&#x662F;&#x5426;&#xFF1A;is()<br>&#x4EE5;&#x4E0A;&#x7B80;&#x8981;&#x5217;&#x51FA;&#xFF0C;&#x4F9B;&#x5927;&#x5BB6;&#x53C2;&#x8003;&#x800C;&#x5DF2;&#xFF0C;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x591A;&#x79CD;&#xFF0C;&#x7528;&#x6CD5;&#x4E5F;&#x5404;&#x5F02;&#x3002;</p>
<h2 id="&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x2014;&#x2014;&#x7FA4;&#x5751;&#x835F;&#x8403;&#xFF1A;"><a href="#&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x2014;&#x2014;&#x7FA4;&#x5751;&#x835F;&#x8403;&#xFF1A;" class="headerlink" title="&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x2014;&#x2014;&#x7FA4;&#x5751;&#x835F;&#x8403;&#xFF1A;"></a>&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x2014;&#x2014;&#x7FA4;&#x5751;&#x835F;&#x8403;&#xFF1A;</h2><p>&#x4E00;&#x3001;&#x5343;&#x4E07;&#xFF0C;&#x5343;&#x4E07;&#xFF0C;&#x5343;&#x4E07;&#xFF08;&#x6211;&#x8981;&#x6709;&#x8FD9;&#x4E48;&#x591A;&#x94B1;&#x5C31;&#x597D;&#x4E86;~&#xFF09;&#xFF0C;&#x5343;&#x4E07;&#x522B;&#x628A;&#x53D8;&#x91CF;&#x7ED9;&#x5F04;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#xFF01;&#xFF08;&#x9664;&#x975E;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x4F60;&#x5C31;&#x662F;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x540D;&#x5B57;&#xFF09;&#x7F16;&#x7A0B;&#x91CC;&#x9762;&#x6709;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x7279;&#x522B;&#x6709;&#x7528;&#x7684;&#x4E1C;&#x4E1C;&#x53EB;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C31;&#x662F;&#x4E2A;&#x65E0;&#x9650;&#x5927;&#x7684;&#x76D2;&#x5B50;&#xFF0C;&#x60F3;&#x5F80;&#x91CC;&#x88C5;&#x4EC0;&#x4E48;&#x5C31;&#x88C5;&#x4EC0;&#x4E48;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x505A;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x603B;&#x662F;&#x4E60;&#x60EF;&#x4E8E;&#x8BF8;&#x5982; alert(&#x201C;&#x53D8;&#x91CF;&#x201D;);&#x8FD9;&#x4E48;happy&#x7684;&#x5199;&#x6CD5;&#xFF0C;&#x90A3;&#x4F60;&#x4F1A;&#x5F88;&#x4E0D;happy~</p>
<p>&#x4E8C;&#x3001;&#x63A5;&#x7740;&#x4E0A;&#x9762;&#x4E00;&#x4E2A;&#x987A;&#x4FBF;&#x8BF4;&#x4E00;&#x4E0B;&#xFF0C;&#x5F53;&#x505A;&#x9009;&#x62E9;&#x5668;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BF8;&#x5982;&#xFF0C;&#x7C7B;&#xFF0C;id&#x8FD9;&#x4E9B;&#x8981;&#x628A;&#x201D;.&#x201C;&#x548C;&#x201D;#&#x201D;&#x52A0;&#x4E0A;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x662F;&#x8981;&#x7528;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5219;&#x4E0D;&#x8981;&#x52A0;&#x4E86;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x53C8;&#x4E0D;happy&#x4E86;</p>
<p>&#x4E09;&#x3001;&#x8FD8;&#x8BB0;&#x5F97;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8C08;&#x5230;&#x5217;&#x8868;&#x9879;&#x65F6;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x7684;&#x201D;&#x4E00;&#x6837;&#x201C;&#xFF0C;&#x800C;&#x7ED9;&#x5217;&#x8868;&#x9879;&#x91CC;&#x9762;&#x7684;&#x6240;&#x6709;&#x90FD;&#x7528;&#x201D;&#x7C7B;&#x201D;&#x6765;&#x7ED9;&#x6837;&#x5F0F;&#x5417;&#xFF1F;&#x8FD9;&#x6837;&#x5B50;&#x5F53;&#x7136;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x662F;&#x5F53;&#x6211;&#x4EEC;&#x8981;&#x7ED9;&#x5B83;&#x4EEC;&#x52A0;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x7ED9;&#x5B83;&#x4EEC;&#x89C4;&#x5B9A;&#x4F5C;&#x7528;&#x57DF;&#x4E86;&#xFF0C;&#x4E0D;&#x7136;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x5230;&#x5B83;&#x4EEC;&#x961F;&#x5F62;&#x6574;&#x9F50;&#x7684;&#x5168;&#x90FD;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x867D;&#x58EE;&#x89C2;&#x3001;&#x4F46;&#x60B2;&#x50AC;&#x5440;~&#x8FD9;&#x65F6;&#x5019;$(this)&#x5C31;&#x662F;&#x4E2A;&#x5F88;&#x597D;&#x7528;&#xFF0C;&#x4E5F;&#x5F88;&#x5FC5;&#x8981;&#x7684;&#x4E1C;&#x4E1C;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8981;&#x7ED3;&#x5408;&#x5176;&#x4ED6;&#x7684;&#x7B5B;&#x9009;&#x65B9;&#x6CD5;&#x624D;&#x80FD;&#x7CBE;&#x51C6;&#x5B9A;&#x4F4D;&#x4F5C;&#x7528;&#x5BF9;&#x8C61;&#x54E6;&#xFF01;~</p>
<p>&#x56DB;&#x3001;&#x5173;&#x4E8E;&#x4E8B;&#x4EF6;&#x4EE3;&#x7406;&#xFF0C;&#x4E0D;&#x8981;&#x88AB;&#x8FD9;&#x4E2A;&#x8BCD;&#x513F;&#x7ED9;&#x5413;&#x5230;&#xFF0C;&#x53EA;&#x9700;&#x5173;&#x6CE8;&#x5B83;&#x7684;&#x610F;&#x601D;&#x548C;&#x662F;&#x5E72;&#x561B;&#x7684;&#x5C31;&#x884C;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x5B83;&#x662F;&#x7528;&#x6765;&#x89E3;&#x51B3;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x5143;&#x7D20;&#x7684;&#x4E8B;&#x4EF6;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5B83;&#x7684;&#x539F;&#x7406;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x662F;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#xFF0C;&#x6211;&#x7B80;&#x5355;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x77E5;&#x9053;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8981;&#x52A8;&#x6001;&#x521B;&#x5EFA;&#x7684;&#x5143;&#x7D20;&#x662F;&#x5728;&#x91CC;&#x5C42;&#xFF0C;&#x8981;&#x52A0;&#x7684;&#x4E8B;&#x4EF6;&#x4E5F;&#x662F;&#x5728;&#x91CC;&#x5C42;&#xFF0C;&#x4EE3;&#x7406;&#x7684;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x4F60;&#x5148;&#x628A;&#x4E8B;&#x4EF6;&#x4EA4;&#x7ED9;&#x5916;&#x5C42;&#xFF0C;&#x7B49;&#x5230;&#x4F60;&#x64CD;&#x4F5C;&#x4E86;&#x8981;&#x52A0;&#x4E8B;&#x4EF6;&#x7684;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x4F1A;&#x7531;&#x5916;&#x5F80;&#x91CC;&#x53BB;&#x201D;&#x5BFB;&#x627E;&#x201C;&#x5339;&#x914D;&#x5143;&#x7D20;&#xFF0C;&#x627E;&#x5230;&#x5373;&#x751F;&#x6548;&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x8981;&#x544A;&#x8BC9;&#x4F60;&#x4E00;&#x767E;&#x4E2A;&#x6CE8;&#x610F;&#xFF01;&#x5982;&#x679C;&#x4E0D;&#x6CE8;&#x610F;&#xFF0C;&#x4F60;&#x5728;&#x8FD9;&#x4E2A;&#x5751;&#x91CC;&#x6302;&#x6389;&#x53EF;&#x522B;&#x627E;&#x6211;&#x2014;&#x2014;&#x4F60;&#x4EA4;&#x7ED9;&#x7684;&#x8FD9;&#x4E2A;&#x5916;&#x5C42;&#x4E0D;&#x80FD;&#x4E5F;&#x662F;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x5143;&#x7D20;&#xFF01;&#xFF01;&#xFF01;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5916;&#x5C42;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x7406;&#x89E3;&#x4E3A;&#x662F;&#x5B83;&#x7238;&#xFF0C;&#x800C;&#x662F;&#x5B83;&#x7684;&#x56FA;&#x6709;&#x7956;&#x5148;&#x5143;&#x7D20;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7238;&#xFF0C;&#x751A;&#x81F3;&#x5B83;&#x7237;&#x7237;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x65B0;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x65E0;&#x6548;&#x4E86;&#xFF01;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x8981;&#x7740;&#x91CD;&#x5F3A;&#x8C03;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x5751;&#x91CC;&#x5F85;&#x8FC7;&#x5F88;&#x4E45;&#xFF0C;&#x8BF4;&#x591A;&#x4E86;&#x90FD;&#x662F;&#x6CEA;&#xFF01;~</p>
<p>&#x4E94;&#x3001;&#x4E8B;&#x4EF6;&#x5192;&#x6CE1;&#xFF0C;&#x592A;&#x591A;&#x8BF4;&#x5B83;&#x7684;&#x8D44;&#x6599;&#x4E86;&#xFF0C;&#x6211;&#x4E0D;&#x8BE6;&#x8FF0;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x591A;&#x5C42;&#x5D4C;&#x5957;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x91CC;&#x5C42;&#x5143;&#x7D20;&#x7684;&#x4E8B;&#x4EF6;&#x5C42;&#x5C42;&#x5411;&#x5916;&#x6269;&#x6563;&#xFF0C;&#x5BFC;&#x81F4;&#x5F88;&#x591A;&#x4E8B;&#x4EF6;&#x91CD;&#x590D;&#x6267;&#x884C;&#x6216;&#x8005;&#x770B;&#x8D77;&#x6765;&#x662F;&#x65E0;&#x6548;&#x7684;&#xFF0C;&#x5177;&#x4F53;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x627E;&#x8D44;&#x6599;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#xFF0C;&#x6211;&#x5C31;&#x5077;&#x4E2A;&#x61D2;~</p>
<p>&#x516D;&#x3001;jquery&#x6709;&#x5F88;&#x591A;&#x7248;&#x672C;&#xFF0C;&#x5BF9;&#x91CC;&#x9762;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x7B5B;&#x9009;&#x65B9;&#x6CD5;&#x548C;&#x4E8B;&#x4EF6;&#x7684;&#x652F;&#x6301;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x4E86;&#x67D0;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x5B83;&#x538B;&#x6839;&#x513F;&#x5C31;&#x6CA1;&#x751F;&#x6548;&#xFF0C;&#x5728;&#x6392;&#x9664;&#x4E86;&#x5176;&#x4ED6;&#x9519;&#x8BEF;&#x4E4B;&#x540E;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x7248;&#x672C;&#x652F;&#x6301;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;toggle()&#x7684;&#x70B9;&#x51FB;,&#x5728;jquery-1.9&#x7248;&#x672C;&#x5C31;&#x4E0D;&#x540C;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x662F;&#x6709;&#x5F25;&#x8865;&#x63AA;&#x65BD;&#x7684;&#xFF0C;&#x53EF;&#x81EA;&#x884C;&#x67E5;&#x9605;&#x3002;</p>
<p>&#x672C;&#x6587;&#x6240;&#x8C08;&#x5185;&#x5BB9;&#x5C1A;&#x6D45;&#xFF0C;&#x4F46;&#x4F60;&#x5E94;&#x8BE5;&#x770B;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x8981;&#x8BF4;&#x7684;&#x4E0D;&#x4EC5;&#x662F;&#x8BC4;&#x8BBA;&#x8FD9;&#x4E2A;&#x4E1C;&#x4E1C;&#x3002;&#x66F4;&#x591A;&#x7684;&#x5728;&#x4E8E;&#x4ECE;&#x529F;&#x80FD;&#x65B9;&#x9762;&#x53BB;&#x505A;&#x4F55;&#x8003;&#x8651;&#xFF0C;&#x8DDF;&#x6240;&#x9700;&#x6280;&#x672F;&#x662F;&#x600E;&#x6837;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x7684;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x611F;&#x53D7;&#x5230;jq&#xFF0C;&#x751A;&#x81F3;js&#x662F;&#x600E;&#x4E48;&#x8FD0;&#x7528;&#x5230;&#x7F51;&#x9875;&#x5F53;&#x4E2D;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x8BE5;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#xFF0C;&#x5982;&#x4F55;&#x7406;&#x6E05;&#x5404;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x7528;&#x5408;&#x9002;&#x7684;&#x9009;&#x62E9;&#x5668;&#x548C;&#x7B5B;&#x9009;&#x65B9;&#x6CD5;&#x53BB;&#x627E;&#x5230;&#x4F5C;&#x7528;&#x5BF9;&#x8C61;&#xFF0C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6548;&#x679C;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x800C;&#x505A;&#x597D;&#x8FD9;&#x4E9B;&#x7684;&#x524D;&#x63D0;&#x662F;&#x6B63;&#x786E;&#x8BA4;&#x8BC6;&#x6982;&#x5FF5;&#x548C;&#x7528;&#x6CD5;&#xFF01;&#xFF01;</p>
<p>&#x8BE5;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x518D;&#x8BF4;&#x4E00;&#x6BB5;&#x513F;&#x5427;&#xFF0C;&#x5199;&#x7A0B;&#x5E8F;&#x5C31;&#x50CF;&#x662F;&#x5199;&#x6587;&#x7AE0;&#xFF0C;&#x90FD;&#x662F;&#x9700;&#x8981;&#x903B;&#x8F91;&#xFF0C;&#x7EC4;&#x7EC7;&#x7684;&#x597D;&#x4E86;&#xFF0C;&#x5219;&#x7ED3;&#x6784;&#x6E05;&#x6670;&#x3001;&#x884C;&#x4E91;&#x6D41;&#x6C34;&#x3001;&#x611F;&#x4EBA;&#x80BA;&#x8151;&#xFF0C;&#x800C;&#x4E14;&#x4F60;&#x4E0D;&#x4F1A;&#x53BB;&#x7BA1;&#x591A;&#x5C11;&#x5B57;&#xFF0C;&#x4E07;&#x4E08;&#x9AD8;&#x697C;&#x4E5F;&#x662F;&#x4ECE;&#x5730;&#x57FA;&#x5F00;&#x59CB;&#x4E00;&#x7816;&#x4E00;&#x74E6;&#x5806;&#x780C;&#x8D77;&#x6765;&#x7684;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E5F;&#x8981;&#x6C42;&#x5FC5;&#x8981;&#x7684;&#x7CBE;&#x7B80;&#xFF0C;&#x901A;&#x7528;&#x6027;&#x7B49;&#xFF0C;&#x6B64;&#x4E0D;&#x8BE6;&#x8FF0;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x7406;&#x89E3;&#x662F;&#xFF0C;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x548C;&#x4EBA;&#x7684;&#x601D;&#x60F3;&#x3001;&#x884C;&#x4E3A;&#x662F;&#x6302;&#x94A9;&#x7684;&#xFF0C;&#x8981;&#x6C42;&#x5F88;&#x4E25;&#x683C;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x51FA;&#x4EFB;&#x4F55;&#x7684;&#x758F;&#x6F0F;&#xFF0C;&#x4EBA;&#x7684;&#x884C;&#x4E3A;&#x5230;&#x4E86;&#x54EA;&#x91CC;&#xFF0C;&#x90A3;&#x4F60;&#x7684;&#x8003;&#x8651;&#x8303;&#x56F4;&#x5C31;&#x8981;&#x5230;&#x54EA;&#x91CC;&#xFF0C;&#x6CA1;&#x6709;&#x5230;&#x5C31;&#x51FA;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x53BB;&#x6316;&#x6398;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x91CC;&#x5C31;&#x8981;&#x56DE;&#x5F52;&#x5230;&#x672C;&#x6587;&#x7684;&#x6807;&#x9898;&#x2014;&#x2014;&#x5B9E;&#x8DF5;&#x4E3A;&#x738B;&#xFF0C;&#x5E94;&#x9700;&#x800C;&#x751F;&#xFF01;</p>
<p>&#x5570;&#x55E6;&#x4E86;&#x8FD9;&#x4E48;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x95EE;&#x9898;&#x518D;&#x6240;&#x96BE;&#x514D;&#xFF0C;&#x8FD8;&#x671B;&#x8C05;&#x89E3;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x6211;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#x4E5F;&#x6CA1;&#x80FD;&#x529B;&#x628A;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x90FD;&#x544A;&#x8BC9;&#x4F60;&#x4EEC;&#xFF0C;&#x5475;&#x5475;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x8BF4;&#x8FC7;&#x7684;&#x7ED9;&#x4F60;&#x4EEC;&#x60CA;&#x559C;&#xFF0C;&#x6CA1;&#x8BA9;&#x4F60;&#x4EEC;&#x5931;&#x671B;&#x5427;&#xFF1F;&#x6280;&#x672F;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x4EE5;&#x524D;&#x5BF9;&#x5B66;&#x4E60;&#x7684;&#x5F62;&#x5BB9;&#x4E00;&#x6837;&#xFF0C;&#x770B;&#x4F3C;&#x5185;&#x5BB9;&#x5F88;&#x591A;&#xFF0C;&#x5148;&#x628A;&#x201D;&#x539A;&#x4E66;&#x201C;&#x8BFB;&#x8584;&#xFF0C;&#x518D;&#x8BFB;&#x539A;&#xFF0C;&#x5C31;&#x80FD;&#x6709;&#x6240;&#x5C0F;&#x6210;&#x3002;&#x591A;&#x5B9E;&#x8DF5;&#xFF0C;&#x575A;&#x6301;&#xFF01;&#x8BA9;&#x6211;&#x4EEC;&#x4E00;&#x8D77;&#x52A0;&#x6CB9;&#x5427;&#xFF01;~&#x5173;&#x4E8E;&#x6B64;&#x6587;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x627E;&#x6211;&#x4EA4;&#x6D41;</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    
      

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                
                <a class="post-title-link" href="/2014/08/16/初谈怎样更好的去规划CSS/" itemprop="url">
                  初谈怎样更好的去规划CSS
                </a>
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-08-16T00:00:00+08:00" content="2014-08-16">
              2014-08-16
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        
          
            <p>&#x6211;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#x90FD;&#x8C08;&#x4E0D;&#x4E0A;&#x7684;&#x4E0D;&#x5408;&#x683C;&#x7684;&#x524D;&#x7AEF;~&#x4F46;&#x8FD8;&#x7B97;&#x662F;&#x4E2A;&#x6709;&#x70B9;&#x8FFD;&#x6C42;&#x3001;&#x4E0D;&#x65AD;&#x524D;&#x8FDB;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x6211;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x5408;&#x7406;&#x3001;&#x66F4;&#x9AD8;&#x6548;&#x3001;&#x66F4;&#x4F18;&#x7F8E;&#x3002;&#x4E3A;&#x4E86;&#x7167;&#x987E;&#x4E00;&#x4E0B;&#x57FA;&#x7840;&#x7A0D;&#x5FAE;&#x8584;&#x5F31;&#x4E00;&#x4E9B;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4F1A;&#x4ECE;&#x6D45;&#x5230;&#x6DF1;&#x7684;&#x9010;&#x6B65;&#x53BB;&#x8BF4;&#x8FD9;&#x4E2A;&#x4E8B;&#x513F;&#x3002;</p>
<p>&#x5B66;&#x4E60;&#x524D;&#x7AEF;&#x6280;&#x672F;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x8981;&#x4ECE;html&#x3001;css&#x3001;js&#x8FD9;&#x4E48;&#x4E00;&#x6761;&#x7EBF;&#x8D70;&#x8FC7;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x5148;&#x5199;&#x7684;&#x5C31;&#x662F;html&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x7ED3;&#x6784;&#x548C;&#x5185;&#x5BB9;&#xFF0C;&#x7F51;&#x9875;&#x5C31;&#x662F;&#x4E00;&#x7247;&#x7A7A;&#x767D;&#xFF0C;&#x5C31;&#x65E0;&#x4ECE;&#x8C08;&#x8D77;&#x5B83;&#x957F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF08;css&#xFF09;&#xFF0C;&#x521D;&#x5B66;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x53BB;&#x5199;&#x6574;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x800C;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x4E2A;&#x80FD;&#x5B9E;&#x73B0;&#x6548;&#x679C;&#x7684;&#x5C0F;&#x4F8B;&#x5B50;&#x53BB;&#x5199;&#xFF0C;&#x6BCF;&#x5F53;&#x8FD9;&#x4E9B;&#x5C0F;&#x4F8B;&#x5B50;&#x4E56;&#x4E56;&#x7684;&#x5448;&#x73B0;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x65B0;&#x7AE5;&#x978B;&#x90FD;&#x4F1A;&#x5174;&#x594B;&#x5F02;&#x5E38;&#x662F;&#x5427;~&#x4EC0;&#x4E48;&#x5404;&#x79CD;&#x7C97;&#x4F53;&#x7684;&#xFF0C;&#x659C;&#x4F53;&#x7684;&#xFF0C;&#x5C45;&#x4E2D;&#x7684;&#xFF0C;&#x5927;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x7684;&#xFF0C;&#x6362;&#x884C;&#x7684;&#xFF0C;&#x6C34;&#x5E73;&#x7EBF;&#xFF0C;&#x8DD1;&#x9A6C;&#x706F;&#x7684;&#xFF0C;&#x80CC;&#x666F;&#x97F3;&#x4E50;&#x7684;&#xFF0C;&#x90FD;&#x60F3;&#x53BB;&#x8BD5;&#x8BD5;&#xFF08;&#x5176;&#x5B9E;&#x90FD;&#x5DEE;&#x4E0D;&#x591A;~&#xFF09;&#xFF0C;&#x5230;&#x540E;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x4E0D;&#x597D;&#x662F;&#x5427;&#xFF0C;&#x4E0D;&#x7B26;&#x5408;&#x7ED3;&#x6784;&#x548C;&#x8868;&#x73B0;&#x5206;&#x79BB;&#x7684;&#x539F;&#x5219;&#xFF0C;</p>
<p>&#x7136;&#x540E;&#x5C31;&#x8DDF;&#x7740;&#x67D0;&#x4E9B;&#x521D;&#x7EA7;&#x6559;&#x7A0B;&#x53BB;&#x7C7B;&#x4F3C;&#x7684;&#x8FD9;&#x6837;&#x5199;</p>
<pre><code>&lt;div style=&quot;&quot;;&gt;&lt;/div&gt;
</code></pre><p>&#x8FD9;&#x79CD;&#x53EB;&#x5185;&#x8054;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x76F8;&#x5BF9;&#x6BD4;&#x8F83;&#x9065;&#x8FDC;&#xFF0C;&#x521D;&#x5B66;&#x8005;&#x773C;&#x91CC;&#x7684;&#x5B89;&#x5168;&#x533A;&#x5C31;&#x662F;<title></title>&#x548C;<body></body>,&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5934;&#x90E8;&#x663E;&#x793A;&#x6807;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x5728;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x533A;&#x586B;&#x5145;&#x3002;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x4F3C;&#x4E4E;&#x90FD;&#x4E0D;&#x6562;&#x52A8;&#xFF0C;&#x968F;&#x7740;&#x5B66;&#x4E60;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x4F1A;&#x63A5;&#x89E6;&#x5230;&#x5185;&#x5D4C;&#x5F0F;</p>
<p>&#x5C31;&#x662F;&#x628A;&#x6837;&#x5F0F;&#x8868;&#x6574;&#x4E2A;&#x7528;<style></style>&#x5305;&#x88F9;&#x8D77;&#x6765;&#x653E;&#x5728;<head></head>&#x91CC;&#xFF1A;</p>
<p>&#x8FD9;&#x91CC;&#x5C31;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x5230;&#x201C;&#x4E3A;&#x6807;&#x7B7E;&#x8BBE;&#x7F6E;&#x6837;&#x5F0F;&#x201D;&#x3001;&#x201C;&#x5B9A;&#x4E49;&#x7C7B;&#x201D;&#x3001;&#x201C;&#x5B9A;&#x4E49;ID&#x201D;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E2A;&#x540E;&#x9762;&#x8C08;&#x3002;&#x5B66;&#x5B8C;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E0D;&#x9519;&#x561B;&#xFF0C;&#x6BD4;&#x5185;&#x8054;&#x7684;&#x597D;&#xFF08;&#x4E5F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x9002;&#x5E94;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E5F;&#x90FD;&#x8FD8;&#x4E0D;&#x592A;&#x7B26;&#x5408;&#x5206;&#x79BB;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x4E00;&#x770B;&#x8FD8;&#x6709;&#x5916;&#x8054;&#x7684;&#x3002;&#x3002;&#x3002;&#x989D;&#xFF0C;&#x600E;&#x4E48;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4EBA;&#x4E00;&#x822C;&#x4F1A;&#x95EE;&#x4E2A;&#x201C;&#x4E3A;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x597D;&#x5904;&#x662F;&#x5565;&#x554A;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x5916;&#x8054;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x4F60;&#x7528;&#x5728;&#x7F51;&#x9875;&#x91CC;&#x7684;&#x65F6;&#x5019;&#x7528;&#x4E0A;&#x8FD9;&#x4E48;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;</p>
<pre><code>&lt;link type=&quot;text/css&quot; rel=&quot;stylesheet&quot; href=&quot;css&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&quot;/&gt;
</code></pre><p>&#x76F8;&#x540C;&#x7684;&#x6837;&#x5F0F;&#x8868;&#x53EA;&#x8981;&#x5199;&#x4E00;&#x6B21;&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x5F53;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E0D;&#x8BBA;&#x5728;&#x7B80;&#x5355;&#x8FD8;&#x662F;&#x590D;&#x6742;&#x7684;&#x7F51;&#x7AD9;&#x4E2D;&#x597D;&#x5904;&#x90FD;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x4E5F;&#x5B9E;&#x73B0;&#x4E86;&#x7ED3;&#x6784;&#x548C;&#x8868;&#x73B0;&#x7684;&#x5B8C;&#x5168;&#x5206;&#x79BB;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E48;&#x4E00;&#x6765;&#x5C31;&#x8981;&#x6CE8;&#x610F;&#x5230;&#x7C7B;&#x6216;&#x8005;id&#x7684;&#x547D;&#x540D;&#x548C;&#x907F;&#x514D;&#x5C42;&#x53E0;&#x8986;&#x76D6;&#x7B49;&#x7B49;&#xFF0C;&#x540E;&#x9762;&#x8BB2;&#x3002;&#x65E2;&#x7136;&#x6709;&#x8FD9;&#x4E48;&#x597D;&#x7684;&#xFF0C;&#x8FD9;&#x4E0B;&#x603B;&#x53EF;&#x4EE5;&#x4E86;&#x5427;&#xFF0C;&#x5F53;&#x65F6;&#x6211;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x60F3;&#x7684;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#xFF0C;&#x4F60;&#x61C2;&#x7684;&#xFF0C;&#x4EBA;&#x603B;&#x662F;&#x8981;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x65E0;&#x77E5;&#x4ED8;&#x51FA;&#x4EE3;&#x4EF7;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x5728;&#x6837;&#x5F0F;&#x8868;&#x4E2D;&#x5F15;&#x5165;&#x5916;&#x90E8;&#x6837;&#x5F0F;&#x6587;&#x4EF6;@import&#xFF0C;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x5982;&#xFF1A;</p>
<pre><code>&lt;style&gt;@import url(&apos;a.css&apos;);&lt;/style&gt;
</code></pre><p>&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5F15;&#x5165;&#x6837;&#x5F0F;&#x8868;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x8DDF;link&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E13;&#x4E3A;css&#x800C;&#x751F;&#xFF0C;link&#x5374;&#x80FD;&#x505A;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#xFF0C;&#x968F;&#x4FBF;&#x8BF7;&#x4E00;&#x4E2A;&#x9AD8;&#x624B;&#x90FD;&#x80FD;&#x8BF4;&#x51FA;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E9B;&#x4E0D;&#x5229;&#xFF0C;&#x6BD4;&#x5982;&#x5FC5;&#x987B;&#x5199;&#x5728;&#x6240;&#x6709;&#x6837;&#x5F0F;&#x4E0A;&#x9762;&#xFF0C;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x6162;&#xFF0C;js&#x7684;dom&#x64CD;&#x4F5C;&#x4E0D;&#x4E86;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x603B;&#x4E4B;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x4E0D;&#x591A;&#xFF0C;&#x5728;&#x6B64;&#x5148;&#x4E0D;&#x8BE6;&#x8FF0;&#x3002;</p>
<p>&#x987A;&#x5E26;&#x8BF4;&#x4E00;&#x4E0B;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4E8B;&#x513F;&#x5427;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5B9A;&#x4E49;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x5B83;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#x6837;&#x5F0F;&#x4F18;&#x5148;&#x7279;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x8DDD;&#x79BB;&#x6700;&#x8FD1;&#x7684;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5185;&#x5D4C;&#x5927;&#x4E8E;&#x5916;&#x8054;&#xFF0C;&#x5185;&#x8054;&#x5927;&#x4E8E;&#x5916;&#x5D4C;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x53EA;&#x662F;&#x4EE5;&#x7A0B;&#x5E8F;&#x4F5C;&#x8005;&#x6240;&#x5199;&#x6837;&#x5F0F;&#x8303;&#x56F4;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8BBE;&#x7F6E;&#x548C;&#x4EE3;&#x7406;&#x3001;&#x9ED8;&#x8BA4;&#x6837;&#x5F0F;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#x3002;&#x7279;&#x6B8A;&#x6027;&#x5219;&#x53E6;&#x5F53;&#x522B;&#x8BBA;&#xFF0C;&#x600E;&#x6837;&#x53BB;&#x589E;&#x52A0;&#x7279;&#x6B8A;&#x6027;&#x5462;&#xFF0C;&#x6BD4;&#x5982;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x662F;&#x6307;&#x5B9A;&#x4E86;&#x8FD9;&#x4E2A;&#x6807;&#x7B7E;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#x540C;&#x7C7B;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x4F60;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x4E86;&#x201C;&#x7C7B;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x89C4;&#x5219;&#x5C31;&#x53EA;&#x5BF9;&#x8FD9;&#x4E00;&#x4E2A;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x5B9A;&#x4E49;&#x201C;id&#x201D;&#x540C;&#x6837;&#xFF0C;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x540C;&#x6837;&#x540D;&#x79F0;&#x7684;&#x201C;id&#x201D;&#x53EA;&#x80FD;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#xFF0C;&#x7C7B;&#x53EF;&#x4EE5;&#x591A;&#x5904;&#x51FA;&#x73B0;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x5355;&#x4E00;&#x5B9A;&#x4E49;&#xFF0C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4E5F;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5B9A;&#x4E49;&#x7C7B;&#x548C;&#x201C;id&#x201D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x6807;&#x7B7E;&#x4E5F;&#x597D;&#xFF0C;&#x7C7B;&#x4E5F;&#x597D;&#xFF0C;&#x201C;id&#x201D;&#x4E5F;&#x597D;&#xFF0C;&#x90FD;&#x662F;&#x6211;&#x4EEC;&#x5BF9;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x9644;&#x52A0;&#x6837;&#x5F0F;&#x80FD;&#x7528;&#x5230;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x7279;&#x70B9;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x540C;&#x4E5F;&#x662F;&#x4E3A;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x6837;&#x5F0F;&#x63D0;&#x4F9B;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x4E00;&#x5C42;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x80FD;&#x8FD0;&#x7528;&#x5305;&#x542B;&#x5173;&#x7CFB;&#x53BB;&#x591A;&#x5C42;&#x8BBE;&#x7F6E;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5728;&#x5B9A;&#x4E49;&#x4E86;&#x6807;&#x7B7E;&#x548C;&#x7C7B;&#x4E4B;&#x540E;&#x53BB;&#x589E;&#x52A0;&#x7279;&#x6B8A;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BD5;&#x7ADF;&#x8303;&#x56F4;&#x8D8A;&#x5C0F;&#x8D8A;&#x6709;&#x9488;&#x5BF9;&#x6027;&#xFF0C;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x5408;&#x7406;&#x4E14;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#x3002;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x4F2A;&#x7C7B;&#xFF0C;&#x5B50;&#x8282;&#x70B9;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5144;&#x5F1F;&#x8282;&#x70B9;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5C5E;&#x6027;&#x9009;&#x62E9;&#x5668;&#xFF0C;css3&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x4E30;&#x5BCC;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x90FD;&#x8FD8;&#x6CA1;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x9EBB;&#x70E6;&#xFF0C;&#x4F60;&#x8981;&#x660E;&#x767D;&#x4E00;&#x70B9;&#xFF0C;&#x5B9A;&#x90A3;&#x4E9B;&#x6807;&#x51C6;&#x7684;&#x4EBA;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x4E0D;&#x662F;&#x50BB;&#x5B50;&#xFF0C;&#x53BB;&#x627E;&#x9EBB;&#x70E6;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7279;&#x6B8A;&#x7684;&#x9009;&#x62E9;&#x5668;&#x53EA;&#x4F1A;&#x7ED9;&#x4F60;&#x5E26;&#x53BB;&#x4FBF;&#x5229;&#x3002;&#x53EA;&#x6709;&#x628A;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5229;&#x7528;&#x597D;&#x5404;&#x81EA;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5DE7;&#x5999;&#x7684;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x4F60;&#x624D;&#x80FD;&#x5199;&#x51FA;&#x66F4;&#x7CBE;&#x7B80;&#xFF0C;&#x9AD8;&#x6548;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x5230;&#x5904;&#x7684;&#x5B9A;&#x4E49;&#x7C7B;&#xFF0C;&#x6216;&#x8005;&#x591A;&#x5C42;&#x5D4C;&#x5957;&#x7684;&#x53BB;&#x5B9A;&#x4E49;&#x540E;&#x4EE3;&#x6837;&#x5F0F;&#x3002;&#x6709;&#x4E9B;&#x4E66;&#x7C4D;&#x4F1A;&#x53BB;&#x6839;&#x636E;&#x6807;&#x7B7E;&#xFF0C;id&#xFF0C;&#x7C7B;&#x8FD9;&#x4E9B;&#x53BB;&#x89E3;&#x91CA;&#x6743;&#x91CD;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E14;&#x6559;&#x4F60;&#x600E;&#x4E48;&#x8BA1;&#x7B97;&#x6743;&#x91CD;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x7ED5;&#x6765;&#x7ED5;&#x53BB;&#x4E5F;&#x7ED5;&#x4E0D;&#x660E;&#x767D;&#xFF0C;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x4E5F;&#x4E0D;&#x7528;&#x53BB;&#x6B7B;&#x8BB0;&#xFF0C;&#x53BB;&#x8BA1;&#x7B97;&#xFF0C;&#x591A;&#x5B9E;&#x8DF5;&#xFF0C;&#x6709;&#x4E86;&#x7ECF;&#x9A8C;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x6240;&#x7406;&#x89E3;&#x7684;&#x548C;&#x638C;&#x63E1;&#x7684;&#x5176;&#x5B9E;&#x548C;&#x6309;&#x7167;&#x6743;&#x91CD;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x53EA;&#x662F;&#x51FA;&#x4E8E;&#x5355;&#x7EAF;&#x7684;css&#x65B9;&#x6CD5;&#x65B9;&#x9762;&#x8003;&#x8651;&#xFF0C;&#x5177;&#x4F53;&#x5230;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x6765;&#x8BF4;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x53BB;&#x89C4;&#x5212;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x8003;&#x8651;&#x4E0B;&#x9762;&#x51E0;&#x70B9;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x662F;&#x9700;&#x8981;&#x4F60;&#x4ED4;&#x7EC6;&#x7684;&#x5BF9;&#x8BBE;&#x8BA1;&#x7A3F;&#x548C;&#x8981;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;&#x4EE5;&#x53CA;&#x4EA4;&#x4E92;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x51ED;&#x7A7A;&#x8003;&#x8651;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;"><a href="#&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;" class="headerlink" title="&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;"></a>&#x4E00;&#x3001;&#x5168;&#x5C40;&#x7684;&#x5B9A;&#x4E49;&#x3001;&#x7EE7;&#x627F;</h2><p>&#x8FD9;&#x662F;&#x4F18;&#x5316;css&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x6B65;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x4F60;&#x7701;&#x53BB;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x4F60;&#x53BB;&#x4ED4;&#x7EC6;&#x7684;&#x770B;&#xFF0C;&#x54EA;&#x4E9B;&#x5730;&#x65B9;&#x5177;&#x6709;&#x5171;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x5171;&#x6027;&#x7684;&#x8303;&#x56F4;&#x662F;&#x591A;&#x5927;&#xFF0C;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x5B9A;&#x4E49;&#xFF0C;&#x591A;&#x5904;&#x751F;&#x6548;&#x3002;&#x8FD8;&#x8981;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x662F;&#x53EF;&#x4EE5;&#x7EE7;&#x627F;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5B57;&#x4F53;&#x7C7B;&#x578B;&#x3001;&#x5927;&#x5C0F;&#x3001;&#x989C;&#x8272;&#xFF08;&#x6709;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x7684;&#x9664;&#x5916;&#xFF0C;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x53E6;&#x5916;&#x5B9A;&#x4E49;&#x53BB;&#x8986;&#x76D6;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x5F80;&#x5F80;&#x5DF2;&#x7ECF;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x9875;&#x9762;&#x5185;&#x8FD9;&#x7C7B;&#x7684;&#x6837;&#x5F0F;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x591A;&#x79CD;&#xFF0C;&#x9664;&#x975E;&#x8BBE;&#x8BA1;&#x5E08;&#x90A3;&#x5565;&#x4E86;~</p>
<h2 id="&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css"><a href="#&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css" class="headerlink" title="&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css"></a>&#x4E8C;&#x3001;&#x53EF;&#x91CD;&#x7528;css</h2><p>&#x4E0A;&#x9762;&#x4E24;&#x70B9;&#x63D0;&#x5230;&#x7684;&#x662F;&#x9488;&#x5BF9;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x91CC;&#x9762;&#x53EF;&#x4EE5;&#x600E;&#x6837;&#x53BB;&#x6784;&#x601D;&#x4F18;&#x5316;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x53C8;&#x591A;&#x4E9B;&#x8003;&#x8651;&#x4E86;&#xFF0C;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x91CD;&#x7528;&#x5462;&#xFF1F;&#x8FD8;&#x771F;&#x6709;&#x4E0D;&#x5C11;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5C45;&#x4E2D;&#x3001;&#x6D6E;&#x52A8;&#x3001;&#x6E05;&#x9664;&#x6D6E;&#x52A8;&#x3001;&#x6E05;&#x9664;&#x9ED8;&#x8BA4;&#x6837;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x66F4;&#x7EC6;&#x81F4;&#x4E00;&#x4E9B;&#x7684;&#x8BDD;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5230;&#x5B57;&#x4F53;&#x7C7B;&#x578B;&#xFF0C;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x5143;&#x7D20;&#x7684;&#x663E;&#x793A;&#x6216;&#x9690;&#x85CF;&#xFF0C;&#x4E00;&#x6BB5;&#x56FA;&#x5B9A;&#x9AD8;&#x5EA6;&#x7684;&#x7A7A;&#x767D;&#x7B49;&#x7B49;&#xFF0C;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x7EC6;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5728;&#x6837;&#x5F0F;&#x7684;&#x5B9A;&#x4E49;&#x91CC;&#x591A;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#x7684;&#x8BBE;&#x7F6E;&#x6216;&#x8BB8;&#x4F1A;&#x6BD4;&#x5728;&#x6807;&#x7B7E;&#x4E0A;&#x591A;&#x52A0;&#x4E00;&#x4E2A;&#x7C7B;&#x66F4;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x4E0A;&#x9762;&#x6709;&#x56DB;&#x4E94;&#x4E2A;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x7684;&#x7C7B;&#xFF0C;&#x81F3;&#x5C11;&#x6211;&#x662F;&#x53D7;&#x4E0D;&#x4E86;&#x7684;~<br>&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x8FD8;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x81F3;&#x5C11;&#x4F60;&#x4E0D;&#x7528;&#x518D;&#x6BCF;&#x6B21;&#x5199;&#x6837;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x53BB;&#x5B9A;&#x4E49;body&#x3001;&#x4E00;&#x5806;hx&#x3001;ul&#x3001;ol&#x6B64;&#x7C7B;&#x7684;&#x4E1C;&#x4E1C;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x4E8B;&#x5148;&#x5199;&#x597D;&#x7684;&#x6837;&#x5F0F;&#x8868;&#x5373;&#x53EF;&#x3002;&#x9700;&#x8981;&#x5C45;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x4F60;&#x770B;&#x60C5;&#x51B5;&#x662F;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x8FD8;&#x662F;&#x52A0;&#x4E0A;&#x4E8B;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x7C7B;&#xFF0C;&#x53EA;&#x5B9A;&#x4E49;&#x5BBD;&#x5EA6;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x7B80;&#x6D01;&#x548C;&#x7F16;&#x5199;&#x6548;&#x7387;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x54EA;&#x79CD;&#x6BD4;&#x8F83;&#x597D;&#x5C31;&#x9009;&#x54EA;&#x79CD;&#x3002;<br>&#x6211;&#x73B0;&#x5728;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x7684;&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x91CD;&#x7F6E;css&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x4E2A;&#x516C;&#x5171;css&#x6587;&#x4EF6;&#xFF0C;&#x52A0;&#x4E00;&#x4E2A;&#x7AD9;&#x70B9;css&#x6587;&#x4EF6;&#xFF0C;&#x81F3;&#x4E8E;&#x5F88;&#x591A;&#x4EBA;&#x91C7;&#x7528;&#x8FC7;&#x7684;&#x7279;&#x6B8A;&#x529F;&#x80FD;&#x6216;&#x8005;&#x7248;&#x5757;&#x513F;&#x5355;&#x72EC;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x6682;&#x65F6;&#x6CA1;&#x6709;&#x53BB;&#x91C7;&#x7528;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4E0D;&#x597D;&#xFF0C;&#x6216;&#x8BB8;&#x5F53;&#x6211;&#x89C9;&#x5F97;&#x6709;&#x5FC5;&#x8981;&#x6216;&#x8005;&#x6709;&#x597D;&#x5904;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x4F1A;&#x91C7;&#x7528;&#x3002;<br>&#x53E6;&#x5916;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x63D0;&#x9192;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x591A;&#x4F59;&#x7684;&#x63D0;&#x9192;&#xFF0C;&#x53EF;&#x91CD;&#x7528;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x5B8C;&#x5168;&#x7684;&#x7167;&#x642C;&#x8FC7;&#x6765;&#xFF0C;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9879;&#x76EE;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5220;&#x51CF;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x6539;&#xFF0C;&#x91CD;&#x7528;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4EFD;&#xFF0C;&#x7528;&#x5230;&#x9879;&#x76EE;&#x91CC;&#x7684;&#x65F6;&#x5019;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x6839;&#x636E;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x5373;&#x53EF;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;"><a href="#&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;" class="headerlink" title="&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;"></a>&#x4E09;&#x3001;&#x6A21;&#x5757;&#x5316;</h2><p>&#x521A;&#x521A;&#x5B66;&#x4F1A;&#x5199;css&#x4EBA;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x4E2A;&#x4E0D;&#x5927;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x5427;&#xFF0C;&#x600E;&#x4E48;&#x5F62;&#x5BB9;&#x5462;&#xFF0C;&#x601D;&#x7EF4;&#x50CF;&#x8131;&#x7F30;&#x7684;&#x91CE;&#x9A6C;&#xFF1F;&#x8FD8;&#x662F;&#x8352;&#x91CE;&#x6E38;&#x9B42;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x53CD;&#x6B63;&#x5C31;&#x662F;&#x60F3;&#x5230;&#x54EA;&#x513F;&#x5199;&#x5230;&#x54EA;&#x513F;&#xFF0C;&#x5199;&#x7740;&#x5199;&#x7740;&#x89C9;&#x5F97;&#x4E0D;&#x5BF9;&#x4E86;&#xFF0C;&#x518D;&#x56DE;&#x5934;&#x6539;&#xFF0C;&#x89C9;&#x5F97;&#x7F3A;&#x70B9;&#x4EC0;&#x4E48;&#x518D;&#x5F80;&#x4E0A;&#x52A0;&#xFF0C;&#x7B49;&#x7B49;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x7F3A;&#x5C11;&#x4E8B;&#x5148;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x6CA1;&#x6709;&#x5148;&#x52A8;&#x8111;&#x540E;&#x52A8;&#x624B;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#x91CC;&#x9762;&#x6709;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x53BB;&#x533A;&#x5206;&#x5B83;&#x4EEC;&#x4E0D;&#x4EC5;&#x4EC5;&#x80FD;&#x4F7F;&#x5185;&#x5BB9;&#x66F4;&#x7ED3;&#x6784;&#x5316;&#x3001;&#x5177;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x66F4;&#x662F;&#x4E3A;&#x4E86;&#x4E4B;&#x540E;&#x5B9A;&#x4E49;css&#x6216;&#x8005;&#x540E;&#x671F;&#x505A;&#x4FEE;&#x6539;&#x7684;&#x65F6;&#x5019;&#x53BB;&#x67E5;&#x627E;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x5927;&#x4FBF;&#x5229;&#xFF0C;&#x4E5F;&#x7275;&#x626F;&#x5230;&#x4E86;&#x547D;&#x540D;&#x7684;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x4E0D;&#x80FD;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x4E0D;&#x540C;&#x800C;&#x968F;&#x610F;&#x547D;&#x540D;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x65B0;&#x95FB;&#xFF0C;&#x547D;&#x540D;&#x4E2A;&#x201C;xw&#x201D;&#xFF0C;&#x4F60;&#x5F53;&#x65F6;&#x5012;&#x662F;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4F60;&#x8FD8;&#x77E5;&#x9053;&#x4E48;&#xFF0C;&#x522B;&#x4EBA;&#x770B;&#x7684;&#x65F6;&#x5019;&#x77E5;&#x9053;&#x4E48;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x5728;&#x6CA1;&#x5F62;&#x6210;&#x4E60;&#x60EF;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x5728;&#x4E1A;&#x754C;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x5E76;&#x666E;&#x904D;&#x8FD0;&#x7528;&#x4E4B;&#x524D;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x53BB;&#x7528;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;"><a href="#&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;" class="headerlink" title="&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;"></a>&#x56DB;&#x3001;&#x6548;&#x679C;&#x5B9E;&#x73B0;</h2><p>&#x6BD4;&#x5982;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x6709;&#x591A;&#x5904;&#x7684;&#x9634;&#x5F71;&#xFF0C;&#x6216;&#x8005;&#x591A;&#x5904;&#x7684;&#x906E;&#x7F69;&#x5C42;&#xFF0C;&#x5B83;&#x4EEC;&#x4EC5;&#x4EC5;&#x662F;&#x5B58;&#x5728;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5BB9;&#x91CC;&#xFF0C;&#x6548;&#x679C;&#x548C;&#x5B9A;&#x4F4D;&#x65B9;&#x5F0F;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x5927;&#x5C0F;&#x5C3A;&#x5BF8;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x9700;&#x8981;&#x987E;&#x53CA;&#x591A;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x5B9A;&#x4E49;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x5E26;&#x7740;&#x5404;&#x79CD;&#x524D;&#x7F00;&#x7684;&#x4E00;&#x5927;&#x5768;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x4F55;&#x4E0D;&#x53EA;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#x5462;&#xFF0C;&#x6211;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x6548;&#x679C;&#x7C7B;&#x201D;&#xFF0C;&#x628A;&#x5B9A;&#x4F4D;&#x65B9;&#x5F0F;&#xFF0C;&#x6548;&#x679C;&#x5B9E;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x5199;&#x597D;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x54EA;&#x91CC;&#x9700;&#x8981;&#xFF0C;&#x5C31;&#x5728;&#x90A3;&#x91CC;&#x52A0;&#x4E0A;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x53E6;&#x5916;&#x518D;&#x5229;&#x7528;&#x7279;&#x6B8A;&#x6027;&#x53BB;&#x9009;&#x62E9;&#x5B83;&#xFF0C;&#x5B9A;&#x4E49;&#x4E13;&#x6709;&#x5C3A;&#x5BF8;&#x6216;&#x8005;&#x4F4D;&#x7F6E;&#x5373;&#x53EF;&#x3002;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x4E8E;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x91CC;&#x9762;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x7136;&#x540E;&#x4F20;&#x53C2;&#xFF0C;&#x5475;&#x5475;&#x3002;&#x60F3;&#x61D2;&#x7701;&#x52B2;&#x513F;&#x5C31;&#x591A;&#x52A8;&#x52A8;&#x8111;&#x5427;&#xFF01;~</p>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x65B9;&#x9762;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x8D44;&#x6599;&#x63A8;&#x8350;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x9B3C;&#x54E5;&#x5199;&#x7684;<a href="http://blog.cssforest.org/2014/07/01/%E9%A1%B5%E9%9D%A2%E9%87%8D%E6%9E%84%E4%B8%AD%E7%9A%84%E8%AE%BE%E8%AE%A1%E6%A8%A1%E5%BC%8F.html" target="_blank" rel="external">&#x300A;&#x9875;&#x9762;&#x91CD;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x300B;</a></p>
<p>&#x4EE5;&#x4E0A;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x5728;&#x5DE5;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4F53;&#x4F1A;&#x603B;&#x7ED3;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF0C;&#x53EA;&#x6D89;&#x53CA;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#xFF0C;&#x5BF9;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x4E9B;&#x7528;&#x5904;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x522B;&#x7684;&#x5730;&#x65B9;&#x53EF;&#x80FD;&#x4E5F;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x501F;&#x9274;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x6211;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x4E4B;&#x5904;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x6211;&#x7ED3;&#x5408;&#x4E86;&#x4E00;&#x4E9B;&#x522B;&#x4EBA;&#x95EE;&#x8FC7;&#x6211;&#x7684;&#x95EE;&#x9898;&#x548C;&#x81EA;&#x5DF1;&#x9047;&#x5230;&#x8FC7;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x6559;&#x8BAD;&#x7B49;&#x628A;&#x4ECE;&#x521D;&#x63A5;&#x89E6;&#x5199;&#x7F51;&#x9875;&#x7684;&#x804C;&#x573A;&#x65B0;&#x4EBA;&#x5230;&#x5177;&#x5907;&#x4E86;&#x4E00;&#x5B9A;css&#x57FA;&#x7840;&#x7684;&#x4EBA;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8F83;&#x5B8C;&#x6574;&#x7684;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#x5427;&#xFF0C;&#x6BD4;&#x8F83;&#x6709;&#x987A;&#x5E8F;&#x548C;&#x903B;&#x8F91;&#x7684;&#x53BB;&#x770B;&#xFF0C;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x591A;&#x54E6;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#xFF0C;&#x5148;&#x5199;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;&#xFF0C;&#x4EE5;&#x540E;&#x6709;&#x65B0;&#x7684;&#x6536;&#x83B7;&#x6216;&#x8005;&#x89C9;&#x5F97;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x6709;&#x4E0D;&#x8DB3;&#x7684;&#x5730;&#x65B9;&#x6211;&#x4F1A;&#x518D;&#x5199;&#x4E00;&#x7BC7;&#x52A0;&#x4EE5;&#x4FEE;&#x6B63;&#x8865;&#x5145;&#xFF01;~</p>

          
        
      
    </div>

    <footer class="post-footer">
      

      

      
      
        <div class="post-eof"></div>
      
    </footer>
  </article>


    

  </section>

  
  <nav class="pagination">
    <a class="extend prev" rel="prev" href="/page/4/"><i class="fa fa-angle-left"></i></a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/4/">4</a><span class="page-number current">5</span><a class="page-number" href="/page/6/">6</a><a class="page-number" href="/page/7/">7</a><a class="extend next" rel="next" href="/page/6/"><i class="fa fa-angle-right"></i></a>
  </nav>



          </div>
          


          

        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      

      <section class="site-overview sidebar-panel  sidebar-panel-active ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  

  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
  

  
  

  
  


</body>
</html>
