<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="分享交流," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x4E0D;&amp;#x4E45;&amp;#x4E4B;&amp;#x524D;&amp;#xFF0C;&amp;#x6211;&amp;#x505A;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x516C;&amp;#x53F8;&amp;#x5185;&amp;#x90E8;&amp;#x7684;&amp;#x5206;&amp;#x4EAB;&amp;#xFF0C;&amp;#x4F46;&amp;#x65F6;&amp;#x95F4;&amp;#x6709;&amp;#x9650;&amp;#xFF0C;&amp;#x5F88;">
<meta property="og:type" content="article">
<meta property="og:title" content="明白了这些，你不仅仅能成长为优秀的UI工程师">
<meta property="og:url" content="http://yoursite.com/2016/11/28/ui_developer/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x4E0D;&amp;#x4E45;&amp;#x4E4B;&amp;#x524D;&amp;#xFF0C;&amp;#x6211;&amp;#x505A;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x516C;&amp;#x53F8;&amp;#x5185;&amp;#x90E8;&amp;#x7684;&amp;#x5206;&amp;#x4EAB;&amp;#xFF0C;&amp;#x4F46;&amp;#x65F6;&amp;#x95F4;&amp;#x6709;&amp;#x9650;&amp;#xFF0C;&amp;#x5F88;">
<meta property="og:updated_time" content="2016-12-18T15:20:54.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="明白了这些，你不仅仅能成长为优秀的UI工程师">
<meta name="twitter:description" content="&amp;#x4E0D;&amp;#x4E45;&amp;#x4E4B;&amp;#x524D;&amp;#xFF0C;&amp;#x6211;&amp;#x505A;&amp;#x4E86;&amp;#x4E00;&amp;#x6B21;&amp;#x516C;&amp;#x53F8;&amp;#x5185;&amp;#x90E8;&amp;#x7684;&amp;#x5206;&amp;#x4EAB;&amp;#xFF0C;&amp;#x4F46;&amp;#x65F6;&amp;#x95F4;&amp;#x6709;&amp;#x9650;&amp;#xFF0C;&amp;#x5F88;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 明白了这些，你不仅仅能成长为优秀的UI工程师 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                明白了这些，你不仅仅能成长为优秀的UI工程师
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-11-28T00:00:00+08:00" content="2016-11-28">
              2016-11-28
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/分享交流/" itemprop="url" rel="index">
                    <span itemprop="name">分享交流</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4E0D;&#x4E45;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x505A;&#x4E86;&#x4E00;&#x6B21;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x4F46;&#x65F6;&#x95F4;&#x6709;&#x9650;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x6CA1;&#x80FD;&#x5C55;&#x5F00;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7B97;&#x662F;&#x6587;&#x5B57;&#x7248;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x8FD8;&#x4F1A;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0B;&#x9762;&#x6B63;&#x6587;&#x3002;</p>
<h2 id="&#x8BDD;&#x9898;&#x7531;&#x6765;"><a href="#&#x8BDD;&#x9898;&#x7531;&#x6765;" class="headerlink" title="&#x8BDD;&#x9898;&#x7531;&#x6765;"></a>&#x8BDD;&#x9898;&#x7531;&#x6765;</h2><p>&#x9996;&#x5148;&#xFF0C;&#x6280;&#x672F;&#x662F;&#x6CA1;&#x6709;&#x754C;&#x9650;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#xFF0C;&#x5206;&#x6210;&#x4E09;&#x4E2A;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x5206;&#x6210;&#x4E94;&#x4E2A;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x4EA4;&#x4E92;&#x8BBE;&#x8BA1;&#x3001;&#x89C6;&#x89C9;&#x8BBE;&#x8BA1;&#x3001;UI&#x5F00;&#x53D1;&#x3001;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x3001;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x540C;&#x56E2;&#x961F;&#x7684;&#x6280;&#x672F;&#x5206;&#x5DE5;&#x4E0D;&#x540C;&#x3002;&#x6709;&#x591A;&#x79CD;&#x5206;&#x5DE5;&#x4F1A;&#x600E;&#x6837;&#x5462;&#xFF1F;&#x5404;&#x81EA;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x9886;&#x57DF;&#x6316;&#x5F97;&#x66F4;&#x6DF1;&#x3001;&#x505A;&#x5F97;&#x66F4;&#x7CBE;&#xFF0C;&#x4F46;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5BF9;&#x4E8E;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x672C;&#x6765;&#x4E5F;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x6216;&#x8005;&#x638C;&#x63E1;&#x7684;&#x76F8;&#x90BB;&#x9886;&#x57DF;&#x77E5;&#x4E4B;&#x751A;&#x5C11;&#xFF0C;&#x8FD9;&#x662F;&#x7CBE;&#x7EC6;&#x5206;&#x5DE5;&#x7684;&#x5F0A;&#x7AEF;&#x3002;</p>
<p>&#x518D;&#x8005;&#xFF0C;&#x6700;&#x8FD1;&#x4E24;&#x5E74;&#xFF0C;&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#x4E2D;&#x6700;&#x706B;&#x7684;&#x83AB;&#x8FC7;&#x4E8E;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#xFF0C;&#x56E0;&#x4E3A;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5927;&#x70ED;&#xFF0C;&#x56E0;&#x4E3A;&#x5404;&#x79CD;&#x5DE5;&#x5177;&#x548C;&#x6846;&#x67B6;&#x3001;&#x5E93;&#x7684;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;&#x56E0;&#x4E3A;Node.js&#x5BF9;&#x540E;&#x7AEF;&#x9886;&#x57DF;&#x7684;&#x5165;&#x4FB5;&#xFF0C;&#x4EFF;&#x4F5B;&#x4E00;&#x4E0B;&#x5B50;JavaScript&#x53D8;&#x5F97;&#x65E0;&#x6BD4;&#x7684;&#x8FF7;&#x4EBA;&#x548C;&#x5F3A;&#x5927;&#x3002;&#x4F46;&#x540C;&#x65F6;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x884C;&#x4E1A;&#x4F1A;&#x8BAE;&#x8FD8;&#x662F;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#xFF0C;&#x90FD;&#x5F88;&#x5C11;&#x770B;&#x5230;&#x6709;&#x4EBA;&#x5728;&#x8C08;&#x8BBA;CSS&#x65B9;&#x9762;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x5C11;&#x6570;&#x4EBA;&#x5728;&#x575A;&#x6301;&#x505A;&#x7684;&#xFF0C;&#x540E;&#x9762;&#x4F1A;&#x63A8;&#x8350;&#x7ED9;&#x5927;&#x5BB6;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x77E5;UI&#x5F00;&#x53D1;&#x4E3A;&#x4F55;&#x7269;&#xFF0C;&#x4EE5;&#x53CA;&#x5F88;&#x591A;&#x4EBA;&#x5BF9;CSS&#x548C;&#x9875;&#x9762;&#x5F00;&#x53D1;&#x7684;&#x8BA4;&#x8BC6;&#x6709;&#x5931;&#x59A5;&#x5F53;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x8C08;&#x7684;&#x66F4;&#x591A;&#x4E0D;&#x662F;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x662F;&#x73AF;&#x5883;&#x3001;&#x65B9;&#x5411;&#x4EE5;&#x53CA;&#x65B9;&#x6CD5;&#x8BBA;&#x3002;</p>
<p>&#x7ED3;&#x6784;&#x5927;&#x4F53;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1&#x3001;<strong>&#x8BA4;&#x8BC6;UI&#x5F00;&#x53D1;</strong></p>
<p>2&#x3001;<strong>&#x91CD;&#x65B0;&#x5F3A;&#x8C03;Web&#x6807;&#x51C6;</strong></p>
<p>3&#x3001;<strong>CSS&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x601D;&#x8003;</strong></p>
<p>4&#x3001;<strong>&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x66F4;&#x654F;&#x6377;</strong></p>
<p>5&#x3001;<strong>&#x600E;&#x6837;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;UI&#x5F00;&#x53D1;</strong></p>
<p>&#x59CB;&#x4E8E;&#x5F00;&#x53D1;&#xFF0C;&#x4F46;&#x4E0D;&#x6B62;&#x4E8E;&#x5F00;&#x53D1;&#x3002;</p>
<h2 id="&#x8BA4;&#x8BC6;UI&#x5F00;&#x53D1;"><a href="#&#x8BA4;&#x8BC6;UI&#x5F00;&#x53D1;" class="headerlink" title="&#x8BA4;&#x8BC6;UI&#x5F00;&#x53D1;"></a>&#x8BA4;&#x8BC6;UI&#x5F00;&#x53D1;</h2><p>UI&#x5F00;&#x53D1;&#xFF0C;&#x4E4B;&#x524D;&#x53EB;&#x7F51;&#x9875;&#x91CD;&#x6784;&#xFF0C;&#x73B0;&#x5728;&#x4ECD;&#x6709;&#x4E0D;&#x5C11;&#x4EBA;&#x5728;&#x8FD9;&#x4E48;&#x53EB;&#xFF0C;&#x5927;&#x5BB6;&#x770B;&#x5230;&#x4E86;&#x77E5;&#x9053;&#x662F;&#x4EC0;&#x4E48;&#x5C31;&#x597D;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x804C;&#x8D23;&#x5C31;&#x662F;&#x8FD8;&#x539F;&#x89C6;&#x89C9;&#x8BBE;&#x8BA1;&#x7A3F;&#xFF0C;&#x4F7F;&#x7528;HTML&#x548C;CSS&#x628A;&#x89C6;&#x89C9;&#x7A3F;&#x505A;&#x6210;&#x7F51;&#x9875;&#x3002;&#x5B83;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x53EF;&#x80FD;&#x8DDF;&#x4F60;&#x5370;&#x8C61;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x91CD;&#x6784;&#x76F8;&#x51B2;&#x7A81;&#xFF0C;&#x90A3;&#x4E48;&#x6765;&#x770B;&#x770B;&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x3002;</p>
<p>&#x201C;&#x9996;&#x5148;&#xFF0C;&#x817E;&#x8BAF;&#x7684;&#x8FD9;&#x4E2A;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x5C97;&#x4F4D;&#x8D77;&#x540D;&#x7684;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x5927;&#x5BB6;&#x8BF4;&#x7684;&#x56E0;&#x4E3A;&#x300A;&#x7F51;&#x7AD9;&#x91CD;&#x6784;&#x300B;&#x4E00;&#x4E66;&#x3002;&#x6700;&#x65E9;&#x662F;&#x53EB;&#x7F51;&#x7AD9;&#x7B56;&#x5212;&#x4E0E;&#x5236;&#x4F5C;&#x3002;&#x5DE5;&#x4F5C;&#x5185;&#x5BB9;&#x5305;&#x542B;&#x4EA7;&#x54C1;&#x4EA4;&#x4E92;&#x7A3F;&#xFF0C;&#x7F51;&#x9875;&#xFF08;HTML&#x548C;CSS&#xFF09;&#x672C;&#x8EAB;&#xFF0C;JavaScript&#xFF0C;flash&#x3002;&#x91CD;&#x6784;&#x7684;&#x5DE5;&#x4F5C;&#x5B9A;&#x4F4D;&#x4E5F;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x8FD8;&#x539F;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x817E;&#x8BAF;&#x91CD;&#x6784;&#x662F;&#x5728;&#x8BBE;&#x8BA1;&#x901A;&#x9053;&#x7684;&#xFF0C;&#x800C;&#x524D;&#x7AEF;&#x662F;&#x5F00;&#x53D1;&#x901A;&#x9053;&#x7684;&#x3002;&#x672F;&#x4E1A;&#x6709;&#x8F6C;&#x653B;&#xFF0C;&#x5212;&#x5206;&#x5F00;&#x4E24;&#x4E2A;&#x5C97;&#x4F4D;&#x662F;&#x4E3A;&#x4E86;&#x660E;&#x786E;&#x8FD9;&#x4E00;&#x4E13;&#x591A;&#x957F;&#x7684;&#x201C;&#x4E00;&#x4E13;&#x201D;&#x800C;&#x5DF2;&#x3002;&#x201D;</p>
<p>&#x2014;&#x2014;Twinsen Liang&#xFF08;&#x6881;&#x749F;&#x5F6A;&#xFF09;</p>
<p>&#x201C;&#x300E;&#x91CD;&#x6784;&#x300F;&#x5E76;&#x4E0D;&#x53EA;&#x662F;&#x5199;CSS&#x548C;HTML&#xFF0C;&#x800C;&#x662F;&#x89C4;&#x5212;&#x7F51;&#x9875;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x5386;&#x53F2;&#x80CC;&#x666F;&#x4E0A;&#xFF0C;&#x4ECE;&#x8868;&#x683C;&#x5E03;&#x5C40;&#x7684;&#x601D;&#x7EF4;&#x8F6C;&#x6362;&#x5230;&#x6837;&#x5F0F;&#x5E03;&#x5C40;&#x7684;&#x601D;&#x7EF4;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x63A8;&#x7FFB;&#x91CD;&#x6765;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x662F;&#x5BF9;&#x65E7;&#x6709;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x3001;&#x5206;&#x5DE5;&#x7684;&#x4E00;&#x79CD;&#x6253;&#x7834;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x8FDB;&#x5316;&#x3002;&#x662F;&#x8FDE;&#x63A5;&#x611F;&#x6027;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x7406;&#x6027;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x6865;&#x6881;&#xFF0C;&#x662F;&#x652F;&#x6301;&#x7AD9;&#x70B9;&#x66F4;&#x7F8E;&#x3001;&#x66F4;&#x53CB;&#x597D;&#x3001;&#x66F4;&#x5065;&#x58EE;&#x7684;&#x57FA;&#x77F3;&#x4E4B;&#x4E00;&#x3002;&#x201D;</p>
<p>&#x2014;&#x2014;ghostzhang&#xFF08;&#x5F20;&#x7678;&#x946B;&#xFF09;</p>
<p>&#x201C;&#x501F;&#x7528;&#x4E86;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x8457;&#x540D;&#x4E66;&#x7C4D;&#x300A;Refactoring&#x300B;&#x7684;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x300A;&#x91CD;&#x6784;&#x300B;&#x6765;&#x5F71;&#x5C04;&#x5F53;&#x65F6;&#x56FD;&#x5185;&#x7F51;&#x7AD9;&#x9700;&#x8981;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6539;&#x53D8;&#x7F51;&#x7AD9;&#x5E95;&#x5C42;&#x7684;&#x672C;&#x8D28;&#x3002;&#x73B0;&#x5728;&#x6765;&#x770B;&#xFF0C;&#x5BF9;&#x7F51;&#x7AD9;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x66F4;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8303;&#x56F4;&#x4E5F;&#x8D85;&#x8131;&#x4E86;&#x5355;&#x7EAF;&#x7684;css&#xFF0C;&#x8FD8;&#x5305;&#x62EC;javascript&#x3001;ajax&#x3001;flash&#x7B49;&#x7B49;&#x6240;&#x6709;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x548C;&#x975E;&#x6280;&#x672F;&#x7684;&#x96C6;&#x5408;&#x4F53;&#x3002;&#x201D;</p>
<p>&#x2014;&#x2014;&#x738B;&#x5B97;&#x4E49; &#x300A;&#x7F51;&#x7AD9;&#x91CD;&#x6784;&#x300B;&#x8BD1;&#x8005;&#x4E4B;&#x4E00;</p>
<p>&#x7531;&#x4EE5;&#x4E0A;&#x4E09;&#x4F4D;&#x884C;&#x4E1A;&#x524D;&#x8F88;&#x7684;&#x8BDD;&#xFF0C;&#x4E0D;&#x96BE;&#x770B;&#x51FA;UI&#x5F00;&#x53D1;&#x662F;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x4F46;&#x968F;&#x7740;&#x65F6;&#x4EE3;&#x548C;&#x6280;&#x672F;&#x7684;&#x53D8;&#x8FC1;&#xFF0C;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4E5F;&#x5728;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</p>
<p><strong>&#x8BBE;&#x5907;</strong>&#xFF1A;&#x4EE5;&#x524D;&#x4E3B;&#x8981;&#x662F;PC&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x5E03;&#x5C40;&#x5C31;&#x597D;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x505A;&#x51FA;&#x5728;PC&#x3001;&#x7B14;&#x8BB0;&#x672C;&#x3001;&#x5E73;&#x677F;&#x7535;&#x8111;&#x3001;&#x5404;&#x79CD;&#x5B89;&#x5353;/iphone&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x5C55;&#x793A;&#x7684;&#x7F51;&#x9875;&#x3002;&#x6280;&#x672F;&#x65B9;&#x6848;&#x603B;&#x662F;&#x8981;&#x4E0E;&#x65F6;&#x4FF1;&#x8FDB;&#x7684;&#xFF0C;&#x5C31;&#x51FA;&#x73B0;&#x4E86;em&#x3001;rem&#x3001;flex&#x3001;&#x767E;&#x5206;&#x6BD4;&#x3001;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#x3001;vh/vw&#x3001;calc&#x7B49;&#x7B49;&#x3002;</p>
<p><strong>&#x6D4F;&#x89C8;&#x5668;</strong>&#xFF1A;&#x8FD9;&#x662F;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x7F51;&#x9875;&#x5B58;&#x5728;&#x7684;&#x552F;&#x4E00;&#x73AF;&#x5883;&#xFF0C;&#x4EE5;&#x524D;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x9EBB;&#x70E6;&#x662F;&#x4F4E;&#x7248;&#x672C;IE&#x7684;&#x5404;&#x79CD;&#x5947;&#x602A;bug&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5174;&#x8D77;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;IE&#x7684;&#x5751;&#x91CC;&#x8DF3;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x5374;&#x53D1;&#x73B0;&#x6389;&#x5230;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x5751;&#x3002;&#x6D4F;&#x89C8;&#x5668;&#x79CD;&#x7C7B;&#x66F4;&#x591A;&#xFF0C;&#x8FD8;&#x6709;&#x5404;&#x79CD;&#x7248;&#x672C;&#x7684;&#x624B;&#x673A;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD8;&#x6709;&#x5FAE;&#x4FE1;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x505A;&#x66F4;&#x591A;&#x7684;&#x517C;&#x5BB9;&#x751A;&#x81F3;&#x5207;&#x6362;&#x65B9;&#x6848;&#x3002;</p>
<p><strong>&#x7F51;&#x7EDC;&#x73AF;&#x5883;</strong>&#xFF1A;&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5F88;&#x5728;&#x4E4E;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x6027;&#x80FD;&#xFF0C;&#x5B83;&#x76F4;&#x63A5;&#x51B3;&#x5B9A;&#x4E86;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x4ECE;UI&#x5F00;&#x53D1;&#x89D2;&#x5EA6;&#xFF0C;&#x5C31;&#x662F;&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x548C;&#x6267;&#x884C;&#xFF0C;&#x66F4;&#x5C11;&#x7684;&#x6587;&#x4EF6;&#x8BF7;&#x6C42;&#xFF0C;&#x66F4;&#x5C0F;&#x7684;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#xFF0C;&#x66F4;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x662F;&#x4E0D;&#x7A33;&#x5B9A;&#x548C;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x53EF;&#x80FD;2G&#xFF0C;&#x53EF;&#x80FD;3G&#xFF0C;&#x53EF;&#x80FD;4G&#xFF0C;&#x53EF;&#x80FD;wifi&#xFF0C;&#x53EF;&#x80FD;&#x6CA1;&#x4FE1;&#x53F7;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8BA9;&#x6027;&#x80FD;&#x66F4;&#x4F18;&#x662F;&#x91CD;&#x8981;&#x4E14;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;UI&#x5F00;&#x53D1;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x4E24;&#x5927;&#x5757;&#xFF1A;</p>
<p><strong>&#x89C6;&#x89C9;&#x4F53;&#x9A8C;</strong>&#xFF1A;&#x5E03;&#x5C40;&#x3001;&#x6587;&#x672C;&#x3002;&#x5E03;&#x5C40;&#x7684;&#x8303;&#x7574;&#x662F;&#xFF0C;&#x5DE6;&#x53F3;&#x8FD8;&#x662F;&#x4E0A;&#x4E0B;&#xFF0C;&#x5BBD;&#x9AD8;&#xFF0C;&#x80CC;&#x666F;&#xFF0C;&#x8FB9;&#x6846;&#x7B49;&#x3002;&#x6587;&#x672C;&#x7684;&#x8303;&#x7574;&#x662F;&#xFF0C;&#x5B57;&#x4F53;&#x79CD;&#x7C7B;&#x3001;&#x5927;&#x5C0F;&#x3001;&#x989C;&#x8272;&#x3001;&#x7C97;&#x7EC6;&#x7B49;&#xFF0C;font&#x5C5E;&#x6027;&#x91CC;&#x5E94;&#x6709;&#x5C3D;&#x6709;&#xFF0C;&#x540E;&#x6765;&#x53C8;&#x52A0;&#x8FDB;&#x6765;&#x4E00;&#x4E2A;font-face&#x7684;&#x6280;&#x80FD;&#x5305;&#x3002;&#x8FD8;&#x6709;&#x56FE;&#x7247;&#xFF0C;&#x56FE;&#x7247;&#x5927;&#x5C0F;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x683C;&#x5F0F;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4EE5;&#x53CA;&#x8981;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#xFF0C;CSS3&#x7684;&#x5F3A;&#x5927;&#xFF0C;&#x9664;&#x4E86;&#x8868;&#x73B0;&#x5728;&#x5E03;&#x5C40;&#xFF0C;&#x8FD8;&#x8868;&#x73B0;&#x5728;&#x89C6;&#x89C9;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5706;&#x89D2;&#x3001;&#x9634;&#x5F71;&#x3001;&#x6E10;&#x53D8;&#x3001;&#x6EE4;&#x955C;&#x3001;&#x906E;&#x7F69;&#x7B49;&#x7B49;&#x3002;</p>
<p><strong>&#x4EA4;&#x4E92;&#x4F53;&#x9A8C;</strong>&#xFF1A;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#x4EA4;&#x4E92;&#x4E0D;&#x662F;js&#x7684;&#x4E8B;&#x5417;&#xFF1F;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#xFF0C;js&#x53EA;&#x662F;&#x54CD;&#x5E94;&#x884C;&#x4E3A;&#xFF0C;&#x884C;&#x4E3A;&#x6709;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x4F9D;&#x7136;&#x5C5E;&#x4E8E;UI&#x8303;&#x7574;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x3001;&#x70B9;&#x51FB;&#x6001;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x89E6;&#x6478;&#x6001;&#xFF0C;&#x70B9;&#x51FB;&#x533A;&#x57DF;&#xFF0C;&#x5C42;&#x7EA7;&#xFF0C;&#x5BB9;&#x5668;&#x5927;&#x5C0F;&#x3001;&#x4F4D;&#x7F6E;&#x53D8;&#x5316;&#x7684;&#x8FC7;&#x6E21;&#xFF0C;&#x989C;&#x8272;&#x53D8;&#x5316;&#x7684;&#x8FC7;&#x6E21;&#xFF0C;&#x52A8;&#x753B;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x5F00;&#x4E2A;&#x5C0F;&#x7076;&#xFF1A;</p>
<p><strong>&#x7A81;&#x7834;&#x601D;&#x7EF4;&#x754C;&#x9650;&#x2014;&#x2014;&#x5E7F;&#x4E49;&#x7684;&#x76D2;</strong></p>
<p>&#x4E0A;&#x9762;&#x8BF4;&#x8FC7;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x9762;&#x4E34;&#x7740;&#x4E00;&#x4E9B;&#x81EA;&#x9002;&#x5E94;&#x548C;&#x6027;&#x80FD;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x6709;&#x5E94;&#x5BF9;&#x65B9;&#x6CD5;&#x3002;&#x5E38;&#x89C4;&#x7684;&#x76D2;&#x6A21;&#x578B;&#x53EA;&#x6709;margin&#x3001;padding&#x3001;border&#x3001;content&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x53EA;&#x770B;&#x5230;&#x8FD9;&#x4E9B;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x7684;&#x521B;&#x610F;&#x8D8A;&#x6765;&#x8D8A;&#x82B1;&#x54E8;&#xFF0C;&#x5143;&#x7D20;&#x7684;&#x6392;&#x5217;&#x4E0D;&#x603B;&#x662F;&#x90A3;&#x4E48;&#x89C4;&#x89C4;&#x77E9;&#x77E9;&#xFF0C;&#x6A2A;&#x5E73;&#x7AD6;&#x76F4;&#xFF0C;&#x5F62;&#x72B6;&#x4E5F;&#x4E0D;&#x89C4;&#x5219;&#xFF0C;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x4E30;&#x5BCC;&#xFF0C;&#x62FF;&#x5230;&#x89C6;&#x89C9;&#x7A3F;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x8981;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x89E3;&#x6784;&#xFF0C;&#x6709;&#x4E86;CSS3&#x7684;&#x5F3A;&#x5927;&#x6B66;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x5206;&#x5F97;&#x5F88;&#x7EC6;&#xFF0C;&#x4E00;&#x822C;&#x7684;&#x5706;&#x89D2;&#x3001;&#x80CC;&#x666F;&#x6E10;&#x53D8;/&#x88C1;&#x5207;&#x3001;&#x9634;&#x5F71;&#x3001;&#x7F29;&#x653E;&#x7B49;&#x90FD;&#x80FD;&#x7528;CSS3&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4E00;&#x4E9B;&#x88C5;&#x9970;&#x6027;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4F2A;&#x5143;&#x7D20;&#x5B9E;&#x73B0;&#xFF0C;&#x5982;&#x6B64;&#x5206;&#x6790;&#x89C4;&#x5212;&#x4E00;&#x756A;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x77E5;&#x9053;&#xFF0C;&#x600E;&#x6837;&#x7528;&#x6700;&#x5C11;&#x7684;&#x56FE;&#x7247;&#x3001;&#x6700;&#x5C11;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x505A;&#x51FA;&#x66F4;&#x5408;&#x7406;&#x4E5F;&#x66F4;&#x5065;&#x58EE;&#x7684;&#x9875;&#x9762;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8981;&#x505A;&#x5230;&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#xFF0C;&#x9700;&#x8981;&#x8FD9;&#x4E09;&#x70B9;&#xFF1A;&#x591F;&#x5E7F;&#x7684;&#x77E5;&#x8BC6;&#x9762;&#x3001;&#x5BF9;&#x6280;&#x672F;&#x7EC6;&#x8282;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x628A;&#x63A7;&#x3001;&#x5C06;&#x89C6;&#x89C9;&#x5143;&#x7D20;&#x548C;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x4E4B;&#x95F4;&#x76F8;&#x8054;&#x7CFB;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x63A8;&#x8350;&#x4E00;&#x672C;&#x4E66;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x662F;&#x7531;CSS&#x9B54;&#x6CD5;&#x7FFB;&#x8BD1;&#x7684;&#x300A;CSS&#x63ED;&#x79D8;&#x300B;&#xFF0C;&#x91CC;&#x9762;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E9B;CSS&#x7684;&#x9AD8;&#x7EA7;&#x4F7F;&#x7528;&#x6280;&#x5DE7;&#xFF0C;&#x80FD;&#x5E2E;&#x52A9;&#x5927;&#x5BB6;&#x62D3;&#x5BBD;&#x601D;&#x7EF4;&#xFF0C;&#x627E;&#x5230;&#x66F4;&#x591A;&#x4E50;&#x8DA3;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x91CD;&#x65B0;&#x5F3A;&#x8C03;Web&#x6807;&#x51C6;"><a href="#&#x91CD;&#x65B0;&#x5F3A;&#x8C03;Web&#x6807;&#x51C6;" class="headerlink" title="&#x91CD;&#x65B0;&#x5F3A;&#x8C03;Web&#x6807;&#x51C6;"></a>&#x91CD;&#x65B0;&#x5F3A;&#x8C03;Web&#x6807;&#x51C6;</h2><p>Web&#x6807;&#x51C6;&#xFF0C;&#x662F;&#x4E2A;&#x8001;&#x751F;&#x5E38;&#x8C08;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x7ED9;&#x591A;&#x6570;&#x4EBA;&#x7684;&#x5370;&#x8C61;&#x5C31;&#x662F;&#x4E00;&#x5806;&#x5806;&#x7684;&#x82F1;&#x6587;&#xFF0C;&#x8DB3;&#x4EE5;&#x5C06;&#x4EFB;&#x4F55;&#x4EBA;&#x9001;&#x5165;&#x68A6;&#x4E61;&#x3002;&#x4E0D;&#x8FC7;&#x4E5F;&#x6709;&#x540C;&#x884C;&#x670B;&#x53CB;&#x82B1;&#x4E86;&#x5F88;&#x5927;&#x5FC3;&#x8840;&#x7FFB;&#x8BD1;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x5C42;&#x53E0;&#x6837;&#x5F0F;&#x8868;2&#x7EA7;&#x4FEE;&#x8BA2;&#x7248;1&#xFF08;CSS 2.1&#xFF09;&#x89C4;&#x8303;&#x53EF;&#x4EE5;&#x7ED9;&#x5927;&#x5BB6;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x80FD;&#x592A;&#x4F9D;&#x8D56;&#x5B83;&#xFF0C;&#x5C31;&#x6211;&#x672C;&#x4EBA;&#x6240;&#x770B;&#xFF0C;&#x6709;&#x4E9B;&#x5730;&#x65B9;&#x7FFB;&#x8BD1;&#x5F97;&#x4E5F;&#x662F;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#xFF0C;&#x8BF4;&#x5230;&#x5E95;&#xFF0C;&#x6280;&#x672F;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x662F;&#x7406;&#x8BBA;&#x52A0;&#x4E0A;&#x5B9E;&#x8DF5;&#xFF0C;&#x767E;&#x70BC;&#x65B9;&#x53EF;&#x6210;&#x94A2;~</p>
<p>&#x6211;&#x4EEC;&#x8BF4;Web&#x6807;&#x51C6;&#xFF0C;&#x662F;&#x5728;&#x8BF4;&#x4EC0;&#x4E48;&#xFF1F;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5BF9;&#x7F51;&#x9875;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x6280;&#x672F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x66F4;&#x79D1;&#x5B66;&#xFF0C;&#x66F4;&#x5408;&#x7406;&#x7684;&#x5EFA;&#x8BAE;&#x3002;&#x9075;&#x5B88;&#x4E86;&#x5B83;&#x4EEC;&#x4E4B;&#x540E;&#xFF0C;&#x66F4;&#x4E13;&#x4E1A;&#xFF0C;&#x66F4;&#x4E0D;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x80FD;&#x5C06;&#x8BED;&#x8A00;&#x7684;&#x539F;&#x751F;&#x5C5E;&#x6027;&#x548C;&#x529F;&#x80FD;&#x53D1;&#x6325;&#x5230;&#x6781;&#x81F4;&#x3002;</p>
<p>&#x597D;&#x5904;&#x5927;&#x81F4;&#x6709;&#x5982;&#x4E0B;&#x56DB;&#x70B9;&#xFF1A;</p>
<p>1&#x3001;&#x66F4;&#x597D;&#x7684;&#x517C;&#x5BB9;&#xFF0C;&#x8BA9;&#x7F51;&#x9875;&#x5728;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x8BBE;&#x5907;&#x5F53;&#x4E2D;&#x6B63;&#x5E38;&#x6D4F;&#x89C8;</p>
<p>2&#x3001;&#x7ED3;&#x6784;&#x8868;&#x73B0;&#x5206;&#x79BB;&#xFF0C;&#x66F4;&#x6613;&#x7EF4;&#x62A4;&#xFF0C;&#x66F4;&#x7075;&#x6D3B;</p>
<p>3&#x3001;&#x6539;&#x5584;&#x65E0;&#x969C;&#x788D;&#x6027;&#xFF0C;&#x4F7F;&#x7F51;&#x7AD9;&#x5728;&#x89E6;&#x6478;&#x6216;&#x8005;&#x952E;&#x76D8;&#x64CD;&#x4F5C;&#x65F6;&#x53EF;&#x7528;&#xFF0C;&#x6613;&#x7528;</p>
<p>4&#x3001;&#x5229;&#x4E8E;SEO&#xFF0C;&#x6BD4;&#x5982;&#x5173;&#x952E;&#x5B57;&#x7684;&#x4E66;&#x5199;&#xFF0C;&#x6807;&#x9898;&#x7684;&#x4F7F;&#x7528;&#x7B49;</p>
<p>&#x7531;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x6BD4;&#x8F83;&#x5927;&#x7A0B;&#x5EA6;&#x7684;&#x5BB9;&#x9519;&#x6027;&#xFF0C;&#x52A0;&#x4E0A;&#x4EBA;&#x4E3A;&#x7684;&#x5FFD;&#x89C6;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x4F1A;&#x53BB;&#x9075;&#x4ECE;&#x6807;&#x51C6;&#x6765;&#x9009;&#x62E9;&#x6807;&#x7B7E;&#x548C;&#x5C5E;&#x6027;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x4E8E;JS&#x3001;CSS&#x3001;HTML&#x7684;&#x5173;&#x6CE8;&#x5EA6;&#x548C;&#x5728;&#x610F;&#x7A0B;&#x5EA6;&#x4F3C;&#x4E4E;&#x662F;&#x9010;&#x7EA7;&#x9012;&#x51CF;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x5728;UI&#x5DE5;&#x7A0B;&#x5E08;&#x5F53;&#x4E2D;&#xFF0C;&#x4E5F;&#x666E;&#x904D;&#x201C;&#x91CD;CSS&#x8F7B;HTML&#x201D;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x59A5;&#x7684;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x5F3A;&#x8C03;web&#x6807;&#x51C6;&#xFF0C;&#x66F4;&#x9700;&#x8981;&#x5927;&#x5BB6;&#x575A;&#x6301;&#x53BB;&#x8DF5;&#x884C;web&#x6807;&#x51C6;&#x3002;</p>
<h2 id="CSS&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x601D;&#x8003;"><a href="#CSS&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x601D;&#x8003;" class="headerlink" title="CSS&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x601D;&#x8003;"></a>CSS&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x601D;&#x8003;</h2><p>&#x53EF;&#x4EE5;&#x5148;&#x4ECE;&#x4E00;&#x4E2A;&#x4E8B;&#x6545;&#x8BB2;&#x8D77;&#xFF0C;&#x521A;&#x5165;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5386;&#x8FC7;&#x4E00;&#x6B21;&#x4E0D;&#x5927;&#x4E0D;&#x5C0F;&#x7684;&#x4E8B;&#x6545;&#xFF0C;&#x56E0;&#x4E3A;&#x521A;&#x5F00;&#x59CB;&#x505A;&#xFF0C;&#x5F88;&#x4E0D;&#x719F;&#xFF0C;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9996;&#x9875;&#x4E5F;&#x8981;&#x4E24;&#x5929;&#x5DE6;&#x53F3;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x521A;&#x597D;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x7A81;&#x7136;&#x53F3;&#x4E0B;&#x89D2;&#x770B;&#x5230;&#x6709;&#x62A5;&#x9519;&#xFF0C;&#x8BF4;&#x7531;&#x4E8E;&#x7CFB;&#x7EDF;&#x539F;&#x56E0;&#x6587;&#x4EF6;&#x5DF2;&#x635F;&#x574F;&#xFF0C;&#x4E00;&#x4E0B;&#x5C31;&#x614C;&#x4E86;&#x795E;&#xFF0C;&#x558A;&#x4E3B;&#x7BA1;&#x8FC7;&#x6765;&#x770B;&#x770B;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x4ED6;&#x9A6C;&#x4E0A;&#x5E2E;&#x6211;&#x628A;&#x6587;&#x4EF6;&#x53E6;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x53EF;&#x662F;&#x6700;&#x540E;&#x53D1;&#x73B0;&#x8FD8;&#x662F;&#x6CA1;&#x7528;&#xFF0C;&#x6587;&#x4EF6;&#x8FD8;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x5929;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x57FA;&#x672C;&#x767D;&#x505A;&#x4E86;&#xFF0C;&#x6781;&#x5176;&#x6CAE;&#x4E27;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x91CD;&#x505A;&#xFF0C;&#x90A3;&#x65F6;&#x6211;&#x6BCF;&#x6B21;&#x62FF;&#x5230;&#x4E00;&#x4E2A;&#x89C6;&#x89C9;&#x7A3F;&#xFF0C;&#x90FD;&#x662F;&#x4E0A;&#x6765;&#x5C31;&#x505A;&#xFF0C;&#x8FB9;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x8FB9;&#x5207;&#x56FE;&#xFF0C;&#x8FB9;&#x5237;&#x65B0;&#x770B;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6B21;&#x4E8B;&#x6545;&#x6253;&#x4E71;&#x4E86;&#x539F;&#x672C;&#x7684;&#x8282;&#x594F;&#xFF0C;&#x5207;&#x56FE;&#x548C;&#x5199;HTML&#x90FD;&#x7701;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x5BF9;&#x7740;&#x4E00;&#x4E2A;&#x51CC;&#x4E71;&#x7684;&#x9875;&#x9762;&#x76F4;&#x63A5;&#x5199;CSS&#xFF0C;&#x6211;&#x53EF;&#x4E0D;&#x60F3;&#x518D;&#x82B1;&#x4E24;&#x5929;&#x65F6;&#x95F4;&#xFF0C;&#x5FC5;&#x987B;&#x6709;&#x6240;&#x89C4;&#x5212;&#x548C;&#x8C03;&#x6574;&#x3002;</p>
<p>&#x6BD5;&#x7ADF;&#x5DF2;&#x7ECF;&#x5199;&#x8FC7;&#x4E00;&#x904D;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x8FD8;&#x6709;&#x5927;&#x81F4;&#x7684;&#x5370;&#x8C61;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x5C31;&#x4ECE;&#x5934;&#x90E8;&#xFF0C;banner&#xFF0C;&#x4EA7;&#x54C1;&#x5217;&#x8868;&#xFF0C;&#x4FA7;&#x8FB9;&#x680F;&#xFF0C;&#x5E95;&#x90E8;&#xFF0C;&#x8FD9;&#x4E48;&#x4E00;&#x8DEF;&#x5199;&#x4E0B;&#x6765;&#xFF0C;&#x56E0;&#x4E3A;&#x601D;&#x8DEF;&#x6E05;&#x6670;&#xFF0C;&#x6709;&#x6240;&#x89C4;&#x5212;&#xFF0C;&#x8FD9;&#x6B21;&#x590D;&#x76D8;&#x53EA;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x591A;&#x5C0F;&#x65F6;&#x5C31;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x5199;&#x5B8C;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x7740;&#x81EA;&#x5DF1;&#x5199;&#x51FA;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x8BF4;&#x4E0D;&#x51FA;&#x7684;&#x6EE1;&#x8DB3;&#xFF0C;&#x4E5F;&#x662F;&#x4ECE;&#x90A3;&#x4E00;&#x6B21;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x7684;&#x7F16;&#x7801;&#x601D;&#x60F3;&#x6162;&#x6162;&#x53D1;&#x751F;&#x4E86;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x6216;&#x8BB8;&#x662F;&#x547D;&#x8FD0;&#x7684;&#x5B89;&#x6392;~</p>
<p>&#x56DE;&#x5F52;&#x6B63;&#x9898;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x5957;&#x5E94;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x4ECE;&#x5B9E;&#x8DF5;&#x5F97;&#x6765;&#xFF0C;&#x4ECE;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x5F97;&#x6765;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x591A;&#x65B0;&#x624B;&#x5728;&#x9762;&#x5BF9;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x4E00;&#x5934;&#x96FE;&#x6C34;&#xFF0C;&#x4E0D;&#x77E5;&#x6240;&#x4EE5;&#x7136;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x90A3;&#x4E48;&#x505A;&#xFF1F;&#x6CA1;&#x6709;&#x78B0;&#x5230;&#x8FC7;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x89E3;&#x51B3;&#x5B83;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x80FD;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x2014;&#x2014;CSS&#x672C;&#x8EAB;&#x8BED;&#x6CD5;&#x7B80;&#x5355;&#x3001;&#x9650;&#x5236;&#x5C11;&#x3001;&#x7F16;&#x7A0B;&#x80FD;&#x529B;&#x5F31;&#x3002;</p>
<p>&#x4EE3;&#x7801;&#x662F;&#x6B7B;&#x7684;&#xFF0C;&#x4EBA;&#x662F;&#x6D3B;&#x7684;&#xFF0C;&#x65E0;&#x5E8F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F00;&#x52A8;&#x8111;&#x7B4B;&#x8BA9;&#x5B83;&#x53D8;&#x5F97;&#x6709;&#x5E8F;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<p>1&#x3001;&#x600E;&#x6837;&#x907F;&#x514D;&#x6837;&#x5F0F;&#x51B2;&#x7A81;</p>
<p>2&#x3001;&#x600E;&#x6837;&#x907F;&#x514D;&#x4EE3;&#x7801;&#x6DF7;&#x4E71;&#x96BE;&#x7EF4;&#x62A4;</p>
<p>3&#x3001;&#x5185;&#x5BB9;&#x548C;&#x8868;&#x73B0;&#x5206;&#x79BB;</p>
<p>4&#x3001;&#x600E;&#x6837;&#x80FD;&#x8BA9;&#x4EE3;&#x7801;&#x6613;&#x62D3;&#x5C55;&#x3001;&#x6613;&#x79FB;&#x690D;</p>
<p>&#x5927;&#x81F4;&#x5148;&#x5217;&#x8FD9;&#x56DB;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x56DB;&#x70B9;&#x5904;&#x7406;&#x4E0D;&#x597D;&#xFF0C;&#x5C31;&#x522B;&#x602A;&#x5751;&#x591A;&#xFF0C;&#x90A3;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x7ED9;&#x81EA;&#x5DF1;&#x6316;&#x7684;~&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x95EE;&#x6211;&#x600E;&#x4E48;&#x907F;&#x514D;&#xFF0C;&#x6211;&#x53EA;&#x80FD;&#x8BF4;&#xFF0C;&#x6709;&#x4E9B;&#x5751;&#x5FC5;&#x8E29;&#x4E0D;&#x53EF;&#xFF0C;&#x6709;&#x4E9B;&#x574E;&#x5FC5;&#x7136;&#x8981;&#x8FC7;&#x3002;</p>
<p>&#x4F60;&#x5E94;&#x8BE5;&#x89C1;&#x8FC7;&#x8FD9;&#x51E0;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;&#xFF1A;</p>
<p><strong>OOCSS</strong>&#x2014;&#x2014;&#x7ED3;&#x6784;&#x548C;&#x76AE;&#x80A4;&#x5206;&#x79BB;&#xFF0C;&#x5BB9;&#x5668;&#x548C;&#x5185;&#x5BB9;&#x5206;&#x79BB;</p>
<p><strong>SMACSS</strong>&#x2014;&#x2014;Base&#xFF08;&#x57FA;&#x7840;&#xFF09;&#x3001;Layout&#xFF08;&#x5E03;&#x5C40;&#xFF09;&#x3001;Module&#xFF08;&#x6A21;&#x5757;&#xFF09;&#x3001;State&#xFF08;&#x72B6;&#x6001;&#xFF09;&#x3001;Theme&#xFF08;&#x4E3B;&#x9898;&#xFF09;</p>
<p><strong>Meta CSS</strong>&#x2014;&#x2014;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x3001;&#x7C92;&#x5EA6;&#x5C0F;&#xFF0C;&#x6837;&#x5F0F;&#x548C;&#x7ED3;&#x6784;&#x3001;&#x5185;&#x5BB9;&#x65E0;&#x5173;</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x628A;&#x8868;&#x73B0;&#x548C;&#x5185;&#x5BB9;&#x5206;&#x79BB;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C; &#x4E00;&#x4E2A;&#x65B0;&#x95FB;&#x5217;&#x8868;&#xFF0C;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x5217;&#x8868;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x90FD;&#x662F;&#x5217;&#x8868;&#xFF0C;&#x4F46;&#x65E2;&#x4E0D;&#x80FD;&#x547D;&#x540D;&#x4E3A;new-list&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x547D;&#x540D;&#x4E3A;product-list&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x4E0D;&#x80FD;&#x76F8;&#x4E92;&#x9002;&#x7528;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x91CD;&#x70B9;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x628A;UI&#x8868;&#x73B0;&#x548C;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x5206;&#x5F00;&#x6765;&#xFF0C;&#x76F8;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#xFF0C;&#x54EA;&#x91CC;&#x9700;&#x8981;&#x5C31;&#x53EF;&#x4EE5;&#x653E;&#x5230;&#x54EA;&#x91CC;&#xFF0C;&#x53EF;&#x4EE5;&#x5408;&#x4F5C;&#x5B8C;&#x6210;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x5176;&#x4ED6;&#x7279;&#x6709;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x6269;&#x5C55;&#x7C7B;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x4E5F;&#x8981;&#x6CE8;&#x610F;&#x4E0D;&#x5B9C;&#x6CDB;&#x6EE5;&#xFF0C;&#x5982;&#x679C;&#x6DFB;&#x52A0;&#x4E86;&#x8FC7;&#x591A;&#x7684;&#x7C7B;&#xFF0C;&#x5C31;&#x8981;&#x91CD;&#x65B0;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x89C4;&#x5212;&#x7684;&#x662F;&#x5426;&#x5408;&#x7406;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#xFF0C;&#x5173;&#x6CE8;&#x70B9;&#x5728;&#x4E8E;&#x6574;&#x7AD9;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x6709;&#x66F4;&#x957F;&#x8FDC;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x57FA;&#x7840;&#x548C;&#x5E03;&#x5C40;&#x6837;&#x5F0F;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x7F51;&#x7AD9;&#x7684;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x90FD;&#x7528;&#x5230;&#xFF0C;&#x5355;&#x72EC;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x6A21;&#x5757;&#x662F;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x6E05;&#x6670;&#x548C;&#x72EC;&#x7ACB;&#x6027;&#xFF0C;&#x72B6;&#x6001;&#x8FD9;&#x4E00;&#x70B9;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x9700;&#x6C42;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x6709;&#x8F83;&#x4E3A;&#x5B8C;&#x6574;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#x4E0D;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x51E0;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x6682;&#x65F6;&#x7684;&#x4E00;&#x4E2A;&#x56FE;&#x6807;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x5C06;&#x6765;&#x7684;&#x4E00;&#x5806;&#x56FE;&#x6807;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x79CD;&#xFF0C;&#x662F;&#x628A;&#x4E00;&#x4E9B;&#x5927;&#x5BB6;&#x90FD;&#x5E38;&#x7528;&#x6216;&#x8005;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x901A;&#x8FC7;&#x8BC4;&#x4F30;&#xFF0C;&#x67D0;&#x4E2A;&#x9879;&#x76EE;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x4F1A;&#x7528;&#x7684;&#x89C4;&#x5219;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x540C;&#x4E00;&#x79CD;&#x989C;&#x8272;&#x7684;&#x5B57;&#x4F53;&#xFF0C;&#x540C;&#x4E00;&#x79CD;&#x95F4;&#x8DDD;&#xFF0C;&#x540C;&#x4E00;&#x7C7B;&#x5E03;&#x5C40;&#x7B49;&#x7B49;&#xFF0C;&#x662F;&#x4E00;&#x4E9B;&#x7C92;&#x5EA6;&#x6BD4;&#x8F83;&#x7EC6;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E0D;&#x6B62;&#x4E0A;&#x9762;&#x8FD9;&#x4E09;&#x79CD;&#xFF0C;&#x53EA;&#x662F;&#x62FF;&#x51FA;&#x6765;&#x7ED9;&#x5927;&#x5BB6;&#x4E3E;&#x4F8B;&#x5B50;&#x3002;&#x6211;&#x4EEC;&#x5E38;&#x4F1A;&#x542C;&#x5230;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x501F;&#x9274;&#x601D;&#x60F3;&#xFF0C;&#x600E;&#x6837;&#x501F;&#x9274;&#x601D;&#x60F3;&#xFF1F;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x6846;&#x67B6;&#xFF0C;&#x90FD;&#x662F;&#x67D0;&#x79CD;&#x601D;&#x60F3;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6837;&#x4F8B;&#xFF0C;&#x5C31;&#x50CF;&#x4EE5;&#x4E0A;&#x4E09;&#x8005;&#xFF0C;&#x4E5F;&#x5404;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x52BF;&#x548C;&#x77ED;&#x677F;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4E0D;&#x62D8;&#x6CE5;&#x4E8E;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#xFF0C;&#x878D;&#x4F1A;&#x8D2F;&#x901A;&#xFF0C;&#x7686;&#x53EF;&#x4E3A;&#x6211;&#x6240;&#x7528;&#xFF0C;&#x6B63;&#x6240;&#x8C13;&#x201C;&#x65E0;&#x62DB;&#x80DC;&#x6709;&#x62DB;&#x201D;&#x3002;</p>
<h2 id="&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x66F4;&#x654F;&#x6377;"><a href="#&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x66F4;&#x654F;&#x6377;" class="headerlink" title="&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x66F4;&#x654F;&#x6377;"></a>&#x5DE5;&#x5177;&#xFF0C;&#x8BA9;&#x5F00;&#x53D1;&#x66F4;&#x654F;&#x6377;</h2><p>&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x4F1A;&#x53D7;&#x56F0;&#x4E8E;&#x4E00;&#x4E9B;&#x70E6;&#x607C;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x3002;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x7F16;&#x7A0B;&#x4ECE;&#x6765;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4EF6;&#x5145;&#x6EE1;&#x4E50;&#x8DA3;&#x548C;&#x521B;&#x610F;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x75B2;&#x4E8E;&#x505A;&#x5F88;&#x591A;&#x91CD;&#x590D;&#x7684;&#x3001;&#x7EAF;&#x4F53;&#x529B;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5C31;&#x592A;&#x6D6A;&#x8D39;&#x4E86;&#x3002;&#x6545;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x5404;&#x4E2A;&#x73AF;&#x8282;&#x53BB;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;UI&#x5F00;&#x53D1;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x4EE5;&#x4E0B;&#x51E0;&#x65B9;&#x9762;&#x53BB;&#x7740;&#x624B;&#xFF1A;</p>
<p><strong>&#x56FE;&#x7247;&#x5904;&#x7406;</strong>&#xFF1A;&#x5207;&#x56FE;&#x3001;&#x538B;&#x7F29;&#x3001;&#x683C;&#x5F0F;&#x8F6C;&#x6362;</p>
<p><strong>&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;</strong>&#xFF1A;&#x5FEB;&#x6377;&#x952E;&#x3001;&#x4EE3;&#x7801;&#x6A21;&#x677F;&#x3001;&#x63D2;&#x4EF6;</p>
<p><strong>&#x4EE3;&#x7801;&#x5904;&#x7406;&#x5668;</strong>&#xFF1A;&#x683C;&#x5F0F;&#x5316;&#x3001;&#x6392;&#x5E8F;&#x3001;&#x538B;&#x7F29;&#x3001;&#x9884;&#x5904;&#x7406;&#x5668;&#x7B49;</p>
<p><strong>&#x81EA;&#x52A8;&#x5316;&#x6784;&#x5EFA;&#x5DE5;&#x5177;</strong>&#xFF1A;grunt&#x3001;gulp&#x3001;webpack&#x3001;fis&#x7B49;</p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#xFF0C;&#x5FEB;&#x901F;&#x5207;&#x56FE;&#xFF0C;&#x66F4;&#x5FEB;&#x7684;&#x5199;&#x51FA;&#x4F18;&#x96C5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x5904;&#x7406;&#x5199;&#x5B8C;&#x4EE3;&#x7801;&#x4E4B;&#x540E;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x73B0;&#x5728;&#x53EF;&#x4F9B;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x6784;&#x5EFA;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x63D2;&#x4EF6;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x5728;&#x7EBF;&#x5DE5;&#x5177;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x7F16;&#x8F91;&#x5668;&#x63D2;&#x4EF6;&#x8FD8;&#x53EF;&#x4EE5;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x5B66;&#x4E60;&#x6210;&#x672C;&#x662F;&#x4E0D;&#x4F4E;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x4E60;&#x60EF;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x53C8;&#x4F1A;&#x72AF;&#x9009;&#x62E9;&#x56F0;&#x96BE;&#x75C7;&#x4E86;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x5927;&#x53EF;&#x4E0D;&#x5FC5;&#xFF0C;&#x6240;&#x6709;&#x5DE5;&#x5177;&#x9700;&#x8981;&#x505A;&#x7684;&#x90FD;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5DEE;&#x5F02;&#x5728;&#x4E8E;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x548C;&#x7EC6;&#x8282;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x5FC5;&#x7EA0;&#x7ED3;&#xFF0C;&#x6709;&#x5174;&#x8DA3;&#x53EF;&#x4EE5;&#x591A;&#x5C1D;&#x8BD5;&#xFF0C;&#x4E0D;&#x60F3;&#x7528;&#x65B0;&#x7684;&#x4E5F;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x7528;&#x539F;&#x5148;&#x81EA;&#x5DF1;&#x6700;&#x62FF;&#x624B;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x5230;&#x54EA;&#x91CC;&#x627E;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x6765;&#x8FD9;&#x513F;&#x770B;&#x770B;&#x9189;&#x725B;&#x524D;&#x7AEF;&#x55EF;&#xFF0C;&#x6211;&#x505A;&#x7684;&#xFF0C;&#x867D;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5B9E;&#x7528;~</p>
<h2 id="&#x600E;&#x6837;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;UI&#x5DE5;&#x7A0B;&#x5E08;&#xFF1F;"><a href="#&#x600E;&#x6837;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;UI&#x5DE5;&#x7A0B;&#x5E08;&#xFF1F;" class="headerlink" title="&#x600E;&#x6837;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;UI&#x5DE5;&#x7A0B;&#x5E08;&#xFF1F;"></a>&#x600E;&#x6837;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;UI&#x5DE5;&#x7A0B;&#x5E08;&#xFF1F;</h2><p>&#x6700;&#x8FD1;&#x51E0;&#x5929;&#xFF0C;&#x6709;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x53EB;&#x300A;&#x65E2;&#x7136;&#x5199;CSS&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x5927;&#x5BB6;&#x8FD8;&#x662F;&#x628A;CSS&#x5199;&#x7684;&#x90A3;&#x4E48;&#x70C2;&#x5462;&#xFF1F;&#x300B;&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x91CC;&#x9762;&#x7684;&#x5E72;&#x8D27;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x5B83;&#x518D;&#x6B21;&#x5F15;&#x53D1;&#x4E86;&#x4E00;&#x4E9B;&#x524D;&#x7AEF;&#x4EBA;&#x7684;&#x601D;&#x8003;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x89C9;&#x5F97;&#x5B83;&#x5BB9;&#x6613;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5BB9;&#x6613;&#x5199;&#x5F97;&#x70C2;&#xFF1F;</p>
<p>&#x6211;&#x66FE;&#x5728;&#x77E5;&#x4E4E;&#x4E0A;&#x56DE;&#x7B54;&#x8FC7;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x95EE;&#x9898;&#x2014;&#x2014;&#x201C;&#x5199;CSS&#xFF0C;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x5F88;&#x70C2;&#xFF1F;&#x201D;&#xFF0C;&#x7B54;&#x6848;&#x7B80;&#x5355;&#x7F57;&#x5217;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1&#x3001;&#x5F53;&#x4F60;&#x7684;&#x5355;&#x4E2A;CSS&#x6587;&#x4EF6;&#x5F88;&#x5927;&#xFF0C;&#x4EE3;&#x7801;&#x5F88;&#x4E71;&#x7684;&#x65F6;&#x5019;</p>
<p>2&#x3001;&#x5F53;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x4E3A;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x800C;&#x968F;&#x4FBF;&#x585E;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5E76;&#x968F;&#x610F;&#x7ED9;&#x5B83;&#x547D;&#x4E86;&#x4E2A;&#x540D;&#x7684;&#x65F6;&#x5019;</p>
<p>3&#x3001;&#x5F53;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x5F88;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x89C4;&#x5219;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BD4;&#x5982;position&#xFF1A;absolute&#xFF1B;display&#xFF1A;block&#xFF1B;</p>
<p>4&#x3001;&#x5F53;&#x4F60;&#x5FFD;&#x7565;&#x4E86;&#x7EE7;&#x627F;&#xFF0C;&#x5728;&#x53CD;&#x590D;&#x5B9A;&#x4E49;font-size&#x3001;color&#x7B49;&#x53EF;&#x7EE7;&#x627F;&#x5C5E;&#x6027;&#x7684;&#x65F6;&#x5019;</p>
<p>5&#x3001;&#x5F53;&#x4F60;&#x5FFD;&#x7565;&#x4E86;&#x590D;&#x7528;&#x6A21;&#x5757;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x5728;&#x91CD;&#x590D;&#x5199;&#x4E00;&#x4E2A;&#x76F8;&#x4F3C;&#x5EA6;&#x8FBE;&#x5230;80%&#x7684;&#x4E24;&#x5757;&#x5185;&#x5BB9;&#x7684;&#x65F6;&#x5019;</p>
<p>6&#x3001;&#x5F53;&#x4F60;&#x4E60;&#x60EF;&#x4E8E;&#x7528;&#x4E00;&#x4E9B;&#x6027;&#x80FD;&#x5F88;&#x5DEE;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x5F88;&#x8106;&#x5F31;&#x7684;&#x7ED3;&#x6784;&#x7684;&#x65F6;&#x5019;</p>
<p>&#x6682;&#x5217;&#x8FD9;6&#x70B9;&#xFF0C;&#x4E0D;&#x5C55;&#x5F00;&#x8BF4;&#x4E86;&#xFF0C;&#x6709;&#x7591;&#x60D1;&#xFF0C;&#x6709;&#x9700;&#x8981;&#xFF0C;&#x54B1;&#x518D;&#x804A;&#x3002;&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;UI&#x5DE5;&#x7A0B;&#x5E08;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x70B9;&#x6765;&#x8BF4;&#xFF1A;</p>
<p><strong>&#x5DE5;&#x5320;&#x7CBE;&#x795E;</strong></p>
<p>&#x5173;&#x952E;&#x8BCD;&#xFF1A;<strong>&#x8FD8;&#x539F;&#x3001;&#x63A2;&#x7D22;&#x3001;&#x79EF;&#x7D2F;&#x3001;&#x8DDF;&#x8FDB;</strong></p>
<p>&#x8FD8;&#x539F;&#xFF1A;&#x591A;&#x4F53;&#x73B0;&#x5728;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x9634;&#x5F71;&#x3001;&#x5BF9;&#x9F50;&#x3001;&#x884C;&#x8DDD;&#xFF0C;&#x4E2D;&#x82F1;&#x6587;&#x5B57;&#x7B26;&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x7528;&#x6237;&#xFF0C;&#x5305;&#x62EC;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x8005;&#x672C;&#x4EBA;&#xFF0C;&#x90FD;&#x96BE;&#x4EE5;&#x770B;&#x51FA;&#x8FD9;&#x4E9B;&#x7EC6;&#x5FAE;&#x5DEE;&#x522B;&#xFF0C;&#x4F46;&#x5F80;&#x5F80;&#x9003;&#x4E0D;&#x8FC7;&#x7EC6;&#x5FC3;&#x8BBE;&#x8BA1;&#x5E08;&#x7684;&#x6CD5;&#x773C;&#xFF0C;&#x800C;&#x4E14;&#x7684;&#x786E;&#x4F1A;&#x5BF9;&#x6574;&#x4F53;&#x7684;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x6709;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5BF9;&#x81EA;&#x5DF1;&#x63D0;&#x51FA;&#x66F4;&#x4E25;&#x683C;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E5F;&#x66F4;&#x80FD;&#x4F53;&#x73B0;&#x4E13;&#x4E1A;&#x5EA6;&#x3002;</p>
<p>&#x63A2;&#x7D22;&#xFF1A;&#x5E73;&#x65F6;&#x6211;&#x4EEC;&#x90FD;&#x5728;&#x4E0D;&#x505C;&#x7684;&#x5FD9;&#x788C;&#xFF0C;&#x505A;&#x9700;&#x6C42;&#xFF0C;&#x505A;&#x9879;&#x76EE;&#xFF0C;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x7A0D;&#x5FAE;&#x4F11;&#x606F;&#x4E00;&#x4E0B;&#xFF0C;&#x63A5;&#x7740;&#x505A;&#x4E0B;&#x4E00;&#x4E2A;&#xFF0C;&#x957F;&#x6B64;&#x53CD;&#x590D;&#xFF0C;&#x5C31;&#x6CA1;&#x65F6;&#x95F4;&#x53BB;&#x63A2;&#x7D22;&#x548C;&#x5C1D;&#x8BD5;&#x65B0;&#x7684;&#x6280;&#x672F;&#x548C;&#x5DE5;&#x5177;&#xFF0C;&#x8FDB;&#x800C;&#x6CA1;&#x6709;&#x7A7A;&#x95F4;&#x53BB;&#x6539;&#x8FDB;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x548C;&#x6280;&#x672F;&#x65B9;&#x6848;&#xFF0C;&#x5C31;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x804C;&#x4E1A;&#x6280;&#x80FD;&#x50A8;&#x5907;&#x5904;&#x4E8E;&#x505C;&#x6EDE;&#x4E0D;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4FDD;&#x6301;&#x70ED;&#x60C5;&#xFF0C;&#x575A;&#x6301;&#x63A2;&#x7D22;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x79EF;&#x7D2F;&#xFF1A;&#x6211;&#x4EEC;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x96BE;&#x514D;&#x4F1A;&#x78B0;&#x5230;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#x78B0;&#x5230;&#x67D0;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x53CA;&#x65F6;&#x7684;&#x79EF;&#x7D2F;&#x8D77;&#x6765;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x6BCF;&#x6B21;&#x9047;&#x5230;&#x90FD;&#x50CF;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x9047;&#x5230;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x6210;&#x672C;&#x3002;</p>
<p>&#x8DDF;&#x8FDB;&#xFF1A;&#x65B0;&#x4E8B;&#x7269;&#x8DDF;&#x8FDB;&#xFF0C;&#x5728;&#x5F88;&#x591A;&#x65B0;&#x7684;&#x6280;&#x672F;&#x6216;&#x8005;&#x5C5E;&#x6027;&#x3001;&#x65B9;&#x6CD5;&#x51FA;&#x73B0;&#x4E4B;&#x540E;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x8282;&#x594F;&#x90FD;&#x662F;&#x5148;&#x6B23;&#x559C;&#x540E;&#x65E0;&#x5948;&#xFF0C;&#x56E0;&#x4E3A;&#x53EF;&#x80FD;&#x5C1A;&#x672A;&#x53D1;&#x5E03;&#x6B63;&#x5F0F;&#x7248;&#x672C;&#x6216;&#x8005;&#x6D4F;&#x89C8;&#x5668;&#x5C1A;&#x672A;&#x652F;&#x6301;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x76F4;&#x63A5;&#x653E;&#x5F03;&#x53BB;&#x5C1D;&#x8BD5;&#x548C;&#x7814;&#x7A76;&#x3002;&#x6E29;&#x603B;&#x7406;&#x66FE;&#x8BF4;&#x8FC7;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#x201C;&#x6CA1;&#x6709;&#x7A0B;&#x5E8F;&#x7684;&#x6C11;&#x4E3B;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x5B9E;&#x8D28;&#x7684;&#x6C11;&#x4E3B;&#x201D;&#xFF0C;&#x5982;&#x679C;&#x5957;&#x7528;&#x5230;&#x8FD9;&#x91CC;&#x6765;&#xFF0C;&#x53EF;&#x4EE5;&#x6539;&#x6210;&#x201C;&#x6CA1;&#x6709;&#x65B0;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x53EF;&#x884C;&#x6027;&#x65B9;&#x6848;&#x201D;&#x3002;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x9762;&#x5BF9;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4E60;&#x60EF;&#x6027;&#x7684;&#x9762;&#x9732;&#x96BE;&#x8272;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x201C;&#x8FD9;&#x4E2A;&#x505A;&#x4E0D;&#x4E86;&#x201D;&#xFF0C;&#x5176;&#x5B9E;&#x6709;&#x4E9B;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x4E0D;&#x4E86;&#xFF0C;&#x53EA;&#x662F;&#x9700;&#x8981;&#x7A0D;&#x5FAE;&#x591A;&#x82B1;&#x4E9B;&#x5FC3;&#x601D;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x6211;&#x4EEC;&#x8BA4;&#x77E5;&#x7684;&#x5C40;&#x9650;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5B9E;&#x73B0;&#xFF0C;&#x9664;&#x4E86;&#x5173;&#x4E4E;&#x9879;&#x76EE;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x8FD8;&#x5173;&#x7CFB;&#x5230;&#x6280;&#x672F;&#x9009;&#x578B;&#xFF0C;&#x5F53;&#x624B;&#x91CC;&#x7684;&#x6B66;&#x5668;&#x591A;&#x4E86;&#xFF0C;&#x53EF;&#x9009;&#x8303;&#x56F4;&#x624D;&#x5E7F;&#xFF0C;&#x624D;&#x80FD;&#x8212;&#x8212;&#x670D;&#x670D;&#x7684;&#x53BB;&#x9009;&#x62E9;&#x6700;&#x4F18;&#x89E3;&#x3002;</p>
<p><strong>&#x66F4;&#x591A;&#x53EF;&#x80FD;&#x6027;</strong></p>
<p>&#x5173;&#x952E;&#x8BCD;&#xFF1A;<strong>&#x521B;&#x9020;&#x6027;&#x3001;&#x53EF;&#x884C;&#x6027;</strong></p>
<p><strong>&#x521B;&#x9020;&#x6027;</strong>&#xFF1A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x4E0D;&#x5C11;&#x4EBA;&#x7528;CSS3&#x7684;&#x6280;&#x672F;&#x505A;&#x51FA;&#x5404;&#x79CD;&#x4EE5;&#x524D;&#x4E0D;&#x6562;&#x60F3;&#x8C61;&#x662F;CSS&#x80FD;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x4E24;&#x4E2A;18&#x4E2A;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x76F8;&#x4FE1;&#x662F;&#x7528;CSS&#x5236;&#x4F5C;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x3001;one-div&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x65B0;&#x65B9;&#x6CD5;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x80FD;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x5947;&#x6280;&#x6DEB;&#x5DE7;&#xFF0C;&#x5728;&#x771F;&#x5B9E;&#x9879;&#x76EE;&#x4E2D;&#x5E76;&#x4E0D;&#x5B9E;&#x7528;&#xFF0C;&#x5176;&#x5B9E;&#x4ED6;&#x4EEC;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x9664;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x611F;&#x53D7;&#x5230;&#x6280;&#x672F;&#x7684;&#x8DA3;&#x5473;&#x6027;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x542F;&#x53D1;&#xFF0C;&#x5E2E;&#x6211;&#x4EEC;&#x6253;&#x5F00;&#x4E00;&#x6247;&#x95E8;&#xFF0C;&#x81F3;&#x4E8E;&#x80FD;&#x521B;&#x9020;&#x51FA;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x770B;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4E86;&#x3002;</p>
<p><strong>&#x53EF;&#x884C;&#x6027;</strong>&#xFF1A;&#x9664;&#x4E86;&#x73A9;&#x513F;&#x6280;&#x672F;&#x201C;&#x81EA;&#x55E8;&#x201D;&#xFF0C;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6280;&#x672F;&#x7684;&#x65BD;&#x5C55;&#x7A7A;&#x95F4;&#x8FD8;&#x662F;&#x8981;&#x8DDF;&#x9879;&#x76EE;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#x7684;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x548C;&#x8BBE;&#x8BA1;&#x5E08;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x5929;&#x9A6C;&#x884C;&#x7A7A;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x542C;&#x8BDD;&#x505A;&#x4E8B;&#x201D;&#x7684;&#x6267;&#x884C;&#x8005;&#xFF0C;&#x8981;&#x5145;&#x5206;&#x53D1;&#x6325;&#x6211;&#x4EEC;&#x7684;&#x4E13;&#x4E1A;&#x6027;&#x548C;&#x4E3B;&#x52A8;&#x6027;&#xFF0C;&#x67D0;&#x4E2A;idea&#x5230;&#x5E95;&#x80FD;&#x4E0D;&#x80FD;&#x505A;&#xFF0C;&#x80FD;&#x5B9E;&#x73B0;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x5C11;&#x6210;&#x672C;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x65E9;&#x671F;&#x80FD;&#x591F;&#x6C9F;&#x901A;&#x597D;&#xFF0C;&#x5C31;&#x80FD;&#x907F;&#x514D;&#x5230;&#x4E86;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6216;&#x8005;&#x9A8C;&#x6536;&#x7684;&#x65F6;&#x5019;&#x624D;&#x6709;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</strong></p>
<p>&#x5173;&#x952E;&#x8BCD;&#xFF1A;<strong>&#x9884;&#x89C1;&#x6027;&#x3001;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</strong></p>
<p><strong>&#x9884;&#x89C1;&#x6027;</strong>&#xFF1A;&#x8BBE;&#x8BA1;&#x5E08;&#x7ED9;&#x8FC7;&#x6765;&#x7684;&#x89C6;&#x89C9;&#x7A3F;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x5185;&#x5BB9;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x7EBF;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x624D;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x5728;&#x524D;&#x671F;&#x907F;&#x514D;&#x6389;&#x4E00;&#x4E9B;&#x4E0D;&#x5E94;&#x8BE5;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x6587;&#x5B57;&#x6EA2;&#x51FA;&#x622A;&#x65AD;&#x3001;&#x6587;&#x5B57;&#x6298;&#x884C;&#x3001;&#x5185;&#x5BB9;&#x81EA;&#x9002;&#x5E94;&#x3001;&#x5185;&#x5BB9;&#x8D85;&#x51FA;&#x6EDA;&#x52A8;&#x7B49;&#x3002;</p>
<p><strong>&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</strong>&#xFF1A;&#x6709;&#x5F88;&#x591A;&#x4ECB;&#x7ECD;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x65B9;&#x9762;&#x7684;&#x901A;&#x7528;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF0C;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x8131;&#x79BB;&#x9879;&#x76EE;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x53EA;&#x6709;&#x505A;&#x4E86;&#xFF0C;&#x8E29;&#x4E86;&#x5751;&#x4E86;&#xFF0C;&#x624D;&#x4F1A;&#x66F4;&#x52A0;&#x77E5;&#x9053;&#x600E;&#x6837;&#x505A;&#x5728;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x4E0B;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;&#x4E3A;&#x907F;&#x514D;&#x7ED3;&#x6784;&#x53D8;&#x52A8;&#x5F15;&#x8D77;&#x7684;&#x6837;&#x5F0F;&#x7EE7;&#x627F;&#x51B2;&#x7A81;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x3002;&#x56E0;&#x4E3A;&#x56FE;&#x6807;&#x5728;&#x7F51;&#x7AD9;&#x7684;&#x6BCF;&#x4E2A;&#x5730;&#x65B9;&#x548C;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x7684;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x53EA;&#x5B9A;&#x4E49;&#x8868;&#x73B0;&#xFF0C;&#x4E0D;&#x5B9A;&#x4E49;&#x5E03;&#x5C40;&#x3002;&#x901A;&#x7528;&#x7EC4;&#x4EF6;&#x7684;&#x5916;&#x6846;&#x662F;&#x786E;&#x5B9A;&#x7684;&#xFF0C;&#x5185;&#x5BB9;&#x662F;&#x4E0D;&#x5B9A;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x53EA;&#x5B9A;&#x4E49;&#x5916;&#x56F4;&#xFF0C;&#x4E0D;&#x5B9A;&#x4E49;&#x5185;&#x5BB9;&#x3002;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#x624D;&#x80FD;&#x5207;&#x8EAB;&#x4F53;&#x4F1A;&#x3002;</p>
<h2 id="&#x5199;&#x5728;&#x6700;&#x540E;"><a href="#&#x5199;&#x5728;&#x6700;&#x540E;" class="headerlink" title="&#x5199;&#x5728;&#x6700;&#x540E;"></a>&#x5199;&#x5728;&#x6700;&#x540E;</h2><p>&#x6709;&#x4E0D;&#x5C11;&#x4EBA;&#x95EE;&#x9875;&#x9762;&#x91CD;&#x6784;&#x662F;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x95EE;&#xFF0C;&#x817E;&#x8BAF;&#x4E3A;&#x4EC0;&#x4E48;&#x628A;JS&#x548C;CSS&#x5206;&#x5F00;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x5229;&#x5F0A;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5176;&#x5B9E;&#x5728;&#x6587;&#x7AE0;&#x7684;&#x5F00;&#x5934;&#x5DF2;&#x7ECF;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x4E86;&#xFF0C;&#x6709;&#x5229;&#x6709;&#x5F0A;&#x3002;&#x4F46;&#x662F;&#x5C31;&#x76EE;&#x524D;&#x524D;&#x7AEF;&#x5708;&#x7684;&#x53D1;&#x5C55;&#x6765;&#x770B;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x5F0A;&#x5927;&#x4E8E;&#x5229;&#x7684;&#xFF0C;&#x4F46;&#x804C;&#x4F4D;&#x662F;&#x6B7B;&#x7684;&#xFF0C;&#x4EBA;&#x662F;&#x6D3B;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5B66;&#x4E60;&#xFF0C;&#x60F3;&#x8981;&#x81EA;&#x6211;&#x7A81;&#x7834;&#xFF0C;&#x600E;&#x6837;&#x90FD;&#x6321;&#x4E0D;&#x4F4F;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x501F;&#x5F20;&#x514B;&#x519B;&#x6211;&#x7684;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x4E4B;&#x8DEF;&#x7684;&#x4E00;&#x6BB5;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x524D;&#x7AEF;&#x5927;&#x6982;&#x7684;&#x53D1;&#x5C55;&#x8DEF;&#x5F84;&#xFF1A;</p>
<p>2002&#x301C;2005&#x5E74;&#xFF0C;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#xFF0C;&#x4ECE;&#x4E1A;&#x8005;&#x8981;&#x6C42;&#xFF1A;&#x624B;&#x5FEB;&#x3001;&#x50CF;&#x7D20;&#x7EA7;&#x8FD8;&#x539F;&#x3001;&#x5168;&#x9762;&#x517C;&#x5BB9;</p>
<p>2005&#x301C;2009&#x5E74;&#xFF0C;&#x7F51;&#x7AD9;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4ECE;&#x4E1A;&#x8005;&#x8981;&#x6C42;&#xFF1A;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x3001;&#x6027;&#x80FD;&#x3001;SEO&#x3001;jQuery&#xFF08;&#x53CA;&#x540C;&#x7C7B;&#xFF09;</p>
<p>2009&#x301C;2013&#x5E74;&#xFF0C;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4ECE;&#x4E1A;&#x8005;&#x8981;&#x6C42;&#xFF1A;MV&#xFF0A;&#x3001;AMD/CMD&#x3001;SCSS&#xFF08;&#x53CA;&#x540C;&#x7C7B;&#xFF09;&#x3001;Grunt&#xFF08;&#x53CA;&#x540C;&#x7C7B;&#xFF09;</p>
<p>2013&#x301C;2016&#x5E74;&#xFF0C;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x4ECE;&#x4E1A;&#x8005;&#x8981;&#x6C42;&#xFF1A;&#x5168;&#x6808;&#x3001;ES5/6&#x3001;CSS3&#x3001;RWD&#xFF08;&#x54CD;&#x5E94;&#x5F0F;&#x5F00;&#x53D1;&#xFF09;&#x3001;&#x6DF7;&#x5408;&#x5F00;&#x53D1;&#xFF08;&#x6240;&#x6709;&#x8981;&#x6C42;&#x5411;&#x524D;&#x517C;&#x5BB9;&#xFF0C;&#x4E0D;&#x5305;&#x542B;&#x7279;&#x6B8A;&#x9886;&#x57DF;&#x7684;&#x7279;&#x522B;&#x8981;&#x6C42;&#xFF09;</p>
<p>&#x4ECE;&#x4EE5;&#x4E0A;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x4ECE;&#x5E02;&#x573A;&#x9700;&#x6C42;&#x8FD8;&#x662F;&#x6280;&#x672F;&#x9886;&#x57DF;&#xFF0C;&#x5BF9;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8981;&#x6C42;&#x90FD;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#xFF0C;&#x9700;&#x8981;&#x638C;&#x63E1;&#x66F4;&#x591A;&#x5B9E;&#x6218;&#x6280;&#x80FD;&#xFF0C;&#x5199;&#x51FA;&#x9002;&#x5E94;&#x591A;&#x7EC8;&#x7AEF;&#x7684;&#x9875;&#x9762;&#x6216;&#x8005;&#x5E94;&#x7528;&#xFF0C;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x5168;&#x80FD;&#x578B;&#x9009;&#x624B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5927;&#x5BB6;&#x4E5F;&#x4E0D;&#x7528;&#x88AB;&#x5413;&#x5230;&#xFF0C;&#x5343;&#x91CC;&#x4E4B;&#x884C;&#x59CB;&#x4E8E;&#x8DB3;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x725B;&#x4EBA;&#x90FD;&#x662F;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x4E00;&#x6B65;&#x6B65;&#x7684;&#x8D70;&#x8FC7;&#x6765;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x76F2;&#x76EE;&#x7684;&#x6BD4;&#x8F83;&#x6216;&#x8005;&#x7ED9;&#x81EA;&#x5DF1;&#x5F92;&#x589E;&#x538B;&#x529B;&#xFF0C;&#x53EA;&#x8981;&#x4F60;&#x559C;&#x6B22;&#x5B83;&#xFF0C;&#x575A;&#x6301;&#x5B66;&#x4E60;&#x548C;&#x8FDB;&#x6B65;&#xFF0C;&#x5B9A;&#x80FD;&#x6709;&#x6240;&#x6210;&#x3002;</p>
<p>&#x5728;&#x5982;&#x4ECA;&#x8FD9;&#x4E2A;&#x8BA9;&#x4EBA;&#x773C;&#x82B1;&#x7F2D;&#x4E71;&#x7684;&#x524D;&#x7AEF;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x4E0D;&#x8BBA;&#x4F60;&#x662F;&#x65B0;&#x624B;&#x8FD8;&#x662F;&#x534A;&#x751F;&#x4E0D;&#x719F;&#xFF0C;&#x90FD;&#x4F1A;&#x5BF9;&#x9009;&#x62E9;&#x6709;&#x6240;&#x8FF7;&#x832B;&#xFF0C;&#x8BED;&#x8A00;&#x7684;&#x8FF7;&#x832B;&#xFF0C;&#x6846;&#x67B6;&#x3001;&#x5DE5;&#x5177;&#x7684;&#x8FF7;&#x832B;&#xFF0C;&#x4E66;&#x672C;&#x7684;&#x8FF7;&#x832B;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x8FF7;&#x832B;&#xFF0C;&#x600E;&#x6837;&#x4E0D;&#x8FF7;&#x832B;&#xFF1F;&#x552F;&#x6709;&#x884C;&#x52A8;&#x8D77;&#x6765;&#xFF0C;&#x8D70;&#x8FD1;&#x5B83;&#xFF0C;&#x719F;&#x6089;&#x5B83;&#x3002;&#x804C;&#x4E1A;&#x6253;&#x62FC;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x63A2;&#x7D22;&#x3001;&#x79EF;&#x7D2F;&#x3001;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8B;&#x7269;&#x7684;&#x8BA4;&#x77E5;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x300A;&#x751F;&#x547D;&#x4E2D;&#x4E0D;&#x80FD;&#x627F;&#x53D7;&#x4E4B;&#x8F7B;&#x300B;&#x91CC;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x201C;&#x4EBA;&#x7C7B;&#x4E00;&#x601D;&#x8003;&#xFF0C;&#x4E0A;&#x5E1D;&#x5C31;&#x53D1;&#x7B11;&#x201D;&#x3002;&#x6709;&#x4EBA;&#x8BF4;&#x662F;&#x5632;&#x7B11;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x662F;&#x9F13;&#x52B1;&#xFF0C;&#x6211;&#x66F4;&#x613F;&#x610F;&#x76F8;&#x4FE1;&#x662F;&#x9F13;&#x52B1;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x505A;&#x4E8B;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x8FC7;&#x5F80;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x601D;&#x8003;&#xFF0C;&#x4F7F;&#x5F97;&#x4EE5;&#x540E;&#x505A;&#x540C;&#x6837;&#x4E8B;&#x60C5;&#x7684;&#x65F6;&#x5019;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x548C;&#x806A;&#x660E;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x8D8A;&#x6765;&#x8D8A;&#x4F18;&#x79C0;&#x7684;&#x7406;&#x7531;&#x3002;</p>
<p>&#x6700;&#x540E;&#x63A8;&#x8350;&#x51E0;&#x4F4D;&#x5728;CSS&#x65B9;&#x9762;&#x9887;&#x6709;&#x7814;&#x7A76;&#x7684;&#x5927;&#x725B;&#xFF0C;&#x5927;&#x6F20;&#x3001;&#x6797;&#x5C0F;&#x5FD7;&#x3001;CSS&#x9B54;&#x6CD5;&#x3001;&#x5F20;&#x946B;&#x65ED;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x5F88;&#x591A;&#x4EBA;&#x5DF2;&#x7ECF;&#x719F;&#x8BC6;&#xFF0C;&#x9AD8;&#x624B;&#x80AF;&#x5B9A;&#x4E0D;&#x6B62;&#x8FD9;&#x56DB;&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x56DB;&#x4F4D;&#x662F;&#x8FD1;&#x5E74;&#x6765;&#x5728;CSS&#x9886;&#x57DF;&#x6700;&#x4E3A;&#x9AD8;&#x4EA7;&#x3001;&#x6700;&#x6709;&#x5EFA;&#x6811;&#xFF0C;&#x7ED9;&#x5927;&#x5BB6;&#x5E26;&#x6765;&#x6700;&#x591A;&#x5E2E;&#x52A9;&#x7684;&#x884C;&#x4E1A;&#x524D;&#x8F88;&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x70B9;&#x5173;&#x6CE8;&#x4E0B;&#x3002;</p>
<p>&#x7EC8;&#x4E8E;&#x628A;&#x8BB8;&#x8BFA;&#x5927;&#x5BB6;&#x7684;&#x6587;&#x7AE0;&#x7248;&#x7ED9;&#x5B8C;&#x6210;&#x4E86;&#xFF0C;&#x5F88;&#x957F;&#xFF0C;&#x8981;&#x5410;&#x8840;&#x4E86;~&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5BF9;&#x4F60;&#x4EEC;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x5FC3;&#x8840;&#x4E4B;&#x4F5C;&#xFF0C;&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#xFF0C;&#x8C22;&#x7EDD;&#x8F6C;&#x8F7D;&#xFF0C;&#x8C22;&#x8C22;&#x3002;</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/分享交流/" rel="tag">#分享交流</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/21/javascript-study-six/" rel="next" title="征服javascript学习笔记（六）——面向对象的程序设计之创建对象">
                <i class="fa fa-chevron-left"></i> 征服javascript学习笔记（六）——面向对象的程序设计之创建对象
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/12/18/css_conf_2016/" rel="prev" title="第三届CSS中国开发者大会纪实">
                第三届CSS中国开发者大会纪实 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#话题由来"><span class="nav-number">1.</span> <span class="nav-text">话题由来</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#认识UI开发"><span class="nav-number">2.</span> <span class="nav-text">认识UI开发</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#重新强调Web标准"><span class="nav-number">3.</span> <span class="nav-text">重新强调Web标准</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#CSS设计模式的思考"><span class="nav-number">4.</span> <span class="nav-text">CSS设计模式的思考</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#工具，让开发更敏捷"><span class="nav-number">5.</span> <span class="nav-text">工具，让开发更敏捷</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#怎样成为一名优秀的UI工程师？"><span class="nav-number">6.</span> <span class="nav-text">怎样成为一名优秀的UI工程师？</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#写在最后"><span class="nav-number">7.</span> <span class="nav-text">写在最后</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
