<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="思考," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x6807;&amp;#x9898;&amp;#x5B9A;&amp;#x4E3A;&amp;#x81EA;&amp;#x5B66;&amp;#x8005;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x5B83;&amp;#x662F;&amp;#x5BFC;&amp;#x706B;&amp;#x7D22;&amp;#xFF0C;&amp;#x4F46;&amp;#x6587;&amp;#x7AE0;&amp;#x4E0D;&amp;#x662F;&amp;#x4E00;&amp;#x5929;&amp;#x5EFA;&amp;#x6210;">
<meta property="og:type" content="article">
<meta property="og:title" content="自学者需要具备的基本技能和素质">
<meta property="og:url" content="http://yoursite.com/2015/12/14/自学者需要具备的基本技能和素质/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x6807;&amp;#x9898;&amp;#x5B9A;&amp;#x4E3A;&amp;#x81EA;&amp;#x5B66;&amp;#x8005;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x5B83;&amp;#x662F;&amp;#x5BFC;&amp;#x706B;&amp;#x7D22;&amp;#xFF0C;&amp;#x4F46;&amp;#x6587;&amp;#x7AE0;&amp;#x4E0D;&amp;#x662F;&amp;#x4E00;&amp;#x5929;&amp;#x5EFA;&amp;#x6210;">
<meta property="og:updated_time" content="2016-02-24T12:57:30.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="自学者需要具备的基本技能和素质">
<meta name="twitter:description" content="&amp;#x6807;&amp;#x9898;&amp;#x5B9A;&amp;#x4E3A;&amp;#x81EA;&amp;#x5B66;&amp;#x8005;&amp;#xFF0C;&amp;#x56E0;&amp;#x4E3A;&amp;#x5B83;&amp;#x662F;&amp;#x5BFC;&amp;#x706B;&amp;#x7D22;&amp;#xFF0C;&amp;#x4F46;&amp;#x6587;&amp;#x7AE0;&amp;#x4E0D;&amp;#x662F;&amp;#x4E00;&amp;#x5929;&amp;#x5EFA;&amp;#x6210;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 自学者需要具备的基本技能和素质 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                自学者需要具备的基本技能和素质
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-12-14T00:00:00+08:00" content="2015-12-14">
              2015-12-14
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6807;&#x9898;&#x5B9A;&#x4E3A;&#x81EA;&#x5B66;&#x8005;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x5BFC;&#x706B;&#x7D22;&#xFF0C;&#x4F46;&#x6587;&#x7AE0;&#x4E0D;&#x662F;&#x4E00;&#x5929;&#x5EFA;&#x6210;&#x7684;&#xFF0C;&#x5199;&#x7740;&#x5199;&#x7740;&#x5B83;&#x5C31;&#x201C;&#x80D6;&#x201D;&#x4E86;&#xFF0C;&#x8001;&#x5C11;&#x7686;&#x5B9C;&#x4E86;~&#x54C8;&#x3002;&#x4E0B;&#x9762;&#x6B63;&#x6587;</p>
<h2 id="&#x5982;&#x9965;&#x4F3C;&#x6E34;"><a href="#&#x5982;&#x9965;&#x4F3C;&#x6E34;" class="headerlink" title="&#x5982;&#x9965;&#x4F3C;&#x6E34;"></a>&#x5982;&#x9965;&#x4F3C;&#x6E34;</h2><p>&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x79CD;&#x884C;&#x4E3A;&#x8868;&#x73B0;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x6070;&#x6070;&#x8868;&#x73B0;&#x51FA;&#x4E86;&#x5F3A;&#x70C8;&#x7684;&#x5B66;&#x4E60;&#x6B32;&#x671B;&#xFF0C;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x4F5C;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x79EF;&#x7D2F;&#x4E0D;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x63A5;&#x89E6;&#x4E0D;&#x5230;&#x7684;&#x5462;&#xFF1F;&#x90FD;&#x53EA;&#x662F;&#x65F6;&#x95F4;&#x95EE;&#x9898;&#x3002;&#x7B80;&#x5355;&#x7528;&#x4E24;&#x4E2A;&#x5B57;&#x5F62;&#x5BB9;&#x5C31;&#x662F;&#xFF1A;&#x70ED;&#x7231;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5F88;&#x80AF;&#x5B9A;&#x7684;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x505A;&#x7684;&#x6216;&#x8005;&#x73B0;&#x5728;&#x5B66;&#x7684;&#x5C31;&#x662F;&#x559C;&#x6B22;&#x7684;&#xFF0C;&#x6211;&#x95EE;&#x8FC7;&#x5F88;&#x591A;&#x670B;&#x53CB;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x60F3;&#x4E0D;&#x51FA;&#x6765;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#xFF0C;&#x8981;&#x4E48;&#x662F;&#x559C;&#x6B22;&#x7684;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x5E72;&#x4EC0;&#x4E48;&#xFF0C;&#x7D22;&#x6027;&#x5C31;&#x5C1A;&#x672A;&#x505A;&#x51FA;&#x9009;&#x62E9;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x5F98;&#x5F8A;&#x3001;&#x72B9;&#x8C6B;&#xFF0C;&#x7136;&#x540E;&#x663E;&#x5F97;&#x505A;&#x54EA;&#x4E2A;&#x90FD;&#x6CA1;&#x6709;&#x5F88;&#x5F3A;&#x7684;&#x6FC0;&#x60C5;&#x548C;&#x5E72;&#x52B2;&#x513F;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x591A;&#x5570;&#x55E6;&#x51E0;&#x53E5;&#x6765;&#x8BF4;&#x8BF4;&#x6211;&#x662F;&#x600E;&#x4E48;&#x505A;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x6211;&#x662F;&#x4E2A;&#x7231;&#x597D;&#x633A;&#x591A;&#x7684;&#x4EBA;&#xFF0C;&#x7A0D;&#x5FAE;&#x5217;&#x51FA;&#x6765;&#x51E0;&#x4E2A;&#xFF1A;&#x6587;&#x5B57;&#x3001;&#x97F3;&#x4E50;&#x3001;&#x8FD0;&#x52A8;&#x3002;&#x66FE;&#x60F3;&#x6210;&#x4E3A;&#x4F5C;&#x5BB6;&#xFF0C;&#x66FE;&#x60F3;&#x5B66;&#x5409;&#x4ED6;&#x3001;&#x94A2;&#x7434;&#xFF0C;&#x8FD8;&#x5B9A;&#x4E0B;&#x4E86;30&#x5C81;&#x6210;&#x4E3A;&#x4E9A;&#x6D32;&#x9876;&#x7EA7;&#x6B4C;&#x624B;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x8FD8;&#x66FE;&#x60F3;&#x6210;&#x4E3A;&#x8FD0;&#x52A8;&#x5458;&#xFF08;&#x4F53;&#x64CD;&#x3001;&#x4E52;&#x4E53;&#x7403;&#x3001;&#x77ED;&#x8DD1;&#x7B49;&#xFF09;&#x3002;&#x53EF;&#x662F;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x80FD;&#x517C;&#x987E;&#x8FD9;&#x6240;&#x6709;&#xFF0C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x50CF;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x3001;&#x8FBE;&#x82AC;&#x5947;&#x3001;&#x725B;&#x987F;&#x90A3;&#x6837;&#x6709;&#x7740;&#x5F00;&#x6302;&#x7684;&#x4EBA;&#x751F;&#x3002;&#x7136;&#x540E;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x8BF4;&#x76F4;&#x63A5;&#x4E00;&#x70B9;&#xFF0C;&#x54EA;&#x4E9B;&#x4E1C;&#x897F;&#x4F5C;&#x4E3A;&#x8C0B;&#x751F;&#x7684;&#x804C;&#x4E1A;&#xFF0C;&#x54EA;&#x4E9B;&#x4F5C;&#x4E3A;&#x5E73;&#x65F6;&#x7684;&#x7231;&#x597D;&#x5076;&#x5C14;&#x4E3A;&#x4E4B;&#x6216;&#x8005;&#x5173;&#x6CE8;&#xFF0C;&#x4F5C;&#x4E3A;&#x751F;&#x6D3B;&#x7684;&#x8C03;&#x5473;&#x5242;&#x3002;&#x8FD9;&#x4E2A;&#x8981;&#x5206;&#x6E05;&#xFF0C;&#x4E0D;&#x662F;&#x559C;&#x6B22;&#x4EC0;&#x4E48;&#x5C31;&#x5168;&#x90FD;&#x8981;&#x505A;&#x51FA;&#x4EC0;&#x4E48;&#x6210;&#x5C31;&#x3002;</p>
<p>&#x6211;&#x7684;&#x9009;&#x62E9;&#x6807;&#x51C6;&#x662F;&#xFF0C;&#x7ED3;&#x5408;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x60C5;&#x548C;&#x81EA;&#x8EAB;&#x5177;&#x5907;&#x7684;&#x4E00;&#x4E9B;&#x7D20;&#x8D28;&#x548C;&#x5929;&#x5206;&#xFF0C;&#x6765;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;</p>
<p>&#x6587;&#x5B57;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x559C;&#x6B22;&#x67D0;&#x4E9B;&#x65F6;&#x5019;&#x8E66;&#x51FA;&#x6765;&#x4E9B;&#x8BB8;&#x7075;&#x611F;&#xFF0C;&#x7136;&#x540E;&#x5F88;&#x4EAB;&#x53D7;&#x7684;&#x6325;&#x6D12;&#x51FA;&#x6765;&#xFF0C;&#x6563;&#x6587;&#x3001;&#x6742;&#x6587;&#x3001;&#x8BD7;&#x6B4C;&#x3001;&#x968F;&#x7B14;&#x7B49;&#x3002;&#x7528;&#x6765;&#x8868;&#x8FBE;&#x60C5;&#x611F;&#xFF0C;&#x6292;&#x53D1;&#x611F;&#x53D7;&#xFF0C;&#x5C0F;&#x5C0F;&#x7684;&#x611F;&#x52A8;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#xFF0C;&#x6216;&#x8005;&#x88C5;&#x4E00;&#x4E0B;&#x6587;&#x827A;&#x9752;&#x5E74;~</p>
<p>&#x97F3;&#x4E50;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x542C;&#x597D;&#x542C;&#x7684;&#x97F3;&#x4E50;&#xFF0C;&#x4E5F;&#x559C;&#x6B22;&#x54FC;&#x5531;&#xFF0C;&#x4E5F;&#x8868;&#x6F14;&#x8FC7;&#x591A;&#x6B21;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x64C5;&#x957F;&#x5531;&#x6B4C;&#x7684;&#x4EBA;&#xFF0C;&#x55D3;&#x5B50;&#x6761;&#x4EF6;&#x4E0D;&#x7B97;&#x597D;&#xFF0C;&#x4E50;&#x5668;&#x90FD;&#x4E0D;&#x4F1A;&#xFF0C;&#x5BF9;&#x90A3;&#x4E9B;&#x97F3;&#x51C6;&#x548C;&#x4E94;&#x7EBF;&#x8C31;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x611F;&#x5192;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x989C;&#x503C;&#x4E5F;&#x662F;&#x786C;&#x4F24;&#xFF08;&#x8FD9;&#x4E2A;&#x4E0D;&#x8C08;~&#xFF09;</p>
<p>&#x8FD0;&#x52A8;&#x5458;&#xFF0C;&#x6211;&#x559C;&#x6B22;&#x8FD0;&#x52A8;&#xFF0C;&#x5F88;&#x591A;&#xFF0C;&#x5404;&#x79CD;&#x7403;&#xFF0C;&#x7530;&#x5F84;&#x3001;&#x4F53;&#x64CD;&#x3001;&#x6E38;&#x6CF3;&#x7B49;&#xFF0C;&#x6709;&#x4E9B;&#x662F;&#x81EA;&#x5DF1;&#x505A;&#xFF0C;&#x6709;&#x4E9B;&#x53EA;&#x662F;&#x5173;&#x6CE8;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x5982;&#x76F4;&#x63A5;&#x8BF4;&#x6211;&#x662F;&#x559C;&#x6B22;&#x8FD0;&#x52A8;&#x4E4B;&#x7F8E;&#xFF0C;&#x4F53;&#x64CD;&#x6CA1;&#x6761;&#x4EF6;&#x7EC3;&#xFF0C;&#x4FEF;&#x5367;&#x6491;&#x3001;&#x5355;&#x53CC;&#x6760;&#x90FD;&#x73A9;&#x513F;&#x8FC7;&#xFF0C;&#x8FD0;&#x52A8;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x4FDD;&#x6301;&#x5065;&#x5EB7;&#xFF0C;&#x5065;&#x7F8E;&#xFF0C;&#x9971;&#x6EE1;&#x7CBE;&#x795E;&#x52B2;&#x513F;&#x3002;and so what&#xFF1F;&#x540C;&#x6837;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x5929;&#x8D4B;&#xFF0C;&#x8DD1;&#x3001;&#x8DF3;&#x3001;&#x8EAB;&#x9AD8;&#x3001;&#x67D4;&#x97E7;&#x6027;&#x2026;&#x4E00;&#x4E2A;&#x51FA;&#x7C7B;&#x62D4;&#x8403;&#x7684;&#x90FD;&#x6CA1;&#x6709;&#xFF0C;&#x90A3;&#x4E9B;&#x6709;&#x70B9;&#x5929;&#x8D4B;&#x7684;&#x90FD;&#x4F1A;&#x7EC3;&#x51E0;&#x5E74;&#x56E0;&#x4E3A;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x6211;&#x5C31;&#x66F4;&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x6240;&#x4EE5;&#x2026;</p>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x51E0;&#x4E2A;&#xFF0C;&#x5F88;&#x663E;&#x7136;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x5177;&#x5907;&#x88AB;&#x6211;&#x9009;&#x4F5C;&#x804C;&#x4E1A;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x6211;&#x4E0D;&#x4F1A;&#x88AB;&#x8FEB;&#x53BB;&#x505A;&#x4E00;&#x4EF6;&#x4E0D;&#x80FD;&#x6709;&#x6301;&#x7EED;&#x9AD8;&#x8D28;&#x4EA7;&#x51FA;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x505A;&#x660E;&#x77E5;&#x4E0D;&#x64C5;&#x957F;&#x3001;&#x4E0D;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x6210;&#x7EE9;&#x7684;&#x4E8B;&#x3002;&#x6BCF;&#x4E2A;&#x4EBA;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x90FD;&#x80FD;&#x5224;&#x65AD;&#x51FA;&#x6765;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x6240;&#x7231;&#x5E76;&#x9002;&#x5408;&#x4F5C;&#x4E3A;&#x804C;&#x4E1A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5E94;&#x8BE5;&#x4E5F;&#x4E0D;&#x96BE;&#x3002;&#x4E3B;&#x8981;&#x7684;&#x4F5C;&#x4E3A;&#x804C;&#x4E1A;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x4F5C;&#x4E3A;&#x4E1A;&#x4F59;&#x7231;&#x597D;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x4F60;&#x67D0;&#x65B9;&#x9762;&#x6BD4;&#x8F83;&#x5F3A;&#xFF0C;&#x5F88;&#x4E13;&#x4E1A;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x662F;&#x4E2A;&#x591A;&#x624D;&#x591A;&#x827A;&#x80FD;&#x4E00;&#x8D77;&#x76F8;&#x4E92;&#x4EA4;&#x6D41;&#x3001;&#x5F00;&#x5F00;&#x73A9;&#x7B11;&#x5439;&#x5439;&#x725B;&#x76AE;&#x7684;&#x4EBA;&#xFF0C;&#x4F55;&#x4E50;&#x800C;&#x4E0D;&#x4E3A;&#xFF1F;~</p>
<h2 id="&#x987A;&#x85E4;&#x6478;&#x74DC;"><a href="#&#x987A;&#x85E4;&#x6478;&#x74DC;" class="headerlink" title="&#x987A;&#x85E4;&#x6478;&#x74DC;"></a>&#x987A;&#x85E4;&#x6478;&#x74DC;</h2><p>&#x4F55;&#x4E3A;&#x85E4;&#xFF0C;&#x4F55;&#x4E3A;&#x74DC;&#xFF1F;&#x5728;&#x8FD9;&#x4E2A;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x6253;&#x5F00;&#x7F51;&#x9875;&#xFF0C;&#x5230;&#x5904;&#x662F;&#x85E4;&#x2014;&#x2014;link&#xFF08;&#x94FE;&#x63A5;&#xFF09;&#xFF0C;&#x7FA4;&#x91CC;&#xFF0C;&#x793E;&#x533A;&#x7AD9;&#x70B9;&#x91CC;&#xFF0C;&#x901A;&#x5E38;&#x7531;&#x4E00;&#x4E2A;&#x94FE;&#x63A5;&#x53EF;&#x4EE5;&#x5230;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x96C6;&#x4E2D;&#x8425;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x522B;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x627E;&#x5230;&#x66F4;&#x591A;&#x7684;&#x7AD9;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x628A;&#x90A3;&#x7BC7;&#x6587;&#x7AE0;&#x6240;&#x5728;&#x7684;&#x7AD9;&#x70B9;&#x6536;&#x85CF;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C31;&#x662F;&#x74DC;&#x3002;&#x901A;&#x8FC7;&#x987A;&#x85E4;&#x6478;&#x74DC;&#xFF0C;&#x4F60;&#x80FD;&#x627E;&#x5230;&#x5F88;&#x591A;&#x610F;&#x5411;&#x4E0D;&#x5230;&#x7684;&#x597D;&#x4E1C;&#x897F;&#x3002;&#x4E0D;&#x8981;&#x5C0F;&#x770B;&#x8FD9;&#x4E2A;&#x80FD;&#x529B;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x662F;&#x5FAE;&#x5999;&#x7684;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x54EA;&#x4E2A;&#x74DC;&#x80FD;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x542F;&#x53D1;&#xFF0C;&#x80FD;&#x8BA9;&#x4F60;&#x91CD;&#x65B0;&#x8BA4;&#x8BC6;&#x4E00;&#x6837;&#x4E8B;&#x7269;&#xFF0C;&#x751A;&#x81F3;&#x8BA9;&#x4F60;&#x7ED3;&#x8BC6;&#x5230;&#x65B0;&#x670B;&#x53CB;&#xFF0C;&#x8FD9;&#x90FD;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<h2 id="&#x519C;&#x592B;&#x62FE;&#x7CAA;"><a href="#&#x519C;&#x592B;&#x62FE;&#x7CAA;" class="headerlink" title="&#x519C;&#x592B;&#x62FE;&#x7CAA;"></a>&#x519C;&#x592B;&#x62FE;&#x7CAA;</h2><p>&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x6700;&#x5F00;&#x59CB;&#x662F;&#x770B;&#x6709;&#x4E9B;&#x4E66;&#x4E0A;&#x9762;&#x5B66;&#x9738;&#x4ECB;&#x7ECD;&#x7684;&#x5B66;&#x4E60;&#x79EF;&#x7D2F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E00;&#x4E9B;&#x96F6;&#x788E;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x3001;&#x8BCD;&#x6C47;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x50CF;&#x662F;&#x6563;&#x843D;&#x4EBA;&#x95F4;&#x7684;&#x7CBE;&#x7075;&#x4E00;&#x6837;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x6089;&#x5FC3;&#x6536;&#x96C6;&#x624D;&#x80FD;&#x9010;&#x6E10;&#x7684;&#x4E30;&#x5BCC;&#x8D77;&#x6765;&#x3002;&#x8D70;&#x51FA;&#x6821;&#x56ED;&#xFF0C;&#x8FDB;&#x5165;&#x804C;&#x573A;&#x4E86;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x6216;&#x8BB8;&#x6CA1;&#x4EBA;&#x80FD;&#x7ED9;&#x4F60;&#x8BB2;&#x8BFE;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EBA;&#x80FD;&#x4E13;&#x95E8;&#x62BD;&#x51FA;&#x65F6;&#x95F4;&#x7ED9;&#x4F60;&#x6307;&#x5BFC;&#xFF0C;&#x4F46;&#x603B;&#x4F1A;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#x7ED9;&#x4F60;&#x4E00;&#x4E9B;&#x6307;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x8BFB;&#x6587;&#x7AE0;&#x6216;&#x8005;&#x770B;&#x4E66;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x7BC7;&#x6587;&#x548C;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x4F60;&#x89C9;&#x5F97;&#x53D7;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x80FD;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x4F46;&#x90A3;&#x6709;&#x9650;&#x7684;&#x4E00;&#x70B9;&#xFF0C;&#x6536;&#x8D77;&#x6765;&#xFF0C;&#x653E;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x50A8;&#x5907;&#x5E93;&#x91CC;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x7B14;&#x5C0F;&#x8D22;&#x5BCC;&#x3002;&#x519C;&#x592B;&#x62FE;&#x7CAA;&#xFF0C;&#x610F;&#x6307;&#xFF0C;&#x4E0D;&#x5E26;&#x6709;&#x592A;&#x591A;&#x6311;&#x5254;&#x7684;&#x773C;&#x5149;&#xFF0C;&#x4E5F;&#x4E0D;&#x53BB;&#x65E0;&#x89C6;&#x5C0F;&#x7684;&#x4E0D;&#x8D77;&#x773C;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x6837;&#x6162;&#x6162;&#x79EF;&#x7D2F;&#xFF0C;&#x5C31;&#x80FD;&#x6C47;&#x96C6;&#x5F88;&#x591A;&#x597D;&#x4E1C;&#x897F;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4ED3;&#x5E93;&#x91CC;&#x3002;</p>
<h2 id="&#x5F52;&#x7EB3;&#x6574;&#x7406;"><a href="#&#x5F52;&#x7EB3;&#x6574;&#x7406;" class="headerlink" title="&#x5F52;&#x7EB3;&#x6574;&#x7406;"></a>&#x5F52;&#x7EB3;&#x6574;&#x7406;</h2><p>&#x8BF4;&#x5B9E;&#x8BDD;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x6211;&#x8BFB;&#x9AD8;&#x4E2D;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x6709;&#x4E86;&#x6BD4;&#x8F83;&#x75DB;&#x7684;&#x9886;&#x609F;&#xFF0C;&#x4E3A;&#x4E86;&#x590D;&#x4E60;&#xFF0C;&#x4E3A;&#x4E86;&#x5907;&#x8003;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4E70;&#x4E00;&#x4E9B;&#x6559;&#x6750;&#x4E4B;&#x5916;&#x7684;&#xFF0C;&#x8F85;&#x52A9;&#x590D;&#x4E60;&#x548C;&#x7EC3;&#x4E60;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x8FD9;&#x79CD;&#x8D44;&#x6599;&#x53C8;&#x662F;&#x73B2;&#x7405;&#x6EE1;&#x76EE;&#x7684;&#xFF0C;&#x968F;&#x4FBF;&#x8D70;&#x8FDB;&#x4E00;&#x5BB6;&#x5B66;&#x6821;&#x9644;&#x8FD1;&#x7684;&#x4E66;&#x5E97;&#xFF0C;&#x5927;&#x7684;&#x5C0F;&#x7684;&#xFF0C;&#x8584;&#x7684;&#x539A;&#x7684;&#xFF0C;&#x7EA2;&#x7684;&#x7EFF;&#x7684;&#xFF0C;&#x90A3;&#x4E2A;&#x5168;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD8;&#x6709;&#x6A21;&#x62DF;&#x3001;&#x62BC;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x4E2A;&#x4E2A;&#x90FD;&#x4E70;&#x56DE;&#x53BB;&#x770B;&#xFF0C;&#x7CBE;&#x529B;&#x548C;&#x8D22;&#x529B;&#x90FD;&#x4E0D;&#x5141;&#x8BB8;&#xFF0C;&#x90A3;&#x6709;&#x6CA1;&#x6709;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#x6216;&#x8005;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x80FD;&#x628A;&#x6240;&#x6709;&#x60F3;&#x8981;&#x7684;&#x90FD;&#x6574;&#x7406;&#x5230;&#x4E00;&#x8D77;&#x5462;&#xFF1F;&#x6709;&#xFF0C;&#x90A3;&#x5F97;&#x81EA;&#x5DF1;&#x5199;~&#x5F00;&#x4E2A;&#x73A9;&#x7B11;&#x3002;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x53BB;&#x201C;&#x968F;&#x65F6;&#x968F;&#x5730;&#x201D;&#x7684;&#x7EC6;&#x5FC3;&#x7EC4;&#x7EC7;&#x6574;&#x7406;&#xFF0C;&#x7BA1;&#x7406;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x3002;</p>
<p>&#x6216;&#x8BB8;&#x6709;&#x4EBA;&#x8981;&#x8BF4;&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x4F60;&#x5728;&#x4E0A;&#x5B66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B66;&#x79D1;&#x77E5;&#x8BC6;&#xFF0C;&#x95E8;&#x7C7B;&#x4EC0;&#x4E48;&#x7684;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x5927;&#x591A;&#x4E5F;&#x6CA1;&#x6709;&#x6761;&#x4EF6;&#x548C;&#x65F6;&#x95F4;&#x4E0A;&#x7F51;&#xFF0C;&#x73B0;&#x5728;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x61C2;&#x7684;&#xFF0C;&#x627E;&#x5EA6;&#x5A18;&#x6216;&#x8005;&#x8C37;&#x6B4C;&#x4E0D;&#x5C31;&#x884C;&#x4E86;&#xFF1F; &#x662F;&#x7684;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x6700;&#x4F1F;&#x5927;&#x7684;&#x201C;&#x53D1;&#x660E;&#x201D;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x7ED9;&#x81EA;&#x5DF1;&#x6536;&#x96C6;&#x7684;&#x4E1C;&#x897F;&#x505A;&#x4E2A;&#x641C;&#x7D22;&#x4E0D;&#x592A;&#x73B0;&#x5B9E;&#xFF0C;&#x4F46;&#x6700;&#x8D77;&#x7801;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x2014;&#x2014;&#x628A;&#x5B83;&#x4EEC;&#x5F52;&#x7C7B;&#x6574;&#x7406;&#xFF0C;&#x5206;&#x7C7B;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x68B3;&#x7406;&#x81EA;&#x5DF1;&#x77E5;&#x8BC6;&#x7ED3;&#x6784;&#xFF0C;&#x5BF9;&#x5B83;&#x4EEC;&#x91CD;&#x65B0;&#x8BA4;&#x8BC6;&#x548C;&#x7406;&#x89E3;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x800C;&#x4E14;&#x5206;&#x7C7B;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x7F29;&#x5C0F;&#x6BCF;&#x6B21;&#x627E;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x6216;&#x8005;&#x501F;&#x52A9;&#x67D0;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x641C;&#x7D22;&#xFF0C;&#x8FD9;&#x6837;&#x5229;&#x4E8E;&#x6536;&#x96C6;&#x4E5F;&#x5229;&#x4E8E;&#x67E5;&#x627E;&#xFF0C;&#x65B9;&#x4FBF;&#x53C8;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4EEC;&#x4E3B;&#x52A8;&#x6574;&#x7406;&#x7684;&#xFF0C;&#x7ED3;&#x6784;&#x66F4;&#x6E05;&#x6670;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x4FBF;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x8BB0;&#x5FC6;&#xFF0C;&#x597D;&#x5904;&#x591A;&#x591A;&#x3002;</p>
<p><strong>&#x52E4;&#x3001;&#x52E4;&#x3001;&#x52E4;</strong></p>
<p><strong>&#x52E4;&#x4E8E;&#x5B9E;&#x8DF5;</strong></p>
<p>&#x52A8;&#x624B;&#x5B9E;&#x8DF5;&#xFF0C;&#x662F;&#x8BA9;&#x81EA;&#x5DF1;&#x5370;&#x8C61;&#x6700;&#x6DF1;&#x523B;&#xFF0C;&#x6700;&#x5FEB;&#x770B;&#x5230;&#x5B9E;&#x9645;&#x6548;&#x679C;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x80FD;&#x76F4;&#x63A5;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5927;&#x5BB6;&#x4E00;&#x76F4;&#x8BF4;&#x7406;&#x8BBA;&#x7ED3;&#x5408;&#x5B9E;&#x8DF5;&#xFF0C;&#x770B;&#x82B1;&#x5BB9;&#x6613;&#xFF0C;&#x7EE3;&#x82B1;&#x96BE;&#x3002;&#x6CA1;&#x6709;&#x5B9E;&#x8DF5;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF1B;&#x6CA1;&#x6709;&#x78B0;&#x5230;&#x8FC7;&#x95EE;&#x9898;&#x7684;&#x4EBA;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5B9E;&#x8DF5;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x8BF8;&#x591A;&#x4E0D;&#x8DB3;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x7406;&#x8BBA;&#x3002;&#x6700;&#x9002;&#x5408;&#x4F60;&#x7684;&#x5B66;&#x4E60;&#x8DEF;&#x7EBF;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x6765;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x4EC0;&#x4E48;&#x7F51;&#x7AD9;&#x3001;&#x6587;&#x7AE0;&#x91CC;&#x76F4;&#x63A5;&#x62FF;&#x6765;&#x7ED9;&#x81EA;&#x5DF1;&#x5B9A;&#x89C4;&#x5212;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5B9E;&#x8DF5;&#x4E0D;&#x6B62;&#x662F;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x638C;&#x63E1;&#x4E00;&#x95E8;&#x6280;&#x80FD;&#x7684;&#x6377;&#x5F84;&#xFF0C;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x89E3;&#x51B3;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#x7684;&#x4E0A;&#x4E58;&#x4E4B;&#x6CD5;&#xFF0C;&#x884C;&#x4E0D;&#x884C;&#xFF0C;&#x5BF9;&#x4E0D;&#x5BF9;&#xFF0C;&#x597D;&#x4E0D;&#x597D;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7ECF;&#x9A8C;&#x4E4B;&#x524D;&#xFF0C;just do it&#xFF01;~</p>
<p><strong>&#x52E4;&#x4E8E;&#x601D;&#x8003;</strong></p>
<p>&#x5B9E;&#x8DF5;&#x662F;&#x6211;&#x4EEC;&#x628A;&#x7406;&#x8BBA;&#x8F6C;&#x5316;&#x6210;&#x5B9E;&#x9645;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x505A;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x4E86;&#xFF0C;&#x4F46;&#x505A;&#x5F97;&#x80AF;&#x5B9A;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x52E4;&#x4E8E;&#x601D;&#x8003;&#xFF0C;&#x72AF;&#x8FC7;&#x7684;&#x9519;&#x4E0D;&#x518D;&#x72AF;&#xFF0C;&#x6240;&#x8C13;&#x5403;&#x4E00;&#x5811;&#x957F;&#x4E00;&#x667A;&#x3002;&#x4E0D;&#x4EC5;&#x662F;&#x6280;&#x672F;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x4E00;&#x65F6;&#x7684;&#x4E0D;&#x59A5;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x505A;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x505A;&#x9519;&#x4E8B;&#xFF0C;&#x4F1A;&#x53D7;&#x632B;&#xFF0C;&#x4F1A;&#x88AB;&#x6307;&#x8D23;&#xFF0C;&#x4F1A;&#x9762;&#x4E34;&#x5931;&#x8D25;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4F1A;&#x56F0;&#x60D1;&#xFF0C;&#x4F1A;&#x5426;&#x5B9A;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#xFF0C;&#x8FDB;&#x800C;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x505A;&#x6CD5;&#x52A0;&#x4EE5;&#x6539;&#x8FDB;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6709;&#x76CA;&#x7684;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x601D;&#x8003;&#x4E0D;&#x662F;&#x7B54;&#x6848;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x601D;&#x8003;&#x66F4;&#x52A0;&#x56F0;&#x60D1;&#xFF0C;&#x66F4;&#x52A0;&#x90C1;&#x95F7;&#xFF0C;&#x601D;&#x8003;&#x662F;&#x8FC7;&#x7A0B;&#xFF0C;&#x5728;&#x63A2;&#x5BFB;&#x7684;&#x8DEF;&#x4E0A;&#x4E0D;&#x65AD;&#x601D;&#x8003;&#xFF0C;&#x603B;&#x80FD;&#x6162;&#x6162;&#x7684;&#x62E8;&#x5F00;&#x8FF7;&#x96FE;&#x3002;</p>
<p><strong>&#x52E4;&#x4E8E;&#x603B;&#x7ED3;</strong></p>
<p>&#x6709;&#x4E86;&#x5B9E;&#x8DF5;&#xFF0C;&#x6709;&#x4E86;&#x601D;&#x8003;&#xFF0C;&#x505A;&#x5230;&#x8FD9;&#x4E24;&#x70B9;&#x5C31;&#x5DF2;&#x7ECF;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x4EEC;&#x79EF;&#x7D2F;&#x5230;&#x5F88;&#x591A;&#x7ECF;&#x9A8C;&#x3002;&#x4F46;&#x662F;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x8FD8;&#x7F3A;&#x5C11;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x628A;&#x5B83;&#x4EEC;&#x96C6;&#x4E2D;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E0D;&#x4EC5;&#x5916;&#x754C;&#x7684;&#x4E8B;&#x7269;&#x662F;&#x96F6;&#x6563;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5B58;&#x50A8;&#x5728;&#x5927;&#x8111;&#x6216;&#x8005;&#x4EE3;&#x7801;&#x91CC;&#x9762;&#x7684;&#x90A3;&#x4E9B;tips&#x4E5F;&#x662F;&#x96F6;&#x6563;&#x7684;&#xFF0C;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x662F;&#x6211;&#x4EEC;&#x5BF9;&#x4EE5;&#x524D;&#x505A;&#x8FC7;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5199;&#x8FC7;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8BB0;&#x4F4F;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x91CD;&#x65B0;&#x7684;&#x8BA4;&#x8BC6;&#x548C;&#x7406;&#x89E3;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x751A;&#x81F3;&#x80FD;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x4EE5;&#x524D;&#x6CA1;&#x6709;&#x5728;&#x610F;&#x8FC7;&#x7684;&#x70B9;&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x9010;&#x6E10;&#x6E05;&#x6670;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x80FD;&#x66F4;&#x6E05;&#x695A;&#x7684;&#x770B;&#x5230;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x548C;&#x533A;&#x522B;&#xFF0C;&#x6216;&#x8BB8;&#x6709;&#x65B0;&#x7684;&#x987F;&#x609F;&#x548C;&#x521B;&#x9020;&#xFF0C;&#x5C31;&#x66F4;&#x4E0A;&#x4E00;&#x5C42;&#x697C;&#x4E86;&#x3002;</p>
<p><strong>&#x8BB0;&#x5F55;&#x5206;&#x4EAB;</strong></p>
<p>&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#xFF0C;&#x662F;&#x4ECE;&#x81EA;&#x8EAB;&#x53BB;&#x770B;&#x5B66;&#x4E60;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x4EAB;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x5206;&#x4EAB;&#x662F;&#x76F8;&#x4E92;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5411;&#x522B;&#x4EBA;&#x5C55;&#x793A;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5B66;&#x4E60;&#x6210;&#x679C;&#xFF0C;&#x8BA9;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#xFF08;&#x53EF;&#x80FD;&#x6BD4;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x7684;&#x6DF1;&#xFF0C;&#x638C;&#x63E1;&#x7684;&#x66F4;&#x597D;&#xFF09;&#x7ED9;&#x6211;&#x4EEC;&#x6307;&#x51FA;&#x4E0D;&#x8DB3;&#xFF0C;&#x4E5F;&#x80FD;&#x8BA9;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#xFF08;&#x521A;&#x63A5;&#x89E6;&#x6216;&#x8005;&#x8FD8;&#x6CA1;&#x63A5;&#x89E6;&#xFF09;&#x6982;&#x89C8;&#x4E00;&#x4E0B;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x8BF1;&#x4EBA;&#x4E4B;&#x5904;&#x3002;&#x52A9;&#x4EBA;&#x4E3A;&#x4E50;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4ED6;&#x6709;&#x522B;&#x7684;&#x597D;&#x4E1C;&#x897F;&#x4E5F;&#x4F1A;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5462;&#xFF1F;&#x6B63;&#x6240;&#x8C13;&#xFF0C;&#x4E92;&#x76F8;&#x5E2E;&#x52A9;&#xFF0C;&#x4E92;&#x4E3A;&#x80A9;&#x8180;&#xFF01;</p>
<p><strong>&#x865A;&#x5FC3;&#x3001;&#x521D;&#x5FC3;</strong></p>
<p>&#x6211;&#x4EEC;&#x5E38;&#x8BF4;&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;&#xFF0C;&#x4F60;&#x7684;&#x521D;&#x5FC3;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x5728;&#x628A;&#x81EA;&#x5DF1;&#x505A;&#x7684;&#x9875;&#x9762;&#x7ED9;&#x975E;&#x540C;&#x884C;&#x670B;&#x53CB;&#x770B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F1A;&#x53D1;&#x51FA;&#x9635;&#x9635;&#x7684;&#x60CA;&#x53F9;&#xFF1A;&#x597D;&#x795E;&#x5947;&#xFF0C;&#x597D;&#x5389;&#x5BB3;&#xFF01;~</p>
<p>&#x5BF9;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x7684;&#x521D;&#x5FC3;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;&#x88AB;&#x5938;&#x5389;&#x5BB3;&#x662F;&#x521D;&#x5FC3;~&#x672C;&#x8EAB;&#x4E5F;&#x4E0D;&#x5389;&#x5BB3;&#x3002;&#x800C;&#x662F;&#x80FD;&#x505A;&#x51FA;&#x7F8E;&#x7684;&#x3001;&#x7565;&#x663E;&#x795E;&#x5947;&#x7684;&#x3001;&#x597D;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E0A;&#x53F8;&#x6216;&#x8005;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4E5F;&#x4E0D;&#x53EA;&#x662F;&#x7ED9;&#x7528;&#x6237;&#x4E00;&#x4E2A;&#x4EA4;&#x4EE3;&#xFF0C;&#x66F4;&#x5E94;&#x8BE5;&#x662F;&#x6211;&#x4EEC;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8981;&#x6C42;&#x3002;&#x505A;&#x6280;&#x672F;&#x7684;&#x4EBA;&#x4E0D;&#x8FFD;&#x6C42;&#x66F4;&#x597D;&#x770B;&#xFF0C;&#x66F4;&#x597D;&#x7528;&#xFF0C;&#x4EE3;&#x7801;&#x5199;&#x5F97;&#x66F4;&#x79D1;&#x5B66;&#xFF0C;&#x90A3;&#x4E0D;&#x5982;&#x4E0D;&#x505A;&#x54AF;~&#x81F3;&#x4E8E;&#x5F88;&#x591A;&#x4EBA;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x884C;&#x85AA;&#x6C34;&#x6BD4;&#x8F83;&#x53EF;&#x89C2;&#xFF0C;&#x90A3;&#x6015;&#x662F;&#x4F1A;&#x5C11;&#x5F88;&#x591A;&#x4E50;&#x8DA3;&#x5427;&#x3002;&#x8FD9;&#x4E9B;&#x5E74;&#xFF0C;&#x79D1;&#x6280;&#x8FDB;&#x6B65;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x8BBE;&#x8BA1;&#x7684;&#x98CE;&#x683C;&#x548C;&#x6F6E;&#x6D41;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#xFF0C;&#x6280;&#x672F;&#x8FED;&#x4EE3;&#x4E5F;&#x5FEB;&#xFF0C;&#x5927;&#x5BB6;&#x5728;&#x75B2;&#x4E8E;&#x8FFD;&#x8D76;&#x4E2D;&#xFF0C;&#x4E5F;&#x6709;&#x7ED9;&#x81EA;&#x5DF1;&#x6253;&#x9547;&#x9759;&#x5242;&#xFF0C;&#x5728;&#x4E0D;&#x5C11;&#x573A;&#x5408;&#x90FD;&#x4F1A;&#x63D0;&#x5230;&#x201C;&#x52FF;&#x5FD8;&#x521D;&#x5FC3;&#x201D;&#xFF0C;&#x201C;&#x6211;&#x4EEC;&#x771F;&#x6B63;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x201C;&#x95EE;&#x9898;&#x7684;&#x672C;&#x8D28;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#xFF0C;&#x201C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x597D;&#x7684;&#x5173;&#x952E;&#x662F;&#x4EC0;&#x4E48;&#x201D;&#x2026;&#x6709;&#x8FD9;&#x4E9B;&#xFF0C;&#x8BF4;&#x660E;&#x5927;&#x5BB6;&#x5728;&#x601D;&#x8003;&#xFF0C;&#x53BB;&#x8FC7;&#x6EE4;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x53BB;&#x5BBD;&#x6CDB;&#x800C;&#x76F2;&#x76EE;&#x7684;&#x8FFD;&#x6C42;&#xFF0C;&#x8FD9;&#x662F;&#x597D;&#x4E8B;&#x3002;</p>
<p>&#x865A;&#x5FC3;&#xFF0C;&#x5219;&#x662F;&#x9700;&#x8981;&#x4E00;&#x76F4;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x5BF9;&#x4E8E;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4ECE;&#x4E8B;&#x884C;&#x4E1A;&#x7684;&#x656C;&#x754F;&#x4E4B;&#x5FC3;&#xFF0C;&#x4F60;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x5B83;&#x7684;&#x5B58;&#x5728;&#x6216;&#x8005;&#x53D1;&#x5C55;&#x7684;&#x65F6;&#x95F4;&#x80AF;&#x5B9A;&#x6BD4;&#x4F60;&#x4ECE;&#x4E8B;&#x5B83;&#x7684;&#x65F6;&#x95F4;&#x8981;&#x957F;&#x5F88;&#x591A;&#xFF0C;&#x6709;&#x65E0;&#x6570;&#x7684;&#x524D;&#x8F88;&#x4EEC;&#x5DF2;&#x7ECF;&#x548C;&#x6B63;&#x5728;&#x4E3A;&#x4E4B;&#x94FA;&#x8DEF;&#xFF0C;&#x4E5F;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x8DDF;&#x4F60;&#x4E00;&#x6837;&#x6216;&#x66F4;&#x4F18;&#x79C0;&#x3001;&#x66F4;&#x8E0F;&#x5B9E;&#x7684;&#x4EBA;&#x5728;&#x505A;&#x51FA;&#x81EA;&#x5DF1;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x7684;&#x8D21;&#x732E;&#x3002;&#x7136;&#x800C;&#x4F60;&#x53EF;&#x80FD;&#x8FD8;&#x6CA1;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x81EA;&#x5DF1;&#x4F1A;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x5728;&#x4EC0;&#x4E48;&#x516C;&#x53F8;&#x5DE5;&#x4F5C;&#xFF0C;&#x88AB;&#x4EBA;&#x51A0;&#x4EE5;&#x4EC0;&#x4E48;&#x79F0;&#x53F7;&#xFF0C;&#x62FF;&#x591A;&#x9AD8;&#x85AA;&#x6C34;&#xFF0C;&#x8FD9;&#x90FD;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x90FD;&#x4E0D;&#x8981;&#x7FD8;&#x5C3E;&#x5DF4;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x4E0D;&#x4EE5;&#x4E3A;&#x7136;&#xFF0C;&#x6BD4;&#x4F60;&#x5389;&#x5BB3;&#xFF0C;&#x6BD4;&#x4F60;&#x4F4E;&#x8C03;&#xFF0C;&#x6BD4;&#x4F60;&#x52A1;&#x5B9E;&#x7684;&#x4EBA;&#x4E00;&#x76F4;&#x90FD;&#x5B58;&#x5728;&#xFF0C;&#x4ED6;&#x4EEC;&#x624D;&#x662F;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5B66;&#x4E60;&#x7684;&#x699C;&#x6837;&#x3002;</p>
<h2 id="&#x603B;&#x7ED3;"><a href="#&#x603B;&#x7ED3;" class="headerlink" title="&#x603B;&#x7ED3;"></a>&#x603B;&#x7ED3;</h2><p>&#x597D;&#x4E86;&#xFF0C;&#x5199;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;</p>
<p>&#x4E00;&#x4E2A;&#x662F;&#x6211;&#x81EA;&#x5DF1;&#x672C;&#x8EAB;&#x662F;&#x8FD9;&#x4E48;&#x6765;&#x7684;&#xFF0C;&#x5728;&#x8DDF;&#x5F88;&#x591A;&#x670B;&#x53CB;&#x4EA4;&#x6D41;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x8981;&#x4E48;&#x6CA1;&#x60F3;&#x6CD5;&#xFF0C;&#x8981;&#x4E48;&#x60F3;&#x6CD5;&#x592A;&#x591A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x9009;&#x62E9;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x6765;&#x8BF4;&#x627E;&#x5230;&#x65B9;&#x5411;&#x7684;&#x65F6;&#x95F4;&#x5C31;&#x633A;&#x665A;&#x7684;&#xFF08;&#x5F53;&#x65F6;&#x5DF2;&#x662F;&#x4E00;&#x540D;&#x9AD8;&#x9F84;&#x5927;&#x56DB;&#x751F;~&#xFF09;&#xFF0C;&#x4F46;&#x4E5F;&#x7B97;&#x53CA;&#x65F6;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x5199;&#x8FD9;&#x4E48;&#x4E00;&#x7BC7;&#x6709;&#x70B9;&#x65B9;&#x6CD5;&#x8BBA;&#x6027;&#x8D28;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x53C2;&#x8003;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x521A;&#x5165;&#x884C;&#xFF0C;&#x521A;&#x63A5;&#x89E6;&#x524D;&#x7AEF;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x8DDF;&#x6211;&#x5F53;&#x5E74;&#x4E00;&#x6837;&#xFF0C;&#x60F3;&#x5B66;&#x5417;&#xFF1F;&#x60F3;&#xFF01;&#x600E;&#x4E48;&#x5B66;&#x5462;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4E71;&#x649E;&#x3002;&#x6211;&#x8981;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF1F;&#x6211;&#x8981;&#x770B;&#x4EC0;&#x4E48;&#x4E66;&#x5462;&#xFF1F;&#x6211;&#x770B;&#x8FD9;&#x4E2A;&#x7F51;&#x7AD9;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5417;&#xFF1F;&#x8C01;&#x6709;**&#x7684;&#x89C6;&#x9891;&#x53EF;&#x4EE5;&#x7ED9;&#x6211;&#x63A8;&#x8350;&#x4E00;&#x4E0B;&#xFF1F;&#x7B49;&#x7B49;&#x3002;&#x662F;&#x7684;&#xFF0C;&#x5386;&#x53F2;&#x603B;&#x5728;&#x4E0D;&#x65AD;&#x91CD;&#x6F14;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E5F;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x5C31;&#x5DF2;&#x7ECF;&#x544A;&#x8BC9;&#x4F60;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x770B;&#x4F3C;&#x6709;&#x4E9B;&#x865A;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x662F;&#x201C;&#x6E14;&#x201D;&#xFF0C;&#x800C;&#x975E;&#x201C;&#x9C7C;&#x201D;&#xFF0C;&#x76F8;&#x4FE1;&#x6211;&#x8FD9;&#x4E48;&#x5F62;&#x5BB9;&#x4F60;&#x5C31;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x4EF7;&#x503C;&#x5728;&#x54EA;&#x513F;&#x4E86;&#x3002;</p>
<p>&#x626F;&#x5230;&#x8FD9;&#x513F;&#x5427;&#xFF0C;&#x9700;&#x8981;&#x4EA4;&#x6D41;&#x611F;&#x60C5;&#x7684;&#x8FF7;&#x832B;&#x9A9A;&#x5E74;&#xFF08;nv&#xFF09;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x627E;&#x6211;&#xFF0C;&#x7F16;&#x7A0B;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x7B97;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#x3002;&#x4E0B;&#x6B21;&#x89C1;</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/思考/" rel="tag">#思考</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/12/01/basic-layout/" rel="next" title="说说基本的布局观">
                <i class="fa fa-chevron-left"></i> 说说基本的布局观
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/01/01/2015-summary/" rel="prev" title="梦幻般的2015，更丰盈的2016">
                梦幻般的2015，更丰盈的2016 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#如饥似渴"><span class="nav-number">1.</span> <span class="nav-text">如饥似渴</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#顺藤摸瓜"><span class="nav-number">2.</span> <span class="nav-text">顺藤摸瓜</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#农夫拾粪"><span class="nav-number">3.</span> <span class="nav-text">农夫拾粪</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#归纳整理"><span class="nav-number">4.</span> <span class="nav-text">归纳整理</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#总结"><span class="nav-number">5.</span> <span class="nav-text">总结</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
