<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>你不该忽视的小问题之margin叠加篇 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">你不该忽视的小问题之margin叠加篇</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">你不该忽视的小问题之margin叠加篇</h1><div class="post-meta">Oct 3, 2014<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2014/10/03/你不该忽视的小问题之margin叠加篇/" href="/2014/10/03/你不该忽视的小问题之margin叠加篇/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#margin的叠加有三种方式"><span class="toc-number">1.</span> <span class="toc-text">margin的叠加有三种方式</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#1-父子元素（分2种情况）之间发生margin叠加的条件："><span class="toc-number">2.</span> <span class="toc-text">1.父子元素（分2种情况）之间发生margin叠加的条件：</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#2-兄弟元素之间发生外边距叠加的条件："><span class="toc-number">3.</span> <span class="toc-text">2.兄弟元素之间发生外边距叠加的条件：</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#什么情况下会创建BFC-——Block-Formatting-Context-（块格式化上下文）？"><span class="toc-number">4.</span> <span class="toc-text">什么情况下会创建BFC ——Block Formatting Context （块格式化上下文）？</span></a></li></ol></div></div><div class="post-content"><p>&#x5728;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;html&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4F1A;&#x7684;&#x4EBA;&#x90FD;&#x8BF4;&#x6700;&#x591A;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x5B66;&#x4F1A;&#x4E86;&#x3002;&#x5F53;&#x6211;&#x5B66;&#x4E60;css&#x5230;&#x4E86;&#x4E00;&#x5B9A;&#x9636;&#x6BB5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x89C9;&#x5F97;&#x4E5F;&#x633A;&#x5BB9;&#x6613;&#x7684;&#x5440;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x4EBA;&#x90FD;&#x505A;&#x4E86;&#x90A3;&#x4E48;&#x4E45;&#xFF0C;&#x8FD8;&#x5728;&#x90A3;&#x513F;&#x7814;&#x7A76;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x53BB;&#x5410;&#x69FD;jquery&#xFF0C;&#x8BF4;&#x5B83;&#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x5E08;&#x73A9;&#x513F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x524D;&#x7AEF;&#x6572;&#x4EE3;&#x7801;&#x7684;&#x4F60;&#x5E94;&#x8BE5;&#x53BB;&#x7814;&#x7A76;js&#x4EE5;&#x53CA;&#x5404;&#x79CD;&#x6846;&#x67B6;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7B49;&#x7B49;&#xFF0C;&#x53CD;&#x6B63;&#x4F60;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x5728;&#x641E;&#x7684;&#x4E1C;&#x897F;&#x522B;&#x4EBA;&#x542C;&#x4E86;&#x89C9;&#x5F97;&#x9AD8;&#x5927;&#x4E0A;&#x3001;&#x4E0D;&#x660E;&#x89C9;&#x5389;&#x5C31;&#x5BF9;&#x4E86;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x73B0;&#x8C61;&#x4E5F;&#x4E0D;&#x80FD;&#x8BF4;&#x4E0D;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD5;&#x7ADF;&#x8FD8;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x4E5F;&#x662F;&#x6D6E;&#x8E81;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x9AD8;&#x624B;&#x7528;&#x6811;&#x53F6;&#x90FD;&#x80FD;&#x6740;&#x4EBA;&#xFF0C;&#x4F60;&#x5374;&#x4E00;&#x76F4;&#x53EA;&#x60F3;&#x8981;&#x7EDD;&#x4E16;&#x597D;&#x5251;&#xFF0C;&#x5728;&#x9119;&#x89C6;&#x81EA;&#x5DF1;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x524D;&#x8FDB;&#x4E0D;&#x6B62;~&#x95EE;&#x9898;&#x662F;&#x4F60;&#x4E5F;&#x987A;&#x4FBF;&#x9119;&#x89C6;&#x4E86;&#x522B;&#x4EBA;&#xFF0C;&#x5475;&#x5475;&#x3002;</p>
<p>&#x6BCF;&#x79CD;&#x6280;&#x672F;&#x786E;&#x5B9E;&#x90FD;&#x5B58;&#x5728;&#x7740;&#x4E00;&#x4E9B;&#x4E0D;&#x8DB3;&#xFF0C;&#x4F46;&#x4EAE;&#x70B9;&#x4E5F;&#x7EDD;&#x5BF9;&#x662F;&#x5927;&#x4E8E;&#x4E0D;&#x8DB3;&#x7684;&#xFF0C;&#x8FD8;&#x8FDC;&#x6CA1;&#x5230;&#x88AB;&#x4F60;&#x8BF4;&#x70C2;&#x7684;&#x5730;&#x6B65;&#xFF0C;&#x4E0D;&#x7136;&#x5B83;&#x4E5F;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x6D41;&#x884C;&#x5E76;&#x4E14;&#x88AB;&#x4F60;&#x77E5;&#x9053;&#x548C;&#x613F;&#x610F;&#x5B66;&#x4E60;&#x3002;<br>&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#xFF0C;&#x56DE;&#x5230;&#x6B63;&#x9898;&#x2014;&#x2014;margin&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x5728;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x62FF;&#x4E00;&#x4E2A;&#x8BCD;&#x7528;&#x6765;&#x5F62;&#x5BB9;&#x663E;&#x793A;&#x5F02;&#x5E38;&#xFF0C;&#x53EB;&#x201C;bug&#x201D;&#x3002;bug&#x5B83;&#x4E5F;&#x5206;&#x4E3A;&#x201C;&#x4EBA;&#x4E3A;&#x201D;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x3002;margin&#x7684;&#x8FD9;&#x4E2A;&#x53E0;&#x52A0;&#x7B97;&#x4E0D;&#x7B97;&#x5462;&#xFF1F;~&#x5728;&#x9047;&#x5230;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7EDD;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x662F;&#x89C9;&#x5F97;&#x4E0D;&#x5BF9;&#x52B2;&#xFF0C;&#x6216;&#x8005;&#x4EE5;&#x4E00;&#x53E5;&#x201C;&#x5E94;&#x8BE5;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x95EE;&#x9898;&#x5427;&#x201C;&#x53BB;&#x6577;&#x884D;&#x8FC7;&#x53BB;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#x5BFB;&#x6C42;&#x771F;&#x76F8;&#x3002;</p>
<h2 id="margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;"><a href="#margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;" class="headerlink" title="margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;"></a>margin&#x7684;&#x53E0;&#x52A0;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;</h2><p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x6211;&#x89C9;&#x5F97;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x4F1A;&#x53BB;&#x5FFD;&#x89C6;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E24;&#x4E2A;&#x4E0A;&#x4E0B;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4E0A;&#x8FB9;&#x5143;&#x7D20;&#x7684;&#x4E0B;&#x5916;&#x8FB9;&#x8DDD;&#x4F1A;&#x4E0E;&#x4E0B;&#x8FB9;&#x5143;&#x7D20;&#x7684;&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#xFF0C;&#x53E0;&#x52A0;&#x7684;&#x610F;&#x601D;&#x4E0D;&#x662F;&#x4E8C;&#x8005;&#x76F8;&#x52A0;&#xFF0C;&#x800C;&#x662F;&#x53D6;&#x66F4;&#x5927;&#x8005;&#x3002;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p>&#x7EFF;&#x8272;&#x8FB9;&#x6846;&#x662F;h2&#x6807;&#x9898;&#xFF0C;&#x672A;&#x6D88;&#x9664;&#x5E95;&#x5916;&#x8FB9;&#x8DDD;&#xFF0C;&#x8BA1;&#x7B97;&#x4E4B;&#x540E;&#x8FD1;&#x4F3C;12px&#xFF0C;&#x4F46;&#x7EA2;&#x8272;&#x7BAD;&#x5934;&#x6240;&#x6807;&#x51FA;&#x7684;&#x5916;&#x8FB9;&#x8DDD;&#x4E3A;30px&#xFF0C;&#x662F;&#x84DD;&#x8272;&#x8FB9;&#x6846;&#x5BB9;&#x5668;&#x6240;&#x6DFB;&#x52A0;&#x7684;&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#x3002;&#x6B64;&#x4E3A;&#x4E0D;&#x540C;&#x5143;&#x7D20;&#x95F4;&#x7684;&#x4E0A;&#x4E0B;&#x91CD;&#x5408;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x6709;&#x5BB9;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5D4C;&#x5957;&#xFF0C;&#x7236;&#x5143;&#x7D20;&#x548C;&#x5B50;&#x5143;&#x7D20;&#x5916;&#x8FB9;&#x8DDD;&#x4E5F;&#x4F1A;&#x76F8;&#x53E0;&#x52A0;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6761;&#x4EF6;&#x662F;&#xFF0C;&#x4E2D;&#x95F4;&#x6CA1;&#x6709;&#x8FB9;&#x6846;&#x548C;&#x5916;&#x8FB9;&#x8DDD;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x5230;&#x5E95;&#x662F;&#x8C01;&#x6CA1;&#x6709;&#x8FB9;&#x6846;&#x6216;&#x8005;&#x5185;&#x8FB9;&#x8DDD;&#x5462;&#xFF0C;&#x7236;&#x5143;&#x7D20;&#x8FD8;&#x662F;&#x5B50;&#x5143;&#x7D20;&#xFF1F;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x6B64;&#x56FE;&#x4E2D;&#xFF0C;&#x84DD;&#x8272;&#x8FB9;&#x6846;30px&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#x672A;&#x53D8;&#x3002;&#x7EA2;&#x8272;&#x8FB9;&#x6846;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x4E86;50px&#x4E0A;&#x5916;&#x8FB9;&#x8DDD;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x628A;&#x7EA2;&#x8272;&#x8FB9;&#x6846;&#x7684;&#x4E0A;&#x8FB9;&#x6846;&#x53BB;&#x6389;&#x4E86;&#xFF0C;&#x4E5F;&#x6B63;&#x5E38;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x6B64;&#x56FE;&#x4E2D;&#xFF0C;&#x84DD;&#x8272;&#x8FB9;&#x6846;&#x53BB;&#x9664;&#xFF0C;&#x54C7;&#x5076;&#xFF0C;&#x7236;&#x5B50;&#x7D27;&#x7D27;&#x8D34;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#x4EB2;&#x5BC6;&#x65E0;&#x95F4;~&#x800C;&#x4E14;&#x7236;&#x5143;&#x7D20;&#x548C;&#x4E0A;&#x9762;&#x7684;&#x5143;&#x7D20;&#x7684;&#x8FB9;&#x8DDD;&#x53D8;&#x6210;&#x4E86;50px&#xFF01;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x7236;&#x5143;&#x7D20;&#x7684;&#x8FB9;&#x6846;~&#x90A3;&#x4E48;&#xFF0C;&#x52A0;&#x4E2A;&#x5185;&#x8FB9;&#x8DDD;&#x8BD5;&#x8BD5;&#x5462;&#xFF1F;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p>&#x54B1;&#x7ED9;&#x7236;&#x5143;&#x7D20;&#x52A0;&#x4E86;10px&#x7684;&#x5185;&#x8FB9;&#x8DDD;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x7236;&#x5B50;&#x53C8;&#x5206;&#x79BB;&#x4E86;&#x3002;&#x7531;&#x6B64;&#x53EF;&#x89C1;&#xFF0C;&#x5185;&#x8FB9;&#x8DDD;&#x4E5F;&#x662F;&#x53D6;&#x51B3;&#x4E8E;&#x7236;&#x5143;&#x7D20;&#x3002;<br>&#x5B50;&#x5143;&#x7D20;&#x52A0;&#x5185;&#x8FB9;&#x8DDD;&#x548C;&#x53BB;&#x9664;&#x8FB9;&#x6846;&#x7684;&#x60C5;&#x51B5;&#x5C31;&#x4E0D;&#x5728;&#x8FD9;&#x91CC;&#x8DDF;&#x5927;&#x5BB6;&#x5C55;&#x793A;&#x4E86;&#xFF0C;&#x5DF2;&#x6D4B;&#x5BF9;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x65E0;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x79CD;&#x5462;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x81EA;&#x5DF1;&#x8DDF;&#x81EA;&#x5DF1;&#x6253;&#x67B6;&#x3002;&#x540C;&#x6837;&#x8981;&#x6C42;&#x65E0;&#x8FB9;&#x6846;&#x548C;&#x5185;&#x8FB9;&#x8DDD;&#x3002;<br>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x65B9;&#x4FBF;&#x6211;&#x81EA;&#x5DF1;&#x7F62;&#x4E86;&#xFF0C;&#x54C8;&#x54C8;&#xFF09;&#xFF0C;&#x54B1;&#x5728;&#x521A;&#x624D;&#x90A3;&#x4E2A;&#x7EA2;&#x8272;&#x8FB9;&#x6846;&#x5BB9;&#x5668;&#x91CC;&#x52A0;&#x4E0A;&#x4E2A;&#x5BB9;&#x5668;</p>
<p>&#x4F60;&#x4E0D;&#x8BE5;&#x5FFD;&#x89C6;&#x7684;&#x5C0F;&#x95EE;&#x9898;&#x4E4B;margin&#x53E0;&#x52A0;&#x7BC7; - &#x7075;&#x611F; - linggan</p>
<p> &#x518D;&#x6F84;&#x6E05;&#x4E00;&#x4E0B;&#x7EAF;&#x5C5E;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x54C8;&#xFF0C;&#x8DDF;&#x53E6;&#x5916;&#x4FE9;&#x5BB9;&#x5668;&#x6CA1;&#x4EFB;&#x4F55;&#x5173;&#x7CFB;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x5BF9;&#x6BD4;&#x3002;&#x4E0D;&#x8FC7;&#x3002;&#x3002;&#x54A6;&#xFF0C;&#x4F60;&#x52A0;&#x7684;&#x662F;&#x5565;&#xFF1F;&#x5BB9;&#x5668;&#x5462;&#xFF1F;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x53EF;&#x4E0D;&#x597D;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#x600E;&#x4E48;&#x80FD;&#x660E;&#x767D;&#x5462;&#xFF1F;&#xFF01;<br>&#x597D;&#x5427;&#xFF0C;&#x5343;&#x4E07;&#x4E0D;&#x8981;&#x602A;&#x6211;&#xFF0C;&#x4E0B;&#x9762;&#x5206;&#x5F00;&#x89E3;&#x91CA;</p>
<p>&#x4E00;&#x3001;&#x81EA;&#x5DF1;&#x8DDF;&#x81EA;&#x5DF1;&#x6253;&#x67B6;&#x662F;&#x6709;&#x4E2A;&#x524D;&#x63D0;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#xFF0C;&#x5143;&#x7D20;&#x4E3A;&#x7A7A;&#xFF0C;&#x7A7A;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF0C;&#x5185;&#x5BB9;&#x4E3A;&#x7A7A;&#xFF0C;&#x800C;&#x4E14;&#x6CA1;&#x6709;&#x9AD8;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x4E0A;&#x4E0B;&#x5916;&#x8FB9;&#x8DDD;&#x5C31;&#x78B0;&#x9762;&#x4E86;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6253;&#x4E86;~&#x6240;&#x4EE5;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#x4E86;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x4F60;&#x8BF4;&#x4EC0;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#xFF0C;&#x4F46;&#x6211;&#x660E;&#x660E;&#x770B;&#x5230;&#x4E86;&#x554A;&#xFF0C;&#x7EA2;&#x8272;&#x5BB9;&#x5668;&#x4E0D;&#x662F;&#x88AB;&#x6491;&#x5F00;&#x4E86;&#x4E48;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5965;&#x5999;&#x6240;&#x5728;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x5728;&#x91CC;&#x9762;&#x653E;&#x4E86;&#x4FE9;&#x5BB9;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x90FD;&#x52A0;&#x4E86;&#x5916;&#x8FB9;&#x8DDD;&#xFF0C;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x90FD;&#x5404;&#x52A0;&#x4E86;30px&#x7684;&#x4E0A;&#x4E0B;&#x8FB9;&#x8DDD;&#xFF0C;&#x4EC0;&#x4E48;&#xFF1F;&#xFF01;&#x662F;&#x7684;&#xFF0C;&#x4F60;&#x6CA1;&#x770B;&#x9519;&#xFF0C;&#x7406;&#x8BBA;&#x4E0A;&#x8BB2;&#xFF0C;&#x8FD9;&#x91CC;&#x5E94;&#x8BE5;&#x6709;120px&#x50CF;&#x7D20;&#x7684;&#x9AD8;&#x5EA6;&#x51FA;&#x6765;&#xFF0C;&#x5C31;&#x7B97;&#x52A0;&#x4E0A;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x4E0A;&#x4E0B;&#x5143;&#x7D20;&#x7684;&#x8FB9;&#x8DDD;&#x4F1A;&#x53D1;&#x751F;&#x53E0;&#x52A0;&#xFF0C;&#x90A3;&#x4E5F;&#x6709;90px&#x5427;&#xFF1F;&#x597D;&#x5427;&#xFF0C;&#x54B1;&#x5C31;&#x7B97;&#x518D;&#x9000;&#x4E00;&#x6B65;&#x8BB2;&#xFF0C;&#x4E2D;&#x95F4;30px&#x4E5F;&#x6CA1;&#x4E86;&#xFF0C;&#x90A3;&#x54B1;&#x5F97;&#x6709;60px&#x5427;&#x81F3;&#x5C11;&#xFF0C;&#x53EF;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x6709;30px&#x4E86;&#xFF0C;&#x8FD9;&#x662F;&#x89C1;&#x4EBA;&#x6740;&#x4EBA;&#xFF0C;&#x89C1;&#x4F5B;&#x6740;&#x4F5B;&#x7684;&#x8282;&#x594F;&#x554A;&#xFF0C;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x7A7A;&#x767D;&#x4FE1;&#x606F;&#x91CF;&#x4E5F;&#x592A;&#x4E30;&#x5BCC;&#x4E86;&#x5427;&#xFF1F;&#x662F;&#x4E0D;&#x662F;&#x9189;&#x4E86;&#xFF1F;~&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x4E0D;&#x76F8;&#x4FE1;&#x5B83;&#x7684;&#x6B8B;&#x5FCD;&#xFF0C;&#x518D;&#x52A0;&#x51E0;&#x4E2A;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x7ED3;&#x679C;&#x76F8;&#x540C;&#xFF0C;&#x8FD8;&#x662F;30px&#x3002;</p>
<p>&#x53CB;&#x60C5;&#x63D0;&#x793A;&#xFF0C;&#x8FD9;&#x79CD;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x53EA;&#x662F;&#x5728;&#x666E;&#x901A;&#x6D41;&#x7684;&#x5757;&#x6846;&#x5143;&#x7D20;&#x624D;&#x5B58;&#x5728;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5782;&#x76F4;&#x5916;&#x8FB9;&#x8DDD;&#xFF01;&#x884C;&#x5185;&#x6846;&#x3001;&#x6D6E;&#x52A8;&#x6846;&#x3001;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x6846;&#xFF0C;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x53E0;&#x52A0;&#x7684;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;margin&#x53E0;&#x52A0;&#x7684;&#x4E8B;&#x513F;&#x54B1;&#x5C31;&#x5148;&#x8BF4;&#x5230;&#x8FD9;&#x513F;&#xFF0C;&#x5176;&#x4E2D;&#x5947;&#x5999;&#x8FD8;&#x5F97;&#x5404;&#x4F4D;&#x81EA;&#x5DF1;&#x53BB;&#x611F;&#x53D7;&#x4E86;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x5E94;&#x8BE5;&#x662F;&#x6781;&#x5C11;&#x4F1A;&#x78B0;&#x5230;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x7528;&#x9014;&#x7684;&#x7A7A;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x77E5;&#x9053;&#x7B2C;&#x4E00;&#x79CD;&#x800C;&#x4E0D;&#x77E5;&#x9053;&#x7B2C;&#x4E8C;&#x79CD;&#xFF0C;&#x90A3;&#x8BF7;&#x76F8;&#x4FE1;&#x4F60;&#x65E9;&#x665A;&#x4F1A;&#x78B0;&#x5230;&#x7B2C;&#x4E8C;&#x79CD;&#x7684;&#xFF0C;&#x78B0;&#x5230;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x7D22;&#x6027;&#x4E0D;&#x7528;&#x5916;&#x8FB9;&#x8DDD;&#x4E86;&#xFF1F;&#x8FD9;&#x7684;&#x786E;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x4F1A;&#x603B;&#x662F;&#x80FD;&#x8EB2;&#x8FC7;&#x53BB;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x662F;&#x6587;&#x7AE0;&#x5F00;&#x5934;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5F15;&#x5B50;&#x3002;&#x5176;&#x5B9E;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x6280;&#x672F;&#x6C34;&#x5E73;&#x7684;&#x63D0;&#x9AD8;&#x5C31;&#x5728;&#x4E8E;&#xFF0C;&#x4E0D;&#x8981;&#x52E4;&#x4E8E;&#x53BB;&#x8BF4;&#x201D;&#x77E5;&#x4E86;&#x201C;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x52E4;&#x4E8E;&#x53D1;&#x95EE;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x771F;&#x7684;&#x662F;&#x8FD9;&#x6837;&#x4E48;&#xFF1F;&#x8FD8;&#x53EF;&#x4EE5;&#x600E;&#x6837;&#xFF1F;&#x7136;&#x540E;&#x53BB;&#x5B9E;&#x8DF5;&#x3001;&#x9A8C;&#x8BC1;&#x3002;&#x518D;&#x8005;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4E0D;&#x4F1A;&#x662F;&#x5168;&#x9762;&#x7CFB;&#x7EDF;&#x7684;&#x5B66;&#x4E60;&#x4E86;&#x4E4B;&#x540E;&#x624D;&#x5F00;&#x59CB;&#x505A;&#x9875;&#x9762;&#x7684;&#xFF0C;&#x90FD;&#x4F1A;&#x65F6;&#x5E38;&#x5E26;&#x7740;&#x4E00;&#x79CD;&#x5174;&#x594B;&#x53BB;&#x5C1D;&#x8BD5;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x96BE;&#x514D;&#x53EA;&#x770B;&#x5230;&#x4E86;&#x77E5;&#x8BC6;&#x7684;&#x4E00;&#x9762;&#x800C;&#x6F0F;&#x6389;&#x4E86;&#x5176;&#x4ED6;&#xFF0C;&#x6216;&#x8005;&#x7406;&#x89E3;&#x4E0D;&#x5230;&#x4F4D;&#x3002;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#x5C31;&#x4F1A;&#x9047;&#x5230;&#x6240;&#x8C13;&#x7684;&#x201D;&#x74F6;&#x9888;&#x201C;~&#x65F6;&#x5E38;&#x7684;&#x53BB;&#x56DE;&#x987E;&#xFF0C;&#x6216;&#x8005;&#x591A;&#x627E;&#x8D44;&#x6599;&#x591A;&#x65B9;&#x5B66;&#x4E60;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x4E0D;&#x65AD;&#x53D1;&#x73B0;&#x81EA;&#x8EAB;&#x4E0D;&#x8DB3;&#xFF0C;&#x4E0D;&#x65AD;&#x8FDB;&#x6B65;&#xFF0C;&#x66F4;&#x5168;&#x9762;&#xFF0C;&#x529F;&#x592B;&#x66F4;&#x6DF1;&#x3002;&#x4E0E;&#x5927;&#x5BB6;&#x5171;&#x52C9;&#xFF01;~&#x6B22;&#x8FCE;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#x3002;</p>
<p>&#x53E6;&#x63A8;&#x8350;&#x300A;&#x7CBE;&#x901A;css&#xFF1A;&#x9AD8;&#x7EA7;web&#x6807;&#x51C6;&#x89E3;&#x51B3;&#x65B9;&#x6848;(&#x7B2C;2&#x7248;)&#x300B;&#x8FD9;&#x672C;&#x4E66;&#xFF0C;&#x66F4;&#x9002;&#x5408;&#x6709;&#x4E00;&#x5B9A;css&#x7F16;&#x5199;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x770B;&#xFF0C;&#x6536;&#x83B7;&#x4F1A;&#x66F4;&#x5927;</p>
<p>&#x56E0;&#x670B;&#x53CB;&#x63D0;&#x9192;&#xFF0C;&#x53C8;&#x53C2;&#x8003;&#x4E86;&#x4E00;&#x4E0B;&#x522B;&#x4EBA;&#x7684;&#x8D44;&#x6599;&#xFF0C;&#x5728;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#x65B9;&#x9762;&#x505A;&#x5982;&#x4E0B;&#x4FEE;&#x6B63;&#xFF1A;<br><a href="http://www.smallni.com/collapsing-margin/" target="_blank" rel="external">&#x76F8;&#x5173;&#x94FE;&#x63A5;</a></p>
<h2 id="1-&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"><a href="#1-&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;" class="headerlink" title="1.&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"></a>1.&#x7236;&#x5B50;&#x5143;&#x7D20;&#xFF08;&#x5206;2&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#x4E4B;&#x95F4;&#x53D1;&#x751F;margin&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;</h2><p>&#x7236;&#x5143;&#x7D20;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x53D1;&#x751F;margin-top&#x53E0;&#x52A0;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x521B;&#x5EFA;BFC&#xFF08;&#x6587;&#x7AE0;&#x5E95;&#x90E8;&#x5BF9;BFC&#x6709;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#xFF09;<br>&#x7236;&#x5143;&#x7D20;&#x548C;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x975E;&#x7A7A;&#x5185;&#x5BB9;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;border-top<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;padding-top</p>
<p>&#x7236;&#x5143;&#x7D20;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x53D1;&#x751F;margin-bottom&#x53E0;&#x52A0;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x521B;&#x5EFA;BFC<br>&#x7236;&#x5143;&#x7D20;height&#x4E3A;auto&#x3001;min-height&#x4E3A;0<br>&#x7236;&#x5143;&#x7D20;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x975E;&#x7A7A;&#x5185;&#x5BB9;<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;border-bottom<br>&#x7236;&#x5143;&#x7D20;&#x6CA1;&#x6709;padding-bottom</p>
<p>2&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x603B;&#x7ED3;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E0D;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x4E5F;&#x5C31;&#x663E;&#x5F97;&#x5F88;&#x5BB9;&#x6613;&#x4E86;&#xFF1A;</p>
<p>&#x4E3A;&#x7236;&#x5143;&#x7D20;&#x521B;&#x5EFA;BFC<br>&#x4E3A;&#x7236;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x76F8;&#x5E94;&#x7684;padding&#x6216;&#x8005;border</p>
<h2 id="2-&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"><a href="#2-&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;" class="headerlink" title="2.&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;"></a>2.&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x5916;&#x8FB9;&#x8DDD;&#x53E0;&#x52A0;&#x7684;&#x6761;&#x4EF6;&#xFF1A;</h2><p>&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x662F;float&#x5143;&#x7D20;<br>&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x662F;absolute&#x5143;&#x7D20;<br>&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x90FD;&#x4E0D;&#x662F;inline-block&#x5143;&#x7D20;</p>
<h2 id="&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC-&#x2014;&#x2014;Block-Formatting-Context-&#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC-&#x2014;&#x2014;Block-Formatting-Context-&#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC &#x2014;&#x2014;Block Formatting Context &#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;BFC &#x2014;&#x2014;Block Formatting Context &#xFF08;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF09;&#xFF1F;</h2><p>CSS &#x89C4;&#x8303;&#x8BF4;&#x660E;&#x4E86;&#x5728;&#x4E0B;&#x5217;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x521B;&#x5EFA;&#x65B0;&#x7684; block formatting context&#xFF1A;<br>&#x6D6E;&#x52A8;&#x5143;&#x7D20;&#xFF08;float: left | right&#xFF09;&#xFF1B;<br> &#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x5143;&#x7D20;&#xFF08;position: absolute | fixed&#xFF09;&#xFF1B;          &#x884C;&#x5185;&#x5757;&#x5143;&#x7D20;&#xFF08;display: inline-block&#xFF09;&#xFF1B;<br>&#x8868;&#x683C;&#x7684;&#x5355;&#x5143;&#x683C;&#xFF08;display: table-cells&#xFF0C;TD&#x3001;TH&#xFF09;&#xFF1B;  &#x8868;&#x683C;&#x7684;&#x6807;&#x9898;&#xFF08;display: table-captions&#xFF0C;CAPTION&#xFF09;&#xFF1B;<br>&#x2018;overflow&#x2019; &#x7279;&#x6027;&#x4E0D;&#x4E3A; visible &#x7684;&#x5143;&#x7D20;&#xFF08;&#x9664;&#x975E;&#x8BE5;&#x503C;&#x5DF2;&#x7ECF;&#x4F20;&#x64AD;&#x5230;viewport&#xFF09;&#xFF1B; &#x8868;&#x683C;&#x5143;&#x7D20;&#x521B;&#x5EFA;&#x7684; &#x201C;&#x533F;&#x540D;&#x6846;&#x201D;  </p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x201D;display:table&#x201D; &#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x4EA7;&#x751F; &#x201C;block formatting contexts&#x201D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x533F;&#x540D;&#x6846; 6&#xFF0C; &#x5176;&#x4E2D;&#x5305;&#x542B; &#x201C;display:table-cell&#x201D; &#x7684;&#x6846;&#x4F1A;&#x4EA7;&#x751F;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x3002; &#x603B;&#x4E4B;&#xFF0C;&#x5BF9;&#x4E8E; &#x201C;display:table&#x201D; &#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4EA7;&#x751F;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x662F;&#x533F;&#x540D;&#x6846;&#x800C;&#x4E0D;&#x662F; &#x201C;display:table&#x201D;<br>&#x6CE8;&#x610F;&#xFF0C;&#x662F;&#x8FD9;&#x4E9B;&#x5143;&#x7D20;&#x521B;&#x5EFA;&#x4E86;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x5B83;&#x4EEC;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x5757;&#x683C;&#x5F0F;&#x5316;&#x4E0A;&#x4E0B;&#x6587;&#x3002;</p>
<p>&#x4FEE;&#x6B63;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#xFF0C;&#x5177;&#x4F53;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x6B22;&#x8FCE;&#x5B66;&#x4E60;&#x4EA4;&#x6D41;&#xFF01;~</p>
</div><a data-url="http://yoursite.com/2014/10/03/你不该忽视的小问题之margin叠加篇/" data-id="cisd9dxzb001t4uqi219xkhut" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2014/10/05/border-image/" class="pre">轻松入门css3之border-image</a><a href="/2014/08/30/need-practice/" class="next">万丈高楼平地起——实践为王，应需而生</a></div><div data-thread-key="2014/10/03/你不该忽视的小问题之margin叠加篇/" data-title="你不该忽视的小问题之margin叠加篇" data-url="http://yoursite.com/2014/10/03/你不该忽视的小问题之margin叠加篇/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2014/10/03/你不该忽视的小问题之margin叠加篇/" data-title="你不该忽视的小问题之margin叠加篇" data-url="http://yoursite.com/2014/10/03/你不该忽视的小问题之margin叠加篇/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/成长，经历，思考/" style="font-size: 15px;">成长，经历，思考</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/08/17/tencent_oneyear/">总有一个地方，我们未曾到达——我的鹅厂周年记</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/15/readbook_seetheworld/">静静的打开一本书，你会看到新的世界</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>