<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>征服javascript学习笔记（一）——认识js | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">征服javascript学习笔记（一）——认识js</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">征服javascript学习笔记（一）——认识js</h1><div class="post-meta">Feb 25, 2016<span> | </span><span class="category"><a href="/categories/javascript学习笔记/">javascript学习笔记</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2016/02/25/javascript-study-one/" href="/2016/02/25/javascript-study-one/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#javascript可以做什么？"><span class="toc-number">1.</span> <span class="toc-text">javascript可以做什么？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#说到javascript时，我们经常谈什么"><span class="toc-number">2.</span> <span class="toc-text">说到javascript时，我们经常谈什么</span></a><ol class="toc-child"><li class="toc-item toc-level-3"><a class="toc-link" href="#ECMAScript"><span class="toc-number">2.1.</span> <span class="toc-text">ECMAScript</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#DOM"><span class="toc-number">2.2.</span> <span class="toc-text">DOM</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#BOM"><span class="toc-number">2.3.</span> <span class="toc-text">BOM</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#语句"><span class="toc-number">2.4.</span> <span class="toc-text">语句</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#对象"><span class="toc-number">2.5.</span> <span class="toc-text">对象</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#事件"><span class="toc-number">2.6.</span> <span class="toc-text">事件</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#值和变量"><span class="toc-number">2.7.</span> <span class="toc-text">值和变量</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#操作符"><span class="toc-number">2.8.</span> <span class="toc-text">操作符</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#赋值和比较"><span class="toc-number">2.9.</span> <span class="toc-text">赋值和比较</span></a></li></ol></li><li class="toc-item toc-level-2"><a class="toc-link" href="#小结"><span class="toc-number">3.</span> <span class="toc-text">小结</span></a></li></ol></div></div><div class="post-content"><p>&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x4E13;&#x6CE8;&#x5E76;&#x4E14;&#x70ED;&#x7231;&#x524D;&#x7AEF;(&#x4E5F;&#x597D;&#x610F;&#x601D;&#x8BF4;)&#x7684;&#x201C;&#x4F2A;&#x524D;&#x7AEF;&#x201D;&#xFF0C;js&#x4E00;&#x76F4;&#x662F;&#x6211;&#x5FC3;&#x4E2D;&#x7684;&#x75DB;&#xFF0C;&#x8BF4;&#x5B8C;&#x5168;&#x4E0D;&#x61C2;&#x5427;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x70B9;&#xFF0C;&#x80FD;&#x5199;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x7528;&#x8FC7;jquery&#x5199;&#x4EA4;&#x4E92;&#x548C;&#x903B;&#x8F91;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x52A8;&#x753B;&#xFF0C;&#x8BF4;&#x61C2;&#x5427;&#xFF0C;&#x4E0D;&#x7B97;&#xFF0C;&#x968F;&#x4FBF;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x90FD;&#x80FD;&#x96BE;&#x5012;&#x6211;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x7518;&#x5982;&#x6B64;&#x554A;&#xFF0C;&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x65E2;&#x7136;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x8981;&#x505A;&#x51FA;&#x4E00;&#x4E9B;&#x5B9E;&#x5B9E;&#x5728;&#x5728;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x628A;&#x5B83;&#x641E;&#x5B9A;&#x66F4;&#x5B9E;&#x5728;&#x7684;&#x4E86;&#x3002;&#x6545;&#x800C;&#xFF0C;&#x6211;&#x4F1A;&#x5728;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x628A;&#x4E00;&#x4E9B;&#x7B14;&#x8BB0;&#x3001;&#x5FC3;&#x5F97;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#xFF0C;&#x8D77;&#x540D;&#x201C;&#x5F81;&#x670D;javascript&#x201D;&#xFF0C;&#x4EE5;&#x4FBF;&#x81EA;&#x5DF1;&#x67E5;&#x770B;&#xFF0C;&#x6216;&#x8005;&#x4E5F;&#x4F1A;&#x5BF9;&#x67D0;&#x4E9B;&#x770B;&#x5230;&#x7684;&#x670B;&#x53CB;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x65E2;&#x7136;&#x662F;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B8C;&#x6574;&#x6027;&#x548C;&#x51C6;&#x786E;&#x6027;&#x5C31;&#x4E0D;&#x6562;&#x6253;&#x5305;&#x7968;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x53D1;&#x73B0;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x4E5F;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;&#x3002;&#x597D;&#x4E86;&#xFF0C;&#x4E0D;&#x5E9F;&#x8BDD;&#x4E86;&#xFF0C;&#x6B63;&#x9898;&#xFF1A;</p>
<p>&#x8981;&#x5B66;&#x4E00;&#x6837;&#x4E1C;&#x897F;&#xFF0C;&#x9996;&#x5148;&#x5F97;&#x6709;&#x4E00;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;js&#xFF0C;&#x6700;&#x76F4;&#x89C2;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x83AB;&#x8FC7;&#x4E8E;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x7528;html&#x642D;&#x597D;&#x4E86;&#x7F51;&#x7AD9;&#x7684;&#x9AA8;&#x67B6;&#x3001;&#x7528;css&#x7F8E;&#x5316;&#x4E86;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5462;&#xFF1F;&#x4F3C;&#x4E4E;&#x8FD8;&#x7F3A;&#x5C11;&#x4EC0;&#x4E48;&#xFF0C;&#x5BF9;&#x7684;&#xFF0C;js&#x6700;&#x521D;&#x7684;&#x4EA7;&#x751F;&#xFF0C;&#x5C31;&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x7ED9;&#x7F51;&#x9875;&#x6DFB;&#x52A0;&#x6D3B;&#x529B;&#x548C;&#x4EA4;&#x4E92;&#x6027;&#x7684;&#x3002;&#x81F3;&#x4E8E;java&#x548C;&#x957F;&#x5F97;&#x5F88;&#x50CF;&#x7684;javascript&#x8FD9;&#x54E5;&#x4FE9;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x76F8;&#x4FE1;&#x5927;&#x4F19;&#x90FD;&#x542C;&#x8FC7;&#x96F7;&#x5CF0;&#x5854;&#x7684;&#x6BB5;&#x5B50;&#xFF0C;&#x5C31;&#x4E0D;&#x5570;&#x55E6;&#x4E86;&#x3002;</p>
<h2 id="javascript&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#javascript&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="javascript&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;"></a>javascript&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;</h2><p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B83;&#xFF0C;&#x505A;&#x4E0D;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x77E5;&#x9053;&#x5B83;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#x4E86;&#x3002;</p>
<p>&#x4EA4;&#x4E92;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x9F20;&#x6807;&#x7684;&#x60AC;&#x505C;&#x548C;&#x70B9;&#x51FB;&#x7ED9;&#x4E88;&#x4E00;&#x5B9A;&#x7684;&#x54CD;&#x5E94;&#x548C;&#x53CD;&#x9988;&#xFF0C;&#x64CD;&#x4F5C;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#xFF1B;&#x8868;&#x5355;&#x9A8C;&#x8BC1;&#xFF1B;&#x63A7;&#x5236;&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;&#xFF1B;&#x5229;&#x7528;&#x81EA;&#x8EAB;&#x7684;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#x7279;&#x6027;&#xFF0C;&#x751F;&#x6210;&#x65F6;&#x949F;&#x3001;&#x65E5;&#x5386;&#x7B49;&#xFF1B;&#x8BBE;&#x7F6E;cookie&#xFF1B;&#x5373;&#x65F6;&#x6784;&#x5EFA;&#x9875;&#x9762;&#x6216;&#x8005;&#x521B;&#x5EFA;&#x57FA;&#x4E8E;web&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7B49;&#x3002;</p>
<h2 id="&#x8BF4;&#x5230;javascript&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8C08;&#x4EC0;&#x4E48;"><a href="#&#x8BF4;&#x5230;javascript&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8C08;&#x4EC0;&#x4E48;" class="headerlink" title="&#x8BF4;&#x5230;javascript&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8C08;&#x4EC0;&#x4E48;"></a>&#x8BF4;&#x5230;javascript&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x8C08;&#x4EC0;&#x4E48;</h2><p>&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;js&#x5B9E;&#x73B0;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<p><strong>&#x6838;&#x5FC3;(ECMAScript)&#x3001;DOM&#x3001;BOM</strong></p>
<h3 id="ECMAScript"><a href="#ECMAScript" class="headerlink" title="ECMAScript"></a>ECMAScript</h3><p>&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;web&#x6D4F;&#x89C8;&#x5668;&#x662F;ECMAScript&#x5B9E;&#x73B0;&#x7684;&#x5BBF;&#x4E3B;&#x73AF;&#x5883;&#x4E4B;&#x4E00;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x4E4B;&#x4E00;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#xFF0C;&#x66FE;&#x8BA9;&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#xFF0C;&#x5B83;&#x53EA;&#x80FD;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x91CC;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x5BBF;&#x4E3B;&#x73AF;&#x5883;&#x6BD4;&#x5982;node&#xFF08;&#x4E00;&#x79CD;&#x670D;&#x52A1;&#x7AEF;js&#x5E73;&#x53F0;&#xFF09;&#x548C;Adobe Flash&#x3002;</p>
<p>&#x5B83;&#x89C4;&#x5B9A;&#x4E86;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x7684;&#x4E0B;&#x5217;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF1A;</p>
<p><strong>&#x8BED;&#x6CD5;&#x3001;&#x7C7B;&#x578B;&#x3001;&#x8BED;&#x53E5;&#x3001;&#x5173;&#x952E;&#x5B57;&#x3001;&#x4FDD;&#x7559;&#x5B57;&#x3001;&#x64CD;&#x4F5C;&#x7B26;&#x3001;&#x5BF9;&#x8C61;</strong></p>
<h3 id="DOM"><a href="#DOM" class="headerlink" title="DOM"></a>DOM</h3><p>&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x7684;DOM&#xFF0C;&#x63D0;&#x4F9B;&#x8BBF;&#x95EE;&#x548C;&#x64CD;&#x4F5C;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4E0D;&#x53EA;&#x662F;&#x56E0;&#x4E3A;js&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5370;&#x8C61;&#x6BD4;&#x8F83;&#x6DF1;&#x7684;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#x64CD;&#x4F5C;DOM&#xFF0C;&#x589E;&#x5220;&#x67E5;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#xFF0C;DOM&#x662F;&#x6587;&#x6863;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x7684;&#x82F1;&#x6587;&#x7F29;&#x5199;&#xFF0C;&#x8DDF;js&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x6BCF;&#x4E2A;&#x7F51;&#x9875;&#x90FD;&#x6709;&#x5B83;&#x7684;DOM&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x6709;&#x8BF4;&#x6CD5;&#x53EB;DOM&#x6811;&#xFF0C;&#x6811;&#x4E0A;&#x7684;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x201C;&#x8282;&#x70B9;&#x201D;&#xFF08;node&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;js&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x5982;&#x679C;&#x8282;&#x70B9;&#x5305;&#x542B;html&#x6807;&#x7B7E;&#xFF0C;&#x79F0;&#x4E3A;&#x201C;&#x5143;&#x7D20;&#x8282;&#x70B9;&#x201D;&#xFF0C;&#x5426;&#x5219;&#x662F;&#x6587;&#x672C;&#x8282;&#x70B9;&#x3002;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x63A8;&#x51FA;&#xFF0C;&#x5143;&#x7D20;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6587;&#x672C;&#x8282;&#x70B9;&#x3002;</p>
<h3 id="BOM"><a href="#BOM" class="headerlink" title="BOM"></a>BOM</h3><p>&#x6D4F;&#x89C8;&#x5668;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#xFF0C;&#x5B83;&#x662F;&#x5904;&#x7406;&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;&#x548C;&#x6846;&#x67B6;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E5F;&#x4E60;&#x60EF;&#x628A;&#x6240;&#x6709;&#x9488;&#x5BF9;&#x6D4F;&#x89C8;&#x5668;&#x7684;javascript&#x6269;&#x5C55;&#x7B97;&#x4F5C;BOM&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x5F39;&#x51FA;&#x65B0;&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;</li>
<li>&#x79FB;&#x52A8;&#x3001;&#x7F29;&#x653E;&#x3001;&#x5173;&#x95ED;&#x6D4F;&#x89C8;&#x5668;&#x7A97;&#x53E3;</li>
<li>&#x63D0;&#x4F9B;&#x6D4F;&#x89C8;&#x5668;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x7684;navigator&#x5BF9;&#x8C61;</li>
<li>&#x63D0;&#x4F9B;&#x6D4F;&#x89C8;&#x5668;&#x6240;&#x52A0;&#x8F7D;&#x9875;&#x9762;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x7684;location&#x5BF9;&#x8C61;</li>
<li>&#x63D0;&#x4F9B;&#x7528;&#x6237;&#x663E;&#x793A;&#x5668;&#x5206;&#x8FA8;&#x7387;&#x4FE1;&#x606F;&#x7684;screen&#x5BF9;&#x8C61;</li>
<li>cookie&#x7B49;</li>
</ul>
<h3 id="&#x8BED;&#x53E5;"><a href="#&#x8BED;&#x53E5;" class="headerlink" title="&#x8BED;&#x53E5;"></a>&#x8BED;&#x53E5;</h3><p>&#x5373;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x89C1;&#x5230;&#x7684;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#x8BED;&#x53E5;&#x3001;&#x5FAA;&#x73AF;&#x8BED;&#x53E5;&#xFF0C;label&#x8BED;&#x53E5;&#xFF0C;with&#x8BED;&#x53E5;&#x7B49;&#xFF0C;&#x7528;&#x6765;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x7B26;&#x5408;&#x67D0;&#x79CD;&#x903B;&#x8F91;&#x7684;&#x64CD;&#x4F5C;</p>
<h3 id="&#x5BF9;&#x8C61;"><a href="#&#x5BF9;&#x8C61;" class="headerlink" title="&#x5BF9;&#x8C61;"></a>&#x5BF9;&#x8C61;</h3><p>&#x6709;&#x4EBA;&#x8BF4;&#x5B83;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x90A3;&#x6837;&#x4E0D;&#x4E25;&#x683C;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x3002;&#x4E0D;&#x7BA1;&#x54EA;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x90FD;&#x6CA1;&#x4EC0;&#x4E48;&#x5F71;&#x54CD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x5728;&#x8BF4;&#x4EC0;&#x4E48;&#x2026;</p>
<p>&#x5728;&#x8BF4;&#x5BF9;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x559C;&#x6B22;&#x62FF;&#x732B;&#x3001;&#x72D7;&#x4EC0;&#x4E48;&#x7684;&#x6253;&#x6BD4;&#x65B9;&#xFF0C;&#x6765;&#x89E3;&#x91CA;&#x4EC0;&#x4E48;&#x662F;&#x5C5E;&#x6027;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x65B9;&#x6CD5;&#x3002;&#x6BD4;&#x5982;&#x5B83;&#x4EEC;&#x6709;&#x8033;&#x6735;&#x3001;&#x9F3B;&#x5B50;&#x3001;&#x773C;&#x775B;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x5C5E;&#x6027;&#xFF0C;&#x4F1A;&#x8DD1;&#x3001;&#x4F1A;&#x53EB;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x65B9;&#x6CD5;&#xFF0C;&#x80FD;&#x591F;&#x63A7;&#x5236;&#x8FD9;&#x4E9B;&#xFF0C;&#x5C31;&#x80FD;&#x6307;&#x6325;&#x5B83;&#x505A;&#x5F88;&#x591A;&#x4E8B;&#xFF0C;&#x90A3;&#xFF0C;&#x8FD9;&#x4E9B;&#x8DDF;&#x5199;&#x7A0B;&#x5E8F;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x8054;&#x5462;&#xFF1F;</p>
<p>&#x8C8C;&#x4F3C;&#x4E0D;&#x77E5;&#x6240;&#x4E91;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x4F1A;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x4F1A;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x5BF9;&#x8C61;&#x3002;</p>
<p><strong>&#x5C5E;&#x6027;</strong></p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x6587;&#x6863;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4F1A;&#x6709;&#x6807;&#x9898;&#xFF1B;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x8868;&#x5355;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6709;&#x6587;&#x672C;&#x8F93;&#x5165;&#x6846;&#x3001;&#x5355;&#x9009;&#x6846;&#x7B49;&#x3002;&#x6539;&#x53D8;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x5C31;&#x4FEE;&#x6539;&#x4E86;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF0C;&#x76F8;&#x540C;&#x7684;&#x5C5E;&#x6027;&#x540D;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x732B;&#x6709;&#x8033;&#x6735;&#xFF0C;&#x72D7;&#x4E5F;&#x6709;&#x8033;&#x6735;&#xFF0C;&#x4EBA;&#x4E5F;&#x6709;&#x8033;&#x6735;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6709;&#x4E9B;&#x5C5E;&#x6027;&#x672C;&#x8EAB;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x6709;&#x5B50;&#x5BF9;&#x8C61;&#x3002;</p>
<p><strong>&#x65B9;&#x6CD5;</strong></p>
<p>&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x65B9;&#x6CD5;&#x201D;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x732B;&#x4F1A;&#x53EB;&#xFF0C;&#x94FE;&#x63A5;&#x3001;&#x6309;&#x94AE;&#x53EF;&#x4EE5;&#x70B9;&#x51FB;click()&#x3001;&#x7A97;&#x53E3;&#x53EF;&#x4EE5;&#x6253;&#x5F00;open()&#x7B49;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x201C;&#x5BF9;&#x8C61;&#x201D;&#x3001;&#x201C;&#x5C5E;&#x6027;&#x201D;&#x770B;&#x505A;&#x540D;&#x8BCD;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x201C;&#x52A8;&#x8BCD;&#x201D;&#x3002;</p>
<p>&#x5BF9;&#x8C61;&#x3001;&#x5C5E;&#x6027;&#x3001;&#x65B9;&#x6CD5;&#x7EC4;&#x5408;&#xFF0C;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x7684;&#x63CF;&#x8FF0;&#x5BF9;&#x8C61;&#x6216;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BD4;&#x5982;</p>
<p>&#x5BF9;&#x8C61;&#x548C;&#x5C5E;&#x6027;   car.wheel</p>
<p>&#x5BF9;&#x8C61;&#x548C;&#x65B9;&#x6CD5;   car.run()</p>
<p>&#x4EE5;&#x4E0A;&#x5199;&#x6CD5;&#x79F0;&#x4E3A;&#x201C;&#x70B9;&#x53F7;&#x8BED;&#x6CD5;&#x201D;</p>
<h3 id="&#x4E8B;&#x4EF6;"><a href="#&#x4E8B;&#x4EF6;" class="headerlink" title="&#x4E8B;&#x4EF6;"></a>&#x4E8B;&#x4EF6;</h3><p>&#x4E4B;&#x524D;&#x5C31;&#x8BF4;&#x8FC7;&#xFF0C;js&#x662F;&#x7528;&#x6765;&#x5904;&#x7406;&#x201C;&#x884C;&#x4E3A;&#x201D;&#x548C;&#x201C;&#x6570;&#x636E;&#x201D;&#x7684;&#xFF0C;&#x65E2;&#x7136;&#x6709;&#x884C;&#x4E3A;&#xFF0C;&#x80AF;&#x5B9A;&#x8981;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF0C;&#x79F0;&#x4E3A;&#x201C;&#x4E8B;&#x4EF6;&#x201D;&#x3002;<br>js&#x91CC;&#x9762;&#x6709;&#x5F88;&#x591A;&#x7684;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x5728;&#x7F51;&#x9875;&#x4E0A;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x4F1A;&#x89E6;&#x53D1;&#x5B83;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x201C;onclick&#x3001;onload&#x201D;&#x7B49;&#xFF0C;&#x90A3;&#x4E48;&#x662F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x884C;&#x4E3A;&#x90FD;&#x9700;&#x8981;&#x53BB;&#x54CD;&#x5E94;&#x5462;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x54EA;&#x4E9B;&#x4E8B;&#x4EF6;&#x662F;&#x4F60;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x80FD;&#x6709;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4F53;&#x9A8C;&#x6216;&#x8005;&#x5E94;&#x8BE5;&#x54CD;&#x5E94;&#x3002;</p>
<h3 id="&#x503C;&#x548C;&#x53D8;&#x91CF;"><a href="#&#x503C;&#x548C;&#x53D8;&#x91CF;" class="headerlink" title="&#x503C;&#x548C;&#x53D8;&#x91CF;"></a>&#x503C;&#x548C;&#x53D8;&#x91CF;</h3><p>&#x503C;&#xFF1A;&#x5728;js&#x4E2D;&#xFF0C;&#x4E00;&#x6BB5;&#x4FE1;&#x606F;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x719F;&#x6089;&#x7684;&#x201C;&#x6570;&#x5B57;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x201D;&#x7B49;&#x3002;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x522B;&#x7684;&#xFF0C;&#x540E;&#x7EED;&#x8BE6;&#x7EC6;&#x8BB0;&#x5F55;&#x3002;<br>&#x53D8;&#x91CF;&#xFF1A;&#x662F;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x503C;&#x7684;&#xFF0C;&#x5B66;&#x8FC7;&#x7F16;&#x7A0B;&#x7684;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x90FD;&#x559C;&#x6B22;&#x7528;&#x4E00;&#x4E2A;&#x76D2;&#x5B50;&#x6216;&#x4E00;&#x4E2A;&#x623F;&#x5B50;&#x6765;&#x505A;&#x6BD4;&#x55BB;&#xFF0C;&#x9053;&#x7406;&#x90FD;&#x4E00;&#x6837;&#x3002;&#x53EF;&#x5B58;&#xFF0C;&#x53EF;&#x53D6;&#xFF0C;&#x53EF;&#x64CD;&#x4F5C;</p>
<p>&#x63D0;&#x793A;&#xFF1A;&#x53D8;&#x91CF;&#x540D;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x4E0D;&#x80FD;&#x5305;&#x542B;&#x7A7A;&#x683C;&#x548C;&#x5176;&#x4ED6;&#x6807;&#x70B9;&#xFF0C;&#x4E0D;&#x80FD;&#x4EE5;&#x6570;&#x5B57;&#x5F00;&#x5934;&#xFF0C;&#x4E0D;&#x80FD;&#x662F;js&#x7684;&#x4FDD;&#x7559;&#x5B57;&#x3002;</p>
<h3 id="&#x64CD;&#x4F5C;&#x7B26;"><a href="#&#x64CD;&#x4F5C;&#x7B26;" class="headerlink" title="&#x64CD;&#x4F5C;&#x7B26;"></a>&#x64CD;&#x4F5C;&#x7B26;</h3><p>&#x7B80;&#x5355;&#x8BF4;&#x6765;&#xFF0C;&#x5C31;&#x662F;&#x201C;+&#x3001;&#x2014;&#x3001;*&#x3001;/&#x201D;&#x7B49;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;++&#x3001;&#x2013;&#x6B64;&#x7C7B;&#x3002;<br>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x6570;&#x5B57;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x76F8;&#x52A0;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x6709;&#x89C4;&#x5F8B;&#x53EF;&#x5FAA;&#xFF0C;&#x540E;&#x9762;&#x9047;&#x5230;&#x518D;&#x8BE6;&#x8FF0;&#x3002;</p>
<h3 id="&#x8D4B;&#x503C;&#x548C;&#x6BD4;&#x8F83;"><a href="#&#x8D4B;&#x503C;&#x548C;&#x6BD4;&#x8F83;" class="headerlink" title="&#x8D4B;&#x503C;&#x548C;&#x6BD4;&#x8F83;"></a>&#x8D4B;&#x503C;&#x548C;&#x6BD4;&#x8F83;</h3><p>&#x8D4B;&#x503C;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x503C;&#x653E;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x8D4B;&#x503C;&#xFF0C;&#x4F7F;&#x7528;&#x8D4B;&#x503C;&#x64CD;&#x4F5C;&#x7B26;&#x5B8C;&#x6210;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;myName=&#x201D;idea&#x201D;;</p>
<p>&#x9664;&#x4E86;=&#xFF0C;&#x8FD8;&#x6709;&#x201C;+=&#x3001;-=&#x3001;*=&#x3001;/=&#x3001;%=&#x201D;&#x7B49;&#x3002;</p>
<p>&#x6BD4;&#x8F83;&#xFF1A;&#x4E24;&#x4E2A;&#x503C;&#x6216;&#x8005;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x64CD;&#x4F5C;&#x7B26;&#x6709;&#x201C;==&#x3001;===&#x3001;&#xFF01;=&#x3001;&gt;=&#x201D;&#x7B49;&#x8FD9;&#x4E9B;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x57FA;&#x672C;&#x5217;&#x51FA;&#x4E86;&#x6211;&#x4EEC;&#x8BF4;&#x8D77;js&#x65F6;&#x4F1A;&#x8BF4;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4EC5;&#x5BF9;js&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x4E0B;&#x6982;&#x89C8;&#xFF0C;&#x4EE5;&#x540E;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#x4F1A;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x9010;&#x4E2A;&#x8BE6;&#x8FF0;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>js&#x662F;&#x4E00;&#x79CD;&#x4E13;&#x4E3A;&#x4E0E;&#x7F51;&#x9875;&#x4EA4;&#x4E92;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x4E3A;&#x7F51;&#x9875;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x4E86;&#x64CD;&#x63A7;&#x7F51;&#x9875;&#x5143;&#x7D20;&#x548C;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6700;&#x8FD1;&#x4E24;&#x5E74;&#xFF0C;&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x6846;&#x67B6;&#x548C;node&#x3001;react&#x7B49;&#x7684;&#x6D41;&#x884C;&#xFF0C;&#x5B83;&#x4F3C;&#x4E4E;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#xFF0C;&#x6709;&#x66F4;&#x5927;&#x7684;&#x60F3;&#x8C61;&#x7A7A;&#x95F4;&#x548C;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x6216;&#x8BB8;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x5F3A;&#x5927;&#xFF0C;&#x8BA9;&#x5F88;&#x591A;&#x4EBA;&#x89C9;&#x5F97;&#xFF0C;&#x638C;&#x63E1;&#x4E86;&#x5B83;&#x5C31;&#x5F88;&#x5389;&#x5BB3;&#x6216;&#x8005;&#x5B83;&#x5F88;&#x96BE;&#x5B66;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x53EF;&#x4E0D;&#x5FC5;&#xFF0C;&#x6212;&#x9664;&#x6D6E;&#x8E81;&#xFF0C;&#x8E0F;&#x8E0F;&#x5B9E;&#x5B9E;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x4E2A;&#x811A;&#x5370;&#xFF0C;&#x76F8;&#x4FE1;&#x8981;&#x4E0D;&#x4E86;&#x591A;&#x4E45;&#x5C31;&#x80FD;&#x6709;&#x4E0D;&#x9519;&#x7684;&#x8FDB;&#x6B65;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x540E;&#x7EED;&#x4F1A;&#x6DF1;&#x5165;&#x5B66;&#x4E60;&#x3002;&#x4E00;&#x8D77;&#x52A0;&#x6CB9;&#x5427;&#xFF01;~</p>
</div><a data-url="http://yoursite.com/2016/02/25/javascript-study-one/" data-id="cimozlmtv003wh1qid5s05ccx" class="article-share-link">分享到</a><div class="tags"><a href="/tags/javascript/">javascript</a></div><div class="post-nav"><a href="/2016/02/28/my-love-with-words/" class="pre">我的文字情结</a><a href="/2016/02/24/new-year-first-do/" class="next">新年伊始，我都做了些什么</a></div><div data-thread-key="2016/02/25/javascript-study-one/" data-title="征服javascript学习笔记（一）——认识js" data-url="http://yoursite.com/2016/02/25/javascript-study-one/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2016/02/25/javascript-study-one/" data-title="征服javascript学习笔记（一）——认识js" data-url="http://yoursite.com/2016/02/25/javascript-study-one/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/05/javascript-study-two/">征服javascript学习笔记（二）——基本概念（上）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/28/my-love-with-words/">我的文字情结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/25/javascript-study-one/">征服javascript学习笔记（一）——认识js</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/24/new-year-first-do/">新年伊始，我都做了些什么</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>