<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>我的“深jsconf2015”之旅 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">我的“深jsconf2015”之旅</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">我的“深jsconf2015”之旅</h1><div class="post-meta">May 9, 2015<span> | </span><span class="category"><a href="/categories/分享交流/">分享交流</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2015/05/09/shen-js-2015/" href="/2015/05/09/shen-js-2015/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div></div></div><div class="post-content"><p>&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x6211;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x6765;&#x8FD9;&#x4E00;&#x5C4A;&#x6DF1;js&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4E0D;&#x64C5;&#x957F;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x7684;&#x804C;&#x4F4D;&#x662F;&#x91CD;&#x6784;&#xFF0C;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x7528;&#x7684;&#x4E5F;&#x4E0D;&#x591A;&#xFF0C;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x4E24;&#x5E74;&#x91CC;&#x57FA;&#x672C;&#x4E0A;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x90FD;&#x5728;html&#x548C;css&#x4E0A;&#x3002;&#x7531;&#x4E8E;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x867D;&#x7136;&#x4E70;&#x4E86;&#x4E0D;&#x5C11;js&#x7684;&#x597D;&#x8D44;&#x6599;&#xFF0C;&#x4E5F;&#x65AD;&#x65AD;&#x7EED;&#x7EED;&#x7684;&#x5728;&#x5B66;&#x4E60;&#xFF0C;&#x4F46;&#x4F9D;&#x7136;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x80FD;&#x62FF;&#x5F97;&#x51FA;&#x624B;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4E5F;&#x5C31;&#x7A0D;&#x5FAE;&#x4F1A;&#x70B9;jq&#x4E4B;&#x7C7B;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x9AD8;&#x624B;&#x4E91;&#x96C6;&#x3001;&#x7FA4;&#x661F;&#x7480;&#x74A8;&#x7684;jsconf&#x4E0A;&#xFF0C;&#x5BA2;&#x89C2;&#x4E0A;&#x6765;&#x8BB2;&#x4F3C;&#x4E4E;&#x4E0D;&#x80FD;get&#x5230;&#x591A;&#x5C11;&#x7CBE;&#x534E;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x66F4;&#x73B0;&#x5B9E;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x82B1;&#x4E86;500&#x94F6;&#x4E24;&#xFF0C;&#x662F;&#x75AF;&#x4E86;&#x4E48;&#xFF1F;&#x597D;&#x5427;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8BF4;&#x8BF4;&#x7406;&#x7531;&#x548C;&#x611F;&#x60F3;&#x3002;</p>
<p>&#x7406;&#x7531;&#x4E00;&#xFF1A;&#x5728;&#x6DF1;&#x5733;&#xFF0C;&#x8FD9;&#x6B21;&#x5927;&#x4F1A;&#x6709;&#x6765;&#x81EA;&#x5168;&#x56FD;&#x5404;&#x5730;&#xFF0C;&#x4E43;&#x81F3;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7684;&#x4EBA;&#x4EEC;&#xFF0C;&#x5F53;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x80CC;&#x7740;&#x5305;&#xFF0C;&#x62C9;&#x7740;&#x884C;&#x674E;&#x7BB1;&#xFF0C;&#x5728;&#x53BB;&#x5F80;&#x673A;&#x573A;&#x6216;&#x8005;&#x8F66;&#x7AD9;&#x7684;&#x8DEF;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x5230;&#x4E86;&#x5BB6;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6CA1;&#x7406;&#x7531;&#x4E0D;&#x6765;&#x3002;</p>
<p>&#x7406;&#x7531;&#x4E8C;&#xFF1A;&#x4E24;&#x5E74;&#x524D;&#x51B3;&#x5B9A;&#x4ECE;&#x4E8B;&#x524D;&#x7AEF;&#xFF0C;&#x5374;&#x4E00;&#x76F4;&#x6CA1;&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x771F;&#x6B63;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x800C;&#x662F;&#x53EA;&#x4F1A;&#x5199;&#x5199;&#x9875;&#x9762;&#xFF0C;&#x4E00;&#x70B9;&#x7B80;&#x5355;&#x4EA4;&#x4E92;&#x548C;&#x52A8;&#x6548;&#x7684;&#x4F2A;&#x524D;&#x7AEF;&#xFF0C;&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x4F9D;&#x7136;&#x5728;&#x52AA;&#x529B;&#x5B66;&#x4E60;&#x7740;&#x4EE5;&#x5F25;&#x8865;&#x81EA;&#x8EAB;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x5C31;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x7ECF;&#x9A8C;&#x800C;&#x8A00;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x81EA;&#x5DF1;&#x6210;&#x957F;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9047;&#x5230;&#x5404;&#x79CD;&#x7A81;&#x5982;&#x5176;&#x6765;&#x7684;&#x56F0;&#x96BE;&#x548C;&#x8003;&#x9A8C;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;&#x90FD;&#x80FD;&#x8BA9;&#x4F60;&#x627E;&#x5230;&#x81EA;&#x8EAB;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x90FD;&#x80FD;&#x6709;&#x6240;&#x8FDB;&#x6B65;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x56F0;&#x96BE;&#x548C;&#x8003;&#x9A8C;&#x6709;&#x4E9B;&#x662F;&#x65E0;&#x6CD5;&#x51C6;&#x5907;&#xFF0C;&#x4E5F;&#x662F;&#x65E0;&#x9700;&#x51C6;&#x5907;&#x7684;&#xFF0C;&#x6B63;&#x5982;&#x8FD9;&#x6B21;&#x5927;&#x4F1A;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4E0D;&#x5177;&#x5907;&#x5B8C;&#x5168;&#x7406;&#x89E3;&#x5927;&#x725B;&#x4EEC;&#x6240;&#x8BB2;&#x7684;&#x4E1C;&#x897F;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x5B83;&#x80FD;&#x7ED9;&#x6211;&#x5E26;&#x6765;&#x542F;&#x53D1;&#xFF0C;&#x8BA9;&#x6211;&#x80FD;&#x591F;&#x7AD9;&#x5728;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x4E0A;&#x53BB;&#x8BA4;&#x8BC6;&#x5B83;&#xFF0C;&#x6216;&#x8005;&#x5E2E;&#x52A9;&#x6211;&#x62D3;&#x5BBD;&#x89C6;&#x91CE;&#xFF0C;&#x5C31;&#x503C;&#x5F97;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B83;&#x7ED9;&#x6211;&#x7684;&#xFF0C;&#x8FDC;&#x8FDC;&#x6BD4;&#x6211;&#x60F3;&#x8C61;&#x7684;&#x591A;&#x5F88;&#x591A;&#xFF0C;&#x8BA9;&#x6211;&#x89C9;&#x5F97;&#x7279;&#x522B;&#x7684;&#x503C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6765;&#x5BF9;&#x4E86;</p>
<p>&#x90FD;&#x6709;&#x4EC0;&#x4E48;&#x611F;&#x89E6;&#x5462;&#xFF1F;</p>
<p>1&#x3001;&#x9996;&#x5148;&#x8981;&#x627F;&#x8BA4;&#x7684;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x5168;&#x82F1;&#x6587;&#x7684;&#x5916;&#x56FD;&#x53CB;&#x4EBA;&#x4EE5;&#x53CA;&#x5C24;&#x5C0F;&#x53F3;&#x6240;&#x8BB2;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x6CA1;&#x6709;get&#x5230;&#xFF0C;&#x66FE;&#x7ECF;&#x8003;&#x8FC7;&#x82F1;&#x8BED;6&#x7EA7;&#x7684;&#x6211;&#x6765;&#x8BF4;&#x4E5F;&#x662F;&#x201C;&#x7136;&#x5E76;&#x5375;&#x201D;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x6709;&#x4E86;&#x66F4;&#x5F3A;&#x7684;&#x7D27;&#x8FEB;&#x611F;&#x53BB;&#x52A0;&#x5F3A;&#x81EA;&#x5DF1;&#x7684;&#x82F1;&#x6587;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x6BCF;&#x5929;&#x4E5F;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x8DDF;&#x5916;&#x56FD;&#x4EBA;&#x4EA4;&#x6D41;&#xFF0C;&#x4F46;&#x4ECD;&#x6709;&#x5F88;&#x591A;&#x7684;&#x82F1;&#x6587;&#x8D44;&#x6E90;&#x662F;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x3002;&#x800C;&#x4E14;&#x5728;&#x5C06;&#x6765;&#xFF0C;&#x8C01;&#x53C8;&#x6562;&#x8BF4;&#x4E0D;&#x540C;&#x5916;&#x56FD;&#x4EBA;&#x4EA4;&#x6D41;&#x5408;&#x4F5C;&#x5462;&#xFF1F;&#x5230;&#x90A3;&#x65F6;&#x5019;&#x518D;&#x52AA;&#x529B;&#xFF0C;&#x665A;&#x77E3;</p>
<p>2&#x3001;&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x52AA;&#x529B;&#x7684;&#x53BB;&#x8DDF;&#x968F;&#x7740;&#x6F14;&#x8BB2;&#x8005;&#x7684;&#x7A3F;&#x5B50;&#x548C;&#x5B83;&#x6240;&#x6572;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53BB;&#x89C2;&#x5BDF;&#x548C;&#x4F53;&#x4F1A;&#xFF0C;&#x4E24;&#x5929;21&#x4F4D;&#x8BB2;&#x5E08;&#xFF0C;&#x52A0;&#x4E0A;&#x51E0;&#x6CE2;&#x7684;lighting talk&#x8BA9;&#x73B0;&#x573A;&#x7684;&#x6570;&#x4F4D;&#x89C2;&#x4F17;&#x6709;&#x673A;&#x4F1A;&#x4E0A;&#x53F0;&#x505A;&#x77ED;&#x5206;&#x4EAB;&#xFF08;&#x4ED6;&#x4EEC;&#x4E5F;&#x90FD;&#x662F;&#x5404;&#x5927;&#x516C;&#x53F8;&#x7684;&#x6280;&#x672F;&#x80FD;&#x4EBA;&#x54E6;~&#xFF09;&#xFF0C;&#x4FE1;&#x606F;&#x91CF;&#x771F;&#x7684;&#x8D85;&#x7EA7;&#x5927;&#xFF0C;&#x8D85;&#x7EA7;&#x4E30;&#x5BCC;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x5927;&#x4F1A;&#x5C31;&#x662F;&#x5404;&#x79CD;&#x5927;&#x795E;&#x805A;&#x5728;&#x4E00;&#x8D77;&#x804A;&#x804A;&#x5929;&#xFF0C;&#x5439;&#x5439;&#x6C34;&#xFF0C;&#x53D9;&#x53D9;&#x65E7;&#xFF0C;no&#xFF01;</p>
<p>3&#x3001;&#x89C6;&#x91CE;&#x548C;&#x60F3;&#x8C61;&#x529B;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x6211;&#x4EEC;&#x770B;&#x4E0D;&#x5230;&#xFF0C;&#x5C31;&#x89C9;&#x5F97;&#x5B83;&#x53EF;&#x80FD;&#x8FD8;&#x6CA1;&#x6709;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x6211;&#x4EEC;&#x6CA1;&#x505A;&#x8FC7;&#xFF0C;&#x5C31;&#x8BA4;&#x4E3A;&#x5B83;&#x505A;&#x4E0D;&#x5230;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5927;&#x4F1A;&#x5C31;&#x662F;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x4E00;&#x6B21;&#x673A;&#x4F1A;&#x53BB;&#x770B;&#x770B;&#xFF0C;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x5176;&#x5B9E;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x6211;&#x4EEC;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x8EAB;&#x76EE;&#x5149;&#x7684;&#x5C40;&#x9650;&#x6027;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x81F3;&#x4ECA;&#x8FD8;&#x6709;&#x4EBA;&#x8BA4;&#x4E3A;js&#x5C31;&#x662F;&#x7528;&#x6765;&#x505A;&#x7F51;&#x9875;&#x4E0A;&#x9762;&#x90A3;&#x4E9B;&#x52A8;&#x6548;&#x7684;&#xFF0C;&#x6709;&#x4E86;node&#x4E4B;&#x540E;&#xFF0C;&#x8BA4;&#x4E3A;&#x4ED6;&#x53EF;&#x4EE5;&#x505A;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x4F5C;&#x7528;&#x4E8E;&#x786C;&#x4EF6;&#x3002;</p>
<p>4&#x3001;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x601D;&#x8003;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x6CA1;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x638C;&#x63E1;js&#xFF0C;&#x5B9E;&#x8DF5;&#x7684;&#x5C11;&#x8FD9;&#x662F;&#x5176;&#x4E00;&#xFF0C;&#x5176;&#x4E8C;&#x5C31;&#x662F;&#xFF0C;&#x5B83;&#x8DDF;css&#x5728;&#x4F7F;&#x7528;&#x548C;&#x65B9;&#x6CD5;&#x8BBA;&#x4E0A;&#x9762;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E9B;&#x4EBA;&#x8BF4;&#x7684;&#x6240;&#x8C13;&#x201C;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x201D;&#x548C;&#x201C;&#x975E;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x201D;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x6211;&#x4EEC;&#x5199;&#x4EE3;&#x7801;&#x662F;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x9700;&#x6C42;&#x7684;&#xFF0C;&#x628A;&#x9700;&#x6C42;&#x8F6C;&#x6362;&#x6210;&#x6211;&#x4EEC;&#x6240;&#x7528;&#x7684;&#x6280;&#x672F;&#x6240;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x62BD;&#x8C61;&#x6210;&#x67D0;&#x79CD;&#x6A21;&#x578B;&#x4E4B;&#x540E;&#xFF0C;&#x624D;&#x662F;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E2D;&#x95F4;&#x6240;&#x9694;&#x7740;&#x7684;&#x90A3;&#x5EA7;&#x5C71;&#x3002;&#x518D;&#x4E3E;&#x4E2A;&#x66F4;&#x52A0;&#x6613;&#x61C2;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5F53;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#xFF0C;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x4E0A;&#x53BB;&#xFF0C;csser&#x548C;jser&#x6240;&#x770B;&#x6240;&#x60F3;&#x80AF;&#x5B9A;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x4E2A;&#x6CE8;&#x91CD;&#x8868;&#x73B0;&#x3001;&#x5E03;&#x5C40;&#xFF0C;&#x4E00;&#x4E2A;&#x6CE8;&#x91CD;&#x884C;&#x4E3A;&#x3001;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x987A;&#x7740;&#x4E24;&#x79CD;&#x6280;&#x672F;&#x7684;&#x4E0D;&#x540C;&#x8DEF;&#x7EBF;&#x63A5;&#x7740;&#x5F80;&#x4E0B;&#x8D70;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x8BF4;&#x7684;&#x533A;&#x522B;&#x6240;&#x5728;&#x3002;<br>&#x901A;&#x8FC7;&#x8FD9;&#x5C4A;&#x5927;&#x4F1A;&#x4E24;&#x5929;&#x7684;&#x718F;&#x9676;&#xFF0C;&#x6211;&#x4F3C;&#x4E4E;&#x5728;&#x201C;&#x8FDC;&#x79BB;&#x201D;&#x7740;css&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x548C;&#x903B;&#x8F91;&#xFF0C;&#x5728;&#x5F3A;&#x8FEB;&#x7740;&#x81EA;&#x5DF1;&#x53BB;&#x9002;&#x5E94;js&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x603B;&#x5F97;&#x6765;&#x8BF4;&#x6548;&#x679C;&#x8FD8;&#x4E0D;&#x9519;&#x3002;</p>
<p>5&#x3001;&#x73B0;&#x573A;&#x6765;&#x4E86;&#x5F88;&#x591A;&#x725B;&#x4EBA;&#xFF0C;&#x5C24;&#x96E8;&#x6EAA;&#x3001;&#x8D3A;&#x5E08;&#x4FCA;&#x3001;&#x5F90;&#x98DE;&#xFF0C;&#x8FD8;&#x6709;&#x5404;&#x5927;&#x516C;&#x53F8;&#x7684;&#x9AA8;&#x5E72;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5916;&#x56FD;&#x5927;&#x725B;&#x7B49;&#x7B49;&#x7B49;&#x7B49;&#xFF0C;&#x6055;&#x6211;&#x4E0D;&#x80FD;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#x51FA;&#x6765;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x89C1;&#x8BC6;&#x5230;&#x5B83;&#x4EEC;&#x6240;&#x5206;&#x4EAB;&#x7684;&#x6280;&#x672F;&#x65B9;&#x6848;&#xFF0C;&#x4E5F;&#x80FD;&#x89C1;&#x8BC6;&#x5230;&#x4ED6;&#x4EEC;&#x73B0;&#x573A;coding&#x7684;&#x98CE;&#x91C7;&#x3002;</p>
<p>6&#x3001;&#x4E0D;&#x5F97;&#x4E0D;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x73B0;&#x573A;&#x6765;&#x4E86;&#x5F88;&#x591A;&#x5927;&#x5B66;&#x751F;&#xFF0C;&#x751A;&#x81F3;&#x6765;&#x4E86;&#x4E00;&#x4F4D;&#x9AD8;&#x4E2D;&#x751F;&#xFF0C;&#x800C;&#x4E14;&#x5F53;&#x65F6;&#x5C31;&#x5750;&#x5728;&#x6211;&#x524D;&#x9762;&#xFF0C;&#x6211;&#x771F;&#x662F;&#x60CA;&#x5446;&#x4E86;&#xFF0C;&#x8FD9;&#x4E0D;&#x5F97;&#x4E0D;&#x8BA9;&#x6211;&#x8FD9;&#x4E2A;&#x5DF2;&#x7ECF;&#x51FA;&#x6765;&#x5DE5;&#x4F5C;&#x8FD8;&#x4E3A;500&#x5757;&#x72B9;&#x8C6B;&#x7684;&#x4EBA;&#x611F;&#x5230;&#x60ED;&#x6127;&#x3002;&#x66F4;&#x610F;&#x5916;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x53EF;&#x4E0D;&#x53EA;&#x662F;&#x6765;&#x51D1;&#x70ED;&#x95F9;&#x7684;&#xFF0C;&#x4ED6;&#x77E5;&#x9053;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x7528;&#x8FC7;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x6216;&#x8BB8;&#x8FD9;&#x4E0D;&#x80FD;&#x201C;&#x602A;&#x201D;&#x4ED6;&#x592A;&#x5F3A;&#xFF0C;&#x800C;&#x662F;&#x6211;&#x592A;&#x5F31;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x4F60;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x611F;&#x53D7;&#x5230;&#x5E74;&#x8F7B;&#x4EBA;&#x7684;&#x5B66;&#x4E60;&#x70ED;&#x60C5;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4ECE;&#x4E1A;&#x5341;&#x51E0;&#x5E74;&#x7684;&#x4EBA;&#x90A3;&#x79CD;&#x5728;&#x8C08;&#x8BBA;&#x6280;&#x672F;&#x65F6;&#x5019;&#x7684;&#x6FC0;&#x60C5;&#xFF0C;&#x5403;&#x996D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5750;&#x4E0B;&#x95F2;&#x804A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x4E9B;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#x53E6;&#x5916;&#x7EA6;&#x522B;&#x7684;&#x5730;&#x65B9;&#x804A;&#x5230;&#x5F88;&#x665A;&#x3002;&#x53EF;&#x80FD;&#x77E5;&#x97F3;&#x96BE;&#x89C5;&#x5427;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4EBA;&#x8BF4;github&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5927;&#x7684;&#x540C;&#x6027;&#x4EA4;&#x53CB;&#x5E73;&#x53F0;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5728;&#x4E0A;&#x9762;&#x76F8;&#x4E92;f**k~</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x6700;&#x540E;&#x6765;&#x70B9;&#x5C0F;&#x7ED3;&#xFF0C;&#x4F1A;&#x573A;&#x6709;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x8D5E;&#x52A9;&#x7684;&#x90A3;&#x5565;&#x548C;&#x90A3;&#x5565;&#x6211;&#x6CA1;&#x62FF;&#xFF0C;&#x6709;&#x6253;&#x6298;&#x5356;&#x7684;&#x4E66;&#xFF0C;&#x5FCD;&#x4F4F;&#x4E86;&#x6CA1;&#x4E70;&#xFF0C;&#x524D;&#x9762;&#x4E5F;&#x8BF4;&#x4E86;&#x6211;&#x5DF2;&#x7ECF;&#x4E70;&#x8FC7;&#x5F88;&#x591A;&#xFF0C;&#x4E0D;&#x8FC7;&#x2026;&#x8FD9;&#x6B21;&#x5927;&#x4F1A;&#x62BD;&#x4E86;&#x56DB;&#x6B21;&#x5956;&#xFF0C;&#x62BD;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#x4EBA;&#xFF0C;&#x6211;&#x5C45;&#x7136;&#x6CA1;&#x6709;&#x4E2D;&#xFF0C;&#x5C31;&#x6211;&#x4ECA;&#x5E74;&#x7684;&#x8FD0;&#x6C14;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x5F88;&#x4E0D;&#x79D1;&#x5B66;&#xFF0C;&#x6700;&#x540E;&#x6709;&#x4E09;&#x5341;&#x672C;&#x4E66;&#x8BA9;&#x4EBA;&#x968F;&#x4FBF;&#x62FF;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x8FD8;&#x6CA1;&#x7B49;&#x4E00;&#x7B49;&#x5956;&#x7684;&#x4EBA;&#x9886;&#x5B8C;&#x5956;&#xFF0C;&#x8EAB;&#x8FB9;&#x5C31;&#x6709;&#x4EBA;&#x51B2;&#x4E86;&#x51FA;&#x53BB;&#xFF0C;&#x6211;&#x2026;&#x4E5F;&#x51B2;&#x4E86;&#x51FA;&#x53BB;&#xFF0C;&#x62A2;&#x5230;&#x4E00;&#x672C;&#xFF0C;&#x54C8;&#x54C8;&#xFF01;</p>
<p>&#x6709;&#x4E00;&#x70B9;&#x9057;&#x61BE;&#x5C31;&#x662F;&#xFF0C;&#x8FD8;&#x6CA1;&#x6765;&#x5F97;&#x53CA;&#x8DDF;&#x60C5;&#x5C01;&#x548C;&#x9B3C;&#x61FF;&#x5408;&#x5F20;&#x5F71;&#x7559;&#x4E2A;&#x5FF5;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x63D0;&#x524D;&#x534A;&#x5929;&#x8D70;&#x4E86;&#x3002;&#xFF08;&#x770B;&#x6765;&#x662F;&#x5ACC;&#x6211;&#x7EA2;&#x5305;&#x7ED9;&#x5F97;&#x5C11;&#xFF0C;&#x54C8;&#x54C8;~&#xFF09;</p>
<p>&#x548C;&#x5F88;&#x591A;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x6B21;&#x5927;&#x4F1A;&#x591A;&#x5C11;&#x4F1A;&#x6709;&#x4E00;&#x70B9;&#x201C;&#x89C1;&#x5230;&#x5F88;&#x591A;&#x5927;&#x725B;&#x201D;&#x771F;&#x8EAB;&#x7684;&#x4E00;&#x79CD;&#x6EE1;&#x8DB3;&#x611F;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x89C1;&#x5230;&#x6211;&#x60F3;&#x89C1;&#x7684;&#x5168;&#x90E8;&#x7684;&#x4EBA;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x8FD9;&#x6B21;&#x5927;&#x4F1A;&#x7684;&#x7CBE;&#x5F69;&#x7A0B;&#x5EA6;&#x548C;&#x6EE1;&#x6EE1;&#x7684;&#x6536;&#x83B7;&#xFF0C;&#x8BA9;&#x6211;&#x5BF9;&#x4E0B;&#x4E2A;&#x6708;&#x5728;&#x201C;&#x9B54;&#x90FD;&#x201D;&#x4E0A;&#x6D77;&#x4E3E;&#x529E;&#x7684;&#x7B2C;&#x4E8C;&#x5C4A;cssconf&#x66F4;&#x52A0;&#x5145;&#x6EE1;&#x4E86;&#x671F;&#x5F85;&#xFF0C;&#x6240;&#x8BB2;&#x7684;&#x4E3B;&#x9898;&#x5168;&#x90FD;&#x662F;&#x6211;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x54E6;&#xFF01;&#x4F60;&#x5462;&#xFF1F;&#x7EA6;&#x5417;&#xFF1F;~~</p>
<p>&#x6700;&#x540E;&#x9001;&#x51E0;&#x5F20;&#x56FE;</p>
<p><img src="/2015/05/09/shen-js-2015/1.jpg" alt=""></p>
<p><img src="/2015/05/09/shen-js-2015/2.jpg" alt=""></p>
<p><img src="/2015/05/09/shen-js-2015/3.jpg" alt=""></p>
<p><img src="/2015/05/09/shen-js-2015/4.jpg" alt=""></p>
<p><img src="/2015/05/09/shen-js-2015/5.jpg" alt=""></p>
<p>&#x8FD9;&#x4F4D;&#x5C31;&#x662F;&#x5168;&#x573A;&#x552F;&#x4E00;&#x7684;&#x9AD8;&#x4E2D;&#x751F;</p>
<p><img src="/2015/05/09/shen-js-2015/6.jpg" alt=""></p>
</div><a data-url="http://yoursite.com/2015/05/09/shen-js-2015/" data-id="ciwupuar9003cecqiqeo6pblf" class="article-share-link">分享到</a><div class="tags"><a href="/tags/分享交流/">分享交流</a></div><div class="post-nav"><a href="/2015/05/09/say-opacity/" class="pre">小叙透明</a><a href="/2015/04/18/img-ele-gap/" class="next">图片以及其他替换元素的空隙问题</a></div><div data-thread-key="2015/05/09/shen-js-2015/" data-title="我的“深jsconf2015”之旅" data-url="http://yoursite.com/2015/05/09/shen-js-2015/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2015/05/09/shen-js-2015/" data-title="我的“深jsconf2015”之旅" data-url="http://yoursite.com/2015/05/09/shen-js-2015/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/成长，经历，思考/" style="font-size: 15px;">成长，经历，思考</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/12/18/css_conf_2016/">第三届CSS中国开发者大会纪实</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/21/javascript-study-six/">征服javascript学习笔记（六）——面向对象的程序设计之创建对象</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/17/tencent_oneyear/">总有一个地方，我们未曾到达——我的鹅厂周年记</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/15/readbook_seetheworld/">静静的打开一本书，你会看到新的世界</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>