<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>征服javascript学习笔记（五）——引用类型Object和Array | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">征服javascript学习笔记（五）——引用类型Object和Array</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">征服javascript学习笔记（五）——引用类型Object和Array</h1><div class="post-meta">Apr 20, 2016<span> | </span><span class="category"><a href="/categories/javascript学习笔记/">javascript学习笔记</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2016/04/20/javascript-study-five/" href="/2016/04/20/javascript-study-five/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#写在前面"><span class="toc-number">1.</span> <span class="toc-text">写在前面</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#Object类型"><span class="toc-number">2.</span> <span class="toc-text">Object类型</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#Array类型"><span class="toc-number">3.</span> <span class="toc-text">Array类型</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#小结"><span class="toc-number">4.</span> <span class="toc-text">小结</span></a></li></ol></div></div><div class="post-content"><h2 id="&#x5199;&#x5728;&#x524D;&#x9762;"><a href="#&#x5199;&#x5728;&#x524D;&#x9762;" class="headerlink" title="&#x5199;&#x5728;&#x524D;&#x9762;"></a>&#x5199;&#x5728;&#x524D;&#x9762;</h2><p>&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;ES&#x7684;&#x53D8;&#x91CF;&#x7C7B;&#x578B;&#xFF0C;&#x5206;&#x4E3A;&#x201C;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x201D;&#x548C;&#x201C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x201D;&#x3002;&#x90A3;&#x4E48;&#x8FD9;&#x91CC;&#x5C31;&#x5F00;&#x59CB;&#x4ECB;&#x7ECD;&#x201C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x201D;&#x3002;</p>
<p>&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF08;&#x5BF9;&#x8C61;&#xFF09;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x4F8B;&#xFF0C;&#x5728;ES&#x4E2D;&#xFF0C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7528;&#x4E8E;&#x5C06;&#x6570;&#x636E;&#x548C;&#x529F;&#x80FD;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#xFF0C;</p>
<p>&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5BF9;&#x8C61;&#x662F;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x65B0;&#x5BF9;&#x8C61;&#x662F;&#x4F7F;&#x7528;new&#x64CD;&#x4F5C;&#x7B26;&#x540E;&#x8DDF;&#x4E00;&#x4E2A;<strong>&#x6784;&#x9020;&#x51FD;&#x6570;</strong>&#x6765;&#x521B;&#x5EFA;&#x3002;&#x6784;&#x9020;&#x51FD;&#x6570;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x8BE5;&#x51FD;&#x6570;&#x662F;&#x51FA;&#x4E8E;&#x521B;&#x5EFA;&#x65B0;&#x5BF9;&#x8C61;&#x7684;&#x76EE;&#x7684;&#x800C;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>var perspon=new Object();
</code></pre><h2 id="Object&#x7C7B;&#x578B;"><a href="#Object&#x7C7B;&#x578B;" class="headerlink" title="Object&#x7C7B;&#x578B;"></a>Object&#x7C7B;&#x578B;</h2><p>&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x6240;&#x770B;&#x5230;&#x7684;&#x5927;&#x591A;&#x6570;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x90FD;&#x662F;Object&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;Object&#x4E5F;&#x662F;ES&#x4E2D;&#x4F7F;&#x7528;&#x6700;&#x591A;&#x7684;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x3002;&#x867D;&#x7136;Object&#x7684;&#x5B9E;&#x4F8B;&#x4E0D;&#x5177;&#x5907;&#x591A;&#x5C11;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B58;&#x50A8;&#x548C;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x4EEC;&#x786E;&#x5B9E;&#x662F;&#x975E;&#x5E38;&#x7406;&#x60F3;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x521B;&#x5EFA;Object&#x5B9E;&#x4F8B;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x79CD;&#xFF1A;</p>
<p><strong>&#x7B2C;&#x4E00;&#x79CD;</strong></p>
<p>&#x4F7F;&#x7528;new&#x64CD;&#x4F5C;&#x7B26;&#x540E;&#x8DDF;Object&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>var person=new Object();
    person.name=&quot;idea&quot;;
    person.age=27;
</code></pre><p><strong>&#x7B2C;&#x4E8C;&#x79CD;</strong></p>
<p>&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#xFF0C;&#x662F;&#x5BF9;&#x8C61;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x79CD;&#x7B80;&#x5199;&#x5F62;&#x5F0F;&#xFF0C;&#x76EE;&#x7684;&#x5728;&#x4E8E;&#x7B80;&#x5316;&#x521B;&#x5EFA;&#x5305;&#x542B;&#x5927;&#x91CF;&#x5C5E;&#x6027;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4E0A;&#x4F8B;&#x53EF;&#x4EE5;&#x5199;&#x6210;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var person={
    name:&quot;idea&quot;,
    age:27
}
</code></pre><p>&#x5982;&#x4E0A;&#x6240;&#x793A;&#xFF0C;&#x5BF9;&#x8C61;&#xFF0C;&#x5C5E;&#x6027;&#xFF0C;&#x5C5E;&#x6027;&#x503C;&#xFF0C;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x3002;&#x4F46;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x63D0;&#x793A;&#x7684;&#x662F;&#xFF0C;&#x591A;&#x4E2A;&#x5C5E;&#x6027;&#x4E4B;&#x95F4;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x9017;&#x53F7;&#xFF0C;&#x4F46;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x540E;&#x9762;&#x7684;&#x9017;&#x53F7;&#x4E0D;&#x662F;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#xFF0C;&#x5982;&#x679C;&#x52A0;&#x4E86;&#xFF0C;&#x4F1A;&#x5728;IE7&#x53CA;&#x66F4;&#x65E9;&#x7248;&#x672C;&#x548C;Opera&#x4E2D;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x5C5E;&#x6027;&#x540D;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>var person={
    &#x201C;name&#x201D;:&quot;idea&quot;,
    &#x201C;age&#x201D;:27
}
</code></pre><p>&#x53E6;&#x5916;&#x8FD8;&#x4F1A;&#x51FA;&#x73B0;&#x7559;&#x7A7A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>var person={}
</code></pre><p>&#x5219;&#x5176;&#x53EA;&#x5305;&#x542B;&#x9ED8;&#x8BA4;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x5BF9;&#x8C61;&#x5B57;&#x9762;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x597D;&#xFF0C;&#x8FD8;&#x7ED9;&#x4EBA;&#x6709;&#x5C01;&#x88C5;&#x6570;&#x636E;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E9B;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#xFF0C;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#xFF0C;&#x5B57;&#x9762;&#x91CF;&#x4E5F;&#x662F;&#x5411;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x5927;&#x91CF;&#x53EF;&#x9009;&#x53C2;&#x6570;&#x7684;&#x9996;&#x9009;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x8BBF;&#x95EE;&#x5BF9;&#x8C61;&#x5C5E;&#x6027;&#x65F6;&#x4F7F;&#x7528;&#x90FD;&#x662F;&#x70B9;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x4E0D;&#x8FC7;js&#x4E2D;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x8868;&#x793A;&#x6CD5;&#x6765;&#x8BBF;&#x95EE;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x5C06;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x5C5E;&#x6027;&#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F62;&#x5F0F;&#x653E;&#x5728;&#x65B9;&#x62EC;&#x53F7;&#x4E2D;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>alert(person[&quot;name&quot;]); // &quot;idea&quot;
</code></pre><p>&#x4ECE;&#x529F;&#x80FD;&#x4E0A;&#x770B;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x522B;&#xFF0C;&#x4F46;&#x65B9;&#x62EC;&#x53F7;&#x65B9;&#x6CD5;&#x6709;&#x4E2A;&#x4F18;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D8;&#x91CF;&#x8BBF;&#x95EE;&#x5C5E;&#x6027;&#xFF1A;</p>
<pre><code>var personName=&quot;name&quot;;
    alert(person[personName]); //&quot;idea&quot;
</code></pre><p>&#x5982;&#x679C;&#x5C5E;&#x6027;&#x540D;&#x4E2D;&#x5305;&#x542B;&#x4F1A;&#x5BFC;&#x81F4;&#x8BED;&#x6CD5;&#x9519;&#x8BEF;&#x7684;&#x5B57;&#x7B26;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x5173;&#x952E;&#x5B57;&#x6216;&#x4FDD;&#x7559;&#x5B57;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x8868;&#x793A;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>person[&quot;first name&quot;]=&quot;idea&quot;;
</code></pre><p>&#x56E0;&#x4E3A;&#x5C5E;&#x6027;&#x540D;&#x4E2D;&#x5305;&#x542B;&#x7A7A;&#x683C;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x70B9;&#x8868;&#x793A;&#x6CD5;&#x8BBF;&#x95EE;&#xFF0C;&#x7136;&#x800C;&#x5C5E;&#x6027;&#x540D;&#x4E2D;&#x662F;&#x5141;&#x8BB8;&#x5305;&#x542B;&#x975E;&#x5B57;&#x6BCD;&#x975E;&#x6570;&#x5B57;&#x7684;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x6CD5;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x9664;&#x975E;&#x5FC5;&#x987B;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x70B9;&#x8868;&#x793A;&#x6CD5;&#x3002;</p>
<h2 id="Array&#x7C7B;&#x578B;"><a href="#Array&#x7C7B;&#x578B;" class="headerlink" title="Array&#x7C7B;&#x578B;"></a>Array&#x7C7B;&#x578B;</h2><p>&#x9664;&#x4E86;Object&#x7C7B;&#x578B;&#xFF0C;Array&#x7C7B;&#x578B;&#x662F;ES&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x800C;&#x4E14;ES&#x4E2D;&#x7684;Array&#x548C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x5F53;&#x4E2D;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E14;&#x6570;&#x7EC4;&#x7684;&#x5927;&#x5C0F;&#x53EF;&#x4EE5;&#x52A8;&#x6001;&#x8C03;&#x6574;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x6570;&#x7EC4;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x5F0F;&#x6709;&#x4E24;&#x79CD;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E00;&#x79CD;</strong></p>
<pre><code>var colors=new Array();
</code></pre><p>&#x82E5;&#x77E5;&#x9053;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var colors=new Array(20);
</code></pre><p>&#x8FD8;&#x53EF;&#x4EE5;&#x628A;&#x6570;&#x7EC4;&#x7684;&#x9879;&#x76F4;&#x63A5;&#x5199;&#x8FDB;&#x53BB;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var colors=new Array(&quot;green&quot;,&quot;blue&quot;,&quot;yellow&quot;);
</code></pre><p>&#x7ED9;&#x6784;&#x9020;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x503C;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5206;&#x4E3A;&#x6570;&#x503C;&#x548C;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x4E4B;&#x5206;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>var colors=new Array(3)&#xFF1B;   //&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;3&#x7684;&#x6570;&#x7EC4;
    var colors=new Array(&quot;green&quot;); //&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E00;&#x9879;&#x503C;&#x4E3A;&#x201C;green&#x201D;&#x7684;&#x6570;&#x7EC4;
</code></pre><p>&#x53E6;&#x5916;&#xFF0C;&#x53EF;&#x4EE5;&#x7701;&#x7565;new&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>var colors=Array();
</code></pre><p><strong>&#x7B2C;&#x4E8C;&#x79CD;</strong></p>
<p>&#x6570;&#x7EC4;&#x5B57;&#x9762;&#x91CF;&#xFF0C;&#x76F4;&#x63A5;&#x770B;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>var numbers=[0,1,2,3,4];
</code></pre><p>&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;5&#x7684;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x5B8C;&#x4E86;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x57FA;&#x672C;&#x7684;&#x5C31;&#x662F;&#x8BFB;&#x53D6;&#x548C;&#x8BBE;&#x7F6E;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x65B9;&#x62EC;&#x53F7;&#x52A0;&#x4E0A;&#x6570;&#x5B57;&#x7D22;&#x5F15;&#xFF0C;&#x6570;&#x7EC4;&#x7684;&#x6570;&#x5B57;&#x7D22;&#x5F15;&#x4ECE;0&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;</p>
<pre><code>var colors=[&quot;red&quot;,&quot;blue&quot;];
    alert(colors[1]);   //&#x8BFB;&#x53D6;
    colors[0]=&quot;green&quot;;  //&#x8BBE;&#x7F6E;
</code></pre><p>&#x8BBF;&#x95EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x7D22;&#x5F15;&#x503C;&#x5BF9;&#x4E8E;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#xFF0C;&#x5219;&#x4F1A;&#x8FD4;&#x56DE;undefined&#xFF0C;&#x8BFB;&#x53D6;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x80FD;&#x8FD9;&#x6837;&#x8BFB;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x8BBE;&#x7F6E;&#x7684;&#x65F6;&#x5019;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4EE5;&#x4E0A;&#x6570;&#x7EC4;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;</p>
<pre><code>colors[2]=&quot;orange&quot;;
</code></pre><p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x7EC4;&#x5C31;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x9879;&#x5E76;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x957F;&#x5EA6;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7D27;&#x90BB;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;</p>
<pre><code>colors[10]=&quot;orange&quot;;
</code></pre><p>&#x90A3;&#x4E48;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;11&#x7684;&#x6570;&#x7EC4;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#xFF0C;&#x4E2D;&#x95F4;&#x7684;8&#x4E2A;&#x503C;&#x4E3A;undefined&#x3002;</p>
<p><strong>&#x68C0;&#x6D4B;&#x6570;&#x7EC4;</strong></p>
<p>&#x81EA;&#x4ECE;ES3&#x505A;&#x51FA;&#x89C4;&#x5B9A;&#xFF0C;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x786E;&#x5B9A;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#x7684;&#x7ECF;&#x5178;&#x95EE;&#x9898;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x6765;&#x4E66;&#x6B27;&#xFF0C;&#x4F7F;&#x7528;instance&#x64CD;&#x4F5C;&#x7B26;&#x5C31;&#x80FD;&#x5F97;&#x5230;&#x6EE1;&#x610F;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>if(value instanceof Array){}
</code></pre><p>&#x4F46;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x5047;&#x5B9A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x82E5;&#x6709;&#x591A;&#x4E2A;&#xFF0C;&#x5C31;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;Array&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;</p>
<p>ES5&#x65B0;&#x589E;&#x4E86;Array.isArray()&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x6700;&#x7EC8;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x503C;&#x5230;&#x5E95;&#x662F;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x5B83;&#x662F;&#x5728;&#x54EA;&#x4E2A;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#x521B;&#x5EFA;&#x7684;.&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>if(Array.isArray(value)){}
</code></pre><p>&#x4F46;&#x4F7F;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x65F6;&#x8981;&#x6CE8;&#x610F;&#x4F4E;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x3002;</p>
<p><strong>&#x8F6C;&#x6362;&#x65B9;&#x6CD5;</strong></p>
<p>toLocaleString(),toString(),valueOf()</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x4F1A;&#x8FD4;&#x56DE;&#x4EE5;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x7528;&#x9017;&#x53F7;&#x5206;&#x9694;&#x5F00;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x8C03;&#x7528;&#x4E86;&#x6BCF;&#x4E00;&#x9879;&#x7684;toString()&#x65B9;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x8FD4;&#x56DE;&#x7684;&#x8FD8;&#x662F;&#x6570;&#x7EC4;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x76F4;&#x63A5;alert()&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x7531;&#x4E8E;alert()&#x8981;&#x63A5;&#x6536;&#x5B57;&#x7B26;&#x4E32;&#x53C2;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4F1A;&#x5728;&#x540E;&#x53F0;&#x8C03;&#x7528;toString()&#x65B9;&#x6CD5;&#xFF0C;&#x7531;&#x6B64;&#x5F97;&#x5230;&#x548C;toString()&#x65B9;&#x6CD5;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x800C;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7ECF;&#x5E38;&#x4F1A;&#x548C;&#x540E;&#x4E24;&#x79CD;&#x8FD4;&#x56DE;&#x76F8;&#x540C;&#x7684;&#x503C;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x603B;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x5B83;&#x4F1A;&#x5BF9;&#x6BCF;&#x4E00;&#x9879;&#x8C03;&#x7528;toLocaleString()&#xFF0C;&#x800C;&#x4E0D;&#x662F;toString()&#x3002; </p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x53EF;&#x63A7;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;join(),&#x6BD4;&#x5982;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>var colors=[&quot;red&quot;,&quot;green&quot;,&quot;blue&quot;];
    alert(colors.join(&quot;.&quot;));
</code></pre><p>&#x5C31;&#x4F1A;&#x8FD4;&#x56DE;&#x4EE5;&#x70B9;&#x53F7;&#x9694;&#x5F00;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p><strong>&#x6808;&#x65B9;&#x6CD5;</strong></p>
<p>&#x6808;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5B66;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5E94;&#x8BE5;&#x90FD;&#x4E0D;&#x964C;&#x751F;&#xFF0C;&#x5C31;&#x7B97;&#x6CA1;&#x6709;&#x5B66;&#x8FC7;&#xFF0C;&#x4E5F;&#x4F1A;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x61C2;&#xFF0C;&#x56E0;&#x4E3A;&#x5723;&#x540E;&#x4E2D;&#x592A;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;LIFO(last in first out),&#x901A;&#x4FD7;&#x8BF4;&#x5C31;&#x662F;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#xFF0C;&#x6808;&#x4E2D;&#x7684;&#x9879;&#x6709;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4E14;&#x53EA;&#x53D1;&#x751F;&#x5728;&#x6808;&#x7684;&#x9876;&#x90E8;&#x3002;&#x5BF9;&#x6B64;&#xFF0C;ES&#x4E3A;&#x6570;&#x7EC4;&#x63D0;&#x4F9B;&#x4E86;push()&#x548C;pop()&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B9E;&#x73B0;&#x6808;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>push()&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x628A;&#x5B83;&#x4EEC;&#x9010;&#x4E2A;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x7EC4;&#x672B;&#x5C3E;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4FEE;&#x6539;&#x540E;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#xFF0C;pop()&#x65B9;&#x6CD5;&#x5219;&#x4ECE;&#x6570;&#x7EC4;&#x672B;&#x5C3E;&#x79FB;&#x9664;&#x6700;&#x540E;&#x4E00;&#x9879;&#xFF0C;&#x51CF;&#x5C11;&#x6570;&#x7EC4;&#x7684;length&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8FD4;&#x56DE;&#x79FB;&#x9664;&#x7684;&#x9879;&#x3002;</p>
<p><strong>&#x961F;&#x5217;&#x65B9;&#x6CD5;</strong></p>
<p>&#x548C;&#x6808;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x961F;&#x5217;&#x662F;FIFO(first in first out),&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF0C;&#x5728;&#x672B;&#x5C3E;&#x6DFB;&#x52A0;&#x9879;&#xFF0C;&#x4ECE;&#x5217;&#x8868;&#x7684;&#x524D;&#x7AEF;&#x79FB;&#x9664;&#xFF0C;&#x56E0;&#x4E3A;&#x7ED9;&#x672B;&#x5C3E;&#x6DFB;&#x52A0;&#x9879;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x65B9;&#x6CD5;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4ECE;&#x6570;&#x7EC4;&#x524D;&#x7AEF;&#x53D6;&#x5F97;&#x9879;&#x7684;&#x65B9;&#x6CD5;&#x2014;&#x2014;shift()&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x79FB;&#x9664;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x9879;&#x5E76;&#x8FD4;&#x56DE;&#x8BE5;&#x9879;&#xFF0C;&#x540C;&#x65F6;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x51CF;1&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;ES&#x8FD8;&#x4E3A;&#x6570;&#x7EC4;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;unshift()&#x65B9;&#x6CD5;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x548C;shift()&#x7684;&#x7528;&#x9014;&#x76F8;&#x53CD;&#xFF1A;&#x5B83;&#x80FD;&#x5728;&#x6570;&#x7EC4;&#x524D;&#x7AEF;&#x6DFB;&#x52A0;&#x4EFB;&#x610F;&#x4E2A;&#x9879;&#x5E76;&#x8FD4;&#x56DE;&#x65B0;&#x6570;&#x7EC4;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x540C;&#x65F6;&#x4F7F;&#x7528;unshift()&#x548C;pop()&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x76F8;&#x53CD;&#x65B9;&#x5411;&#x6765;&#x6A21;&#x62DF;&#x961F;&#x5217;&#xFF0C;&#x5373;&#x524D;&#x7AEF;&#x6DFB;&#x52A0;&#x9879;&#xFF0C;&#x672B;&#x7AEF;&#x79FB;&#x9664;&#x9879;&#x3002;</p>
<p><strong>&#x91CD;&#x6392;&#x5E8F;&#x65B9;&#x6CD5;</strong></p>
<p>&#x6570;&#x7EC4;&#x4E2D;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x6765;&#x91CD;&#x6392;&#x5E8F;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;reverse()&#x548C;sort()&#xFF0C;&#x524D;&#x8005;&#x7528;&#x4E8E;&#x53CD;&#x8F6C;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;sort()&#x65B9;&#x6CD5;&#x6309;&#x5347;&#x5E8F;&#x6392;&#x5217;&#x6570;&#x7EC4;&#x9879;&#xFF0C;&#x5373;&#x6700;&#x5C0F;&#x7684;&#x503C;&#x4F4D;&#x4E8E;&#x6700;&#x524D;&#x9762;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x503C;&#x6392;&#x5728;&#x540E;&#x9762;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x6392;&#x5E8F;&#xFF0C;sort()&#x65B9;&#x6CD5;&#x4F1A;&#x8C03;&#x7528;&#x6BCF;&#x4E2A;&#x6570;&#x7EC4;&#x9879;&#x7684;toString()&#x8F6C;&#x578B;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x6BD4;&#x8F83;&#x5F97;&#x5230;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x5982;&#x4F55;&#x6392;&#x5E8F;&#xFF0C;&#x5373;&#x4F7F;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x662F;&#x6570;&#x503C;&#xFF0C;sort()&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x7684;&#x4E5F;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>var values=[0,1,5,10,15];
    values.sort();
    alert(values); //0,1,10,15,5
</code></pre><p>&#x53EF;&#x89C1;&#xFF0C;&#x5373;&#x4F7F;&#x503C;&#x7684;&#x987A;&#x5E8F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F46;sort()&#x65B9;&#x6CD5;&#x4E5F;&#x6839;&#x636E;&#x6D4B;&#x8BD5;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x7ED3;&#x679C;&#x6539;&#x53D8;&#x539F;&#x6765;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x8FD9;&#x79CD;&#x6392;&#x5E8F;&#x65B9;&#x6CD5;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x65B9;&#x6848;&#xFF0C;&#x56E0;&#x6B64;sort()&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x51FD;&#x6570;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x6307;&#x5B9A;&#x54EA;&#x4E2A;&#x503C;&#x4F4D;&#x4E8E;&#x54EA;&#x4E2A;&#x503C;&#x7684;&#x524D;&#x9762;&#x3002;</p>
<p><strong>&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;</strong></p>
<p>ES&#x4E3A;&#x64CD;&#x4F5C;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x9879;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x65B9;&#x6CD5;&#x3002;</p>
<p>concat()&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x5F53;&#x524D;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x9879;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4F1A;&#x5148;&#x521B;&#x5EFA;&#x5F53;&#x524D;&#x6570;&#x7EC4;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x63A5;&#x6536;&#x5230;&#x7684;&#x53C2;&#x6570;&#x6DFB;&#x52A0;&#x5230;&#x8FD9;&#x4E2A;&#x526F;&#x672C;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x6700;&#x540E;&#x8FD4;&#x56DE;&#x65B0;&#x6784;&#x5EFA;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x7ED9;concat()&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#x53C2;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EC5;&#x662F;&#x590D;&#x5236;&#x5F53;&#x524D;&#x6570;&#x7EC4;&#xFF0C;&#x5982;&#x679C;&#x4F20;&#x9012;&#x7ED9;concat()&#x65B9;&#x6CD5;&#x7684;&#x662F;&#x4E00;&#x6216;&#x591A;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x5219;&#x8BE5;&#x65B9;&#x6CD5;&#x4F1A;&#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x6DFB;&#x52A0;&#x5230;&#x7ED3;&#x679C;&#x6570;&#x7EC4;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x4F20;&#x9012;&#x7684;&#x503C;&#x4E0D;&#x662F;&#x6570;&#x7EC4;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x5C31;&#x4F1A;&#x88AB;&#x7B80;&#x5355;&#x6DFB;&#x52A0;&#x5230;&#x7ED3;&#x679C;&#x6570;&#x7EC4;&#x7684;&#x672B;&#x5C3E;&#x3002;&#x4E0B;&#x9762;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>var colors=[&quot;red&quot;,&quot;green&quot;,&quot;blue&quot;];
    var colors2=colors.concat(&quot;yellow&quot;,[&quot;black&quot;,&quot;brown&quot;]);
    alert(colors2);   //red,green,blue,yellow,black,brown
</code></pre><p>slice()&#x65B9;&#x6CD5;,&#x5B83;&#x80FD;&#x591F;&#x57FA;&#x4E8E;&#x5F53;&#x524D;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4E00;&#x6216;&#x591A;&#x4E2A;&#x9879;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x6570;&#x7EC4;&#xFF0C;slice()&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4E00;&#x6216;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5373;&#x8981;&#x8FD4;&#x56DE;&#x9879;&#x7684;&#x8D77;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x3002;&#x5728;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;slice()&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4ECE;&#x8BE5;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#x5230;&#x5F53;&#x524D;&#x6570;&#x636E;&#x672B;&#x5C3E;&#x7684;&#x6240;&#x6709;&#x9879;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x8D77;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x4E4B;&#x95F4;&#x7684;&#x9879;&#x2014;&#x2014;&#x4F46;&#x4E0D;&#x5305;&#x62EC;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x7684;&#x9879;&#x3002;&#x6CE8;&#x610F;&#xFF0C;slice()&#x65B9;&#x6CD5;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x539F;&#x59CB;&#x6570;&#x7EC4;&#x3002;</p>
<pre><code>var colors=[&quot;red&quot;,&quot;green&quot;,&quot;blue&quot;,&#x201C;yellow&#x201D;,&quot;purple&quot;];
    var colors2=colors.slice(1,4);
    alert(colors2); //green,blue,yellow
</code></pre><p>&#x5176;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x4E3A;&#x8D1F;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x8D1F;&#x503C;&#xFF0C;&#x5219;&#x7528;&#x6570;&#x7EC4;&#x957F;&#x5EA6;&#x52A0;&#x4E0A;&#x8BE5;&#x6570;&#x6765;&#x786E;&#x5B9A;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5982;&#x679C;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x5C0F;&#x4E8E;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x7A7A;&#x6570;&#x7EC4;&#x3002;</p>
<p>splice()&#x65B9;&#x6CD5;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x662F;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x6570;&#x7EC4;&#x65B9;&#x6CD5;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x7528;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x9014;&#x662F;&#x5411;&#x6570;&#x7EC4;&#x4E2D;&#x90E8;&#x63D2;&#x5165;&#x9879;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x5982;&#x4E0B;3&#x79CD;&#xFF1A;</p>
<p>1&#x3001;&#x5220;&#x9664;&#xFF0C;&#x53EF;&#x5220;&#x9664;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x9879;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x8981;&#x5220;&#x7684;&#x7B2C;&#x4E00;&#x9879;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x5220;&#x9664;&#x7684;&#x9879;&#x6570;&#x3002;<br>2&#x3001;&#x63D2;&#x5165;&#xFF0C;&#x5411;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x63D2;&#x5165;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x9879;&#xFF0C;&#x9700;&#x63D0;&#x4F9B;3&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x3001;&#x8981;&#x5220;&#x9664;&#x7684;&#x9879;&#x6570;&#x548C;&#x8981;&#x63D2;&#x5165;&#x7684;&#x9879;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x63D2;&#x5165;&#x591A;&#x4E2A;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x518D;&#x4F20;&#x5165;&#x7B2C;&#x56DB;&#x3001;&#x7B2C;&#x4E94;&#x6216;&#x66F4;&#x591A;&#x7684;&#x9879;&#x3002;<br>3&#x3001;&#x66FF;&#x6362;&#xFF0C;&#x5411;&#x6307;&#x5B9A;&#x4F4D;&#x7F6E;&#x63D2;&#x5165;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x9879;&#xFF0C;&#x4E14;&#x540C;&#x65F6;&#x5220;&#x9664;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x9879;&#xFF0C;&#x53EA;&#x9700;&#x6307;&#x5B9A;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x8D77;&#x59CB;&#x4F4D;&#x7F6E;&#x3001;&#x8981;&#x5220;&#x9664;&#x7684;&#x9879;&#x6570;&#x548C;&#x8981;&#x63D2;&#x5165;&#x7684;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x9879;&#x3002;&#x63D2;&#x5165;&#x7684;&#x9879;&#x6570;&#x4E0D;&#x5FC5;&#x4E0E;&#x5220;&#x9664;&#x7684;&#x9879;&#x6570;&#x76F8;&#x7B49;&#x3002;</p>
<p>splice()&#x65B9;&#x6CD5;&#x59CB;&#x7EC8;&#x90FD;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x8BE5;&#x6570;&#x7EC4;&#x4E2D;&#x5305;&#x542B;&#x4ECE;&#x539F;&#x59CB;&#x6570;&#x7EC4;&#x4E2D;&#x5220;&#x9664;&#x7684;&#x9879;(&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x4E00;&#x9879;&#xFF0C;&#x5219;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7A7A;&#x6570;&#x7EC4;)&#x3002;</p>
<p><strong>&#x4F4D;&#x7F6E;&#x65B9;&#x6CD5;</strong></p>
<p>ES5&#x4E3A;&#x6570;&#x7EC4;&#x5B9E;&#x4F8B;&#x6DFB;&#x52A0;&#x4E86;&#x4E24;&#x4E2A;&#x4F4D;&#x7F6E;&#x65B9;&#x6CD5;&#xFF1A;indexOf()&#x548C;lastIndexOf()&#xFF0C;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x63A5;&#x6536;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x8981;&#x67E5;&#x627E;&#x7684;&#x9879;&#x8868;&#x793A;&#x67E5;&#x627E;&#x8D77;&#x70B9;&#x4F4D;&#x7F6E;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;indexOf()&#x65B9;&#x6CD5;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x5F00;&#x5934;&#x5F00;&#x59CB;&#x5411;&#x540E;&#x67E5;&#x627E;&#xFF0C;lastIndexOf()&#x65B9;&#x6CD5;&#x5219;&#x4ECE;&#x6570;&#x7EC4;&#x7684;&#x672B;&#x5C3E;&#x5F00;&#x59CB;&#x5411;&#x524D;&#x67E5;&#x627E;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#xFF0C;&#x8FD4;&#x56DE;-1.</p>
<p><strong>&#x8FED;&#x4EE3;&#x65B9;&#x6CD5;</strong></p>
<p>ES5&#x4E3A;&#x6570;&#x7EC4;&#x5B9A;&#x4E49;&#x4E86;5&#x4E2A;&#x8FED;&#x4EE3;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x63A5;&#x6536;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x8981;&#x8FD0;&#x884C;&#x7684;&#x51FD;&#x6570;&#x548C;&#x8FD0;&#x884C;&#x8BE5;&#x51FD;&#x6570;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5BF9;&#x8C61;&#x3002;&#x4F20;&#x5165;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x4F1A;&#x63A5;&#x6536;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x6570;&#x7EC4;&#x9879;&#x7684;&#x503C;&#xFF0C;&#x8BE5;&#x9879;&#x5728;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#x3002;&#x4F5C;&#x7528;&#x5206;&#x522B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>every()</p>
<p>&#x5BF9;&#x6570;&#x7EC4;&#x4E2D;&#x6BCF;&#x4E00;&#x9879;&#x8FD0;&#x884C;&#x7ED9;&#x5B9A;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x8FD4;&#x56DE;true&#xFF0C;&#x5219;&#x8FD4;&#x56DE;true&#x3002;</p>
<p>filter()</p>
<p>&#x5982;&#x5176;&#x540D;&#xFF0C;&#x6709;&#x8FC7;&#x6EE4;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5BF9;&#x6570;&#x7EC4;&#x6BCF;&#x4E00;&#x9879;&#x6267;&#x884C;&#x7ED9;&#x5B9A;&#x51FD;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x4E3A;true&#x7684;&#x9879;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;&#x3002;</p>
<p>forEach()</p>
<p>&#x5BF9;&#x6570;&#x7EC4;&#x6BCF;&#x4E00;&#x9879;&#x8FD0;&#x884C;&#x6307;&#x5B9A;&#x51FD;&#x6570;&#xFF0C;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x3002;</p>
<p>map()</p>
<p>&#x5BF9;&#x6BCF;&#x4E00;&#x9879;&#x8FD0;&#x884C;&#x6307;&#x5B9A;&#x51FD;&#x6570;&#xFF0C;&#x8FD4;&#x56DE;&#x6BCF;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7ED3;&#x679C;&#x7EC4;&#x6210;&#x7684;&#x6570;&#x7EC4;&#x3002;</p>
<p>some()</p>
<p>&#x6BCF;&#x4E00;&#x9879;&#x8FD0;&#x884C;&#x6307;&#x5B9A;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x6709;&#x4EFB;&#x4E00;&#x9879;&#x8FD4;&#x56DE;true&#xFF0C;&#x5219;&#x8FD4;&#x56DE;true</p>
<p><strong>&#x5F52;&#x5E76;&#x65B9;&#x6CD5;</strong></p>
<p>ES5&#x65B0;&#x589E;&#x4E86;&#x4E24;&#x4E2A;&#x5F52;&#x5E76;&#x6570;&#x7EC4;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;reduce()&#x548C;reduceRight()&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x4F1A;&#x8FED;&#x4EE3;&#x6570;&#x7EC4;&#x7684;&#x6240;&#x6709;&#x9879;&#xFF0C;&#x7136;&#x540E;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6700;&#x7EC8;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;reduce()&#x65B9;&#x6CD5;&#x4ECE;&#x7B2C;&#x4E00;&#x9879;&#x5F00;&#x59CB;&#xFF0C;&#x9010;&#x4E2A;&#x904D;&#x5386;&#x5230;&#x6700;&#x540E;&#xFF0C;reduceRight()&#x662F;&#x4ECE;&#x6700;&#x540E;&#x4E00;&#x9879;&#x5F00;&#x59CB;&#xFF0C;&#x5411;&#x524D;&#x904D;&#x5386;&#x5230;&#x7B2C;&#x4E00;&#x9879;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x63A5;&#x6536;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x4E00;&#x4E2A;&#x5728;&#x6BCF;&#x9879;&#x4E0A;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x548C;&#x4F5C;&#x4E3A;&#x5F52;&#x5E76;&#x57FA;&#x7840;&#x7684;&#x521D;&#x59CB;&#x503C;&#xFF08;&#x53EF;&#x9009;&#x7684;&#xFF09;&#x3002;&#x4F20;&#x7ED9;reduce()&#x548C;reduceRight()&#x7684;&#x51FD;&#x6570;&#x63A5;&#x6536;4&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x524D;&#x4E00;&#x4E2A;&#x503C;&#x3001;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x9879;&#x7684;&#x7D22;&#x5F15;&#x548C;&#x6570;&#x7EC4;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x7684;&#x4EFB;&#x4F55;&#x503C;&#x90FD;&#x4F1A;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x81EA;&#x52A8;&#x4F20;&#x7ED9;&#x4E0B;&#x4E00;&#x9879;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>&#x81F3;&#x6B64;&#xFF0C;&#x5BF9;Object&#x7C7B;&#x578B;&#x548C;Array&#x7C7B;&#x578B;&#x6709;&#x4E86;&#x4E2A;&#x7B80;&#x8981;&#x7684;&#x4ECB;&#x7ECD;&#x548C;&#x6982;&#x89C8;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x4E2A;&#x521D;&#x6B65;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x8981;&#x638C;&#x63E1;&#x548C;&#x7075;&#x6D3B;&#x8FD0;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD8;&#x9700;&#x66F4;&#x591A;&#x5B9E;&#x8DF5;&#x3002;&#x540E;&#x9762;&#x4F1A;&#x7EE7;&#x7EED;&#x8BA8;&#x8BBA;&#x5176;&#x4ED6;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x3002;&#x4E00;&#x8D77;&#x52A0;&#x6CB9;&#xFF0C;&#x4E00;&#x8D77;&#x8FDB;&#x6B65;&#x5427;~</p>
</div><a data-url="http://yoursite.com/2016/04/20/javascript-study-five/" data-id="cir6fe4fu0048voqixme3x81f" class="article-share-link">分享到</a><div class="tags"><a href="/tags/javascript/">javascript</a></div><div class="post-nav"><a href="/2016/06/27/less_sass/" class="pre">抛开语法，深度剖析CSS预处理器</a><a href="/2016/04/09/web_standard/" class="next">是时候再提web标准</a></div><div data-thread-key="2016/04/20/javascript-study-five/" data-title="征服javascript学习笔记（五）——引用类型Object和Array" data-url="http://yoursite.com/2016/04/20/javascript-study-five/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2016/04/20/javascript-study-five/" data-title="征服javascript学习笔记（五）——引用类型Object和Array" data-url="http://yoursite.com/2016/04/20/javascript-study-five/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/05/javascript-study-two/">征服javascript学习笔记（二）——基本概念（上）</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>