<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>灵感的小窝 | 生活琐碎、前端杂谈、诗情画意、随心笔记</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">灵感的小窝</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h2 class="post-title"><a href="/2014/08/09/你还在坚持吗？~/">你还在坚持吗？</a></h2><div class="post-meta">2014-08-09</div><a data-thread-key="2014/08/09/你还在坚持吗？~/" href="/2014/08/09/你还在坚持吗？~/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x8FD1;&#x671F;&#x7684;&#x5DE5;&#x4F5C;&#x4F9D;&#x7136;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x5C1D;&#x8BD5;&#x65B0;&#x4E8B;&#x7269;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x89C9;&#x5F97;&#x538B;&#x529B;&#x5C71;&#x5927;&#xFF0C;&#x4F46;&#x57FA;&#x672C;&#x90FD;&#x633A;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6210;&#x957F;&#x7684;&#x5FC5;&#x7ECF;&#x4E4B;&#x8DEF;&#x3002;&#x5404;&#x65B9;&#x9762;&#x7684;&#x5B66;&#x4E60;&#x4ECD;&#x5728;&#x6301;&#x7EED;&#x7740;&#xFF0C;&#x4F46;&#x4F3C;&#x4E4E;&#x4ECD;&#x7136;&#x654C;&#x4E0D;&#x8FC7;&#x65F6;&#x95F4;&#x5BF9;&#x8010;&#x6027;&#x7684;&#x8003;&#x9A8C;~&#x8FD8;&#x597D;&#xFF0C;&#x6211;&#x8FD8;&#x5728;&#x575A;&#x6301;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x4E00;&#x76F4;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x3002;</p></div><p class="readmore"><a href="/2014/08/09/你还在坚持吗？~/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/">初接触移动开发可能遇到的一部分问题（一无所知的可以看看）</a></h2><div class="post-meta">2014-07-05</div><a data-thread-key="2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/#comments" class="ds-thread-count"></a><div class="post-content"><h2 id="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"><a href="#&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"></a>&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;</h2><p>&#x662F;&#x7684;&#xFF0C;&#x7535;&#x8111;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5927;&#x81F4;&#x662F;&#x80CC;&#x666F;&#x5BBD;&#x5EA6;100%&#xFF0C;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x5C45;&#x4E2D;&#xFF0C;&#x5206;&#x680F;&#x5E03;&#x5C40;&#x6D6E;&#x52A8;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x5185;&#x5916;&#x8FB9;&#x8DDD;&#x7B49;&#x4FBF;&#x53EF;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x5230;&#x4E86;&#x79FB;&#x52A8;&#x7AEF;&#x5462;&#xFF1F;&#x5C4F;&#x5E55;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x5C0F;&#xFF0C;&#x4F60;&#x522B;&#x544A;&#x8BC9;&#x6211;&#x8981;&#x628A;&#x56FE;&#x7247;&#x548C;&#x6587;&#x5B57;&#x90FD;&#x8C03;&#x6574;&#x5230;&#x5F88;&#x5C0F;&#x7136;&#x540E;&#x628A;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x7ECF;&#x9A8C;&#x518D;&#x5168;&#x90E8;&#x642C;&#x8FC7;&#x6765;&#xFF0C;&#x663E;&#x7136;&#x4E0D;&#x9760;&#x8C31;&#xFF0C;&#x672C;&#x8EAB;&#x624B;&#x673A;&#x7F51;&#x9875;&#x6709;&#x7740;&#x5C4F;&#x5E55;&#x5C0F;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4FFA;&#x5C31;&#x610F;&#x5473;&#x7740;&#x7A7A;&#x95F4;&#x975E;&#x5E38;&#x5B9D;&#x8D35;&#xFF0C;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5730;&#x65B9;&#x7ED9;&#x4F60;&#x7559;&#x767D;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x533A;&#x57DF;&#x8981;&#x4E48;&#x53EF;&#x64CD;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x7528;&#x6765;&#x5C55;&#x793A;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x611F;&#x5B98;&#x548C;&#x64CD;&#x4F5C;&#x4FBF;&#x5229;&#x3002;</p></div><p class="readmore"><a href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/07/04/inser工作一月/">inser工作一月</a></h2><div class="post-meta">2014-07-04</div><a data-thread-key="2014/07/04/inser工作一月/" href="/2014/07/04/inser工作一月/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x8F9E;&#x53BB;&#x65E7;&#x7684;&#x5DE5;&#x4F5C;&#x4E4B;&#x540E;&#xFF0C;&#x6CA1;&#x60F3;&#x8FC7;&#x518D;&#x6B21;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x521B;&#x4E1A;&#x578B;&#x516C;&#x53F8;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x4EBA;&#x4E0D;&#x60F3;&#x53BB;&#x8FFD;&#x6C42;&#x884C;&#x4E1A;&#x91CC;&#x7684;&#x201C;&#x9AD8;&#x5BCC;&#x5E05;&#x201D;&#x751A;&#x81F3;&#x5DE8;&#x5934;&#xFF0C;&#x60F3;&#x53BB;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x73AF;&#x5883;&#x7ED9;&#x81EA;&#x5DF1;&#x9540;&#x91D1;&#x3002;&#x4F46;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x597D;&#x7684;&#x73AF;&#x5883;&#x548C;&#x5F85;&#x9047;&#xFF0C;&#x6C38;&#x8FDC;&#x90FD;&#x662F;&#x53EA;&#x7ED9;&#x8DB3;&#x591F;&#x4F18;&#x79C0;&#x7684;&#x4EBA;&#x51C6;&#x5907;&#x7684;&#xFF0C;&#x5F53;&#x4F60;&#x6EE1;&#x6000;&#x4FE1;&#x5FC3;&#x548C;&#x70ED;&#x5FF1;&#x7684;&#x53BB;&#xFF0C;&#x751A;&#x81F3;&#x80CC;&#x540E;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x4E0D;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x52AA;&#x529B;&#x53BB;&#x60F3;&#x4E3A;&#x81EA;&#x5DF1;&#x4E89;&#x53D6;&#x54EA;&#x6015;&#x4E00;&#x70B9;&#x5E0C;&#x671B;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x90FD;&#x8D77;&#x4E0D;&#x4E86;&#x591A;&#x5927;&#x4F5C;&#x7528;&#xFF0C;&#x516C;&#x53F8;&#x4E0D;&#x662F;&#x6536;&#x517B;&#x6240;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7AD9;&#x5728;&#x8001;&#x677F;&#x6216;&#x8005;HR&#x7684;&#x89D2;&#x5EA6;&#x53BB;&#x60F3;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x804C;&#x4F4D;&#x540D;&#x989D;&#x4E5F;&#x662F;&#x6709;&#x9650;&#x800C;&#x4E14;&#x5B9D;&#x8D35;&#x7684;&#xFF0C;&#x7406;&#x5E94;&#x4E0D;&#x5BF9;&#x4EFB;&#x4F55;&#x4E0D;&#x8FBE;&#x8981;&#x6C42;&#x7684;&#x4EBA;&#x624B;&#x8F6F;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x88AB;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x592A;&#x591A;&#x7684;&#x90C1;&#x95F7;&#x548C;&#x62B1;&#x6028;&#xFF0C;&#x90A3;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x4E5F;&#x66FE;&#x6709;&#x670B;&#x53CB;&#x6258;&#x6211;&#x4ECB;&#x7ECD;&#x5DE5;&#x4F5C;&#xFF0C;&#x6700;&#x5E38;&#x542C;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x5C31;&#x662F;&#xFF1A;&#x201C;&#x8BA9;&#x6211;&#x53BB;&#x5C31;&#x884C;&#xFF0C;&#x505A;&#x4EC0;&#x4E48;&#x90FD;&#x53EF;&#x4EE5;&#x201D;&#x3002;&#x90A3;&#x4E14;&#x95EE;&#xFF0C;&#x7A76;&#x7ADF;&#x8BA9;&#x4F60;&#x505A;&#x4EC0;&#x4E48;&#x5462;~&#x6CA1;&#x516C;&#x53F8;&#x4F1A;&#x63D0;&#x4F9B;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x6A21;&#x7CCA;&#x7684;&#x804C;&#x4F4D;&#xFF0C;&#x7ED9;&#x201C;&#x505A;&#x4EC0;&#x4E48;&#x90FD;&#x884C;&#x201D;&#x7684;&#x4EBA;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x8FD8;&#x662F;&#x60F3;&#x597D;&#x4F60;&#x5230;&#x5E95;&#x8981;&#x5E72;&#x561B;&#x5427;~</p></div><p class="readmore"><a href="/2014/07/04/inser工作一月/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/07/04/新工作一个月，深圳工作一周年记/">新工作一个月，深圳工作一周年记</a></h2><div class="post-meta">2014-07-04</div><a data-thread-key="2014/07/04/新工作一个月，深圳工作一周年记/" href="/2014/07/04/新工作一个月，深圳工作一周年记/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x524D;&#x51E0;&#x5929;&#x9519;&#x8FC7;&#x4E86;&#x6BD5;&#x4E1A;&#x548C;&#x6765;&#x6DF1;&#x5733;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x4ECA;&#x5929;&#x4E00;&#x770B;&#x65F6;&#x95F4;&#xFF0C;&#x6070;&#x662F;&#x5DE5;&#x4F5C;&#x4E00;&#x5468;&#x5E74;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x80FD;&#x518D;&#x9519;&#x8FC7;&#x4E86;~</p></div><p class="readmore"><a href="/2014/07/04/新工作一个月，深圳工作一周年记/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/05/28/五天面试（5.24—5.28）/">五天面试（5.24—5.28）</a></h2><div class="post-meta">2014-05-28</div><a data-thread-key="2014/05/28/五天面试（5.24—5.28）/" href="/2014/05/28/五天面试（5.24—5.28）/#comments" class="ds-thread-count"></a><div class="post-content"><h2 id="&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;"><a href="#&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;" class="headerlink" title="&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;"></a>&#x5929;&#x5B89;&#x6570;&#x7801;&#x57CE;&#xFF1A;</h2><p>&#x4ECE;&#x8F66;&#x516C;&#x5E99;&#x4E0B;&#x8F66;&#xFF0C;&#x6325;&#x6C57;&#x5982;&#x96E8;&#xFF0C;&#x8D70;&#x4E86;&#x4E0D;&#x5C11;&#x5F2F;&#x8DEF;&#xFF0C;&#x5230;&#x4E86;&#x697C;&#x4E0B;&#xFF0C;&#x4E58;&#x7535;&#x68AF;&#x4E0A;&#x53BB;&#xFF0C;&#x626D;&#x5934;&#x4E00;&#x770B;&#x5BF9;&#x9762;&#x662F;&#x730E;&#x8058;&#x7F51;&#xFF0C;&#x7740;&#x5B9E;&#x60CA;&#x8BB6;&#x4E86;&#x4E00;&#x4E0B;&#x3002;&#x7136;&#x540E;&#x5C31;&#x8FDB;&#x53BB;&#x4E86;&#xFF0C;&#x4E00;&#x4E2A;xx&#x603B;&#xFF0C;&#x4E00;&#x4E2A;&#x6280;&#x672F;&#x8001;&#x5927;&#x3002;&#x7B11;&#x5BB9;&#x53EF;&#x63AC;&#x7684;&#x770B;&#x7740;&#x6211;&#xFF0C;&#x63D0;&#x95EE;&#x7684;&#x5957;&#x8DEF;&#x4ECE;&#x4E13;&#x4E1A;&#x5230;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF0C;&#x5230;&#x4E3A;&#x4EC0;&#x4E48;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E74;&#x9F84;&#x7B49;&#x7B49;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x95EE;&#x4E86;&#x6280;&#x672F;&#x5458;&#x76F8;&#x5173;&#xFF1A;&#x56FE;&#x7247;&#x5904;&#x7406;&#x3001;&#x524D;&#x7AEF;&#x3001;&#x540E;&#x53F0;&#x3002;&#x5177;&#x4F53;&#x662F;&#x4E00;&#x5F20;&#x7167;&#x7247;&#x4E2D;&#x628A;&#x4E00;&#x4E2A;&#x73BB;&#x7483;&#x7F38;&#x6316;&#x51FA;&#x6765;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x675F;&#x82B1;&#xFF0C;&#x4E0D;&#x52A8;&#x53F6;&#x5B50;&#xFF0C;&#x600E;&#x4E48;&#x628A;&#x82B1;&#x4ECE;&#x7EA2;&#x8272;&#x53D8;&#x6210;&#x53D8;&#x6210;&#x9EC4;&#x8272;&#x3002;&#x3002;&#x3002;&#xFF08;&#x8FD9;&#x4E5F;&#x662F;&#x524D;&#x7AEF;&#x7684;&#x4E8B;&#x513F;&#x4E48;~&#xFF09;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x70B9;&#x504F;&#x4E86;&#xFF0C;&#x6CA1;&#x7B54;&#x51FA;&#x6765;&#xFF0C;&#x540E;&#x6765;&#x77E5;&#x9053;&#x5176;&#x5B9E;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x62A0;&#x51FA;&#x6765;&#x6539;&#x989C;&#x8272;&#x7684;&#xFF0C;&#x64E6;&#x3002;&#x3002;&#x3002;&#x518D;&#x7136;&#x540E;&#xFF0C;&#x8C08;&#x4E86;&#x516C;&#x53F8;&#x7684;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#xFF0C;&#x624D;&#x516D;&#x4E2A;&#x4EBA;&#xFF0C;&#x6280;&#x672F;&#x90E8;&#x6210;&#x7ACB;&#x4E00;&#x4E2A;&#x6708;&#x5DE6;&#x53F3;&#xFF0C;&#x505A;&#x5A5A;&#x5E86;&#x5E73;&#x53F0;&#x7684;&#xFF0C;&#x597D;&#x5427;&#x3002;&#x6280;&#x672F;&#x8FD9;&#x5757;&#x513F;&#x7B97;&#x662F;&#x6CA1;&#x987A;&#x5229;&#x8FC7;&#x5173;&#x3002;&#x63A5;&#x7740;&#x4F83;&#x4F83;&#x800C;&#x8C08;&#x516C;&#x53F8;&#x548C;&#x7F51;&#x7AD9;&#x65B9;&#x9762;&#xFF0C;&#x5012;&#x662F;&#x5F15;&#x8D77;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x597D;&#x611F;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x54E5;&#x8EAB;&#x4E0A;&#x8FD8;&#x7B97;&#x6709;&#x70B9;&#x4EAE;&#x70B9;&#x4E48;&#xFF08;&#x54C8;&#x54C8;&#xFF09;&#x3002;&#x6CA1;&#x62D2;&#x7EDD;&#x4E5F;&#x6CA1;&#x540C;&#x610F;&#xFF0C;&#x5F85;&#x5B9A;&#x3002;</p></div><p class="readmore"><a href="/2014/05/28/五天面试（5.24—5.28）/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/05/03/“看起来不错”其实挺重要！/">“看起来不错”其实挺重要！</a></h2><div class="post-meta">2014-05-03</div><a data-thread-key="2014/05/03/“看起来不错”其实挺重要！/" href="/2014/05/03/“看起来不错”其实挺重要！/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5F88;&#x591A;&#x4E8B;&#x7269;&#x7684;&#x7B2C;&#x4E00;&#x5370;&#x8C61;&#x751A;&#x81F3;&#x51B3;&#x5B9A;&#x6027;&#x5370;&#x8C61;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x89C6;&#x89C9;&#x6765;&#x4F20;&#x9012;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7528;&#x773C;&#x53BB;&#x611F;&#x89C9;&#xFF0C;&#x90A3;&#x4E48;&#x201C;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#x201D;&#x5C31;&#x663E;&#x5F97;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#xFF01;&#x53EF;&#x8FD9;&#x65F6;&#x5E38;&#x88AB;&#x4EBA;&#x5FFD;&#x7565;&#xFF0C;&#x8BA4;&#x4E3A;&#x90A3;&#x4F55;&#x5FC5;&#x5462;&#xFF0C;&#x90FD;&#x662F;&#x8868;&#x9762;&#x529F;&#x592B;&#xFF0C;&#x672C;&#x8D28;&#x597D;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x9519;~</p></div><p class="readmore"><a href="/2014/05/03/“看起来不错”其实挺重要！/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/03/23/逃离舒适区(转)/">逃离舒适区(转)</a></h2><div class="post-meta">2014-03-23</div><a data-thread-key="2014/03/23/逃离舒适区(转)/" href="/2014/03/23/逃离舒适区(转)/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x5F88;&#x65E9;&#x8BFB;&#x7684;&#x9003;&#x79BB;&#x8212;&#x9002;&#x533A;<br>&#x5F88;&#x65E9;&#x5C31;&#x5F00;&#x59CB;&#x8BD5;&#x4E86;</p></div><p class="readmore"><a href="/2014/03/23/逃离舒适区(转)/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/03/21/你的位置和你应有的态度（给所有刚开始努力的人）/">你的位置和你应有的态度（给所有刚开始努力的人）</a></h2><div class="post-meta">2014-03-21</div><a data-thread-key="2014/03/21/你的位置和你应有的态度（给所有刚开始努力的人）/" href="/2014/03/21/你的位置和你应有的态度（给所有刚开始努力的人）/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x6700;&#x8FD1;&#x8DDF;&#x540C;&#x4E8B;&#x4E00;&#x8D77;&#x53BB;&#x5065;&#x8EAB;&#xFF0C;&#x7ED3;&#x679C;&#x4E24;&#x4E2A;&#x661F;&#x671F;&#x4E0D;&#x5230;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x540C;&#x4E8B;&#x90FD;&#x6389;&#x961F;&#x4E86;&#xFF0C;&#x7ECF;&#x5E38;&#x53BB;&#x7684;&#x5C31;&#x53EA;&#x6709;&#x6211;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#xFF0C;&#x6700;&#x5E38;&#x53BB;&#x7684;&#x5C31;&#x53EA;&#x6709;&#x6211;&#x4E86;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x8BF4;&#xFF0C;&#x4EBA;&#x5C11;&#x4E86;&#x53BB;&#x6CA1;&#x610F;&#x601D;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x53BB;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x3002;&#x6211;&#x53EA;&#x60F3;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x529E;&#x7684;&#x5E74;&#x5361;&#xFF0C;&#x534A;&#x4E2A;&#x6708;&#x90FD;&#x6491;&#x4E0D;&#x5230;&#x5C31;&#x4E0D;&#x53BB;&#x4E86;&#xFF0C;&#x90A3;&#x4E0D;&#x4EC5;&#x4EC5;&#x8BF4;&#x660E;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x61D2;&#xFF0C;&#x4E0D;&#x60F3;&#x53BB;&#x5065;&#x8EAB;&#xFF0C;&#x5176;&#x5B9E;&#x53CD;&#x6620;&#x51FA;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;&#x5F85;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x7684;&#x6001;&#x5EA6;&#x548C;&#x98CE;&#x683C;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#x662F;&#x5426;&#x591F;&#x8D1F;&#x8D23;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x51B3;&#x5B9A;&#x4E86;&#x7684;&#x4E1C;&#x897F;&#x591F;&#x4E0D;&#x591F;&#x575A;&#x6301;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#xFF0C;&#x4ECA;&#x5929;&#x6709;&#x4E2A;&#x5065;&#x8EAB;&#x6559;&#x7EC3;&#x624D;&#x8DDF;&#x6211;&#x8BF4;&#xFF0C;&#x521D;&#x671F;&#x9636;&#x6BB5;&#x4E5F;&#x5F97;&#x6709;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#xFF0C;&#x5728;&#x524D;&#x8FDB;&#x7684;&#x9053;&#x8DEF;&#x4E0A;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x8FDE;&#x521D;&#x671F;&#x9636;&#x6BB5;&#x8FD8;&#x6CA1;&#x5B8C;&#x6210;&#x5C31;&#x653E;&#x5F03;&#x4E86;&#x3002;&#x6211;&#x65E9;&#x5C31;&#x8BF4;&#x8FC7;&#xFF0C;&#x653E;&#x5F03;&#x662F;&#x4E16;&#x754C;&#x4E0A;&#x6700;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x8981;&#x4E0D;&#x53BB;&#x505A;&#x5C31;&#x662F;&#x4E86;,&#x6267;&#x884C;&#x529B;&#x548C;&#x6BC5;&#x529B;&#x51B3;&#x5B9A;&#x4E86;&#x592A;&#x591A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x6709;&#x6CA1;&#x6709;&#x7ED3;&#x679C;&#xFF0C;&#x80FD;&#x4E0D;&#x80FD;&#x4FDD;&#x6301;&#x4E0B;&#x53BB;&#x8FBE;&#x5230;&#x6700;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x8FBE;&#x5230;&#x6700;&#x7EC8;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x4ECE;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E00;&#x4E24;&#x4EF6;&#x5C0F;&#x4E8B;&#x5C31;&#x80FD;&#x770B;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x65F6;&#x5019;&#x770B;&#x4EBA;&#x5C31;&#x77E5;&#x9053;&#x80FD;&#x4E0D;&#x80FD;&#x6210;&#x4E8B;&#x7684;&#x539F;&#x56E0;&#x5427;&#x3002;</p></div><p class="readmore"><a href="/2014/03/21/你的位置和你应有的态度（给所有刚开始努力的人）/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/03/20/重复和渐进，让复杂的东西变简单，简单的变神奇！/">重复和渐进，让复杂的东西变简单，简单的变神奇！</a></h2><div class="post-meta">2014-03-20</div><a data-thread-key="2014/03/20/重复和渐进，让复杂的东西变简单，简单的变神奇！/" href="/2014/03/20/重复和渐进，让复杂的东西变简单，简单的变神奇！/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x6CA1;&#x6709;&#x54EA;&#x4E00;&#x9879;&#x77E5;&#x8BC6;&#x4E0D;&#x662F;&#x6D69;&#x5982;&#x70DF;&#x6D77;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x5B83;&#x7684;&#x8BA4;&#x77E5;&#x4E5F;&#x4F1A;&#x4ECE;&#x964C;&#x751F;&#x719F;&#x6089;&#xFF0C;&#x518D;&#x5230;&#x611F;&#x89C9;&#x5B83;&#x65E0;&#x9650;&#x5927;&#x3002;</p></div><p class="readmore"><a href="/2014/03/20/重复和渐进，让复杂的东西变简单，简单的变神奇！/">阅读更多</a></p></div><div class="post"><h2 class="post-title"><a href="/2014/03/09/什么在阻止你前进？“应该的”和“想的”/">什么在阻止你前进？“应该的”和“想的”</a></h2><div class="post-meta">2014-03-09</div><a data-thread-key="2014/03/09/什么在阻止你前进？“应该的”和“想的”/" href="/2014/03/09/什么在阻止你前进？“应该的”和“想的”/#comments" class="ds-thread-count"></a><div class="post-content"><p>&#x4E00;&#x4E2A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x8D28;&#x91CF;&#x4ECE;&#x4E00;&#x5929;&#x7684;&#x5F00;&#x59CB;&#x5C31;&#x663E;&#x73B0;&#xFF0C;&#x65E9;&#x4E0A;&#x4F60;&#x662F;&#x65E9;&#x65E9;&#x7684;&#x8D77;&#x6765;&#x6D17;&#x6D17;&#x5237;&#x5237;&#xFF0C;&#x8212;&#x5C55;&#x4E00;&#x4E0B;&#x56DB;&#x80A2;&#xFF0C;&#x5403;&#x70B9;&#x8425;&#x517B;&#x65E9;&#x9910;&#xFF0C;&#x8FD8;&#x662F;&#x3002;&#x3002;&#x3002;&#x3002;&#x5728;&#x88AB;&#x7A9D;&#x91CC;&#x547C;&#x547C;&#x5927;&#x7761;&#x5230;&#x534A;&#x4E2D;&#x5348;&#x624D;&#x722C;&#x8D77;&#x6765;&#xFF0C;&#x7761;&#x773C;&#x6726;&#x80E7;&#x7684;&#x770B;&#x7740;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF1F;</p></div><p class="readmore"><a href="/2014/03/09/什么在阻止你前进？“应该的”和“想的”/">阅读更多</a></p></div><nav class="page-navigator"><a class="extend prev" rel="prev" href="/page/3/">上一页</a><a class="page-number" href="/">1</a><a class="page-number" href="/page/2/">2</a><a class="page-number" href="/page/3/">3</a><span class="page-number current">4</span><a class="page-number" href="/page/5/">5</a><a class="extend next" rel="next" href="/page/5/">下一页</a></nav></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/02/24/new-year-first-do/">新年伊始，我都做了些什么</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/01/01/2015-summary/">梦幻般的2015，更丰盈的2016</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/14/自学者需要具备的基本技能和素质/">自学者需要具备的基本技能和素质</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/01/basic-layout/">说说基本的布局观</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/10/17/those-year-i-do-bad/">那些年我干过的矬事</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/09/13/zuiniu-birth/">醉牛前端诞生记</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/08/08/two-years-fe/">两年前端行</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/08/07/front-end-home-margin-that-thing/">margin那些事儿</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/22/再谈css/">再谈css</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/19/front-home-lineheight-and-vertical/">浅析line-height和vertical</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>