<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>轻松入门css3之border-image | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">轻松入门css3之border-image</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">轻松入门css3之border-image</h1><div class="post-meta">Oct 5, 2014<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2014/10/05/border-image/" href="/2014/10/05/border-image/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#先来说第一点"><span class="toc-number">1.</span> <span class="toc-text">先来说第一点</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#再说第二点"><span class="toc-number">2.</span> <span class="toc-text">再说第二点</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#一、repeat和round怎么那么像呢，有什么区别呢？"><span class="toc-number">3.</span> <span class="toc-text">一、repeat和round怎么那么像呢，有什么区别呢？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#二、为什么不能直接选择一个图片，控制大小，控制水平、垂直方向的显示方式就完事儿了呢？"><span class="toc-number">4.</span> <span class="toc-text">二、为什么不能直接选择一个图片，控制大小，控制水平、垂直方向的显示方式就完事儿了呢？</span></a></li></ol></div></div><div class="post-content"><p>&#x8BDD;&#x8BF4;&#x5927;&#x5BB6;&#x4E0D;&#x7BA1;&#x7528;&#x8FC7;&#x6CA1;&#x7528;&#x8FC7;&#xFF0C;&#x5BF9;border-image&#x5E94;&#x8BE5;&#x90FD;&#x6709;&#x6240;&#x8033;&#x95FB;&#xFF0C;&#x76F8;&#x6BD4;css2.1&#xFF0C;css3&#x7684;&#x65B0;&#x4E1C;&#x897F;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6311;&#x8FD9;&#x4E2A;&#x6765;&#x8BF4;&#x5462;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E2A;&#x76F8;&#x5BF9;&#x6765;&#x8BF4;&#x8F83;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x90A3;&#x5B83;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x53C8;&#x600E;&#x4E48;&#x7528;&#x5462;&#xFF0C;&#x6709;&#x54EA;&#x4E9B;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF1F;&#x8FD9;&#x65B9;&#x9762;&#x4E5F;&#x6709;&#x4E66;&#x7C4D;&#x548C;&#x6587;&#x7AE0;&#x8BB2;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x770B;&#x8FC7;&#xFF0C;&#x5374;&#x89C9;&#x5F97;&#x6CA1;&#x641E;&#x61C2;&#xFF0C;&#x4E5F;&#x6CA1;&#x5F04;&#x660E;&#x767D;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#xFF0C;&#x90A3;&#x4E48;&#x5E0C;&#x671B;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x53EF;&#x4EE5;&#x5E2E;&#x5230;&#x4F60;&#xFF01;&#x6211;&#x4E0D;&#x4F1A;&#x6309;&#x5E38;&#x7406;&#x51FA;&#x724C;~</p>
<p>&#x9996;&#x5148;&#x8981;&#x8DDF;&#x5927;&#x5BB6;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x8981;&#x5148;&#x5165;&#x4E3A;&#x4E3B;&#x7684;&#x8D70;&#x5165;&#x4E00;&#x4E2A;&#x6B7B;&#x80E1;&#x540C;&#xFF0C;&#x4E0D;&#x7136;&#x5F88;&#x96BE;&#x8D70;&#x51FA;&#x6765;&#xFF0C;&#x56FE;&#x7247;&#x8FB9;&#x6846;&#xFF0C;&#x8DDF;&#x4F7F;&#x7528;&#x7EBF;&#x578B;&#x8FB9;&#x6846;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x601D;&#x7EF4;&#x8981;&#x8F6C;&#x6362;&#x8FC7;&#x6765;&#xFF0C;&#x4F7F;&#x7528;&#x7EBF;&#x578B;&#x8FB9;&#x6846;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x201C;&#x8FB9;&#x6846;&#x5BBD;&#x5EA6;&#x201D;&#x3001;&#x201C;&#x7C7B;&#x578B;&#x201D;&#x548C;&#x201C;&#x989C;&#x8272;&#x201D;&#x3002;&#x90A3;&#x4E48;&#x8FB9;&#x6846;&#x5C31;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x4F7F;&#x7528;&#x56FE;&#x7247;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x4E0D;&#x80FD;&#x7167;&#x642C;&#xFF0C;&#x5B83;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x5957;&#x89C4;&#x5219;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8BF7;&#x6E05;&#x7A7A;&#x4F60;&#x7684;&#x8111;&#x888B;&#xFF0C;&#x5FD8;&#x5374;&#x624D;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x5B66;&#x4E60;&#xFF08;&#x8FD9;&#x8BDD;&#x597D;&#x50CF;&#x5728;&#x6B66;&#x4FA0;&#x7247;&#x91CC;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#xFF09;~</p>
<p>&#x4F60;&#x9700;&#x8981;&#x638C;&#x63E1;&#x7684;&#x8981;&#x9886;&#x53EA;&#x6709;&#x4E24;&#x70B9;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x56FE;&#x7247;&#x88C1;&#x526A;&#x7684;&#x65B9;&#x5F0F;<br>&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x88C1;&#x526A;&#xFF0C;&#x88C1;&#x526A;&#x5B8C;&#x4E4B;&#x540E;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x52A8;&#x4F5C;&#xFF1F;</p>
<h2 id="&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;"><a href="#&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;" class="headerlink" title="&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;"></a>&#x5148;&#x6765;&#x8BF4;&#x7B2C;&#x4E00;&#x70B9;</h2><p>&#x4E0D;&#x8981;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x6709;&#x591A;&#x9EBB;&#x70E6;&#xFF0C;&#x591A;&#x6DF1;&#x5965;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x73A9;&#x513F;&#x8FC7;&#x4E00;&#x79CD;&#x667A;&#x529B;&#x6E38;&#x620F;&#x5427;&#xFF0C;&#x53EB;&#x505A;&#x201C;&#x4F60;&#x80FD;&#x7528;&#x51E0;&#x5200;&#x628A;&#x4E00;&#x4E2A;&#x6B63;&#x65B9;&#x5F62;&#x5207;&#x6210;&#x4E5D;&#x5757;&#xFF1F;&#x201D;&#x6216;&#x8005;&#x8BF4;&#x201C;&#x53EA;&#x7528;&#x51E0;&#x5200;&#x4F60;&#x80FD;&#x628A;&#x4EC0;&#x4E48;&#x5207;&#x6210;&#x591A;&#x5C11;&#x5757;&#x201D;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x56FE;&#x7247;&#x88C1;&#x526A;&#x662F;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x77AC;&#x95F4;&#x89C9;&#x5F97;&#x4EB2;&#x5207;&#x5F88;&#x591A;&#xFF1F;&#x5B83;&#x5C31;&#x662F;&#x6A2A;&#x7AD6;&#x5404;&#x4E24;&#x5200;&#x6765;&#x628A;&#x4F60;&#x6240;&#x9009;&#x53D6;&#x7684;&#x56FE;&#x7247;&#x5207;&#x6210;&#x4E5D;&#x4EFD;&#xFF0C;&#x5C31;&#x662F;&#x5F88;&#x591A;&#x8D44;&#x6599;&#x91CC;&#x8BF4;&#x7684;&#x201C;&#x4E5D;&#x5BAB;&#x683C;&#x201D;&#x6A21;&#x6837;&#xFF0C;&#x662F;&#x600E;&#x4E48;&#x5207;&#x7684;&#x5462;&#xFF1F;&#x6CE8;&#x610F;&#xFF0C;&#x5207;&#x7684;&#x6B21;&#x6570;&#x662F;4&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x86EE;&#x719F;&#x6089;&#x7684;&#x5427;&#xFF0C;margin&#x3001;padding&#x3001;border&#x7B49;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6709;&#x56DB;&#x4E2A;&#x65B9;&#x5411;&#x7684;&#x89C4;&#x5219;&#x5427;&#xFF0C;&#x6B64;&#x5904;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x9075;&#x5FAA;&#x4E0A;&#x3001;&#x53F3;&#x3001;&#x4E0B;&#x3001;&#x5DE6;&#xFF0C;&#x90A3;&#x662F;&#x600E;&#x4E48;&#x6D4B;&#x91CF;&#x7684;&#x5462;&#xFF1F;&#x4F60;&#x5E94;&#x8BE5;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x662F;&#x4ECE;&#x8FB9;&#x7F18;&#x5411;&#x91CC;&#x6D4B;&#x91CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0A;&#x8FB9;&#x7F18;&#x5411;&#x4E0B;&#xFF0C;&#x53F3;&#x8FB9;&#x7F18;&#x5411;&#x5DE6;&#xFF0C;&#x4F9D;&#x6B21;&#x7C7B;&#x63A8;&#x3002;&#x50CF;&#x5176;&#x4ED6;&#x89C4;&#x5219;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x7B80;&#x5199;&#x4E4B;&#xFF0C;&#x5199;&#x4E00;&#x4E2A;&#xFF0C;&#x4E24;&#x4E2A;&#x3001;&#x4E09;&#x4E2A;&#x90FD;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4F1A;&#x5728;&#x4E0B;&#x9762;&#x5949;&#x4E0A;&#xFF01;~</p>
<h2 id="&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;"><a href="#&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;" class="headerlink" title="&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;"></a>&#x518D;&#x8BF4;&#x7B2C;&#x4E8C;&#x70B9;</h2><p>&#x6216;&#x8BB8;&#x4F1A;&#x6709;&#x4EBA;&#x8BF4;&#xFF0C;&#x6211;&#x770B;&#x4F60;&#x8BF4;&#x600E;&#x4E48;&#x6D4B;&#x91CF;&#xFF0C;&#x600E;&#x4E48;&#x88C1;&#x526A;&#xFF0C;&#x5934;&#x90FD;&#x5927;&#x4E86;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x8981;&#x5E72;&#x561B;&#x554A;&#xFF1F;&#x6211;&#x5C31;&#x7528;&#x4E2A;&#x8FB9;&#x6846;&#x8FD8;&#x641E;&#x8FD9;&#x4E48;&#x590D;&#x6742;&#x3002;&#x76F8;&#x4FE1;&#x6211;&#xFF0C;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x8BF4;&#x660E;&#x88C1;&#x526A;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x5E72;&#x561B;&#xFF0C;&#x6765;&#x62FF;&#x5F20;&#x56FE;&#x7247;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;w3c&#x6559;&#x7A0B;&#x7F51;&#x7684;&#x56FE;&#x7247;</p>
<p><img src="/2014/10/05/border-image/1.png" alt=""></p>
<p>&#x5148;&#x8FD9;&#x4E48;&#x7C97;&#x7CD9;&#x7684;&#x7ED9;&#x5927;&#x5BB6;&#x753B;&#x4E00;&#x5E45;&#xFF0C;&#x5DF2;&#x7ECF;&#x5207;&#x6210;&#x4E5D;&#x5757;&#x4E86;&#x5BF9;&#x5427;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8981;&#x5E72;&#x561B;&#x5462;&#xFF0C;&#x8981;&#x53D1;&#x529F;&#x4E86;&#xFF01;&#x5475;&#x5475;&#xFF0C;&#x5F00;&#x73A9;&#x7B11;&#x3002;</p>
<p>&#x56FE;&#x7247;&#x8FB9;&#x6846;&#x7684;&#x7ED8;&#x5236;&#x8FDB;&#x5165;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x5173;&#x952E;&#x7684;&#x4E00;&#x6B65;&#xFF1A;</p>
<p>&#x5207;&#x8BB0;&#xFF0C;&#x56DB;&#x4E2A;&#x89D2;&#x662F;&#x4E0D;&#x52A8;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x4F60;&#x5E94;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x4F5C;&#x4E3A;&#x8FB9;&#x6846;&#xFF0C;&#x56DB;&#x4E2A;&#x89D2;&#x8FD8;&#x662F;&#x7EA2;&#x8272;&#x83F1;&#x5F62;&#xFF0C;&#x4F60;&#x4E5F;&#x63A7;&#x5236;&#x4E0D;&#x4E86;&#x5B83;&#xFF08;&#x9664;&#x4E86;&#x5C3A;&#x5BF8;&#xFF09;&#x3002;&#x90A3;&#x4E2D;&#x95F4;&#x5462;&#xFF0C;&#x4E2D;&#x95F4;&#x4E5F;&#x662F;&#x4E0D;&#x663E;&#x793A;&#x7684;&#xFF0C;&#x5927;&#x6F20;&#x54E5;&#x7684;&#x6587;&#x7AE0;&#x91CC;&#x628A;&#x5B83;&#x79F0;&#x4E3A;&#x201C;&#x76F2;&#x533A;&#x201D;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x62FF;&#x6389;&#xFF01;&#x5C31;&#x53EA;&#x5269;&#x56DB;&#x4E2A;&#x9EC4;&#x8272;&#x83F1;&#x5F62;&#x4E86;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x6B63;&#x7ECF;&#x7684;&#x8BB2;&#x4E00;&#x4E0B;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x3002;&#x6211;&#x505A;&#x4E00;&#x4E2A;&#x5F62;&#x8C61;&#x7684;&#x6BD4;&#x55BB;&#x5427;&#xFF0C;&#x7ED9;&#x5143;&#x7D20;&#x52A0;&#x4E0A;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8FB9;&#x6846;&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x7136;&#x540E;&#x6309;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x533A;&#x57DF;&#x628A;&#x4E2D;&#x95F4;&#x638F;&#x7A7A;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5411;&#x56DB;&#x5468;&#x6491;&#x5F00;&#xFF01;</p>
<p>&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x683C;&#x5F0F;&#xFF1A;<br>border-image:url(&#x56FE;&#x7247;&#x8DEF;&#x5F84;)    &#x88C1;&#x526A;&#x5C3A;&#x5BF8;   &#x88C1;&#x526A;&#x8FC7;&#x540E;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#xFF08;&#x5C31;&#x4E0A;&#x56FE;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x56DB;&#x4E2A;&#x9EC4;&#x8272;&#x83F1;&#x5F62;&#x7684;&#x6392;&#x5217;&#x65B9;&#x5F0F;&#xFF09;</p>
<p>&#x6392;&#x5217;&#x65B9;&#x5F0F;&#x6709;&#x4E09;&#x79CD;round&#x3001;repeat&#x3001;stretch&#x5206;&#x522B;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x662F;&#x4EC0;&#x4E48;&#x6548;&#x679C;</p>
<p>round&#xFF08;&#x5E73;&#x94FA;&#xFF09;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 round;border-width:27px;width:800px;height:100px;background:#0CC;}
</code></pre><p>&#x6548;&#x679C;</p>
<p><img src="/2014/10/05/border-image/2.png" alt=""> </p>
<p>repeat&#xFF08;&#x91CD;&#x590D;&#xFF09;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 repeat;border-width:27px;width:800px;height:100px;background:#0CC;}
</code></pre><p>&#x6548;&#x679C;</p>
<p><img src="/2014/10/05/border-image/3.png" alt=""> </p>
<p>stretch&#xFF08;&#x62C9;&#x4F38;&#xFF09;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 stretch;border-width:27px;width:800px;height:100px;background:#0CC;}
</code></pre><p>&#x6548;&#x679C;</p>
<p><img src="/2014/10/05/border-image/4.png" alt=""></p>
<p>&#x6CE8;&#xFF1A;IE&#x5F00;&#x53D1;&#x8005;&#x5E73;&#x53F0;&#x8FD8;&#x7ED9;&#x51FA;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;space&#xFF0C;&#x636E;&#x6211;&#x6D4B;&#x8BD5;&#xFF0C;&#x8DDF;repeat&#x6CA1;&#x770B;&#x51FA;&#x6765;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x65B0;&#x53D1;&#x73B0;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;~</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x4E09;&#x79CD;&#x5C55;&#x793A;&#x5B8C;&#x4E86;&#xFF0C;&#x76F8;&#x4FE1;&#x7528;&#x8FC7;&#x80CC;&#x666F;&#x56FE;&#x7247;&#x6216;&#x8005;&#x8BBE;&#x7F6E;&#x8FC7;&#x7535;&#x8111;&#x684C;&#x9762;&#x56FE;&#x7247;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x5E73;&#x94FA;&#x548C;&#x62C9;&#x4F38;&#x90FD;&#x5F88;&#x719F;&#x6089;&#x5427;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x96BE;&#x7406;&#x89E3;&#x3002;&#x73B0;&#x5728;&#x8BE5;&#x8BF4;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4E86;&#x3002;</p>
<p>&#x77ED;&#x77ED;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5230;&#x5E95;&#x85CF;&#x6709;&#x591A;&#x5C11;&#x7384;&#x673A;&#x5462;&#xFF1F;&#xFF08;&#x6545;&#x5F04;&#x7384;&#x865A;&#x4E86;&#x54C8;~&#xFF09;</p>
<p>1&#x3001;&#x56FE;&#x7247;&#x8DEF;&#x5F84;&#x4E00;&#x5B9A;&#x4E0D;&#x8981;&#x9519;&#xFF0C;&#x53EF;&#x4E3A;&#x7EDD;&#x5BF9;&#x6216;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;<br>2&#x3001;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5230;&#x88C1;&#x526A;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x7528;&#x4E86;27&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x56FE;&#x7247;&#x7684;&#x5BBD;&#x9AD8;&#x5747;&#x4E3A;81&#xFF0C;&#x4F7F;&#x7528;27&#x80FD;&#x628A;&#x5B83;&#x7684;&#x8FB9;&#x8FDB;&#x884C;&#x4E09;&#x7B49;&#x5206;&#xFF0C;&#x526A;&#x51FA;&#x4E09;&#x4E2A;&#x5B8C;&#x6574;&#x83F1;&#x5F62;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x597D;&#x770B;&#xFF0C;&#x4F60;&#x60F3;&#x7528;&#x591A;&#x5927;&#x7528;&#x591A;&#x5927;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x5F71;&#x54CD;&#x4F60;&#x6210;&#x529F;&#x7684;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8981;&#x5728;&#x539F;&#x56FE;&#x5C3A;&#x5BF8;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;0&#x6216;&#x8005;81&#x662F;&#x4EC0;&#x4E48;&#x6548;&#x679C;~&#x53E6;&#x5916;&#xFF0C;&#x5B83;&#x6CA1;&#x5E26;&#x5355;&#x4F4D;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x5B83;&#x9ED8;&#x8BA4;&#x5355;&#x4F4D;&#x5C31;&#x662F;&#x201C;px&#x201D;&#xFF0C;&#x5E26;&#x4E0A;&#x5355;&#x4F4D;&#x53CD;&#x800C;&#x4F1A;&#x9519;&#xFF01;&#xFF01;<br>3&#x3001;&#x4F7F;&#x7528;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x53EF;&#x4EE5;&#x53EA;&#x5199;&#x4E00;&#x4E2A;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4E0A;&#x9762;&#x90A3;&#x6837;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5199;&#x4E24;&#x4E2A;&#xFF0C;&#x4F46;&#x5207;&#x8BB0;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x7684;&#x8BF4;&#xFF0C;&#x53EF;&#x4E0D;&#x53EF;&#x4EE5;&#x5199;&#x4E09;&#x4E2A;&#x6216;&#x8005;&#x56DB;&#x4E2A;&#x5462;&#xFF1F;&#x4E0D;&#x884C;&#xFF01;&#x4E0D;&#x4EC5;&#x8BF8;&#x5982; round repeat stretch&#x8FD9;&#x6837;&#x7684;&#x4E0D;&#x884C;&#xFF0C;round repeat round&#x548C;round repeat round repeat&#x8FD9;&#x6837;&#x770B;&#x4F3C;&#x5408;&#x7406;&#x7684;&#x4E5F;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF01;&#xFF01;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E0D;&#x5199;&#x4E5F;&#x53EF;&#x4EE5;&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x662F; stretch&#x3002;</p>
<p>&#x7ED9;&#x51FA;stretch round &#x7ED3;&#x5408;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x6CE8;&#x610F;&#xFF0C;&#x524D;&#x9762;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x4E0A;&#x4E0B;&#xFF0C;&#x540E;&#x9762;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x5DE6;&#x53F3;&#x3002;</p>
<p><img src="/2014/10/05/border-image/5.png" alt=""></p>
<p>4&#x3001;&#x8FB9;&#x6846;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x9996;&#x5148;&#x8FD9;&#x4E2A;&#x662F;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x4E0D;&#x7136;&#x662F;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x53CD;&#x5E94;&#x7684;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x8FB9;&#x6846;&#x7684;&#x5BBD;&#x5EA6;&#x548C;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x65E0;&#x5173;&#xFF0C;&#x539F;&#x59CB;&#x56FE;&#x7247;&#x53EA;&#x662F;&#x4F60;&#x7528;&#x6765;&#x505A;&#x9009;&#x53D6;&#x7684;&#xFF0C;&#x4F60;&#x6240;&#x8BBE;&#x7F6E;&#x7684;&#x8FB9;&#x6846;&#x5BBD;&#x5EA6;&#x6BD4;&#x9009;&#x53D6;&#x7684;&#x90E8;&#x5206;&#x66F4;&#x5927;&#x6216;&#x8005;&#x66F4;&#x5C0F;&#x90FD;&#x6CA1;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x6B63;&#x5E38;&#x6570;&#x503C;&#xFF0C;&#x4F60;&#x6240;&#x9009;&#x53D6;&#x7684;&#x90E8;&#x5206;&#x56FE;&#x7247;&#x4F1A;&#x7B49;&#x6BD4;&#x4F8B;&#x7F29;&#x653E;&#x4EE5;&#x6B63;&#x5E38;&#x663E;&#x793A;</p>
<p>&#x4EE5;&#x4E0A;&#x56DB;&#x70B9;&#xFF0C;&#x4FBF;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x57FA;&#x672C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x70B9;&#x51FA;&#x9519;&#x4F60;&#x90FD;&#x5C06;&#x770B;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x6548;&#x679C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x7EC3;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x5148;&#x68C0;&#x67E5;&#x4E00;&#x4E0B;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x6CE8;&#x610F;&#x5355;&#x8BCD;&#x7684;&#x62FC;&#x5199;&#x8FD9;&#x6837;&#x7684;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#x4E0D;&#x8981;&#x72AF;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x4F60;&#x8FD8;&#x662F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x56F0;&#x60D1;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x4E48;</p>
<h2 id="&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;"><a href="#&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;"></a>&#x4E00;&#x3001;repeat&#x548C;round&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x50CF;&#x5462;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#x5462;&#xFF1F;</h2><p>&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x54E5;&#x4FE9;&#x662F;&#x5F88;&#x50CF;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#xFF0C;repeat&#x4F3C;&#x4E4E;&#x4E0D;&#x50CF;round&#x90A3;&#x4E48;&#x5B8C;&#x7F8E;&#xFF0C;&#x662F;&#x4F1A;&#x5728;&#x4E24;&#x7AEF;&#x7559;&#x6709;&#x7455;&#x75B5;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x5B83;&#x4EC5;&#x4EC5;&#x627F;&#x62C5;&#x4E86;&#x91CD;&#x590D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x6709;&#x4E2D;&#x95F4;&#x5411;&#x4E24;&#x7AEF;&#x8FDB;&#x884C;&#x91CD;&#x590D;&#xFF0C;&#x800C;round&#x4E0D;&#x4EC5;&#x627F;&#x62C5;&#x4E86;&#x91CD;&#x590D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD8;&#x5E73;&#x8861;&#x4E86;&#x4E00;&#x4E0B;&#x603B;&#x5BBD;&#x5EA6;&#x548C;&#x6240;&#x9009;&#x53D6;&#x90E8;&#x5206;&#x56FE;&#x7247;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x8BA9;&#x56FE;&#x7247;&#x521A;&#x521A;&#x597D;&#x80FD;&#x5B8C;&#x6574;&#x7684;&#x5E73;&#x94FA;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;"><a href="#&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;" class="headerlink" title="&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;"></a>&#x4E8C;&#x3001;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#xFF0C;&#x63A7;&#x5236;&#x5927;&#x5C0F;&#xFF0C;&#x63A7;&#x5236;&#x6C34;&#x5E73;&#x3001;&#x5782;&#x76F4;&#x65B9;&#x5411;&#x7684;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x5C31;&#x5B8C;&#x4E8B;&#x513F;&#x4E86;&#x5462;&#xFF1F;</h2><p> &#x5982;&#x679C;&#x771F;&#x7684;&#x662F;&#x90A3;&#x6837;&#x7684;&#x8BDD;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x80FD;&#x5B8C;&#x6210;&#x66F4;&#x591A;&#x66F4;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x4F7F;&#x7528;&#x597D;&#x8FB9;&#x6846;&#x56FE;&#x7247;&#x9700;&#x8981;&#x505A;&#x597D;&#x4E24;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x7B2C;&#x4E00;&#x662F;&#x505A;&#x51FA;&#x4E00;&#x5F20;&#x597D;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7B2C;&#x4E8C;&#x662F;&#x4EE5;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x88C1;&#x526A;&#xFF0C;&#x8FD9;&#x6837;&#x8D4B;&#x4E88;&#x4E86;&#x5B83;&#x66F4;&#x591A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x597D;&#x5947;&#x5FC3;&#x548C;&#x521B;&#x9020;&#x529B;&#xFF0C;&#x5B83;&#x7684;&#x5F3A;&#x5927;&#x8D85;&#x4E4E;&#x4F60;&#x60F3;&#x8C61;&#xFF01;&#x4E0A;&#x9762;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x56DB;&#x6761;&#x8FB9;&#x548C;&#x56DB;&#x89D2;&#x6362;&#x6210;&#x4EFB;&#x610F;&#x56FE;&#x8C61;&#xFF0C;&#x8FD9;&#x90FD;&#x7531;&#x4F60;&#x6765;&#x51B3;&#x5B9A;&#xFF01;~&#x6BD4;&#x5982;&#x4E0A;&#x4F8B;&#xFF0C;&#x4F60;&#x628A;&#x83F1;&#x5F62;&#x5168;&#x90FD;&#x505A;&#x6210;&#x7EA2;&#x8272;&#x6216;&#x8005;&#x9EC4;&#x8272;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x56DB;&#x8FB9;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x7684;&#x56FE;&#x7247;&#x8FB9;&#x6846;&#x4E86;&#xFF0C;so easy&#xFF01;~</p>
<p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E0A;&#x9762;&#x662F;&#x8981;&#x505A;&#x51FA;&#x8FB9;&#x6846;&#x7684;&#x5FC5;&#x5907;&#x4E8B;&#x7269;&#xFF0C;&#x8BE5;&#x732E;&#x4E0A;border-image&#x7684;&#x5B8C;&#x6574;&#x683C;&#x5F0F;&#x4E86;</p>
<p>border-image: url(&#x201C;&#x56FE;&#x7247;&#x8DEF;&#x5F84;&#x201D;) &#x88C1;&#x526A;&#x5C3A;&#x5BF8; /&#x8FB9;&#x6846;&#x5BBD;&#x5EA6; /&#x8FB9;&#x6846;&#x56FE;&#x8C61;&#x8D85;&#x51FA;&#x8FB9;&#x6846;&#x7684;&#x91CF; &#x663E;&#x793A;&#x65B9;&#x5F0F;;</p>
<p>&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x600E;&#x4E48;&#x6BD4;&#x521A;&#x624D;&#x591A;&#x51FA;&#x4E24;&#x4E2A;&#x5462;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x628A;&#x6240;&#x6709;&#x7684;&#x90FD;&#x7F29;&#x5199;&#x5230;&#x4E00;&#x6761;&#x89C4;&#x5219;&#x91CC;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x6309;&#x7167;&#x683C;&#x5F0F;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#x201C;/&#x201D;&#x662F;<br>&#x4E0D;&#x80FD;&#x53BB;&#x6389;&#x7684;&#xFF0C;&#x4E0D;&#x7136;&#x6574;&#x6761;&#x89C4;&#x5219;&#x53C8;&#x4E00;&#x547D;&#x545C;&#x547C;&#x4E86;&#xFF0C;&#x90A3;&#x8FB9;&#x6846;&#x56FE;&#x8C61;&#x8D85;&#x51FA;&#x8FB9;&#x6846;&#x7684;&#x91CF;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x6240;&#x8BBE;&#x5B9A;&#x7684;&#x8FB9;&#x6846;&#x56FE;&#x8C61;&#x662F;&#x5360;&#x636E;&#x4E86;&#x6240;&#x5B9A;<br>&#x4E49;&#x7684;&#x56FA;&#x5B9A;&#x5BBD;&#x5EA6;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x9ED8;&#x8BA4;&#x8D85;&#x51FA;&#x4E3A;0&#xFF1B;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x8D85;&#x51FA;5px&#x7684;&#x6837;&#x5B50;&#x3002;</p>
<pre><code>.box{border-image:url(&quot;../images/border.png&quot;) 27 /30px /5px stretch round;
</code></pre><p><img src="/2014/10/05/border-image/6.png" alt=""></p>
<p>&#x770B;&#x5230;&#x533A;&#x522B;&#x4E86;&#x4E48;&#xFF1F;&#x56DB;&#x8FB9;&#x90FD;&#x8D85;&#x51FA;&#x53BB;&#x4E86;5px&#xFF0C;&#x4F5C;&#x4E3A;&#x5E38;&#x7406;&#xFF0C;&#x50CF;&#x8FD9;&#x79CD;&#x7528;&#x6765;&#x63A7;&#x5236;&#x8DDD;&#x79BB;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x53EF;&#x4EE5;&#x6B63;<br>&#x5C31;&#x53EF;&#x4EE5;&#x8D1F;&#x54AF;&#xFF1F;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x8FD9;&#x4E2A;&#x771F;&#x6CA1;&#x6709;&#xFF01;~&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x9075;&#x5FAA;&#x4E0A;&#x3001;&#x53F3;&#x3001;&#x4E0B;&#x3001;&#x5DE6;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7B80;&#x5199;&#x3002;</p>
<p>&#x603B;&#x7ED3;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x7B80;&#x5199;</p>
<p>border-image: url(&#x201C;&#x56FE;&#x7247;&#x8DEF;&#x5F84;&#x201D;) &#x88C1;&#x526A;&#x5C3A;&#x5BF8; /&#x8FB9;&#x6846;&#x5BBD;&#x5EA6;;</p>
<p>&#x8FD9;&#x4E2A;&#x7EC4;&#x5408;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x4E86;&#x3002;&#x5176;&#x4ED6;&#x7528;&#x6765;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#x3002;</p>
<p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E0D;&#x77E5;&#x4F60;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x660E;&#x4E86;&#xFF1F;&#x5982;&#x679C;&#x8FD8;&#x662F;&#x6CA1;&#x660E;&#x767D;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x52A8;&#x624B;&#x505A;&#x4E00;&#x4E0B;&#x5427;&#xFF0C;&#x53EA;&#x8981;&#x63D0;&#x5230;&#x7684;&#x90A3;&#x56DB;&#x6761;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x4E0D;&#x51FA;&#x9519;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#x3002;&#x53E6;&#x9644;&#x5927;&#x6F20;&#x54E5;&#x6587;&#x7AE0;<a href="http://www.w3cplus.com/content/css3-border-image" target="_blank" rel="external">css3-border-image</a>&#xFF0C;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4F60;&#x5148;&#x80FD;&#x505A;&#x51FA;&#x6765;&#x57FA;&#x672C;&#x7684;&#x6548;&#x679C;&#x518D;&#x770B;&#x6536;&#x83B7;&#x4F1A;&#x66F4;&#x5927;&#xFF0C;&#x8FD8;&#x6709;&#x60CA;&#x559C;&#xFF0C;&#x4E0D;&#x7136;&#x53EF;&#x80FD;&#x5F88;&#x6655;&#x3002;</p>
<p>IE&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E2D;&#x5FC3;<a href="http://msdn.microsoft.com/library/ie/dn384064.aspx" target="_blank" rel="external">&#x76F8;&#x5173;&#x5185;&#x5BB9;</a></p>
<p>&#x6B22;&#x8FCE;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#x5B66;&#x4E60;&#xFF0C;&#x52A0;&#x5165;&#x6211;&#x7684;&#x4F01;&#x9E45;&#x7FA4;&#x4F60;&#x5C06;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x54E6;&#xFF01;~web&#x524D;&#x7AEF;~&#x7F8E;&#x662F;&#x7F16;&#x51FA;&#x6765;&#x7684;&#xFF1A;152128548</p>
</div><a data-url="http://yoursite.com/2014/10/05/border-image/" data-id="cimozi8d3004sgiqiwhimggfn" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2014/11/03/为标签正名之“也谈语义化”/" class="pre">为标签正名之“也谈语义化”</a><a href="/2014/10/03/你不该忽视的小问题之margin叠加篇/" class="next">你不该忽视的小问题之margin叠加篇</a></div><div data-thread-key="2014/10/05/border-image/" data-title="轻松入门css3之border-image" data-url="http://yoursite.com/2014/10/05/border-image/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2014/10/05/border-image/" data-title="轻松入门css3之border-image" data-url="http://yoursite.com/2014/10/05/border-image/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/05/javascript-study-two/">征服javascript学习笔记（二）——基本概念（上）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/28/my-love-with-words/">我的文字情结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/25/javascript-study-one/">征服javascript学习笔记（一）——认识js</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/24/new-year-first-do/">新年伊始，我都做了些什么</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>