<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="分享交流," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x4E0D;&amp;#x7B97;&amp;#x51E0;&amp;#x6B21;&amp;#x8DEF;&amp;#x8FC7;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x6B63;&amp;#x513F;&amp;#x516B;&amp;#x7ECF;&amp;#x7B2C;&amp;#x4E8C;&amp;#x6B21;&amp;#x6765;&amp;#x5E7F;&amp;#x5DDE;&amp;#xFF0C;&amp;#x6BCF;&amp;#x5E74;&amp;#x7684;&amp;#x8FD9;">
<meta property="og:type" content="article">
<meta property="og:title" content="第三届CSS中国开发者大会纪实">
<meta property="og:url" content="http://yoursite.com/2016/12/18/css_conf_2016/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x4E0D;&amp;#x7B97;&amp;#x51E0;&amp;#x6B21;&amp;#x8DEF;&amp;#x8FC7;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x6B63;&amp;#x513F;&amp;#x516B;&amp;#x7ECF;&amp;#x7B2C;&amp;#x4E8C;&amp;#x6B21;&amp;#x6765;&amp;#x5E7F;&amp;#x5DDE;&amp;#xFF0C;&amp;#x6BCF;&amp;#x5E74;&amp;#x7684;&amp;#x8FD9;">
<meta property="og:image" content="http://yoursite.com/2016/12/18/css_conf_2016/cssconf_banner.jpg">
<meta property="og:image" content="http://yoursite.com/2016/12/18/css_conf_2016/layout.jpg">
<meta property="og:image" content="http://yoursite.com/2016/12/18/css_conf_2016/cssconf1.jpg">
<meta property="og:image" content="http://yoursite.com/2016/12/18/css_conf_2016/cssconf2.jpg">
<meta property="og:image" content="http://yoursite.com/2016/12/18/css_conf_2016/cssconf3.jpg">
<meta property="og:image" content="http://yoursite.com/2016/12/18/css_conf_2016/iconfont.jpg">
<meta property="og:updated_time" content="2016-12-18T15:09:55.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="第三届CSS中国开发者大会纪实">
<meta name="twitter:description" content="&amp;#x4E0D;&amp;#x7B97;&amp;#x51E0;&amp;#x6B21;&amp;#x8DEF;&amp;#x8FC7;&amp;#xFF0C;&amp;#x8FD9;&amp;#x662F;&amp;#x6211;&amp;#x6B63;&amp;#x513F;&amp;#x516B;&amp;#x7ECF;&amp;#x7B2C;&amp;#x4E8C;&amp;#x6B21;&amp;#x6765;&amp;#x5E7F;&amp;#x5DDE;&amp;#xFF0C;&amp;#x6BCF;&amp;#x5E74;&amp;#x7684;&amp;#x8FD9;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 第三届CSS中国开发者大会纪实 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                第三届CSS中国开发者大会纪实
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-12-18T00:00:00+08:00" content="2016-12-18">
              2016-12-18
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/分享交流/" itemprop="url" rel="index">
                    <span itemprop="name">分享交流</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="/2016/12/18/css_conf_2016/cssconf_banner.jpg" alt="&#x6765;&#x4E2A;&#x6B63;&#x8138;"><br>&#x4E0D;&#x7B97;&#x51E0;&#x6B21;&#x8DEF;&#x8FC7;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x6B63;&#x513F;&#x516B;&#x7ECF;&#x7B2C;&#x4E8C;&#x6B21;&#x6765;&#x5E7F;&#x5DDE;&#xFF0C;&#x6BCF;&#x5E74;&#x7684;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5357;&#x65B9;&#x8FD8;&#x662F;&#x9633;&#x5149;&#x660E;&#x5A9A;&#xFF0C;12&#x6708;17&#x65E5;&#xFF0C;&#x7B2C;&#x4E09;&#x5C4A;CSS&#x4E2D;&#x56FD;&#x5F00;&#x53D1;&#x8005;&#x5927;&#x4F1A;&#xFF0C;&#x5C31;&#x5728;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x6E29;&#x6696;&#x7684;&#x65E9;&#x6668;&#x5F00;&#x59CB;&#x4E86;&#x3002;</p>
<p>&#x6B64;&#x6B21;&#x5927;&#x4F1A;&#x4E3E;&#x529E;&#x5730;&#x8C08;&#x4E0D;&#x4E0A;&#x9AD8;&#x5927;&#x4E0A;&#xFF0C;&#x751A;&#x81F3;&#x6BD4;&#x8F83;&#x504F;&#xFF0C;&#x4F46;&#x4F1A;&#x573A;&#x5185;&#x73AF;&#x5883;&#x548C;&#x89C4;&#x6A21;&#x5C1A;&#x53EF;&#xFF0C;400&#x4EBA;&#x5DE6;&#x53F3;&#x3002;</p>
<p>&#x4ECA;&#x5E74;&#x662F;CSS&#x8BDE;&#x751F;22&#x5468;&#x5E74;&#xFF0C;&#x5728;&#x4F1A;&#x8BAE;&#x7684;&#x5F00;&#x5934;&#xFF0C;&#x7279;&#x5730;&#x64AD;&#x653E;&#x4E86;CSS&#x4E4B;&#x7236;H&#xE5;kon Wium Lie&#x5F55;&#x5236;&#x7684;&#x4E00;&#x6BB5;&#x89C6;&#x9891;&#xFF0C;&#x5176;&#x7B80;&#x5355;&#x63D0;&#x53CA;&#x4E86;CSS&#x7684;&#x53D1;&#x5C55;&#x5386;&#x53F2;&#x548C;&#x73B0;&#x72B6;&#xFF0C;&#x5E76;&#x5BF9;CSS&#x7684;&#x672A;&#x6765;&#x6709;&#x66F4;&#x591A;&#x671F;&#x8BB8;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x80FD;&#x5E26;&#x7740;&#x5B83;&#x6311;&#x6218;&#x66F4;&#x591A;&#x73B0;&#x5728;&#x5C1A;&#x672A;&#x89E6;&#x53CA;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x6311;&#x6218;&#x66F4;&#x591A;&#x53EF;&#x80FD;&#x3002;</p>
<h2 id="&#x4E00;&#x3001;3-14-Things-I-Didn&#x2019;t-Know-About-CSS&#x2014;&#x2014;Mathias-Bynens"><a href="#&#x4E00;&#x3001;3-14-Things-I-Didn&#x2019;t-Know-About-CSS&#x2014;&#x2014;Mathias-Bynens" class="headerlink" title="&#x4E00;&#x3001;3.14 Things I Didn&#x2019;t Know About CSS&#x2014;&#x2014;Mathias Bynens"></a>&#x4E00;&#x3001;3.14 Things I Didn&#x2019;t Know About CSS&#x2014;&#x2014;Mathias Bynens</h2><p>&#x7B2C;&#x4E00;&#x4E2A;&#x5206;&#x4EAB;&#x7684;&#x662F;&#x4F4D;&#x5916;&#x56FD;&#x53CB;&#x4EBA;&#xFF0C;&#x6211;&#x867D;&#x7136;&#x5927;&#x5B66;&#x82F1;&#x8BED;&#x8FC7;&#x4E86;&#x516D;&#x7EA7;&#xFF0C;&#x4F46;&#x82F1;&#x8BED;&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x8FDB;&#x5219;&#x9000;&#xFF0C;&#x66F4;&#x4F55;&#x51B5;&#x662F;&#x542C;&#x529B;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4E13;&#x4E1A;&#x8BCD;&#x6C47;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x627F;&#x8BA4;&#x5F88;&#x591A;&#x6CA1;&#x6709;&#x542C;&#x61C2;&#xFF0C;&#x4F46;&#x5927;&#x5BB6;&#x90FD;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4EE3;&#x7801;&#x662F;&#x901A;&#x7528;&#x8BED;&#x8A00;&#xFF0C;&#x6F14;&#x8BB2;&#x8005;&#x7684;&#x4EE3;&#x7801;&#x6F14;&#x793A;&#x4F9D;&#x7136;&#x7ED9;&#x4E86;&#x5927;&#x5BB6;&#x4E0D;&#x5C11;&#x51B2;&#x51FB;&#xFF0C;&#x5927;&#x591A;&#x662F;&#x6211;&#x4EEC;&#x5E73;&#x65F6;&#x6CA1;&#x6CE8;&#x610F;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x6216;&#x8005;&#x6CA1;&#x6709;&#x7528;&#x8FC7;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x8F83;&#x4E00;&#x4E9B;&#x5927;&#x5BB6;&#x5E73;&#x65F6;&#x6709;&#x7528;&#x5230;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x4F18;&#x52A3;&#x548C;&#x89C4;&#x8303;&#x4E0E;&#x5426;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;!important&#x7684;&#x7528;&#x6CD5;&#x3001;CSS&#x6CE8;&#x91CA;&#x7684;&#x7528;&#x6CD5;&#x3001;font-family&#x6709;&#x4EC0;&#x4E48;&#x8BB2;&#x7A76;&#x3001;&#x975E;&#x5E38;&#x89C4;&#x9009;&#x62E9;&#x5668; Escaping css selector&#x3001;CSS&#x8868;&#x8FBE;&#x5F0F;  css expressions in IE&lt;7&#x3001;IE legacy document modes&#x3001;Freeze Firefox&#x7B49;&#x7B49;&#xFF0C;&#x8BF8;&#x591A;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x80FD;&#x8BA9;&#x4EBA;&#x611F;&#x53F9;&#xFF0C;&#x5F15;&#x4EBA;&#x601D;&#x8003;&#x3002;</p>
<p>&#x91CC;&#x9762;&#x63D0;&#x5230;&#x7684;&#x4E24;&#x4E2A;&#x7F51;&#x7AD9;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x6B23;&#x8D4F;&#x4E00;&#x4E0B;&#x3002;</p>
<p><a href="http://youmightnotneedjs.com/" target="_blank" rel="external">youmightnotneedjs</a>&#x548C;<a href="http://kong.xn--8ws00zhy3a.com/" target="_blank" rel="external">HTML KONG</a></p>
<h2 id="&#x4E8C;&#x3001;CSS-Grid-Layout&#x2014;&#x2014;&#x5927;&#x6F20;"><a href="#&#x4E8C;&#x3001;CSS-Grid-Layout&#x2014;&#x2014;&#x5927;&#x6F20;" class="headerlink" title="&#x4E8C;&#x3001;CSS Grid Layout&#x2014;&#x2014;&#x5927;&#x6F20;"></a>&#x4E8C;&#x3001;CSS Grid Layout&#x2014;&#x2014;&#x5927;&#x6F20;</h2><p>&#x73B0;&#x5728;&#x5927;&#x91CF;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x57FA;&#x4E8E;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#x3002;&#x867D;&#x8BF4;&#x4EBA;&#x4EEC;&#x901A;&#x5E38;&#x6CE8;&#x610F;&#x4E0D;&#x5230;&#x5B83;&#xFF0C;&#x65E0;&#x8BBA;&#x4ECE;&#x7406;&#x8BBA;&#x3001;&#x7F8E;&#x5B66;&#x548C;&#x6574;&#x9F50;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5E03;&#x5C40;&#x90FD;&#x5F88;&#x597D;&#x5E73;&#x8861;&#x3002;&#x7F51;&#x683C;&#x7ED3;&#x6784;&#x662F;&#x6240;&#x6709;&#x73B0;&#x4EE3;&#x7F51;&#x7AD9;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5B83;&#x603B;&#x80FD;&#x7ED9;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x5B8C;&#x7F8E;&#x65E0;&#x6687;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x5927;&#x6F20;&#x7ED9;&#x5927;&#x5BB6;&#x4ECB;&#x7ECD;&#x7684;Grid&#xFF0C;&#x76F8;&#x4FE1;&#x5F88;&#x591A;&#x4EBA;&#x633A;&#x65E9;&#x5C31;&#x6709;&#x63A5;&#x89E6;&#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x5BF9;&#x5B83;&#x7684;&#x652F;&#x6301;&#x8FD8;&#x4E0D;&#x597D;&#x5E76;&#x4E14;&#x770B;&#x8D77;&#x6765;&#x80FD;&#x591F;&#x5927;&#x80C6;&#x4F7F;&#x7528;&#x8FD8;&#x9065;&#x9065;&#x65E0;&#x671F;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x66F4;&#x6DF1;&#x5165;&#x53BB;&#x4E86;&#x89E3;&#x548C;&#x5B9E;&#x8DF5;&#xFF0C;&#x4E3A;&#x4E86;&#x5230;&#x4F1A;&#x573A;&#x4E4B;&#x540E;&#x4E0D;&#x4F1A;&#x5728;&#x6F14;&#x8BB2;&#x8005;&#x5FEB;&#x8282;&#x594F;&#x7684;&#x8BB2;&#x89E3;&#x4E0B;&#x4E00;&#x8138;&#x832B;&#x7136;&#xFF0C;&#x53BB;&#x4E4B;&#x524D;&#x51E0;&#x5929;&#xFF0C;&#x6211;&#x501F;&#x52A9;&#x7740;Eric Meyer&#x90A3;&#x7BC7;&#x6587;&#x7AE0;&#x4EE5;&#x53CA;&#x6269;&#x5C55;&#x9605;&#x8BFB;&#xFF0C;&#x7A0D;&#x5FAE;&#x628A;Grid&#x53C8;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#xFF0C;&#x5BF9;&#x6574;&#x4F53;&#x6709;&#x4E86;&#x5927;&#x6982;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x4F46;&#x6587;&#x7AE0;&#x7EC8;&#x5F52;&#x662F;&#x6587;&#x7AE0;&#xFF0C;&#x548C;PPT&#x4EE5;&#x53CA;&#x73B0;&#x573A;&#x5609;&#x5BBE;&#x8BB2;&#x89E3;&#x8FD8;&#x662F;&#x4F1A;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x5927;&#x6982;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x6982;&#x5FF5;&#x5C31;&#x4E0D;&#x5FC5;&#x591A;&#x8BF4;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x770B;&#x5B83;&#x7684;&#x4EAE;&#x70B9;&#x4EE5;&#x53CA;&#x80FD;&#x591F;&#x7528;&#x4EC0;&#x4E48;&#x5DE7;&#x5999;&#x7684;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5176;&#x79F0;&#x4E3A;&#x201C;&#x7F51;&#x683C;&#x7CFB;&#x7EDF;&#x201D;&#xFF0C;&#x5F53;&#x7136;&#x5C31;&#x6709;&#x5B83;&#x5F3A;&#x5927;&#x4E4B;&#x5904;&#xFF0C;&#x5F3A;&#x5927;&#x5728;&#x5B83;&#x4E0D;&#x50CF;&#x884C;&#x9AD8;&#x3001;&#x6D6E;&#x52A8;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x53EA;&#x662F;&#x5BF9;&#x4E00;&#x4E9B;&#x5177;&#x4F53;&#x533A;&#x5757;&#x7684;&#x5F71;&#x54CD;&#x548C;&#x4F5C;&#x7528;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x628A;&#x6574;&#x4E2A;&#x7F51;&#x9875;&#x90FD;&#x89C4;&#x5212;&#x8FDB;&#x53BB;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x4E0D;&#x53D8;&#x52A8;HTML&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5927;&#x5E45;&#x5EA6;&#x6539;&#x53D8;&#x5E03;&#x5C40;&#x3002;&#x5C31;&#x50CF;&#x5F88;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x8FD9;&#x8DDF;&#x5F53;&#x5E74;&#x5F88;&#x591A;&#x4EBA;&#x70ED;&#x8877;&#x7684;table&#x4ECE;&#x5916;&#x8868;&#x4E0A;&#x770B;&#x6709;&#x70B9;&#x50CF;&#xFF0C;&#x4F46;&#x53C8;&#x6709;&#x672C;&#x8D28;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x7F51;&#x683C;&#x8F83;&#x4E4B;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x548C;&#x7075;&#x6D3B;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7279;&#x6B8A;&#x6807;&#x7B7E;&#xFF0C;&#x53EA;&#x662F;&#x5C5E;&#x6027;&#xFF0C;&#x53E6;&#x5916;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x5C5E;&#x6027;&#x503C;&#x9009;&#x62E9;&#xFF0C;&#x600E;&#x6837;&#x5206;&#x914D;&#x884C;&#x548C;&#x5217;&#x3001;&#x533A;&#x57DF;&#xFF0C;&#x600E;&#x6837;&#x9AD8;&#x6548;&#x7684;&#x4E66;&#x5199;&#xFF0C;&#x600E;&#x6837;&#x667A;&#x80FD;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x5927;&#x6F20;&#x4E5F;&#x5BF9;&#x672A;&#x6765;&#x7684;&#x5E03;&#x5C40;&#x5927;&#x52BF;&#x505A;&#x4E86;&#x4E9B;&#x524D;&#x77BB;</p>
<p><img src="/2016/12/18/css_conf_2016/layout.jpg" alt="&#x5E03;&#x5C40;&#x8D70;&#x52BF;"></p>
<p>&#x4E86;&#x89E3;&#x8FC7;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x79CD;&#x611F;&#x89C9;&#xFF0C;Grid&#x8DDF;Flex box&#x6709;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x5B83;&#x4FE9;&#x8BE5;&#x600E;&#x6837;&#x9009;&#x62E9;&#xFF0C;&#x4F1A;&#x662F;&#x66FF;&#x4EE3;&#x5173;&#x7CFB;&#x5417;&#xFF1F;</p>
<p>&#x5728;&#x73B0;&#x573A;&#xFF0C;&#x5927;&#x6F20;&#x5BF9;&#x8FD9;&#x4E00;&#x70B9;&#x4E5F;&#x505A;&#x4E86;&#x89E3;&#x8BFB;&#xFF1A;</p>
<p>Flexbox   &#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x3001;&#x5185;&#x5BB9;&#x66F4;&#x64C5;&#x957F;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x91CC;&#x7684;&#x56FE;&#x7247;&#x548C;&#x6587;&#x5B57;&#x6392;&#x7248;</p>
<p>Grid Layout   &#x5B9A;&#x4E49;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6; &#x5916;&#x90E8;&#x5927;&#x5E03;&#x5C40;&#x66F4;&#x9002;&#x5408;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5404;&#x79CD;&#x5927;&#x6A21;&#x5757;&#x7684;&#x6392;&#x5E03;</p>
<p>&#x603B;&#x4E4B;&#x3001;Grid&#x662F;&#x5BF9;CSS&#x6280;&#x80FD;&#x5305;&#x5F88;&#x597D;&#x7684;&#x8865;&#x5145;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x77DB;&#x76FE;&#x6216;&#x8005;&#x51B2;&#x7A81;&#x5173;&#x7CFB;&#xFF0C;&#x6280;&#x672F;&#x5728;&#x4EBA;&#x7684;&#x624B;&#x91CC;&#xFF0C;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x8FD0;&#x7528;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x95EA;&#x7535;&#x5206;&#x4EAB;&#x2014;&#x2014;&#x52FE;&#x4E09;&#x80A1;&#x56DB;"><a href="#&#x4E09;&#x3001;&#x95EA;&#x7535;&#x5206;&#x4EAB;&#x2014;&#x2014;&#x52FE;&#x4E09;&#x80A1;&#x56DB;" class="headerlink" title="&#x4E09;&#x3001;&#x95EA;&#x7535;&#x5206;&#x4EAB;&#x2014;&#x2014;&#x52FE;&#x4E09;&#x80A1;&#x56DB;"></a>&#x4E09;&#x3001;&#x95EA;&#x7535;&#x5206;&#x4EAB;&#x2014;&#x2014;&#x52FE;&#x4E09;&#x80A1;&#x56DB;</h2><p>&#x7B2C;&#x4E09;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x7531;&#x52FE;&#x4E09;&#x80A1;&#x56DB;&#x5E26;&#x6765;&#x7684;&#x95EA;&#x7535;&#x5206;&#x4EAB; Css in Native&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x79F0;&#x4E3A;&#x95EA;&#x7535;&#x5206;&#x4EAB;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x65F6;&#x95F4;&#x5F88;&#x77ED;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8BED;&#x901F;&#x4E5F;&#x5F88;&#x5FEB;&#x3002;</p>
<p>&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x5185;&#x5BB9;&#x8DDF;CSS&#x672C;&#x8EAB;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x591A;&#xFF0C;&#x591A;&#x662F;&#x5173;&#x4E8E;Weex&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x6709;&#x70B9;&#x5E7F;&#x544A;&#x4E4B;&#x5ACC;&#x54C8;&#xFF0C;&#x4F46;Weex&#x51FA;&#x6765;&#x4E4B;&#x540E;&#x7684;&#x786E;&#x66FE;&#x5F15;&#x8D77;&#x884C;&#x4E1A;&#x7684;&#x5E7F;&#x6CDB;&#x5173;&#x6CE8;&#xFF0C;&#x6211;&#x4EEC;&#x7EC4;&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FC7;&#x4E86;&#x90A3;&#x9635;&#x513F;&#x5C31;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x5173;&#x6CE8;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x4EBA;&#x548C;&#x56E2;&#x961F;&#x4E5F;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x5427;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DDF;&#x81EA;&#x8EAB;&#x7684;&#x4E1A;&#x52A1;&#x9879;&#x76EE;&#x76F8;&#x5173;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;&#x4E2A;&#x4EBA;&#x53BB;&#x4E86;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x5176;&#x6F14;&#x8BB2;&#x5BF9;&#x65F6;&#x95F4;&#x7684;&#x7CBE;&#x51C6;&#x63A7;&#x5236;&#x548C;&#x6D41;&#x7545;&#x5EA6;&#x7ED9;&#x4EBA;&#x7559;&#x4E0B;&#x6DF1;&#x523B;&#x5370;&#x8C61;&#xFF0C;&#x8DDF;&#x4E3B;&#x9898;&#x76F8;&#x5173;&#x7684;&#x662F;&#x8BB2;&#x4E86;Weex&#x4E2D;&#x662F;&#x600E;&#x4E48;&#x5199;CSS&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x539F;&#x751F;CSS&#x5C5E;&#x6027;&#x7684;&#x652F;&#x6301;&#x60C5;&#x51B5;&#xFF0C;&#x5177;&#x4F53;&#x7B49;&#x8D44;&#x6599;&#x653E;&#x51FA;&#x6765;&#x5927;&#x5BB6;&#x518D;&#x7EC6;&#x770B;&#x5427;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;Sass-amp-CSS-Design-Pattern&#x2014;&#x2014;&#x5ED6;&#x6D27;&#x6770;"><a href="#&#x56DB;&#x3001;Sass-amp-CSS-Design-Pattern&#x2014;&#x2014;&#x5ED6;&#x6D27;&#x6770;" class="headerlink" title="&#x56DB;&#x3001;Sass &amp; CSS Design Pattern&#x2014;&#x2014;&#x5ED6;&#x6D27;&#x6770;"></a>&#x56DB;&#x3001;Sass &amp; CSS Design Pattern&#x2014;&#x2014;&#x5ED6;&#x6D27;&#x6770;</h2><p>&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x51FA;&#x7075;&#x6D3B;&#x6027;&#x9AD8;&#x3001;&#x6613;&#x7EF4;&#x62A4;&#x7684;&#x7F51;&#x9875;&#x7248;&#x578B;&#xFF0C;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x5927;&#x5BB6;&#x61A7;&#x61AC;&#x7684;&#x76EE;&#x6807;&#x3002;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x662F;&#x6211;&#x6BD4;&#x8F83;&#x611F;&#x5174;&#x8DA3;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x6F14;&#x8BB2;&#x8005;&#x5148;&#x662F;&#x5217;&#x4E86;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x5173;&#x4E8E;&#x5927;&#x5BB6;&#x5E73;&#x65F6;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x89C4;&#x8303;&#x6027;&#x548C;&#x610F;&#x8BC6;&#x7684;&#x7EDF;&#x8BA1;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF08;Sass&#xFF09;&#x3001;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF08;BEM&#xFF09;&#x3001;CSS&#x7684;&#x547D;&#x540D;&#x89C4;&#x5219;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x91CD;&#x70B9;&#x662F;&#x63D0;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x91D1;&#x5B57;&#x5854;&#xFF1A;</p>
<p><img src="/2016/12/18/css_conf_2016/cssconf1.jpg" alt="&#x9879;&#x76EE;&#x6784;&#x5EFA;&#x91D1;&#x5B57;&#x5854;"></p>
<p>&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#xFF0C;&#x4E0D;&#x540C;&#x5C42;&#x9762;&#xFF0C;&#x4ECE;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x9AD8;&#x5EA6;&#x53BB;&#x8003;&#x91CF;&#xFF0C;&#x4E00;&#x6B65;&#x6B65;&#x6784;&#x5EFA;&#x51FA;&#x8FD9;&#x4E2A;&#x91D1;&#x5B57;&#x5854;&#xFF0C;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x800C;&#x987A;&#x7406;&#x6210;&#x7AE0;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x9700;&#x8981;&#x5F88;&#x591A;&#x7684;&#x5B9E;&#x8DF5;&#x548C;&#x601D;&#x8003;&#x3002;</p>
<p>&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x5E94;&#x8BE5;&#x80FD;&#x548C;&#x5F88;&#x591A;&#x4EBA;&#x8111;&#x5B50;&#x91CC;&#x7684;&#x60F3;&#x6CD5;&#x53D1;&#x751F;&#x78B0;&#x649E;&#x3002;&#x5177;&#x4F53;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>vendors&#xFF1A;&#x7B2C;&#x4E09;&#x65B9;&#x63D2;&#x4EF6;  jquery plugin  inbox</p>
<p>components&#xFF1A;&#x7EC4;&#x4EF6;</p>
<p>elements&#xFF1A;&#x5143;&#x7D20;/&#x539F;&#x5B50; &#x2014;&#x2014;&#x5206;&#x5B50;&#xFF08;&#x6A21;&#x5757;&#xFF09;&#x2014;&#x2014;&#x673A;&#x6784;</p>
<p>base&#xFF1A;&#x9884;&#x8BBE;&#x6837;&#x5F0F;&#xFF0C;&#x5168;&#x57DF;&#x6837;&#x5F0F;&#x3001;&#x51CF;&#x8F7B;&#x5404;&#x7C7B;&#x8BBE;&#x5B9A;&#x8D1F;&#x62C5;&#x3001;&#x524D;&#x7AEF;&#x548C;&#x8BBE;&#x8BA1;&#x5171;&#x540C;&#x8BA8;&#x8BBA;</p>
<p>browser&#xFF1A;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;reset&#x5DEE;&#x5F02;</p>
<p>tools&#xFF1A;&#x5F00;&#x53D1;&#x8D44;&#x4EA7;&#x3001;&#x79EF;&#x7D2F;&#x3001;&#x6210;&#x578B;&#x65B9;&#x6848;</p>
<p>config&#xFF1A;&#x5168;&#x57DF;&#x53D8;&#x91CF; &#x3001;&#x6863;&#x6848;&#x8DEF;&#x5F84; &#x3001;&#x524D;&#x7AEF;&#x4EFB;&#x52A1; gulp&#x7B49;   </p>
<p>&#x8FD9;&#x4E9B;&#x73AF;&#x8282;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4ECE;&#x65E0;&#x5230;&#x6709;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5BF9;&#x4E8E;&#x57FA;&#x7840;&#x9636;&#x6BB5;&#x7684;&#x670B;&#x53CB;&#x6765;&#x770B;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x8D39;&#x52B2;&#x513F;&#xFF0C;&#x4F46;&#x7EC6;&#x7EC6;&#x54C1;&#x5473;&#x4E00;&#x5B9A;&#x4F1A;&#x6709;&#x6240;&#x609F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x501F;&#x4E00;&#x6B65;&#x770B;&#x4E0B;&#x6211;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x5199;&#x8FC7;&#x7684;&#x53E6;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x660E;&#x767D;&#x4E86;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x4EC5;&#x80FD;&#x6210;&#x957F;&#x4E3A;&#x4F18;&#x79C0;&#x7684;UI&#x5DE5;&#x7A0B;&#x5E08;&#x4F1A;&#x6709;&#x4E00;&#x4E22;&#x4E22;&#x7684;&#x5E2E;&#x52A9;~</p>
<p>&#x5728;&#x8C08;&#x8BBA;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6F14;&#x8BB2;&#x8005;&#x63D2;&#x5165;&#x4E86;&#x4E00;&#x5927;&#x6BB5;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x548C;&#x56E2;&#x961F;&#x773C;&#x91CC;&#x7684;&#x804C;&#x80FD;&#x548C;&#x6240;&#x5173;&#x5FC3;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<p>1&#x3001;&#x53EA;&#x5199;&#x524D;&#x7AEF;&#x7684;&#xFF0C;&#x4F1A;&#x66F4;&#x6CE8;&#x610F;&#x5230;&#x4EC0;&#x4E48;</p>
<p>2&#x3001;&#x65E2;&#x61C2;&#x8BBE;&#x8BA1;&#x53C8;&#x61C2;&#x524D;&#x7AEF;&#x7684;&#xFF0C;&#x4F1A;&#x662F;&#x600E;&#x6837;</p>
<p>3&#x3001;&#x5206;&#x5DE5;&#x6BD4;&#x8F83;&#x7EC6;&#x81F4;&#xFF0C;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#xFF0C;&#x5FEB;&#x8282;&#x594F;&#x7684;&#xFF0C;&#x53C8;&#x662F;&#x600E;&#x6837;</p>
<p>&#x8FD9;&#x4E9B;&#x80FD;&#x8BA9;&#x5904;&#x5728;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x548C;&#x56E2;&#x961F;&#x7684;&#x4EBA;&#x611F;&#x540C;&#x8EAB;&#x53D7;&#x3002;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x6BB5;&#x8BF4;&#xFF0C;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x8981;&#x8003;&#x8651;&#x4EC0;&#x4E48;&#xFF1A;&#x81EA;&#x9002;&#x5E94;&#x5E03;&#x5C40;&#x3001;&#x56FE;&#x7247;&#x683C;&#x5F0F;&#x3001;&#x72B6;&#x6001;&#x3001;&#x9875;&#x9762;&#x56DE;&#x9988;&#x3001;&#x5143;&#x7D20;&#x52A8;&#x753B;&#x6548;&#x679C;&#x63CF;&#x8FF0;&#x3001;WebUI &#x79CD;&#x7C7B;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x8FD9;&#x4F1A;&#x4EE4;&#x5F88;&#x591A;&#x8BBE;&#x8BA1;&#x5E08;&#x6C57;&#x989C;&#xFF0C;&#x56E0;&#x4E3A;&#x636E;&#x6211;&#x6240;&#x77E5;&#xFF0C;&#x76F8;&#x5F53;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x662F;&#x8003;&#x8651;&#x4E0D;&#x5230;&#x8FD9;&#x4E9B;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x504F;&#x5411;&#x4E8E;&#x5F00;&#x53D1;&#x8303;&#x7574;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x80FD;&#x8003;&#x8651;&#x5230;&#x8FD9;&#x4E9B;&#xFF0C;&#x5BF9;&#x524D;&#x7AEF;&#x6216;&#x8005;UI&#x5F00;&#x53D1;&#x6765;&#x8BF4;&#x5E94;&#x8BE5;&#x662F;&#x5F88;&#x5E78;&#x798F;&#x7684;&#x3002;</p>
<h2 id="&#x4E94;&#x3001;&#x5FAE;&#x4FE1;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x5B9E;&#x8DF5;-amp-amp-SVG&#x5DE5;&#x7A0B;&#x5316;&#x4E0E;&#x52A8;&#x753B;&#x5B9E;&#x8DF5;&#x2014;&#x2014;&#x7F57;&#x6B63;&#x70E8;&#x3001;&#x65B9;&#x6F47;&#x4EEA;&#x3001;&#x502A;&#x6829;&#x751F;"><a href="#&#x4E94;&#x3001;&#x5FAE;&#x4FE1;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x5B9E;&#x8DF5;-amp-amp-SVG&#x5DE5;&#x7A0B;&#x5316;&#x4E0E;&#x52A8;&#x753B;&#x5B9E;&#x8DF5;&#x2014;&#x2014;&#x7F57;&#x6B63;&#x70E8;&#x3001;&#x65B9;&#x6F47;&#x4EEA;&#x3001;&#x502A;&#x6829;&#x751F;" class="headerlink" title="&#x4E94;&#x3001;&#x5FAE;&#x4FE1;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x5B9E;&#x8DF5; &amp;&amp; SVG&#x5DE5;&#x7A0B;&#x5316;&#x4E0E;&#x52A8;&#x753B;&#x5B9E;&#x8DF5;&#x2014;&#x2014;&#x7F57;&#x6B63;&#x70E8;&#x3001;&#x65B9;&#x6F47;&#x4EEA;&#x3001;&#x502A;&#x6829;&#x751F;"></a>&#x4E94;&#x3001;&#x5FAE;&#x4FE1;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x5B9E;&#x8DF5; &amp;&amp; SVG&#x5DE5;&#x7A0B;&#x5316;&#x4E0E;&#x52A8;&#x753B;&#x5B9E;&#x8DF5;&#x2014;&#x2014;&#x7F57;&#x6B63;&#x70E8;&#x3001;&#x65B9;&#x6F47;&#x4EEA;&#x3001;&#x502A;&#x6829;&#x751F;</h2><p>&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x8BB2;&#x4E86;SVG&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x3002;SVG&#x5C31;&#x50CF;Grid&#x4E00;&#x6837;&#xFF0C;&#x5927;&#x5BB6;&#x65E9;&#x6709;&#x8033;&#x95FB;&#xFF0C;&#x4F46;&#x5E94;&#x7528;&#x4E00;&#x76F4;&#x90FD;&#x4E0D;&#x592A;&#x666E;&#x904D;&#xFF0C;&#x50CF;&#x662F;&#x4E00;&#x76F4;&#x5728;&#x5708;&#x513F;&#x5916;&#x6253;&#x8F6C;&#x4E00;&#x822C;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x73AF;&#x8282;&#x662F;&#x7531;&#x5FAE;&#x4FE1;&#x7684;&#x4E09;&#x4E2A;&#x540C;&#x4E8B;&#x6765;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x57FA;&#x7840;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x5FC5;&#x8D58;&#x8FF0;&#xFF1A;<br>&#x7B2C;&#x4E00;&#x4F4D;&#x4E3B;&#x8BB2;&#x4E86;&#x201C;&#x4EC0;&#x4E48;&#x662F;SVG&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;&#x600E;&#x4E48;&#x7528;&#x201D;&#x3002;&#x8FD9;&#x4E9B;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0A;&#x7F51;&#x548C;&#x4E66;&#x7C4D;&#x53BB;&#x67E5;&#x9605;&#x3002;</p>
<p>SVG&#x4F18;&#x52BF;&#x5982;&#x56FE;&#xFF1A;</p>
<p><img src="/2016/12/18/css_conf_2016/cssconf2.jpg" alt="SVG&#x7684;&#x4F18;&#x52BF;"></p>
<p>&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x6211;&#x4EEC;&#x5728;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x4E2D;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x75DB;&#x70B9;&#xFF0C;&#x5E38;&#x5E38;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x4EE3;&#x7801;&#x5C42;&#x9762;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x4F46;&#x5230;&#x5934;&#x6765;&#x9876;&#x4E0D;&#x4F4F;&#x51E0;&#x5F20;&#x5F88;&#x5927;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x5C31;&#x663E;&#x5F97;&#x5F88;&#x5927;&#xFF0C;&#x53E6;&#x5916;&#x5C31;&#x662F;&#x867D;&#x7136;CSS3&#x5728;&#x89C6;&#x89C9;&#x548C;&#x52A8;&#x753B;&#x65B9;&#x9762;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x52A8;&#x6548;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x8FD8;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x5F88;&#x591A;&#x573A;&#x666F;&#x4E0B;&#xFF0C;SVG&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4F4D;&#xFF0C;&#x4E3B;&#x8BB2;&#x4E86;SVG&#x7684;&#x5404;&#x79CD;&#x52A8;&#x753B;&#x6548;&#x679C;&#x548C;&#x5927;&#x6982;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x63CF;&#x7EBF;&#x3001;&#x53D8;&#x5F62;&#x3001;&#x8DEF;&#x5F84;&#x8FD0;&#x52A8;&#x3001;&#x56FE;&#x6848;&#x586B;&#x5145;&#x3001;&#x6EE4;&#x955C;&#x3002;&#x8FD8;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x662F;&#x7528;&#x54EA;&#x4E9B;&#x5C5E;&#x6027;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5BF9;&#x521A;&#x63A5;&#x89E6;&#x6216;&#x8005;&#x8FD8;&#x5C1A;&#x672A;&#x5F00;&#x59CB;&#x63A5;&#x89E6;SVG&#x7684;&#x670B;&#x53CB;&#x5E94;&#x8BE5;&#x5E2E;&#x52A9;&#x86EE;&#x5927;&#x7684;&#xFF0C;&#x5B83;&#x4F1A;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x90A3;&#x4E9B;&#x5F88;&#x70AB;&#x7684;&#x52A8;&#x6548;&#x79BB;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x9065;&#x8FDC;&#xFF0C;&#x800C;&#x4E14;&#x4E00;&#x70B9;&#x4E5F;&#x4E0D;&#x96BE;&#xFF0C;&#x4F1A;&#x8BA9;&#x4EBA;&#x5FCD;&#x4E0D;&#x4F4F;&#x9A6C;&#x4E0A;&#x53BB;&#x5C1D;&#x8BD5;&#x4E00;&#x756A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x521B;&#x610F;&#x4E86;&#x3002;<br>&#x7B2C;&#x4E09;&#x4F4D;&#xFF0C;&#x8BB2;&#x4E86;&#x4FE1;&#x606F;&#x548C;&#x7F51;&#x9875;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x7F51;&#x9875;&#x662F;&#x4FE1;&#x606F;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x60C5;&#x666F;&#x91CD;&#x73B0;&#x3002;</p>
<p>&#x7F51;&#x9875;&#x7279;&#x5F81;&#xFF1A;&#x591A;&#x5E73;&#x53F0;&#x3001;&#x53EF;&#x8BBF;&#x95EE;&#x3001;&#x53EF;&#x7528;</p>
<p>&#x4FE1;&#x606F;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#x7684;&#x5F62;&#x6001;</p>
<p>&#x610F;&#x8BC6;&#x5F62;&#x6001;&#xFF1A;&#x5143;&#x4FE1;&#x606F;  &#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x610F;&#x8BC6;&#x5F62;&#x6001;&#xFF0C;&#x5C31;&#x662F;&#x7F51;&#x9875;&#x7ED3;&#x6784;&#x4E2D;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5B9E;&#x4F53;&#x5F62;&#x6001;&#xFF1A;&#x6807;&#x8BB0;</p>
<p>&#x8868;&#x73B0;&#x5F62;&#x6001;&#xFF1A;&#x6837;&#x5F0F;</p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x662F;&#x5BF9;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x4E0B;&#x62BD;&#x8C61;&#x548C;&#x5F52;&#x7C7B;&#x7684;&#x63CF;&#x8FF0;&#x3002;</p>
<h2 id="&#x516D;&#x3001;&#x4ECE;&#x77E9;&#x9635;&#x8D70;&#x5165;-WebGL-&#x4E16;&#x754C;&#x2014;&#x2014;&#x9648;&#x5251;&#x946B;"><a href="#&#x516D;&#x3001;&#x4ECE;&#x77E9;&#x9635;&#x8D70;&#x5165;-WebGL-&#x4E16;&#x754C;&#x2014;&#x2014;&#x9648;&#x5251;&#x946B;" class="headerlink" title="&#x516D;&#x3001;&#x4ECE;&#x77E9;&#x9635;&#x8D70;&#x5165; WebGL &#x4E16;&#x754C;&#x2014;&#x2014;&#x9648;&#x5251;&#x946B;"></a>&#x516D;&#x3001;&#x4ECE;&#x77E9;&#x9635;&#x8D70;&#x5165; WebGL &#x4E16;&#x754C;&#x2014;&#x2014;&#x9648;&#x5251;&#x946B;</h2><p>&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x6211;&#x6CA1;&#x6709;&#x5B66;&#x4E60;&#x8FC7;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x5B83;&#x6CA1;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x8FD9;&#x6D89;&#x53CA;&#x5230;&#x786C;&#x4F24;&#x2014;&#x2014;&#x6570;&#x5B66;&#x548C;&#x7269;&#x7406;&#xFF0C;&#x55EF;&#xFF0C;&#x4E0D;&#x662F;&#x61C2;&#x51E0;&#x4E2A;&#x5C5E;&#x6027;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x591A;&#x65B9;&#x9762;&#x7EFC;&#x5408;&#x800C;&#x6765;&#x7684;&#x80FD;&#x529B;&#x548C;&#x6280;&#x5DE7;&#xFF0C;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x662F;&#x4E0D;&#x582A;&#x5165;&#x76EE;~&#x6240;&#x4EE5;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4E34;&#x65F6;&#x62B1;&#x4F5B;&#x811A;&#xFF0C;&#x5C31;&#x6743;&#x5F53;&#x53BB;&#x73B0;&#x573A;&#x611F;&#x53D7;&#x4E00;&#x4E0B;&#x5B83;&#x7684;&#x9B45;&#x529B;&#x4E86;&#x3002;</p>
<p>&#x629B;&#x51FA;&#x6765;&#x51E0;&#x4E2A;&#x6982;&#x5FF5;&#x4F60;&#x4EEC;&#x81EA;&#x5DF1;&#x611F;&#x53D7;&#x5427;&#x3002;</p>
<p>&#x77E9;&#x9635;matrix transform&#x57FA;&#x4E8E;&#x77E9;&#x9635;&#x5B9E;&#x73B0;&#x6548;&#x679C;            </p>
<p>&#x6B27;&#x62C9;&#x89D2;rotateXYZ              </p>
<p>&#x56DB;&#x5143;&#x6570;rotate3D</p>
<p>&#x6F14;&#x8BB2;&#x8005;&#x5728;&#x73B0;&#x573A;&#x4E5F;&#x6F14;&#x793A;&#x4E86;&#x51E0;&#x4E2A;&#x8FD0;&#x7528;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x505A;&#x51FA;&#x6765;&#x7684;&#x70AB;&#x9177;&#x6548;&#x679C;&#xFF0C;&#x8FD9;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;</p>
<p><img src="/2016/12/18/css_conf_2016/cssconf3.jpg" alt="&#x77E9;&#x9635;&#x7684;&#x9B54;&#x6CD5;"></p>
<h2 id="&#x4E03;&#x3001;CSS-animation-amp-amp-CSS-The-secret-drawing-tool&#x2014;&#x2014;Wenting-Zhang"><a href="#&#x4E03;&#x3001;CSS-animation-amp-amp-CSS-The-secret-drawing-tool&#x2014;&#x2014;Wenting-Zhang" class="headerlink" title="&#x4E03;&#x3001;CSS animation &amp;&amp; CSS: The secret drawing tool&#x2014;&#x2014;Wenting Zhang"></a>&#x4E03;&#x3001;CSS animation &amp;&amp; CSS: The secret drawing tool&#x2014;&#x2014;Wenting Zhang</h2><p>&#x6765;&#x53C2;&#x4F1A;&#x4E4B;&#x524D;&#xFF0C;&#x5C31;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x8FC7;&#x6F14;&#x8BB2;&#x8005;&#x7684;&#x7AD9;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4EBA;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x662F;&#x61D2;&#x7684;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x7CBE;&#x529B;&#x6709;&#x9650;&#xFF0C;&#x5BF9;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x4F1A;&#x4E00;&#x626B;&#x800C;&#x8FC7;&#xFF0C;&#x6211;&#x6240;&#x770B;&#x5230;&#x7684;&#x7F51;&#x7AD9;&#x548C;&#x6F14;&#x8BB2;&#x8005;&#x81EA;&#x5DF1;&#x6F14;&#x793A;&#x51FA;&#x6765;&#x7684;&#x76F8;&#x6BD4;&#x5C11;&#x4E86;&#x5F88;&#x591A;&#x4EAE;&#x70B9;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x201C;&#x79D8;&#x5BC6;&#x201D;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#xFF0C;&#x5177;&#x4F53;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x53BB;&#x53D1;&#x73B0;&#x5427;~ <a href="http://cssicon.space/#/" target="_blank" rel="external">cssicon.space</a></p>
<p>&#x6F14;&#x8BB2;&#x8005;&#x4EE5;&#x73B0;&#x573A;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x53EF;&#x7231;&#x7684;&#x80E1;&#x5B50;&#x6765;&#x5F00;&#x573A;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;</p>
<p><img src="/2016/12/18/css_conf_2016/iconfont.jpg" alt="&#x73B0;&#x573A;&#x64B8;&#x7801;&#x753B;&#x80E1;&#x5B50;"></p>
<p>&#x80E1;&#x5B50;&#x672C;&#x8EAB;&#x5E76;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x96BE;&#x5EA6;&#xFF0C;&#x5229;&#x7528;&#x5706;&#x89D2;&#x548C;&#x9634;&#x5F71;&#x4EE5;&#x53CA;&#x4F2A;&#x5143;&#x7D20;&#x548C;&#x5B9A;&#x4F4D;&#x7B49;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x80FD;&#x753B;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x7ED3;&#x5408;&#x7740;CSS&#x53D8;&#x91CF;&#x548C;calc&#x51FD;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x5C11;&#x91CF;js&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x4FBF;&#x80FD;&#x4EA7;&#x751F;&#x51FA;&#x8BA9;&#x5927;&#x5BB6;&#x60CA;&#x53F9;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F60;&#x4F1A;&#x89C9;&#x5F97;&#xFF0C;&#x539F;&#x6765;&#x770B;&#x8D77;&#x6765;&#x90A3;&#x4E48;&#x70AB;&#x7684;&#x6548;&#x679C;&#x5176;&#x5B9E;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x5C31;&#x80FD;&#x505A;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x6211;&#x7684;&#x611F;&#x53D7;&#x662F;&#xFF0C;&#x753B;icon&#x662F;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x753B;&#x4E86;512&#x4E2A;&#xFF0C;&#x8FD8;&#x7ED9;&#x5B83;&#x4EEC;&#x5B89;&#x4E86;&#x4E2A;&#x5BB6;&#xFF0C;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x8FD8;&#x7279;&#x5730;&#x82B1;&#x4E86;&#x4E00;&#x4E9B;&#x529F;&#x592B;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x975E;&#x5E38;&#x8D5E;&#x7684;&#x4F53;&#x9A8C;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x4E0D;&#x7B80;&#x5355;&#x7684;&#x4E8B;~</p>
<h2 id="&#x540E;&#x8BB0;"><a href="#&#x540E;&#x8BB0;" class="headerlink" title="&#x540E;&#x8BB0;"></a>&#x540E;&#x8BB0;</h2><p>&#x671F;&#x5F85;&#x4E86;&#x51E0;&#x4E2A;&#x6708;&#xFF0C;&#x63D0;&#x524D;&#x4E00;&#x5929;&#x62B5;&#x8FBE;&#x5E7F;&#x5DDE;&#xFF0C;&#x5E26;&#x7740;&#x672C;&#x5B50;&#x505A;&#x4E86;&#x4E00;&#x5806;&#x7B14;&#x8BB0;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x4E0D;&#x865A;&#x6B64;&#x884C;&#x3002;&#x6216;&#x8BB8;&#x56E0;&#x4E3A;&#x4E2A;&#x4EBA;&#x5DE5;&#x4F5C;&#x7684;&#x5C40;&#x9650;&#xFF0C;&#x6216;&#x8BB8;&#x56E0;&#x4E3A;&#x61D2;&#x60F0;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x5C1A;&#x672A;&#x53D1;&#x73B0;&#xFF0C;&#x7136;&#x540E;&#x4E00;&#x6B65;&#x6B65;&#x5730;&#x8D70;&#x5230;&#x4E86;&#x6280;&#x672F;&#x548C;&#x5FC3;&#x7406;&#x7684;&#x53CC;&#x91CD;&#x74F6;&#x9888;&#xFF0C;&#x6709;&#x4EBA;&#x5C31;&#x89C9;&#x5F97;&#x8FF7;&#x832B;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4E0B;&#x4E00;&#x6B65;&#x8BE5;&#x628A;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x80FD;&#x591F;&#x501F;&#x52A9;&#x4E00;&#x4E9B;&#x66F4;&#x52A0;&#x4F18;&#x79C0;&#x6216;&#x8005;&#x6BD4;&#x6211;&#x4EEC;&#x505A;&#x4E86;&#x66F4;&#x591A;&#x5C1D;&#x8BD5;&#x7684;&#x4EBA;&#x7684;&#x89C6;&#x89D2;&#xFF0C;&#x53BB;&#x770B;&#x4E00;&#x770B;&#x672A;&#x77E5;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x5BF9;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x4E2A;&#x6FC0;&#x52B1;&#x3002;</p>
<p>&#x5C1D;&#x8BD5;&#x66F4;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x627E;&#x5230;&#x66F4;&#x591A;&#x7CBE;&#x5F69;&#xFF0C;&#x8FD9;&#x4E0D;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x7F16;&#x7A0B;&#x4EBA;&#x5458;&#x5DE5;&#x4F5C;&#x7684;&#x4E50;&#x8DA3;&#x548C;&#x521D;&#x5FC3;&#x4E48;~</p>
<p>&#x611F;&#x8C22;&#x5927;&#x4F1A;&#x7684;&#x7EC4;&#x7EC7;&#x8005;&#x548C;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x4EBA;&#x5458;&#xFF0C;&#x671F;&#x5F85;&#x4E0B;&#x4E00;&#x6B21;&#x7684;&#x7CBE;&#x5F69;&#x3002;</p>
<p>&#x53E6;&#x9644;&#x4E00;&#x4E2A;&#x65E0;&#x610F;&#x95F4;&#x770B;&#x5230;&#x7684;CSS&#x4E8C;&#x5341;&#x5468;&#x5E74;&#x4F5C;&#x8005;&#x4E13;&#x8BBF; <a href="https://dev.opera.com/articles/css-twenty-years-hakon/" target="_blank" rel="external">CSS: It was twenty years ago today &#x2014; an interview with H&#xE5;kon Wium Lie</a></p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/分享交流/" rel="tag">#分享交流</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/11/28/ui_developer/" rel="next" title="明白了这些，你不仅仅能成长为优秀的UI工程师">
                <i class="fa fa-chevron-left"></i> 明白了这些，你不仅仅能成长为优秀的UI工程师
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/08/17/tencent_two/" rel="prev" title="每个人都在跟自己赛跑——我的鹅厂两年记">
                每个人都在跟自己赛跑——我的鹅厂两年记 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#一、3-14-Things-I-Didn’t-Know-About-CSS——Mathias-Bynens"><span class="nav-number">1.</span> <span class="nav-text">一、3.14 Things I Didn’t Know About CSS——Mathias Bynens</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#二、CSS-Grid-Layout——大漠"><span class="nav-number">2.</span> <span class="nav-text">二、CSS Grid Layout——大漠</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#三、闪电分享——勾三股四"><span class="nav-number">3.</span> <span class="nav-text">三、闪电分享——勾三股四</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#四、Sass-amp-CSS-Design-Pattern——廖洧杰"><span class="nav-number">4.</span> <span class="nav-text">四、Sass & CSS Design Pattern——廖洧杰</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#五、微信网页重构实践-amp-amp-SVG工程化与动画实践——罗正烨、方潇仪、倪栩生"><span class="nav-number">5.</span> <span class="nav-text">五、微信网页重构实践 && SVG工程化与动画实践——罗正烨、方潇仪、倪栩生</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#六、从矩阵走入-WebGL-世界——陈剑鑫"><span class="nav-number">6.</span> <span class="nav-text">六、从矩阵走入 WebGL 世界——陈剑鑫</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#七、CSS-animation-amp-amp-CSS-The-secret-drawing-tool——Wenting-Zhang"><span class="nav-number">7.</span> <span class="nav-text">七、CSS animation && CSS: The secret drawing tool——Wenting Zhang</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#后记"><span class="nav-number">8.</span> <span class="nav-text">后记</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
