<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="设计、读后感," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x62DC;&amp;#x8BFB;&amp;#x4E86;&amp;#x300A;&amp;#x5199;&amp;#x7ED9;&amp;#x5927;&amp;#x5BB6;&amp;#x770B;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E66;&amp;#x300B;(&amp;#x7CBE;&amp;#x88C5;&amp;#x7248;)~
&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x672C;&amp;#x5927;&amp;#x5">
<meta property="og:type" content="article">
<meta property="og:title" content="设计，不止于美">
<meta property="og:url" content="http://yoursite.com/2016/03/06/design-principle/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x62DC;&amp;#x8BFB;&amp;#x4E86;&amp;#x300A;&amp;#x5199;&amp;#x7ED9;&amp;#x5927;&amp;#x5BB6;&amp;#x770B;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E66;&amp;#x300B;(&amp;#x7CBE;&amp;#x88C5;&amp;#x7248;)~
&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x672C;&amp;#x5927;&amp;#x5">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/01.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/02.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/03.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/compare01.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/compare02.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/color_wheel01.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/color_wheel.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/color_wheel02.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/color_wheel03.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/color_wheel04.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/color_wheel05.jpg">
<meta property="og:image" content="http://yoursite.com/2016/03/06/design-principle/word-kind.jpg">
<meta property="og:updated_time" content="2016-03-06T13:25:54.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="设计，不止于美">
<meta name="twitter:description" content="&amp;#x6700;&amp;#x8FD1;&amp;#x62DC;&amp;#x8BFB;&amp;#x4E86;&amp;#x300A;&amp;#x5199;&amp;#x7ED9;&amp;#x5927;&amp;#x5BB6;&amp;#x770B;&amp;#x7684;&amp;#x8BBE;&amp;#x8BA1;&amp;#x4E66;&amp;#x300B;(&amp;#x7CBE;&amp;#x88C5;&amp;#x7248;)~
&amp;#x8FD9;&amp;#x662F;&amp;#x4E00;&amp;#x672C;&amp;#x5927;&amp;#x5">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 设计，不止于美 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                设计，不止于美
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-03-06T00:00:00+08:00" content="2016-03-06">
              2016-03-06
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/设计/" itemprop="url" rel="index">
                    <span itemprop="name">设计</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6700;&#x8FD1;&#x62DC;&#x8BFB;&#x4E86;<strong>&#x300A;&#x5199;&#x7ED9;&#x5927;&#x5BB6;&#x770B;&#x7684;&#x8BBE;&#x8BA1;&#x4E66;&#x300B;</strong>(&#x7CBE;&#x88C5;&#x7248;)~</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x672C;&#x5927;&#x5BB6;&#x90FD;&#x8BF4;&#x597D;&#x7684;&#x4E66;&#xFF0C;&#x80FD;&#x901A;&#x8FC7;&#x6D3B;&#x52A8;&#x96C6;&#x8D5E;&#x5F97;&#x6765;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x611F;&#x8C22;&#x5404;&#x4F4D;&#x597D;&#x53CB;&#x7684;&#x7ED9;&#x529B;&#xFF0C;&#x7136;&#x540E;&#x4E5F;&#x4E0D;&#x80FD;&#x6D6A;&#x8D39;&#x4E86;&#x3002;&#x5C31;&#x54C1;&#x8BFB;&#x4E86;&#x4E00;&#x756A;&#x3002;</p>
<h2 id="&#x4F60;&#x4E5F;&#x80FD;&#x61C2;&#x201C;&#x8BBE;&#x8BA1;&#x201D;"><a href="#&#x4F60;&#x4E5F;&#x80FD;&#x61C2;&#x201C;&#x8BBE;&#x8BA1;&#x201D;" class="headerlink" title="&#x4F60;&#x4E5F;&#x80FD;&#x61C2;&#x201C;&#x8BBE;&#x8BA1;&#x201D;"></a>&#x4F60;&#x4E5F;&#x80FD;&#x61C2;&#x201C;&#x8BBE;&#x8BA1;&#x201D;</h2><p><strong>&#x8131;&#x6389;&#x9AD8;&#x5927;&#x4E0A;&#x7684;&#x5916;&#x8863;&#xFF0C;&#x5B83;&#x5C31;&#x5728;&#x4F60;&#x6211;&#x8EAB;&#x8FB9;</strong></p>
<p>&#x6211;&#x662F;&#x505A;&#x7F51;&#x9875;&#x76F8;&#x5173;&#x5DE5;&#x4F5C;&#x7684;&#xFF0C;&#x4F46;&#x9996;&#x5148;&#x8981;&#x8DDF;&#x6CA1;&#x8BFB;&#x8FC7;&#x7684;&#x8BFB;&#x8005;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x672C;&#x6559;&#x4F60;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x7684;&#x4E66;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E66;&#x540D;&#x91CC;&#x7684;&#x201C;&#x5927;&#x5BB6;&#x201D;&#xFF0C;&#x4E0D;&#x662F;&#x5BF9;&#x5E7F;&#x5927;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#xFF0C;&#x800C;&#x662F;&#x5BF9;&#x6240;&#x6709;&#x4EBA;&#x3002;&#x91CC;&#x9762;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x548C;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x5F88;&#x591A;&#x65B9;&#x9762;&#x3002;</p>
<p>&#x6587;&#x6863;&#xFF0C;&#x4FE1;&#x4EF6;&#xFF0C;&#x540D;&#x7247;&#xFF0C;&#x65B0;&#x95FB;&#x7B80;&#x62A5;&#xFF0C;&#x4F20;&#x5355;&#xFF0C;&#x5BA3;&#x4F20;&#x518C;&#xFF0C;&#x62A5;&#x520A;&#xFF0C;&#x5E7F;&#x544A;&#xFF0C;&#x7B80;&#x5386;&#xFF0C;ppt&#x7B49;&#x7B49;&#xFF0C;&#x603B;&#x6709;&#x4E00;&#x6B3E;&#x9002;&#x5408;&#x4F60;&#x3002;&#x5F53;&#x4F60;&#x638C;&#x63E1;&#x4E86;&#x4E00;&#x4E9B;&#x7F16;&#x6392;&#x548C;&#x8BBE;&#x8BA1;&#x6280;&#x5DE7;&#xFF0C;&#x5C31;&#x80FD;&#x4F7F;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x54C1;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x4E13;&#x4E1A;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x7406;&#x60F3;&#x6548;&#x679C;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x63D0;&#x5230;&#x201C;&#x8BBE;&#x8BA1;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x611F;&#x89C9;&#xFF0C;&#x7F8E;&#x89C2;&#xFF0C;&#x6574;&#x9F50;&#x6216;&#x8005;&#x5177;&#x6709;&#x67D0;&#x79CD;&#x9C9C;&#x660E;&#x7684;&#x98CE;&#x683C;&#x548C;&#x76EE;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#xFF0C;&#x4F60;&#x8BF4;&#x4E0D;&#x51FA;&#x5B83;&#x54EA;&#x91CC;&#x597D;&#xFF0C;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#x633A;&#x597D;&#x3002;&#x90A3;&#x4E48;&#x4E0B;&#x9762;&#x5C31;&#x8DDF;&#x7740;&#x6211;&#x6982;&#x89C8;&#x4E00;&#x4E0B;&#x5427;&#x3002;</p>
<h2 id="&#x56DB;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;"><a href="#&#x56DB;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;" class="headerlink" title="&#x56DB;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;"></a>&#x56DB;&#x5927;&#x57FA;&#x672C;&#x539F;&#x5219;</h2><p>&#x60F3;&#x8981;&#x7ED9;&#x4EBA;&#x4EE5;&#x8BBE;&#x8BA1;&#x611F;&#xFF0C;&#x8FBE;&#x5230;&#x66F4;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5FC5;&#x7136;&#x8981;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x548C;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x91CC;&#x6240;&#x8BF4;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x65E2;&#x7136;&#x662F;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF0C;&#x8F7B;&#x5185;&#x5BB9;&#xFF0C;&#x91CD;&#x5F62;&#x5F0F;&#x3002;</p>
<p><strong>&#x4EB2;&#x5BC6;&#x6027;</strong>&#x2014;&#x2014;&#x8BA9;&#x4FE1;&#x606F;&#x4F20;&#x8FBE;&#x66F4;&#x6E05;&#x6670;</p>
<p>&#x5728;&#x5F88;&#x591A;&#x8BBE;&#x8BA1;&#x65B0;&#x624B;&#x7684;&#x773C;&#x4E2D;&#xFF0C;&#x66F4;&#x52A0;&#x70ED;&#x8877;&#x4E8E;&#x5BF9;&#x201C;&#x753B;&#x5E03;&#x201D;&#x7684;&#x586B;&#x5145;&#xFF0C;&#x52A0;&#x4E00;&#x6BB5;&#x8BDD;&#xFF0C;&#x52A0;&#x4E00;&#x5E45;&#x56FE;&#x7B49;&#x7B49;&#xFF0C;&#x5BF9;&#x4E8E;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x7559;&#x767D;&#x6709;&#x79CD;&#x672C;&#x80FD;&#x7684;&#x56DE;&#x907F;&#xFF0C;&#x4F3C;&#x4E4E;&#x53EA;&#x6709;&#x5185;&#x5BB9;&#x624D;&#x80FD;&#x4F53;&#x73B0;&#x51FA;&#x6C34;&#x5E73;&#x3002;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x9875;&#x9762;&#x5F53;&#x4E2D;&#x5145;&#x65A5;&#x7740;&#x592A;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x6742;&#x4E71;&#x65E0;&#x7AE0;&#x3002;</p>
<p>&#x4EB2;&#x5BC6;&#x6027;&#x539F;&#x5219;&#xFF0C;&#x5373;<strong>&#x5C06;&#x76F8;&#x5173;&#x7684;&#x9879;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;</strong>&#xFF0C;&#x4F7F;&#x5B83;&#x4EEC;&#x7684;&#x7269;&#x7406;&#x4F4D;&#x7F6E;&#x76F8;&#x4E92;&#x9760;&#x8FD1;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x76F8;&#x5173;&#x9879;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x7EC4;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BEB;&#x65E0;&#x5173;&#x8054;&#x7684;&#x4E24;&#x4E2A;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5C55;&#x793A;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x5F20;&#x4F20;&#x5355;&#xFF0C;&#x4F1A;&#x6709;&#x5927;&#x6807;&#x9898;&#xFF0C;&#x6BB5;&#x843D;&#x548C;&#x6BB5;&#x843D;&#x6807;&#x9898;&#xFF0C;&#x56FE;&#x7247;&#x548C;&#x56FE;&#x7247;&#x4FE1;&#x606F;&#x63CF;&#x8FF0;&#xFF0C;&#x5728;&#x4E0B;&#x65B9;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5730;&#x5740;&#x3001;&#x8054;&#x7CFB;&#x4EBA;&#x3001;&#x8054;&#x7CFB;&#x65B9;&#x5F0F;&#x3002;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x88AB;&#x4E00;&#x7A9D;&#x8702;&#x7684;&#x5806;&#x79EF;&#x5230;&#x4E00;&#x5F20;&#x7EB8;&#x4E0A;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="/2016/03/06/design-principle/01.jpg" alt=""></p>
<p>&#x663E;&#x7136;&#x4F1A;&#x5F88;&#x96BE;&#x533A;&#x5206;&#x548C;&#x8FA8;&#x8BC6;&#xFF0C;&#x66F4;&#x522B;&#x63D0;&#x8BA9;&#x53D7;&#x4F17;&#x6709;&#x6DF1;&#x5165;&#x9605;&#x8BFB;&#x4E0B;&#x53BB;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x90A3;&#x4E48;&#x4F20;&#x5355;&#x7684;&#x5236;&#x4F5C;&#x5C31;&#x662F;&#x5931;&#x8D25;&#x7684;&#x3002;</p>
<p>&#x6839;&#x636E;&#x4EB2;&#x5BC6;&#x6027;&#x539F;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x5411;&#x5916;&#x754C;&#x4F20;&#x8FBE;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x5173;&#x7CFB;&#x76F8;&#x8FD1;&#x7684;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4E0D;&#x4EC5;&#x80FD;&#x4F7F;&#x5185;&#x5BB9;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x597D;&#x7684;&#x7ED3;&#x6784;&#x7F16;&#x6392;&#x80FD;&#x5E2E;&#x52A9;&#x4EBA;&#x7406;&#x89E3;&#xFF0C;&#x4E5F;&#x80FD;&#x964D;&#x4F4E;&#x4EBA;&#x773C;&#x7684;&#x9605;&#x8BFB;&#x8D1F;&#x62C5;&#xFF0C;&#x66F4;&#x613F;&#x610F;&#x8BFB;&#x4E0B;&#x53BB;&#x3002;&#x62FF;&#x4E0A;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x628A;&#x5927;&#x6807;&#x9898;&#x5355;&#x72EC;&#x4E00;&#x884C;&#x653E;&#x5728;&#x9876;&#x90E8;&#xFF0C;&#x6BB5;&#x843D;&#x548C;&#x6BB5;&#x843D;&#x6807;&#x9898;&#x4EE5;&#x5217;&#x8868;&#x5F62;&#x5F0F;&#x7531;&#x4E0A;&#x5230;&#x4E0B;&#x7684;&#x6392;&#x5217;&#xFF0C;&#x6BCF;&#x4E2A;&#x6BB5;&#x843D;&#x7684;&#x6807;&#x9898;&#x548C;&#x6BB5;&#x843D;&#x7D27;&#x9760;&#xFF0C;&#x540C;&#x65F6;&#x548C;&#x5176;&#x4ED6;&#x6BB5;&#x843D;&#x4FDD;&#x6301;&#x4E00;&#x70B9;&#x8DDD;&#x79BB;&#xFF0C;&#x5E95;&#x90E8;&#x96C6;&#x4E2D;&#x653E;&#x7F6E;&#x8054;&#x7CFB;&#x4EBA;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x4F1A;&#x663E;&#x5F97;&#x7ED3;&#x6784;&#x5F88;&#x6E05;&#x6670;&#x548C;&#x5408;&#x7406;&#x3002;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/03/06/design-principle/02.jpg" alt=""></p>
<p><strong>&#x5BF9;&#x9F50;</strong>&#x2014;&#x2014;&#x6587;&#x5B57;&#x4E5F;&#x80FD;&#x6709;&#x6001;&#x5EA6;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x9875;&#x9762;&#x4E2D;&#x5404;&#x5143;&#x7D20;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#x4E0D;&#x654F;&#x611F;&#xFF0C;&#x4E5F;&#x4E0D;&#x5728;&#x610F;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x4F1A;&#x663E;&#x5F97;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x89C4;&#x5F8B;&#xFF0C;&#x5185;&#x5BB9;&#x867D;&#x4ECD;&#x7136;&#x53EF;&#x8BFB;&#xFF0C;&#x4F53;&#x9A8C;&#x5C31;&#x5927;&#x6253;&#x6298;&#x6263;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x773C;&#x775B;&#x559C;&#x6B22;&#x770B;&#x5230;&#x6709;&#x5E8F;&#x7684;&#x4E8B;&#x7269;&#xFF0C;&#x4F1A;&#x7ED9;&#x4EBA;&#x4E00;&#x79CD;&#x5E73;&#x9759;&#x3001;&#x5B89;&#x5168;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x4F20;&#x8FBE;&#x4FE1;&#x606F;&#x3002;&#x5BF9;&#x9F50;&#x539F;&#x5219;&#xFF0C;&#x5373;<strong>&#x6BCF;&#x4E00;&#x9879;&#x90FD;&#x5E94;&#x5F53;&#x4E0E;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x67D0;&#x4E2A;&#x5185;&#x5BB9;&#x5B58;&#x5728;&#x67D0;&#x79CD;&#x89C6;&#x89C9;&#x8054;&#x7CFB;</strong>&#x3002;</p>
<p>&#x5BF9;&#x9F50;&#xFF0C;&#x5C31;&#x8981;&#x6709;&#x5BF9;&#x9F50;&#x7684;&#x57FA;&#x51C6;&#x7EBF;&#xFF0C;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x7528;&#x6765;&#x5E03;&#x5C40;&#x548C;&#x6392;&#x7248;&#x7684;&#x8F7D;&#x4F53;&#x662F;&#x77E9;&#x5F62;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x65B9;&#x5411;&#x4E0A;&#x5C31;&#x6709;&#x4E86;&#x201C;&#x6C34;&#x5E73;&#x3001;&#x7AD6;&#x76F4;&#x201D;&#xFF0C;&#x6C34;&#x5E73;&#x65B9;&#x5411;&#x4E0A;&#xFF0C;&#x6709;&#x201C;&#x5C45;&#x5DE6;&#x3001;&#x5C45;&#x4E2D;&#x3001;&#x5C45;&#x53F3;&#x201D;&#xFF0C;&#x7AD6;&#x76F4;&#x65B9;&#x5411;&#x4E0A;&#x6709;&#x201C;&#x7F6E;&#x9876;&#x3001;&#x5C45;&#x4E2D;&#x3001;&#x7F6E;&#x5E95;&#x201D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x4F53;&#x73B0;&#x4E86;&#x4EC0;&#x4E48;&#x6001;&#x5EA6;&#x5462;&#xFF0C;&#x51CC;&#x4E71;&#x548C;&#x6574;&#x9F50;&#x5212;&#x4E00;&#x7684;&#x533A;&#x522B;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x89C6;&#x89C9;&#x611F;&#x5B98;&#xFF0C;&#x5176;&#x6B21;&#xFF0C;&#x4EE5;&#x540C;&#x4E00;&#x57FA;&#x51C6;&#x7EBF;&#x5BF9;&#x9F50;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4F1A;&#x4E0D;&#x81EA;&#x89C9;&#x7684;&#x628A;&#x5B83;&#x4EEC;&#x5F52;&#x4E3A;&#x540C;&#x7C7B;&#x6216;&#x540C;&#x7EC4;&#x3002;</p>
<p>&#x8981;&#x600E;&#x6837;&#x5BF9;&#x9F50;&#xFF1F;</p>
<p>&#x201C;&#x5C45;&#x4E2D;&#x201D;&#x662F;&#x5F88;&#x591A;&#x521D;&#x5B66;&#x8005;&#x7684;&#x6700;&#x7231;&#xFF0C;&#x4E5F;&#x662F;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x548C;&#x5236;&#x4F5C;&#x8005;&#x6700;&#x719F;&#x6089;&#x7684;&#x4E00;&#x79CD;&#x5BF9;&#x9F50;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x8F83;&#x5E38;&#x89C1;&#x7684;&#x662F;&#x6587;&#x672C;/&#x56FE;&#x7247;&#x76F8;&#x5BF9;&#x4E8E;&#x7236;&#x5BB9;&#x5668;&#x5C45;&#x4E2D;&#x548C;&#x7F51;&#x9875;&#x6574;&#x4E2A;&#x89C6;&#x533A;&#x7684;&#x5C45;&#x4E2D;&#x3002;&#x8FD9;&#x79CD;&#x5BF9;&#x9F50;&#x770B;&#x8D77;&#x6765;&#x5B89;&#x5168;&#xFF0C;&#x611F;&#x89C9;&#x4E0A;&#x4E5F;&#x5F88;&#x8212;&#x670D;&#xFF0C;&#x5C45;&#x4E2D;&#x5BF9;&#x9F50;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x79CD;&#x66F4;&#x6B63;&#x5F0F;&#x3001;&#x66F4;&#x7A33;&#x91CD;&#x7684;&#x5916;&#x89C2;&#xFF0C;&#x663E;&#x5F97;&#x66F4;&#x4E2D;&#x89C4;&#x4E2D;&#x77E9;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x6709;&#x4E9B;&#x4E4F;&#x5473;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x53CD;&#x5E94;&#x662F;&#x5C45;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x6539;&#x53D8;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x601D;&#x7EF4;&#x60EF;&#x6027;&#xFF0C;&#x672C;&#x4E66;&#x4F5C;&#x8005;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x5C1D;&#x8BD5;&#x5C45;&#x4E2D;&#xFF0C;&#x771F;&#x6B63;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x5C45;&#x4E2D;&#x5BF9;&#x9F50;&#x7684;&#x573A;&#x666F;&#x8FD8;&#x662F;&#x6BD4;&#x8F83;&#x5C11;&#x7684;&#xFF0C;&#x5728;&#x751F;&#x6D3B;&#x5F53;&#x4E2D;&#x5E94;&#x7528;&#x7684;&#x66F4;&#x591A;&#x7684;&#x662F;&#x76F8;&#x5BF9;&#x67D0;&#x4E00;&#x6761;&#x201C;&#x9690;&#x5F62;&#x201D;&#x7684;&#x57FA;&#x51C6;&#x7EBF;&#x5BF9;&#x9F50;&#x3002;</p>
<p>&#x5BF9;&#x9F50;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x662F;&#x4F7F;&#x9875;&#x9762;&#x7EDF;&#x4E00;&#x800C;&#x4E14;&#x6709;&#x6761;&#x7406;&#xFF0C;&#x53E6;&#x5916;&#x8981;&#x63A7;&#x5236;&#x81EA;&#x5DF1;&#x7684;&#x53D1;&#x6325;&#x6B32;&#x671B;&#xFF0C;&#x907F;&#x514D;&#x9875;&#x9762;&#x4E0A;&#x6DF7;&#x5408;&#x4F7F;&#x7528;&#x591A;&#x79CD;&#x6587;&#x672C;&#x5BF9;&#x9F50;&#x3002;</p>
<p><strong>&#x91CD;&#x590D;</strong>&#x2014;&#x2014;&#x7EDF;&#x4E00;&#x7684;&#x827A;&#x672F;</p>
<p><em>&#x8BBE;&#x8BA1;&#x7684;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x9700;&#x8981;&#x5728;&#x6574;&#x4E2A;&#x4F5C;&#x54C1;&#x4E2D;&#x91CD;&#x590D;</em>&#x3002;&#x91CD;&#x590D;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x4E25;&#x683C;&#x9650;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x4E5F;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x8FD9;&#x79CD;&#x91CD;&#x590D;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x8DEF;&#x724C;&#xFF0C;&#x9A6C;&#x8DEF;&#x4E2D;&#x7684;&#x7EBF;&#xFF0C;&#x4E00;&#x680B;&#x697C;&#x7684;&#x6BCF;&#x95F4;&#x623F;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x8DF3;&#x51FA;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#xFF0C;&#x91CD;&#x590D;&#x4E5F;&#x662F;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x7684;&#xFF0C;&#x56DE;&#x5230;&#x5E73;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x6587;&#x7AE0;&#x6216;&#x8005;&#x6BB5;&#x843D;&#x6807;&#x9898;&#xFF0C;&#x5217;&#x8868;&#x56FE;&#x6807;&#xFF0C;&#x6BB5;&#x843D;&#x95F4;&#x8DDD;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x91CD;&#x590D;&#x3002;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/03/06/design-principle/03.jpg" alt=""></p>
<p>&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x91CD;&#x590D;&#x662F;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x662F;&#x81EA;&#x7136;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x800C;&#x662F;&#x6709;&#x610F;&#x8BC6;&#x7684;&#x8BBE;&#x8BA1;&#x884C;&#x4E3A;&#x3002;&#x4F60;&#x4F1A;&#x4E0D;&#x81EA;&#x89C9;&#x7684;&#x628A;&#x770B;&#x8D77;&#x6765;&#x91CD;&#x590D;&#x7684;&#x4E00;&#x81F4;&#x7684;&#x4F5C;&#x4E3A;&#x540C;&#x4E00;&#x7EC4;&#xFF0C;&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x540C;&#x4E00;&#x7C7B;&#x4FE1;&#x606F;&#x3002;</p>
<p><strong>&#x5BF9;&#x6BD4;</strong>&#x2014;&#x2014;&#x6293;&#x4F4F;&#x773C;&#x775B;&#xFF0C;&#x8BA9;&#x91CD;&#x70B9;&#x8131;&#x9896;&#x800C;&#x51FA;</p>
<p>&#x5BF9;&#x6BD4;&#x662F;&#x4E3A;&#x9875;&#x9762;&#x589E;&#x52A0;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x7684;&#x6700;&#x6709;&#x6548;&#x9014;&#x5F84;&#xFF0C;&#x4E5F;&#x662F;&#x5728;&#x4E0D;&#x540C;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E00;&#x79CD;&#x6709;&#x7EC4;&#x7EC7;&#x7684;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x8981;&#x8BB0;&#x4F4F;&#x5B9E;&#x73B0;&#x6709;&#x6548;&#x7684;&#x5BF9;&#x6BD4;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5F3A;&#x70C8;&#x3002;</p>
<p><strong>&#x8981;&#x4E0D;&#x540C;&#xFF0C;&#x5C31;&#x622A;&#x7136;&#x4E0D;&#x540C;</strong></p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7AD9;&#x5728;&#x4F60;&#x9762;&#x524D;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x53CC;&#x80DE;&#x80CE;&#xFF0C;&#x5B83;&#x4EEC;&#x80AF;&#x5B9A;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x4E00;&#x773C;&#x770B;&#x4E0A;&#x53BB;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x5F88;&#x5FEB;&#x627E;&#x51FA;&#x4E0D;&#x540C;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x518D;&#x6BD4;&#x5982;&#x5927;&#x5BB6;&#x5E94;&#x8BE5;&#x90FD;&#x73A9;&#x8FC7;&#x627E;&#x832C;&#x6E38;&#x620F;&#xFF0C;&#x4E24;&#x5E45;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x56FE;&#xFF0C;&#x627E;&#x51FA;&#x7EC6;&#x5FAE;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x4E5F;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x662F;&#x4E3E;&#x4E86;&#x4E24;&#x4E2A;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x4F8B;&#x5B50;&#x8BF4;&#x660E;&#xFF0C;&#x7528;&#x5728;&#x5E73;&#x9762;&#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x8BDD;&#xFF0C;&#x5BF9;&#x6BD4;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x5438;&#x5F15;&#x773C;&#x7403;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x7EC4;&#x7EC7;&#x4FE1;&#x606F;&#x3001;&#x6E05;&#x6670;&#x5C42;&#x7EA7;&#xFF0C;&#x6307;&#x5F15;&#x8BFB;&#x8005;&#x5E76;&#x5236;&#x9020;&#x7126;&#x70B9;&#x3002;</p>
<p>&#x600E;&#x6837;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x5462;&#xFF1F;</p>
<p>&#x60F3;&#x77E5;&#x9053;&#x600E;&#x6837;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#xFF0C;&#x5C31;&#x8981;&#x77E5;&#x9053;&#x600E;&#x6837;&#x662F;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x5C31;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x6765;&#x8BF4;&#xFF0C;13px&#x548C;14px&#x7684;&#x5B57;&#xFF0C;1px&#x7C97;&#x7684;&#x7EBF;&#x548C;2px&#x7C97;&#x7684;&#x7EBF;&#xFF0C;&#x9ED1;&#x8272;&#x548C;&#x7A0D;&#x6D45;&#x4E00;&#x70B9;&#x7684;&#x9ED1;&#x8272;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x6BD4;&#x90FD;&#x5F88;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x975E;&#x4F46;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x5BF9;&#x6BD4;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x4F60;<strong>&#x51FA;&#x73B0;&#x4E86;&#x5931;&#x8BEF;&#xFF01;</strong></p>
<p>&#x6BD4;&#x5982;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/03/06/design-principle/compare01.jpg" alt=""></p>
<p><img src="/2016/03/06/design-principle/compare02.jpg" alt=""></p>
<p>&#x4F60;&#x80FD;&#x770B;&#x51FA;&#x6765;&#x4E24;&#x5E45;&#x56FE;&#x4E2D;&#x91CD;&#x70B9;&#x548C;&#x975E;&#x91CD;&#x70B9;&#x6709;&#x660E;&#x663E;&#x533A;&#x522B;&#x5417;&#xFF1F;&#x6700;&#x591A;&#x662F;&#x4ED4;&#x7EC6;&#x770B;&#x4F1A;&#x89C9;&#x5F97;&#x54EA;&#x91CC;&#x4E0D;&#x5BF9;&#xFF0C;&#x4F46;&#x8FD9;&#x8D77;&#x4E0D;&#x5230;&#x5BF9;&#x6BD4;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<h2 id="&#x8272;&#x5F69;&#x7684;&#x79D8;&#x5BC6;"><a href="#&#x8272;&#x5F69;&#x7684;&#x79D8;&#x5BC6;" class="headerlink" title="&#x8272;&#x5F69;&#x7684;&#x79D8;&#x5BC6;"></a>&#x8272;&#x5F69;&#x7684;&#x79D8;&#x5BC6;</h2><p>&#x6211;&#x4EEC;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x4E94;&#x5F69;&#x7F24;&#x7EB7;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x8272;&#x539F;&#x7406;&#x8BBA;&#x53EF;&#x4EE5;&#x5F88;&#x6DF1;&#x5165;&#x3001;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x4F1A;&#x8BF4;&#x5F97;&#x90A3;&#x4E48;&#x590D;&#x6742;&#xFF0C;&#x53EA;&#x4F1A;&#x5BF9;&#x8272;&#x8F6E;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x8981;&#x7684;&#x4ECB;&#x7ECD;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x95EE;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x4F55;&#x914D;&#x8272;&#xFF1F;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8272;&#x8F6E;&#x5C31;&#x4F1A;&#x5F88;&#x6709;&#x7528;&#x3002;</p>
<p>&#x8272;&#x8F6E;&#x7684;&#x57FA;&#x7840;&#x662F;&#x201C;&#x9EC4;&#x3001;&#x7EA2;&#x3001;&#x84DD;&#x201D;&#xFF0C;&#x79F0;&#x4E3A;&#x4E09;&#x539F;&#x8272;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x65E0;&#x6CD5;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x989C;&#x8272;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x4E09;&#x539F;&#x8272;&#x8FDB;&#x884C;&#x4E0D;&#x65AD;&#x7684;&#x6DF7;&#x5408;&#x3001;&#x642D;&#x914D;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4EFB;&#x4F55;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x989C;&#x8272;&#x3002;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/03/06/design-principle/color_wheel01.jpg" alt=""></p>
<p><img src="/2016/03/06/design-principle/color_wheel.jpg" alt=""></p>
<p>&#x5728;&#x6784;&#x9020;&#x51FA;&#x4E86;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8272;&#x8F6E;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0B;&#x9762;&#x51E0;&#x4E2A;&#x65B9;&#x9762;&#x53BB;&#x642D;&#x914D;&#xFF1A;</p>
<ul>
<li>&#x5355;&#x8272;&#xFF0C;&#x4E0D;&#x540C;&#x8272;&#x8C03;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6697;&#x3001;&#x4E2D;&#x3001;&#x660E;</li>
</ul>
<p><img src="/2016/03/06/design-principle/color_wheel02.jpg" alt=""></p>
<ul>
<li>&#x7C7B;&#x6BD4;&#x8272;&#xFF0C;&#x76F8;&#x90BB;&#x989C;&#x8272;&#x79F0;&#x4E3A;&#x7C7B;&#x6BD4;&#x8272;&#xFF0C;&#x53EF;&#x4EE5;&#x5236;&#x9020;&#x4E00;&#x79CD;&#x4F4E;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x548C;&#x8C10;&#x7F8E;&#x611F;</li>
</ul>
<p><img src="/2016/03/06/design-principle/color_wheel03.jpg" alt=""></p>
<ul>
<li>&#x8865;&#x8272;&#xFF0C;&#x8272;&#x8F6E;&#x4E0A;&#x76F4;&#x7EBF;&#x76F8;&#x5BF9;&#x7684;&#x4E24;&#x79CD;&#x989C;&#x8272;&#x79F0;&#x4E3A;&#x8865;&#x8272;&#xFF0C;&#x80FD;&#x5F62;&#x6210;&#x5F3A;&#x70C8;&#x5BF9;&#x6BD4;&#xFF0C;&#x4F20;&#x8FBE;&#x51FA;&#x6D3B;&#x529B;&#x3001;&#x80FD;&#x91CF;&#x3001;&#x5174;&#x594B;&#x7B49;&#x610F;&#x4E49;<br><img src="/2016/03/06/design-principle/color_wheel04.jpg" alt=""></li>
</ul>
<ul>
<li>&#x5206;&#x88C2;&#x8865;&#x8272;&#xFF0C;&#x540C;&#x65F6;&#x7528;&#x8865;&#x8272;&#x53CA;&#x7C7B;&#x6BD4;&#x8272;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x786E;&#x5B9A;&#x989C;&#x8272;&#x5173;&#x7CFB;&#xFF0C;&#x517C;&#x5177;&#x4F4E;&#x5BF9;&#x6BD4;&#x5EA6;&#x7684;&#x7F8E;&#x611F;&#x548C;&#x8865;&#x8272;&#x7684;&#x529B;&#x91CF;&#x611F;&#xFF0C;&#x65E2;&#x548C;&#x8C10;&#x53C8;&#x6709;&#x91CD;&#x70B9;<br><img src="/2016/03/06/design-principle/color_wheel05.jpg" alt=""></li>
</ul>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x79CD;&#x7C7B;&#x7684;&#x642D;&#x914D;&#x65B9;&#x6CD5;&#xFF0C;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x8FD9;&#x91CC;&#x4E0D;&#x505A;&#x8D58;&#x8FF0;&#xFF0C;&#x5982;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x67E5;&#x9605;&#x76F8;&#x5173;&#x8D44;&#x6599;&#x8FDB;&#x4E00;&#x6B65;&#x5B66;&#x4E60;&#x3002;</p>
<h2 id="&#x591A;&#x6837;&#x7684;&#x6587;&#x672C;"><a href="#&#x591A;&#x6837;&#x7684;&#x6587;&#x672C;" class="headerlink" title="&#x591A;&#x6837;&#x7684;&#x6587;&#x672C;"></a>&#x591A;&#x6837;&#x7684;&#x6587;&#x672C;</h2><p>&#x8FD9;&#x672C;&#x4E66;&#x50CF;&#x5176;&#x4ED6;&#x7684;&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#x7684;&#x4E66;&#x7C4D;&#x4E00;&#x6837;&#xFF0C;&#x91CC;&#x9762;&#x6240;&#x4E3E;&#x793A;&#x4F8B;&#x90FD;&#x662F;&#x82F1;&#x6587;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x8FD9;&#x91CC;&#x8BA8;&#x8BBA;&#x7684;&#x5B57;&#x4F53;&#x4E5F;&#x662F;&#x82F1;&#x6587;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x662F;&#x4E2D;&#x6587;&#xFF0C;&#x4F46;&#x5BF9;&#x82F1;&#x6587;&#x5B57;&#x4F53;&#x7684;&#x4E86;&#x89E3;&#x4E5F;&#x662F;&#x6709;&#x4E00;&#x70B9;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x4F53;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x886C;&#x7EBF;&#x4F53;&#x3001;&#x65E0;&#x886C;&#x7EBF;&#x4F53;&#x3001;&#x7C97;&#x886C;&#x7EBF;&#x4F53;&#x3001;&#x624B;&#x5199;&#x4F53;.&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6B63;&#x786E;&#x7684;&#x5C06;&#x5B83;&#x4EEC;&#x8FDE;&#x7EBF;&#x5417;&#xFF1F;</p>
<p><img src="/2016/03/06/design-principle/word-kind.jpg" alt=""></p>
<p>&#x9664;&#x4E86;&#x7C7B;&#x522B;&#xFF0C;&#x5B57;&#x4F53;&#x7684;&#x8BBE;&#x8BA1;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x8868;&#x8FBE;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x5F15;&#x53F7;&#x3001;&#x6487;&#x53F7;&#x3001;&#x8FDE;&#x63A5;&#x53F7;&#x3001;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x3001;&#x4E0B;&#x5212;&#x7EBF;&#x3001;&#x5B57;&#x8DDD;&#x7B49;&#x3002;&#x5B57;&#x4F53;&#x672C;&#x8EAB;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x79CD;&#x5BF9;&#x6BD4;&#xFF0C;&#x5927;&#x5C0F;&#x3001;&#x7C97;&#x7EC6;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x5F62;&#x72B6;&#x3001;&#x65B9;&#x5411;&#x3001;&#x989C;&#x8272;&#x3002;&#x4F5C;&#x4E3A;&#x7F51;&#x9875;&#x65B9;&#x9762;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x591A;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;text-X&#x548C;font&#x76F8;&#x5173;&#x5C5E;&#x6027;&#x3002;</p>
<h2 id="&#x5E76;&#x80A9;&#x6218;&#x6597;"><a href="#&#x5E76;&#x80A9;&#x6218;&#x6597;" class="headerlink" title="&#x5E76;&#x80A9;&#x6218;&#x6597;"></a>&#x5E76;&#x80A9;&#x6218;&#x6597;</h2><p>&#x4E0A;&#x9762;&#x4ECB;&#x7ECD;&#x4E86;&#x8BF8;&#x591A;&#x7684;&#x539F;&#x5219;&#x3001;&#x6280;&#x5DE7;&#x548C;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF0C;&#x5B83;&#x4EEC;&#x5404;&#x4E2A;&#x8EAB;&#x6000;&#x7EDD;&#x6280;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x53EA;&#x5E94;&#x7528;&#x4E86;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#xFF0C;&#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x7406;&#x60F3;&#x6548;&#x679C;&#xFF0C;&#x8981;&#x5408;&#x7406;&#x7684;&#x5C06;&#x5B83;&#x4EEC;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x770B;&#x8D77;&#x6765;&#x65E2;&#x7F8E;&#x89C2;&#xFF0C;&#x53C8;&#x6E05;&#x6670;&#xFF0C;&#x4E3B;&#x6B21;&#x5206;&#x660E;&#x3002;</p>
<h2 id="&#x603B;&#x6709;&#x7279;&#x6743;"><a href="#&#x603B;&#x6709;&#x7279;&#x6743;" class="headerlink" title="&#x603B;&#x6709;&#x7279;&#x6743;"></a>&#x603B;&#x6709;&#x7279;&#x6743;</h2><p>&#x4EC0;&#x4E48;&#x662F;&#x7279;&#x6743;&#xFF1F;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x79CD;&#x4E8B;&#x7269;&#x90FD;&#x9075;&#x5FAA;&#x540C;&#x4E00;&#x89C4;&#x5219;&#xFF0C;&#x4E2D;&#x89C4;&#x4E2D;&#x77E9;&#xFF0C;&#x5C31;&#x6CA1;&#x6709;&#x60CA;&#x559C;&#x53EF;&#x8A00;&#x4E86;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x8981;&#x5BF9;&#x9F50;&#x90FD;&#x5BF9;&#x9F50;&#xFF0C;&#x8981;&#x4E00;&#x6837;&#x5927;&#x90FD;&#x4E00;&#x6837;&#x5927;&#xFF0C;&#x6A2A;&#x5E73;&#x7AD6;&#x76F4;&#xFF0C;&#x5C31;&#x663E;&#x5F97;&#x7F3A;&#x5C11;&#x521B;&#x9020;&#x6027;&#x3002;&#x7279;&#x6743;&#xFF0C;&#x5C31;&#x662F;&#x5141;&#x8BB8;&#x9875;&#x9762;&#x5F53;&#x4E2D;&#x7684;&#x5C11;&#x91CF;&#x5143;&#x7D20;&#x8131;&#x79BB;&#x6B63;&#x5E38;&#x6587;&#x6863;&#x6D41;&#xFF0C;&#x6446;&#x4E2A;&#x7279;&#x6B8A;&#x7684;pose&#xFF0C;&#x7ED9;&#x6574;&#x4F53;&#x5236;&#x9020;&#x4E00;&#x79CD;&#x522B;&#x6837;&#x7684;&#x611F;&#x89C9;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8981;&#x660E;&#x786E;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x4F60;&#x5728;&#x6253;&#x7834;&#x89C4;&#x5219;&#x4E4B;&#x524D;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x4F60;&#x8981;&#x5341;&#x5206;&#x7684;&#x6E05;&#x695A;&#x89C4;&#x5219;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5728;&#x89C4;&#x5219;&#x5904;&#x7834;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x4F60;&#x7684;&#x4E0D;&#x540C;&#x5F88;&#x83AB;&#x540D;&#x5176;&#x5999;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;"><a href="#&#x5C0F;&#x7ED3;" class="headerlink" title="&#x5C0F;&#x7ED3;"></a>&#x5C0F;&#x7ED3;</h2><p>&#x5173;&#x4E8E;&#x5199;&#x7ED9;&#x5927;&#x5BB6;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5C31;&#x5148;&#x8BA8;&#x8BBA;&#x5230;&#x8FD9;&#x91CC;&#x5427;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x5BF9;&#x4F60;&#x6709;&#x4E00;&#x70B9;&#x542F;&#x53D1;&#xFF0C;&#x80FD;&#x5E94;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x5F53;&#x4E2D;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x54C1;&#x589E;&#x8272;&#xFF0C;&#x4E5F;&#x5BF9;&#x60F3;&#x8981;&#x8BFB;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x670B;&#x53CB;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x53C2;&#x8003;&#x3002;&#x4EE5;&#x540E;&#x4F1A;&#x7EE7;&#x7EED;&#x8BA8;&#x8BBA;&#x5173;&#x4E8E;&#x8BBE;&#x8BA1;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x3002;&#x4E0B;&#x6B21;&#x89C1;&#x3002;</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/设计、读后感/" rel="tag">#设计、读后感</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/03/05/javascript-study-two/" rel="next" title="征服javascript学习笔记（二）——基本概念（上）">
                <i class="fa fa-chevron-left"></i> 征服javascript学习笔记（二）——基本概念（上）
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/20/javascript-study-three/" rel="prev" title="征服javascript学习笔记（三）——基本概念（下）">
                征服javascript学习笔记（三）——基本概念（下） <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#你也能懂“设计”"><span class="nav-number">1.</span> <span class="nav-text">你也能懂“设计”</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#四大基本原则"><span class="nav-number">2.</span> <span class="nav-text">四大基本原则</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#色彩的秘密"><span class="nav-number">3.</span> <span class="nav-text">色彩的秘密</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#多样的文本"><span class="nav-number">4.</span> <span class="nav-text">多样的文本</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#并肩战斗"><span class="nav-number">5.</span> <span class="nav-text">并肩战斗</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#总有特权"><span class="nav-number">6.</span> <span class="nav-text">总有特权</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#小结"><span class="nav-number">7.</span> <span class="nav-text">小结</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
