<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="经历," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x5173;&amp;#x952E;&amp;#x8BCD;&amp;#xFF1A;&amp;#x65B0;&amp;#x9C9C;&amp;#x611F;&amp;#x3001;&amp;#x6210;&amp;#x957F;&amp;#x3001;&amp;#x5B66;&amp;#x4E60;&amp;#x3001;&amp;#x56E2;&amp;#x961F;&amp;#x3001;&amp;#x5934;&amp;#x8854;
2017&amp;#x5E74;8&amp;#x6708;17&amp;#x65E5;&amp;#xFF0C;&amp;#x7ACB;">
<meta property="og:type" content="article">
<meta property="og:title" content="每个人都在跟自己赛跑——我的鹅厂两年记">
<meta property="og:url" content="http://yoursite.com/2017/08/17/tencent_two/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x5173;&amp;#x952E;&amp;#x8BCD;&amp;#xFF1A;&amp;#x65B0;&amp;#x9C9C;&amp;#x611F;&amp;#x3001;&amp;#x6210;&amp;#x957F;&amp;#x3001;&amp;#x5B66;&amp;#x4E60;&amp;#x3001;&amp;#x56E2;&amp;#x961F;&amp;#x3001;&amp;#x5934;&amp;#x8854;
2017&amp;#x5E74;8&amp;#x6708;17&amp;#x65E5;&amp;#xFF0C;&amp;#x7ACB;">
<meta property="og:updated_time" content="2017-09-09T04:44:18.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="每个人都在跟自己赛跑——我的鹅厂两年记">
<meta name="twitter:description" content="&amp;#x5173;&amp;#x952E;&amp;#x8BCD;&amp;#xFF1A;&amp;#x65B0;&amp;#x9C9C;&amp;#x611F;&amp;#x3001;&amp;#x6210;&amp;#x957F;&amp;#x3001;&amp;#x5B66;&amp;#x4E60;&amp;#x3001;&amp;#x56E2;&amp;#x961F;&amp;#x3001;&amp;#x5934;&amp;#x8854;
2017&amp;#x5E74;8&amp;#x6708;17&amp;#x65E5;&amp;#xFF0C;&amp;#x7ACB;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 每个人都在跟自己赛跑——我的鹅厂两年记 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                每个人都在跟自己赛跑——我的鹅厂两年记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2017-08-17T00:00:00+08:00" content="2017-08-17">
              2017-08-17
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经历/" itemprop="url" rel="index">
                    <span itemprop="name">经历</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5173;&#x952E;&#x8BCD;&#xFF1A;<strong>&#x65B0;&#x9C9C;&#x611F;&#x3001;&#x6210;&#x957F;&#x3001;&#x5B66;&#x4E60;&#x3001;&#x56E2;&#x961F;&#x3001;&#x5934;&#x8854;</strong></p>
<p>2017&#x5E74;8&#x6708;17&#x65E5;&#xFF0C;&#x7ACB;&#x79CB;&#x5DF2;&#x8FC7;&#x5341;&#x5929;&#xFF0C;&#x8FD9;&#x5929;&#x662F;&#x6211;&#x6765;&#x5230;&#x817E;&#x8BAF;&#x4E24;&#x5468;&#x5E74;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x53C8;&#x4E00;&#x5E74;&#x8FC7;&#x53BB;&#xFF0C;&#x56DB;&#x5B63;&#x8F6E;&#x56DE;&#x5982;&#x5E38;&#xFF0C;&#x6211;&#x5728;&#x817E;&#x8BAF;&#x7684;&#x751F;&#x6D3B;&#x4E5F;&#x5C06;&#x8FDB;&#x5165;&#x65B0;&#x7684;&#x5468;&#x671F;&#xFF0C;&#x603B;&#x5F97;&#x7559;&#x4E0B;&#x4E9B;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x4E00;&#x5468;&#x5E74;&#x65F6;&#xFF0C;&#x6211;&#x5199;&#x8FC7;&#x5468;&#x5E74;&#x8BB0;&#xFF0C;&#x633A;&#x5927;&#x7684;&#x7BC7;&#x5E45;&#xFF0C;&#x5F53;&#x65F6;&#x5C31;&#x62C5;&#x5FC3;&#x4EE5;&#x540E;&#x4F1A;&#x4E0D;&#x4F1A;&#x6CA1;&#x5F97;&#x5199;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x6765;&#x662F;&#x591A;&#x8651;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x8FD8;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD8;&#x7ECF;&#x5386;&#x7740;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x6536;&#x83B7;&#x548C;&#x611F;&#x609F;&#x3002;</p>
<p>&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x8DDF;&#x6211;&#x8BF4;&#x8FC7;&#xFF1A;</p>
<blockquote>
<p>&#x201C;&#x6211;&#x4E4B;&#x524D;&#x6362;&#x5DE5;&#x4F5C;&#x6BD4;&#x8F83;&#x9891;&#x7E41;&#xFF0C;&#x4F46;&#x90FD;&#x662F;&#x8FEB;&#x4E0D;&#x5F97;&#x5DF2;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x8FDB;&#x817E;&#x8BAF;&#xFF0C;&#x8FD8;&#x6362;&#x4EC0;&#x4E48;&#x5DE5;&#x4F5C;&#xFF1F;&#x201D;<br>&#x201C;BAT&#x662F;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x7406;&#x60F3;&#x6BBF;&#x5802;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x8FDB;&#x90FD;&#x8FDB;&#x4E0D;&#x53BB;&#xFF0C;&#x8FD8;&#x6709;&#x4EBA;&#x60F3;&#x51FA;&#x6765;&#xFF1F;&#x51FA;&#x6765;&#x53EA;&#x4F1A;&#x540E;&#x6094;&#x3002;&#x201D;</p>
</blockquote>
<p>&#x4E5F;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x60F3;&#x6258;&#x6211;&#x63A8;&#x8350;&#x8FDB;&#x5165;&#x817E;&#x8BAF;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5750;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x68A6;&#x5BD0;&#x4EE5;&#x6C42;&#x7684;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x505A;&#x7740;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x60F3;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C31;&#x771F;&#x7684;&#x4E00;&#x5207;&#x90FD;&#x5F88;&#x597D;&#x5417;&#xFF1F;</p>
<h2 id="&#x65B0;&#x9C9C;&#x611F;"><a href="#&#x65B0;&#x9C9C;&#x611F;" class="headerlink" title="&#x65B0;&#x9C9C;&#x611F;"></a>&#x65B0;&#x9C9C;&#x611F;</h2><p><strong>&#x5929;&#x5802;&#x4E5F;&#x4F1A;&#x538C;&#x5026;&#x3002;</strong></p>
<p>&#x6211;&#x7684;&#x817E;&#x8BAF;&#x751F;&#x6DAF;&#x662F;&#x4ECE;&#x5916;&#x5305;&#x5C97;&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x4E09;&#x5E74;&#x524D;&#xFF0C;&#x6211;&#x62B1;&#x7740;&#x201C;&#x4E0D;&#x7BA1;&#x600E;&#x6837;&#xFF0C;&#x80FD;&#x6765;&#x5C31;&#x597D;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6597;&#x80C6;&#x5C1D;&#x8BD5;&#x5E94;&#x8058;&#x5916;&#x5305;&#x804C;&#x4F4D;&#xFF0C;&#x636E;&#x8BF4;&#x5916;&#x5305;&#x7684;&#x8981;&#x6C42;&#x7A0D;&#x4F4E;&#x4E9B;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x6B63;&#x5F0F;&#x7F16;&#x5236;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x5F71;&#x54CD;&#x5B83;&#x5728;&#x6211;&#x5FC3;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6CA1;&#x60F3;&#x8FC7;&#x4F1A;&#x4E0D;&#x4F1A;&#x88AB;&#x533A;&#x522B;&#x5BF9;&#x5F85;&#xFF0C;&#x4E5F;&#x6CA1;&#x60F3;&#x8FC7;&#x4E4B;&#x540E;&#x7684;&#x8DEF;&#x600E;&#x4E48;&#x8D70;&#xFF0C;&#x53EA;&#x6709;&#x671F;&#x5F85;&#xFF0C;&#x5BF9;&#x65B0;&#x5DE5;&#x4F5C;&#x7684;&#x671F;&#x5F85;&#xFF0C;&#x5BF9;&#x66F4;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#x7684;&#x671F;&#x5F85;&#xFF0C;&#x300A;&#x6ED5;&#x738B;&#x9601;&#x5E8F;&#x300B;&#x6709;&#x4E91;&#xFF1A;&#x201C;&#x7269;&#x534E;&#x5929;&#x5B9D;&#xFF0C;&#x4EBA;&#x6770;&#x5730;&#x7075;&#x201D;&#xFF0C;&#x603B;&#x80FD;&#x6CBE;&#x70B9;&#x4ED9;&#x6C14;&#xFF1F;</p>
<p>&#x9762;&#x8BD5;&#x5728;&#x6717;&#x79D1;&#x5927;&#x53A6;&#xFF0C;&#x90A3;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x8D70;&#x8FDB;&#x817E;&#x8BAF;&#x7684;&#x529E;&#x516C;&#x697C;&#xFF0C;&#x50CF;&#x6240;&#x6709;&#x7B2C;&#x4E00;&#x6B21;&#x6765;&#x7684;&#x4EBA;&#x4E00;&#x6837;&#xFF0C;&#x62FF;&#x7740;&#x624B;&#x673A;&#x4E00;&#x987F;&#x72C2;&#x62CD;&#xFF0C;&#x7136;&#x540E;&#x8FEB;&#x4E0D;&#x53CA;&#x5F85;&#x5730;&#x8DDF;&#x5BB6;&#x4EBA;&#x5206;&#x4EAB;&#xFF1A;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x817E;&#x8BAF;&#xFF0C;&#x6211;&#x6765;&#x4E86;&#xFF01;</p>
<p>&#x9762;&#x8BD5;&#x5B98;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5E74;&#x8F7B;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5E94;&#x8BE5;&#x662F;&#x4E2A;&#x5C0F;&#x5175;&#x6216;&#x52A9;&#x624B;&#xFF0C;&#x5FC3;&#x6001;&#x5F88;&#x653E;&#x677E;&#xFF0C;&#x540E;&#x6765;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x90A3;&#x662F;&#x4E00;&#x4F4D;&#x4ECE;&#x4E1A;&#x591A;&#x5E74;&#x7684;&#x524D;&#x8F88;&#xFF0C;&#x4E5F;&#x662F;&#x90A3;&#x91CC;&#x7684;&#x7EC4;&#x957F;&#xFF0C;&#x60F3;&#x60F3;&#x4E00;&#x9635;&#x540E;&#x6015;&#xFF0C;&#x4F46;&#x4E5F;&#x8BF4;&#x660E;&#x4E00;&#x4E2A;&#x73B0;&#x8C61;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x5E73;&#x5747;&#x5E74;&#x9F84;&#x4E0D;&#x5927;&#x3002;</p>
<p><strong>&#x5DE5;&#x5361;</strong></p>
<p>&#x6BCF;&#x4E2A;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x5458;&#x5DE5;&#xFF0C;&#x7B2C;&#x4E00;&#x4EF6;&#x6BD4;&#x8F83;&#x5174;&#x594B;&#x7684;&#x4E8B;&#xFF0C;&#x662F;&#x62FF;&#x5230;&#x4E00;&#x5F20;&#x5C5E;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x5361;&#xFF0C;&#x5DE5;&#x5361;&#x662F;&#x8EAB;&#x4EFD;&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x6709;&#x4E86;&#x5B83;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x8FDB;&#x51FA;&#xFF0C;&#x4EAB;&#x6709;&#x516C;&#x53F8;&#x5458;&#x5DE5;&#x624D;&#x6709;&#x7684;&#x6743;&#x5229;&#xFF0C;&#x6BCF;&#x4F4D;&#x5458;&#x5DE5;&#x90FD;&#x66FE;&#x56E0;&#x5B83;&#x800C;&#x81EA;&#x8C6A;&#xFF0C;&#x6068;&#x4E0D;&#x5F97;&#x5230;&#x54EA;&#x513F;&#x90FD;&#x6234;&#x7740;&#xFF0C;&#x4F46;&#x4E45;&#x800C;&#x4E45;&#x4E4B;&#xFF0C;&#x5B83;&#x5C31;&#x6E10;&#x6E10;&#x5931;&#x53BB;&#x4E86;&#x5149;&#x73AF;&#xFF0C;&#x53EA;&#x5269;&#x4E0B;&#x6BCF;&#x5929;&#x8FDB;&#x51FA;&#x5927;&#x697C;&#x548C;&#x5403;&#x996D;&#x5237;&#x5361;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E0D;&#x4F1A;&#x518D;&#x62FF;&#x7740;&#x5B83;&#x770B;&#xFF0C;&#x5361;&#x5E26;&#x4E5F;&#x810F;&#x516E;&#x516E;&#x7684;&#xFF0C;&#x54E6;&#xFF0C;&#x5BF9;&#xFF0C;&#x5982;&#x679C;&#x5F04;&#x4E22;&#x4E86;&#x5C31;&#x8981;&#x8D54;&#x507F;&#x51E0;&#x767E;&#x5757;&#xFF0C;&#x8FD9;&#x662F;&#x5B83;&#x4EC5;&#x5269;&#x7684;&#x8C03;&#x4F83;&#x4EF7;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x9664;&#x4E86;&#x5FC5;&#x987B;&#x8981;&#x7528;&#xFF0C;&#x6211;&#x73B0;&#x5728;&#x90FD;&#x4E0D;&#x518D;&#x628A;&#x5B83;&#x6302;&#x5728;&#x8116;&#x5B50;&#x4E0A;&#x3002;</p>
<p><strong>&#x98DF;&#x5802;</strong></p>
<p>&#x5403;&#x996D;&#x662F;&#x4EBA;&#x751F;&#x8981;&#x4E8B;&#x4E4B;&#x4E00;&#xFF0C;&#x5728;&#x817E;&#x8BAF;&#x53EF;&#x4E0D;&#x7F3A;&#x5403;&#x7684;&#xFF0C;&#x9664;&#x4E86;&#x603B;&#x90E8;&#x817E;&#x8BAF;&#x5927;&#x53A6;&#xFF0C;&#x8FD8;&#x6709;&#x51E0;&#x5904;&#x522B;&#x7684;&#x697C;&#x5C42;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x677E;&#x65E5;&#x3001;&#x4E07;&#x5229;&#x8FBE;&#x3001;&#x5927;&#x65CF;&#x3001;&#x79D1;&#x5174;&#x7B49;&#x7B49;&#xFF0C;&#x6BCF;&#x680B;&#x697C;&#x90FD;&#x6709;&#x98DF;&#x5802;&#xFF0C;&#x6BCF;&#x4E2A;&#x98DF;&#x5802;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x98DF;&#x7269;&#x53EF;&#x9009;&#xFF0C;&#x666E;&#x901A;&#x5FEB;&#x9910;&#x3001;&#x7C89;&#x9762;&#x6863;&#x3001;&#x70E7;&#x814A;&#x6863;&#x3001;&#x8425;&#x517B;&#x9910;&#x3001;&#x9EBB;&#x8FA3;&#x70EB;&#x3001;&#x97E9;&#x56FD;&#x9910;&#x7B49;&#x7B49;&#xFF0C;&#x6211;&#x57FA;&#x672C;&#x90FD;&#x5403;&#x8FC7;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6BCF;&#x5230;&#x996D;&#x70B9;&#xFF0C;&#x5E38;&#x5728;&#x7535;&#x68AF;&#x91CC;&#x542C;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8BDD;&#x2014;&#x2014;</p>
<blockquote>
<p>&#x201C;&#x4ECA;&#x5929;&#x5403;&#x4EC0;&#x4E48;&#xFF1F;&#x201D;<br>&#x201C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x60F3;&#x5403;&#xFF0C;&#x54CE;&#xFF0C;&#x6BCF;&#x5929;&#x5403;&#x996D;&#x5DF2;&#x7ECF;&#x6210;&#x4E86;&#x4F8B;&#x884C;&#x516C;&#x4E8B;&#xFF0C;&#x771F;&#x4E0D;&#x77E5;&#x9053;&#x5403;&#x4EC0;&#x4E48;&#x201D;&#x3002;<br>&#x5F88;&#x591A;&#x4EBA;&#x8BF4;&#x98DE;&#x4E9A;&#x8FBE;&#x98DF;&#x5802;&#x4E0D;&#x597D;&#x5403;&#xFF0C;&#x5927;&#x65CF;&#x98DF;&#x5802;&#x4E0D;&#x597D;&#x5403;&#xFF0C;&#x6211;&#x90FD;&#x65E0;&#x611F;&#xFF0C;&#x6211;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x6211;&#x5403;&#x4E86;&#x4E24;&#x5E74;&#x7684;&#x817E;&#x5927;&#x4E09;&#x5C42;&#x98DF;&#x5802;&#x6709;&#x591A;&#x817B;&#x4E48;&#xFF1F;&#x6CA1;&#x6709;&#x80C3;&#x53E3;&#x5230;&#x54EA;&#x91CC;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x4E0D;&#x662F;&#x5B83;&#x7684;&#x5DEE;&#x4E0E;&#x597D;&#xFF0C;&#x662F;&#x65E9;&#x5DF2;&#x5931;&#x53BB;&#x65B0;&#x9C9C;&#x611F;&#x3002;</p>
</blockquote>
<p><strong>&#x529E;&#x516C;&#x697C;</strong></p>
<p>&#x521A;&#x6765;&#x516C;&#x53F8;&#x505A;&#x5916;&#x5305;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5728;&#x5927;&#x65CF;&#x5F85;&#x8FC7;&#xFF0C;&#x540E;&#x6765;&#x642C;&#x5230;&#x98DE;&#x4E9A;&#x8FBE;&#xFF0C;&#x4E0D;&#x8BBA;&#x5728;&#x54EA;&#xFF0C;&#x90FD;&#x5F88;&#x7FA1;&#x6155;&#x5728;&#x817E;&#x8BAF;&#x5927;&#x53A6;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#xFF0C;&#x90A3;&#x53EF;&#x662F;&#x603B;&#x90E8;&#xFF0C;&#x6BCF;&#x6B21;&#x6709;&#x673A;&#x4F1A;&#x53BB;&#x53C2;&#x52A0;&#x6D3B;&#x52A8;&#x6216;&#x8005;&#x5F00;&#x4F1A;&#xFF0C;&#x90FD;&#x5F88;&#x5174;&#x594B;&#xFF0C;&#x540E;&#x6765;&#xFF0C;&#x6211;&#x901A;&#x8FC7;&#x9762;&#x8BD5;&#x8F6C;&#x4E3A;&#x6B63;&#x5F0F;&#x5DE5;&#xFF0C;&#x6362;&#x4E86;&#x90E8;&#x95E8;&#xFF0C;&#x642C;&#x5230;&#x4E86;&#x817E;&#x5927;&#x4E0A;&#x73ED;&#xFF0C;&#x6BCF;&#x5929;&#x8FDB;&#x8FDB;&#x51FA;&#x51FA;&#xFF0C;&#x51E0;&#x767E;&#x4E2A;&#x65E5;&#x591C;&#xFF0C;&#x52A8;&#x4F5C;&#x65E9;&#x5C31;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x4E5F;&#x4E0D;&#x518D;&#x6709;&#x5FC3;&#x8DF3;&#x52A0;&#x901F;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x6709;&#x65F6;&#x4E0B;&#x8F66;&#x8D70;&#x795E;&#x4E86;&#xFF0C;&#x56DE;&#x8FC7;&#x795E;&#x5DF2;&#x7ECF;&#x5230;&#x697C;&#x4E0B;&#xFF0C;&#x4E0A;&#x73ED;&#x7684;&#x8DEF;&#x90FD;&#x8D70;&#x51FA;&#x4E86;&#x60EF;&#x6027;&#xFF0C;&#x5C31;&#x50CF;&#x66FE;&#x7ECF;&#x95ED;&#x7740;&#x773C;&#x90FD;&#x80FD;&#x8D70;&#x7684;&#x4E0A;&#x5B66;&#x7684;&#x8DEF;&#x3002;</p>
<p>&#x6211;&#x65F6;&#x5E38;&#x5728;&#x4E0A;&#x4E0B;&#x73ED;&#x7684;&#x65F6;&#x5019;&#x62AC;&#x5934;&#x770B;&#x817E;&#x5927;&#xFF0C;&#x5C1D;&#x8BD5;&#x7740;&#x5237;&#x65B0;&#x5BF9;&#x8FD9;&#x91CC;&#x7684;&#x8BB0;&#x5FC6;&#xFF0C;&#x5B83;&#x4F9D;&#x7136;&#x7B14;&#x76F4;&#x8038;&#x7ACB;&#xFF0C;&#x9AD8;&#x5927;&#x5E05;&#x6C14;&#xFF0C;&#x5374;&#x4E0D;&#x518D;&#x6709;&#x5F53;&#x521D;&#x90A3;&#x79CD;&#x795E;&#x79D8;&#x7684;&#x9B45;&#x529B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E60;&#x60EF;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x5B83;&#x80FD;&#x6210;&#x5C31;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x80FD;&#x628A;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x6467;&#x6BC1;&#x3002;</p>
<h2 id="&#x5B66;&#x4E60;"><a href="#&#x5B66;&#x4E60;" class="headerlink" title="&#x5B66;&#x4E60;"></a>&#x5B66;&#x4E60;</h2><p><strong>&#x9006;&#x6C34;&#x884C;&#x821F;&#xFF0C;&#x4E0D;&#x8FDB;&#x5219;&#x9000;&#x3002;</strong></p>
<p>&#x5B66;&#x4E60;&#x4F7F;&#x4EBA;&#x589E;&#x957F;&#x89C1;&#x8BC6;&#xFF0C;&#x589E;&#x6DFB;&#x6280;&#x80FD;&#xFF0C;&#x8FD9;&#x8DDF;&#x505A;&#x4EC0;&#x4E48;&#x65E0;&#x5173;&#xFF0C;&#x4E8B;&#x7269;&#x7684;&#x4E30;&#x5BCC;&#x662F;&#x5BA2;&#x89C2;&#x7684;&#xFF0C;&#x4EBA;&#x4EEC;&#x7684;&#x72ED;&#x9698;&#x662F;&#x4E3B;&#x89C2;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x51B3;&#x5B9A;&#x4E86;&#x8981;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x90FD;&#x5728;&#x5B66;&#x4E60;&#xFF0C;&#x4F46;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6CA1;&#x6709;&#x4E86;&#x8003;&#x8BD5;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x5DE5;&#x4F5C;&#x9010;&#x6E10;&#x7A33;&#x5B9A;&#xFF0C;&#x4E8B;&#x52A1;&#x65E5;&#x8D8B;&#x5A34;&#x719F;&#xFF0C;&#x5C31;&#x4F1A;&#x66B4;&#x9732;&#x51FA;&#x95EE;&#x9898;&#xFF1A;</p>
<p><strong>1&#x3001;&#x6211;&#x4EEC;&#x7684;&#x77E5;&#x8BC6;&#x80FD;&#x5426;&#x7ECF;&#x5F97;&#x4F4F;&#x65F6;&#x95F4;&#x8003;&#x9A8C;&#xFF1F;</strong></p>
<p>&#x6BCF;&#x79CD;&#x6280;&#x80FD;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x5B66;&#x4E60;&#x66F2;&#x7EBF;&#x201D;&#x548C;&#x201C;&#x4FDD;&#x9C9C;&#x671F;&#x201D;&#xFF0C;&#x4ECE;&#x57FA;&#x7840;&#x5230;&#x719F;&#x7EC3;&#xFF0C;&#x518D;&#x5230;&#x7CBE;&#x901A;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x4ECE;&#x6613;&#x5230;&#x96BE;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5B66;&#x4F1A;&#x5BB9;&#x6613;&#xFF0C;&#x4FDD;&#x6301;&#x5F88;&#x96BE;&#xFF0C;&#x5B66;&#x4F1A;&#x4E86;&#x5C31;&#x80FD;&#x505A;&#x4E8B;&#xFF0C;&#x80FD;&#x505A;&#x4E8B;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#xFF0C;&#x5C31;&#x80FD;&#x80DC;&#x4EFB;&#x804C;&#x4F4D;&#x9886;&#x5230;&#x85AA;&#x6C34;&#xFF0C;&#x770B;&#x4F3C;&#x5408;&#x60C5;&#x5408;&#x7406;&#xFF0C;&#x4F46;&#x53E4;&#x8BAD;&#x8BF4;&#x7684;&#x597D;&#xFF0C;&#x5B66;&#x800C;&#x65F6;&#x4E60;&#x4E4B;&#xFF0C;&#x6E29;&#x6545;&#x800C;&#x77E5;&#x65B0;&#xFF0C;&#x518D;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B66;&#x4F1A;&#x4E4B;&#x540E;&#x5C31;&#x4E0D;&#x53BB;&#x7BA1;&#xFF0C;&#x65F6;&#x95F4;&#x4E45;&#x4E86;&#x90FD;&#x4F1A;&#x6A21;&#x7CCA;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x81EA;&#x5DF1;&#x66FE;&#x7ECF;&#x5199;&#x8FC7;&#x7684;&#x6280;&#x672F;&#x6587;&#xFF0C;&#x6709;&#x4E9B;&#x53C8;&#x5FD8;&#x4E86;&#x600E;&#x4E48;&#x7528;&#xFF0C;&#x77E5;&#x8BC6;&#x5C31;&#x662F;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5730;&#x5480;&#x56BC;&#x548C;&#x56DE;&#x5473;&#xFF0C;&#x624D;&#x80FD;&#x4FDD;&#x6301;&#x719F;&#x6089;&#x5EA6;&#xFF0C;&#x8FDB;&#x800C;&#x719F;&#x80FD;&#x751F;&#x5DE7;&#x3002;</p>
<p><strong>2&#x3001;&#x6D45;&#x5C1D;&#x8F84;&#x6B62; OR &#x6DF1;&#x5165;&#x94BB;&#x7814;&#xFF1F;</strong></p>
<p>&#x6D77;&#x91CF;&#x3001;&#x91CD;&#x590D;&#x3001;&#x96F6;&#x6563;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x73B0;&#x5728;&#x7684;&#x4FE1;&#x606F;&#x5448;&#x73B0;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x7684;&#xFF0C;&#x662F;&#x201C;&#x788E;&#x7247;&#x5316;&#x201D;&#x3001;&#x201C;&#x95EE;&#x9898;&#x5F0F;&#x201D;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#xFF0C;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#xFF0C;&#x53E3;&#x5934;&#x63A2;&#x8BA8;&#xFF0C;&#x518D;&#x8005;&#xFF0C;&#x4EBA;&#x4EEC;&#x5E38;&#x5E38;&#x7740;&#x529B;&#x4E8E;&#x4E00;&#x4E2A;&#x77E5;&#x8BC6;&#x70B9;&#x6216;&#x67D0;&#x4E2A;&#x5E94;&#x7528;&#x573A;&#x666F;&#x7684;&#x4EA4;&#x6D41;&#x548C;&#x8BB0;&#x5F55;&#xFF0C;&#x800C;&#x7F3A;&#x5C11;&#x4E3B;&#x52A8;&#x7684;&#x6DF1;&#x6316;&#x548C;&#x62D3;&#x5C55;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x6210;&#x4E3A;&#x4E95;&#x5E95;&#x4E4B;&#x86D9;&#xFF0C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x8BEF;&#x5BFC;&#xFF0C;&#x4F1A;&#x5927;&#x5927;&#x9650;&#x5236;&#x6280;&#x672F;&#x7684;&#x65BD;&#x5C55;&#x7A7A;&#x95F4;&#xFF0C;&#x66F4;&#x4E0D;&#x80FD;&#x8BF4;&#x5BF9;&#x5176;&#x6709;&#x4E86;&#x771F;&#x6B63;&#x7684;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#xFF0C;&#x4E0D;&#x5C11;&#x4EBA;&#x5E38;&#x4F1A;&#x62B1;&#x6028;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x5176;&#x5B9E;&#x66F4;&#x591A;&#x7684;&#x662F;&#x4E2A;&#x4EBA;&#x667A;&#x6167;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x90A3;&#x4E9B;&#x70ED;&#x8877;&#x4E8E;&#x6DF1;&#x5165;&#x94BB;&#x7814;&#x7684;&#x4EBA;&#xFF0C;&#x5E38;&#x4F1A;&#x505A;&#x51FA;&#x8BA9;&#x4EBA;&#x5567;&#x5567;&#x79F0;&#x8D5E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7814;&#x7A76;&#x6210;&#x679C;&#x4E5F;&#x4F1A;&#x88AB;&#x5217;&#x4E3A;&#x884C;&#x4E1A;&#x5178;&#x8303;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x4E86;&#x95EE;&#x9898;&#x5C31;&#x9A6C;&#x4E0A;&#x53BB;&#x7814;&#x7A76;&#x5B83;&#x7684;&#x5168;&#x90E8;&#xFF0C;&#x90A3;&#x5C31;&#x8D70;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x6781;&#x7AEF;&#xFF0C;&#x63A2;&#x7A76;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#xFF0C;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x62FF;&#x634F;&#xFF0C;&#x4F46;&#x63A2;&#x7A76;&#x672C;&#x8EAB;&#x7EDD;&#x5BF9;&#x4E50;&#x8DA3;&#x65E0;&#x7A77;&#xFF0C;&#x4EF7;&#x503C;&#x8FDE;&#x57CE;&#x3002;</p>
<p><strong>3&#x3001;&#x5B66;&#x4E60;&#x5373;&#x662F;&#x7ADE;&#x4E89;&#x529B;&#xFF0C;&#x52AA;&#x529B;&#x5373;&#x662F;&#x5E78;&#x798F;&#x611F;&#x3002;</strong></p>
<p>&#x8FD8;&#x5728;&#x8BFB;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5C31;&#x8DDF;&#x6211;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x9009;&#x62E9;&#x505A;&#x6280;&#x672F;&#xFF0C;&#x5C31;&#x4F1A;&#x9762;&#x5BF9;&#x77E5;&#x8BC6;&#x7684;&#x5FEB;&#x901F;&#x66F4;&#x65B0;&#x6362;&#x4EE3;&#xFF0C;&#x8981;&#x4E0D;&#x65AD;&#x8DDF;&#x8FDB;&#xFF0C;&#x6211;&#x4E0D;&#x4FE1;&#xFF0C;&#x4F46;&#x73B0;&#x5B9E;&#x4E0D;&#x5BB9;&#x6211;&#x4E0D;&#x4FE1;&#xFF0C;&#x56E0;&#x4E3A;&#x6280;&#x672F;&#x7684;&#x786E;&#x662F;&#x5728;&#x4E0D;&#x505C;&#x5730;&#x53D1;&#x5C55;&#xFF0C;&#x4E00;&#x5E74;&#x4E00;&#x5C0F;&#x53D8;&#xFF0C;&#x4E09;&#x5E74;&#x4E00;&#x5927;&#x53D8;&#xFF0C;&#x6709;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x7684;&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#xFF0C;&#x4E5F;&#x6709;&#x4E00;&#x6279;&#x5BCC;&#x6709;&#x5DE5;&#x5320;&#x7CBE;&#x795E;&#x7684;&#x4EBA;&#x53BB;&#x5F00;&#x8F9F;&#x548C;&#x4E0D;&#x65AD;&#x6253;&#x78E8;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6280;&#x672F;&#x603B;&#x662F;&#x5728;&#x6F14;&#x8FDB;&#xFF0C;&#x5404;&#x79CD;&#x63D0;&#x5347;&#x6548;&#x7387;&#x7684;&#x5DE5;&#x5177;&#x4E5F;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#xFF0C;&#x5C31;&#x50CF;&#x6709;&#x4EBA;&#x53D1;&#x660E;&#x706B;&#x8F66;&#x3001;&#x98DE;&#x673A;&#x4E00;&#x6837;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x4E0D;&#x88AB;&#x540C;&#x884C;&#x7529;&#x5728;&#x8EAB;&#x540E;&#xFF0C;&#x5C31;&#x8981;&#x575A;&#x6301;&#x5B66;&#x4E60;&#xFF0C;&#x8FD9;&#x4E0D;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x5347;&#x5DE5;&#x4F5C;&#x6280;&#x80FD;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x771F;&#x7684;&#x70ED;&#x7231;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x5DE5;&#x4F5C;&#x7684;&#x6210;&#x5C31;&#x611F;&#x5C31;&#x80FD;&#x8F6C;&#x5316;&#x4E3A;&#x751F;&#x6D3B;&#x7684;&#x5E78;&#x798F;&#x611F;&#xFF0C;&#x8D8A;&#x5B66;&#x4E60;&#x8D8A;&#x5F3A;&#x5927;&#xFF0C;&#x8D8A;&#x52AA;&#x529B;&#x8D8A;&#x5E78;&#x798F;&#x3002;</p>
<h2 id="&#x6210;&#x957F;"><a href="#&#x6210;&#x957F;" class="headerlink" title="&#x6210;&#x957F;"></a>&#x6210;&#x957F;</h2><p><strong>&#x5BF9;&#x81EA;&#x5DF1;&#x72E0;&#x4E00;&#x70B9;&#xFF0C;&#x4E0D;&#x778E;&#x5FD9;&#xFF0C;&#x4E0D;&#x865A;&#x5EA6;&#x3002;</strong></p>
<p>&#x6211;&#x4EEC;&#x603B;&#x559C;&#x6B22;&#x5236;&#x5B9A;&#x8BA1;&#x5212;&#xFF0C;&#x5374;&#x4E0D;&#x64C5;&#x957F;&#x5B8C;&#x6210;&#x8BA1;&#x5212;&#xFF0C;&#x627E;&#x4E86;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#x548C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x6700;&#x540E;&#x5374;&#x53D1;&#x73B0;&#x6700;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x7684;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x3002;&#x6267;&#x884C;&#x529B;&#x4E0D;&#x591F;&#xFF0C;&#x610F;&#x5FD7;&#x529B;&#x4E0D;&#x591F;&#xFF0C;&#x518D;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x4E5F;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x6709;&#x5F88;&#x591A;&#x6B21;&#xFF0C;&#x6211;&#x722C;&#x4E0A;&#x5E8A;&#x60F3;&#x7761;&#x89C9;&#xFF0C;&#x4F46;&#x4E00;&#x8EBA;&#x4E0B;&#x5C31;&#x4E0D;&#x81EA;&#x89C9;&#x5730;&#x60F3;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x60F3;&#x90A3;&#x4E9B;&#x60AC;&#x800C;&#x672A;&#x51B3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E24;&#x5E74;&#x524D;&#x8BA2;&#x8FC7;&#x7684;&#x76EE;&#x6807;&#x5230;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x8FDB;&#x5C55;&#xFF0C;&#x8FD9;&#x4E24;&#x5E74;&#x90FD;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;&#x4E5F;&#x6CA1;&#x95F2;&#x7740;&#xFF0C;&#x4F46;&#x603B;&#x6709;&#x51E0;&#x4EF6;&#x91CD;&#x8981;&#x5374;&#x4E0D;&#x7D27;&#x6025;&#x7684;&#x4E8B;&#x4E00;&#x76F4;&#x88AB;&#x6401;&#x6D45;&#xFF0C;&#x5B9A;&#x8BA1;&#x5212;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x89C9;&#x5F97;&#x65F6;&#x95F4;&#x975E;&#x5E38;&#x5145;&#x8DB3;&#xFF0C;&#x5E72;&#x52B2;&#x5341;&#x8DB3;&#xFF0C;&#x6267;&#x884C;&#x65F6;&#x5374;&#x75B2;&#x8F6F;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#x6211;&#x60F3;&#x660E;&#x767D;&#x4E00;&#x4E2A;&#x9053;&#x7406;&#xFF1A;</p>
<blockquote>
<p>&#x76F2;&#x76EE;&#x5730;&#x5236;&#x5B9A;&#x597D;&#x770B;&#x5374;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x7684;&#x76EE;&#x6807;&#x662F;&#x611A;&#x8822;&#x7684;&#xFF0C;&#x5206;&#x6E05;&#x4E8B;&#x60C5;&#x7684;&#x4E3B;&#x6B21;&#x8F7B;&#x91CD;&#xFF0C;&#x628A;&#x751F;&#x6D3B;&#x8FC7;&#x5F97;&#x7D27;&#x51D1;&#x800C;&#x53C8;&#x4ECE;&#x5BB9;&#xFF0C;&#x624D;&#x662F;&#x806A;&#x660E;&#x7684;&#x3002;</p>
</blockquote>
<p>&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x9053;&#x7406;&#xFF0C;&#x8FF7;&#x832B;&#x8FC7;&#x624D;&#x66F4;&#x61C2;&#x5B83;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#x5145;&#x65A5;&#x7740;&#x5404;&#x79CD;&#x8BF1;&#x60D1;&#x548C;&#x7410;&#x4E8B;&#xFF0C;&#x6709;&#x4E9B;&#x53EF;&#x505A;&#x53EF;&#x4E0D;&#x505A;&#xFF0C;&#x6709;&#x4E9B;&#x9700;&#x8981;&#x4F18;&#x5148;&#x505A;&#xFF0C;&#x6709;&#x4E9B;&#x53EF;&#x4EE5;&#x5EF6;&#x540E;&#x505A;&#xFF0C;&#x4F46;&#x4EBA;&#x7684;&#x672C;&#x6027;&#x662F;&#x503E;&#x5411;&#x4E8E;&#x66F4;&#x8F7B;&#x677E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x88AB;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x6240;&#x5360;&#x636E;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x53CD;&#x800C;&#x6CA1;&#x65F6;&#x95F4;&#x505A;&#xFF0C;&#x8FD9;&#x662F;&#x591A;&#x6570;&#x70E6;&#x607C;&#x7684;&#x6839;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5F3A;&#x8FEB;&#x81EA;&#x5DF1;&#x53BB;&#x5B8C;&#x6210;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#xFF0C;&#x624D;&#x80FD;&#x6709;&#x6240;&#x6210;&#x957F;&#xFF0C;&#x4E5F;&#x624D;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x66F4;&#x5FEB;&#x4E50;&#x3002;</p>
<p><strong>&#x591A;&#x9879;&#x9009;&#x62E9;&#xFF0C;&#x5E73;&#x8861;&#x4E14;&#x4E0D;&#x5355;&#x4E00;&#x3002;</strong></p>
<p>&#x6211;&#x8EAB;&#x8FB9;&#x6709;&#x8FD9;&#x4E48;&#x4E24;&#x7C7B;&#x4EBA;&#xFF0C;&#x4E00;&#x7C7B;&#x662F;&#x521A;&#x6BD5;&#x4E1A;&#x7684;&#x804C;&#x573A;&#x65B0;&#x4EBA;&#xFF0C;&#x5145;&#x6EE1;&#x6FC0;&#x60C5;&#x548C;&#x51B2;&#x52B2;&#xFF0C;&#x4F4F;&#x5F97;&#x79BB;&#x516C;&#x53F8;&#x5F88;&#x8FD1;&#xFF0C;&#x6BCF;&#x5929;&#x65E9;&#x5230;&#x665A;&#x8D70;&#xFF0C;&#x60F3;&#x7528;&#x6700;&#x597D;&#x7684;&#x8868;&#x73B0;&#x83B7;&#x5F97;&#x5927;&#x5BB6;&#x7684;&#x8BA4;&#x53EF;&#xFF1B;&#x53E6;&#x4E00;&#x7C7B;&#xFF0C;&#x5DF2;&#x7ECF;&#x5DE5;&#x4F5C;&#x4E86;&#x51E0;&#x5E74;&#xFF0C;&#x4F46;&#x8FEB;&#x4E8E;&#x7ECF;&#x6D4E;&#x3001;&#x804C;&#x573A;&#x7ADE;&#x4E89;&#x548C;&#x7EE9;&#x6548;&#x8003;&#x6838;&#x7684;&#x5C42;&#x5C42;&#x538B;&#x529B;&#xFF0C;&#x540C;&#x6837;&#x4E00;&#x95E8;&#x5FC3;&#x601D;&#x6251;&#x5728;&#x5DE5;&#x4F5C;&#x4E0A;&#xFF0C;&#x751A;&#x81F3;&#x5E38;&#x5E38;&#x987E;&#x4E0D;&#x4E0A;&#x5403;&#x996D;&#xFF0C;&#x4E5F;&#x9C9C;&#x6709;&#x4E1A;&#x4F59;&#x65F6;&#x95F4;&#x53BB;&#x505A;&#x70B9;&#x522B;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x6211;&#x8BF4;&#x4ED6;&#x4EEC;&#x662F;&#x4E24;&#x7C7B;&#x4EBA;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x7C7B;&#x4EBA;&#xFF0C;&#x88AB;&#x67D0;&#x79CD;&#x5F3A;&#x70C8;&#x7684;&#x60C5;&#x7EEA;&#x9A71;&#x4F7F;&#xFF0C;&#x628A;&#x51E0;&#x4E4E;&#x5168;&#x90E8;&#x7684;&#x70ED;&#x60C5;&#x90FD;&#x503E;&#x6CE8;&#x5728;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x5145;&#x5B9E;&#xFF0C;&#x6709;&#x6210;&#x7EE9;&#xFF0C;&#x4F46;&#x4E5F;&#x7565;&#x663E;&#x5355;&#x8C03;&#xFF0C;&#x6BCF;&#x6BCF;&#x770B;&#x5230;&#x522B;&#x4EBA;&#x8C08;&#x8BBA;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#xFF0C;&#x90FD;&#x4F1A;&#x95EE;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x90A3;&#x4E48;&#x6709;&#x65F6;&#x95F4;&#xFF1F;&#x5176;&#x5B9E;&#x65F6;&#x95F4;&#x662F;&#x6700;&#x516C;&#x5E73;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x6BCF;&#x5929;&#x90FD;&#x662F;24&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x628A;&#x65F6;&#x95F4;&#x82B1;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x6536;&#x83B7;&#x5C31;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x5B81;&#x613F;&#x4E00;&#x76F4;&#x505A;&#x201C;&#x6B63;&#x4E8B;&#x201D;&#xFF0C;&#x4E5F;&#x4E0D;&#x613F;&#x201C;&#x6D6A;&#x8D39;&#x201D;&#x534A;&#x4E2A;&#x5C0F;&#x65F6;&#x53BB;&#x53D1;&#x5C55;&#x4E1A;&#x4F59;&#x7231;&#x597D;&#xFF0C;&#x5176;&#x5B9E;&#x65F6;&#x95F4;&#x771F;&#x7684;&#x6CA1;&#x90A3;&#x4E48;&#x7D27;&#x5F20;&#xFF0C;&#x7528;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x80FD;&#x53D1;&#x6325;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5206;&#x51FA;&#x6765;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x591A;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#xFF0C;&#x5C31;&#x80FD;&#x6536;&#x83B7;&#x591A;&#x5143;&#x5316;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>
<h2 id="&#x56E2;&#x961F;"><a href="#&#x56E2;&#x961F;" class="headerlink" title="&#x56E2;&#x961F;"></a>&#x56E2;&#x961F;</h2><p><strong>&#x65B9;&#x4FBF;&#x4ED6;&#x4EBA;&#xFF0C;&#x5C31;&#x662F;&#x65B9;&#x4FBF;&#x81EA;&#x5DF1;&#x3002;</strong></p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x754C;&#x6709;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8C03;&#x4F83;&#xFF0C;&#x6700;&#x8BA8;&#x538C;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF1A;&#x81EA;&#x5DF1;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x81EA;&#x5DF1;&#x5199;&#x6CE8;&#x91CA;&#xFF0C;&#x522B;&#x4EBA;&#x4E0D;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x522B;&#x4EBA;&#x4E0D;&#x5199;&#x6CE8;&#x91CA;&#x3002;</p>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x6709;&#x4E9B;&#x4E8B;&#x5BF9;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x597D;&#x5904;&#xFF0C;&#x4F46;&#x8C01;&#x90FD;&#x4E0D;&#x592A;&#x60C5;&#x613F;&#x505A;&#xFF0C;&#x4EFB;&#x52A1;&#x6765;&#x4E86;&#x5377;&#x8D77;&#x8896;&#x5B50;&#x5C31;&#x662F;&#x5E72;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7A0D;&#x52A0;&#x7559;&#x610F;&#x5C31;&#x80FD;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x5177;&#x5907;&#x5171;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x4F9B;&#x81EA;&#x5DF1;&#x6216;&#x4ED6;&#x4EBA;&#x590D;&#x7528;&#xFF0C;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x89C4;&#x5212;&#x548C;&#x8BBE;&#x8BA1;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5751;&#xFF0C;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x4E0A;&#x6E38;&#x6216;&#x8005;&#x4E0B;&#x6E38;&#xFF0C;&#x80FD;&#x4F7F;&#x5408;&#x4F5C;&#x66F4;&#x987A;&#x7545;&#x548C;&#x9AD8;&#x6548;&#xFF0C;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5F80;&#x5F80;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x754C;&#x9650;&#x6A21;&#x7CCA;&#xFF0C;&#x4F1A;&#x88AB;&#x5F53;&#x505A;&#x201C;&#x810F;&#x6D3B;&#x7D2F;&#x6D3B;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x4F1A;&#x5FC3;&#x5B58;&#x4FA5;&#x5E78;&#x5730;&#x53BB;&#x731C;&#x6D4B;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x6CA1;&#x95EE;&#x9898;&#x5427;&#xFF0C;&#x4F46;&#x7ED3;&#x679C;&#x5341;&#x6709;&#x516B;&#x4E5D;&#x90FD;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4E86;&#x4ED6;&#x4EBA;&#xFF0C;&#x4E5F;&#x4E3A;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x4E3B;&#x52A8;&#x591A;&#x505A;&#x4E00;&#x4E9B;&#x4E0D;&#x662F;&#x574F;&#x4E8B;&#x3002;</p>
<p><strong>&#x7EDF;&#x4E00;&#x81F3;&#x4E0A;&#x3002;</strong></p>
<p>&#x201C;&#x7EDF;&#x4E00;&#x201D;&#x662F;&#x56E2;&#x961F;&#x6700;&#x597D;&#x7684;&#x6C9F;&#x901A;&#x65B9;&#x5F0F;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x4EBA;&#x5171;&#x540C;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x5927;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x5DE5;&#x4F5C;&#x90FD;&#x4E0D;&#x518D;&#x72EC;&#x7ACB;&#xFF0C;&#x800C;&#x662F;&#x968F;&#x65F6;&#x4EA7;&#x751F;&#x5173;&#x8054;&#xFF0C;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x56E2;&#x961F;&#x91CC;&#x53C8;&#x90FD;&#x662F;&#x4E00;&#x4E9B;&#x4E2A;&#x6027;&#x9C9C;&#x660E;&#x3001;&#x4E60;&#x60EF;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x7684;&#x65B9;&#x5F0F;&#x6211;&#x4E0D;&#x4E60;&#x60EF;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x6211;&#x7684;&#x5199;&#x6CD5;&#x4F60;&#x4E0D;&#x660E;&#x767D;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x4F60;&#x7684;&#x65B9;&#x6CD5;&#x5F88;&#x597D;&#xFF0C;&#x6211;&#x7684;&#x65B9;&#x6CD5;&#x4E5F;&#x4E0D;&#x9519;&#xFF0C;&#x8981;&#x600E;&#x4E48;&#x529E;&#xFF1F;</p>
<p>&#x7B54;&#x6848;&#x5C31;&#x662F;&#x201C;&#x7EDF;&#x4E00;&#x201D;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x89C4;&#x8303;&#x5B58;&#x5728;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x89C4;&#x8303;&#x4E0D;&#x662F;&#x4E00;&#x8A00;&#x5802;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x4EFB;&#x4F55;&#x4E2A;&#x4EBA;&#x7684;&#x4EA7;&#x7269;&#xFF0C;&#x800C;&#x662F;&#x56E2;&#x961F;&#x6210;&#x5458;&#x5171;&#x540C;&#x8BA8;&#x8BBA;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x662F;&#x4ECE;&#x6280;&#x672F;&#x3001;&#x4E1A;&#x52A1;&#x3001;&#x9879;&#x76EE;&#x3001;&#x5E94;&#x7528;&#x573A;&#x666F;&#x7B49;&#x65B9;&#x9762;&#x7EFC;&#x5408;&#x8003;&#x91CF;&#x540E;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6848;&#xFF0C;&#x5B83;&#x51FA;&#x81EA;&#x6BCF;&#x4E2A;&#x6210;&#x5458;&#xFF0C;&#x4E5F;&#x4F1A;&#x8BA9;&#x6BCF;&#x4E2A;&#x6210;&#x5458;&#x53D7;&#x76CA;&#x3002;</p>
<p><strong>&#x603B;&#x8981;&#x6709;&#x4EBA;&#x4E3B;&#x52A8;&#xFF0C;&#x4E00;&#x4E2A;&#x5C31;&#x591F;&#x4E86;&#x3002;</strong></p>
<p>&#x4E0A;&#x9762;&#x6709;&#x63D0;&#x8FC7;&#x89C4;&#x8303;&#xFF0C;&#x5BF9;&#x56E2;&#x961F;&#x6709;&#x5229;&#x7684;&#x4E8B;&#x60C5;&#x8FDC;&#x4E0D;&#x6B62;&#x89C4;&#x8303;&#xFF0C;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x6846;&#x67B6;&#x3001;&#x5DE5;&#x5177;&#xFF0C;&#x600E;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x600E;&#x6837;&#x80FD;&#x8BA9;&#x5927;&#x5BB6;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x667A;&#x6167;&#x805A;&#x96C6;&#x8D77;&#x6765;&#xFF0C;&#x6210;&#x4E3A;&#x56E2;&#x961F;&#x7684;&#x5B9D;&#x85CF;&#xFF0C;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#xFF0C;&#x6709;&#x4EBA;&#x5206;&#x4EAB;&#xFF0C;&#x6709;&#x4EBA;&#x63A8;&#x5E7F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x5404;&#x81EA;&#x884C;&#x4E8B;&#xFF0C;&#x4E0D;&#x80FD;&#x6307;&#x671B;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4E3B;&#x52A8;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x5C31;&#x591F;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x662F;&#x4F60;&#xFF1F;</p>
<h2 id="&#x6210;&#x672C;"><a href="#&#x6210;&#x672C;" class="headerlink" title="&#x6210;&#x672C;"></a>&#x6210;&#x672C;</h2><p><strong>&#x628A;&#x7CBE;&#x529B;&#x7528;&#x5728;&#x503C;&#x5F97;&#x82B1;&#x8D39;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x591A;&#x4E00;&#x4E9B;&#x4E5F;&#x4E0D;&#x6D6A;&#x8D39;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x518D;&#x5C11;&#x4E5F;&#x662F;&#x5962;&#x4F88;&#x3002;</strong></p>
<p>&#x6211;&#x4EEC;&#x65F6;&#x523B;&#x90FD;&#x5728;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#xFF0C;&#x8D70;&#x54EA;&#x6BB5;&#x8DEF;&#x6700;&#x77ED;&#xFF0C;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#x6700;&#x7701;&#x529B;&#xFF0C;&#x4E70;&#x54EA;&#x5BB6;&#x5E97;&#x7684;&#x4E1C;&#x897F;&#x6700;&#x5212;&#x7B97;&#xFF0C;&#x65F6;&#x95F4;&#x6210;&#x672C;&#x3001;&#x91D1;&#x94B1;&#x6210;&#x672C;&#x3001;&#x4EBA;&#x529B;&#x6210;&#x672C;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4E45;&#x800C;&#x4E45;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x5F62;&#x6210;&#x4E00;&#x79CD;&#x4E60;&#x60EF;&#xFF0C;&#x53EA;&#x8981;&#x662F;&#x5927;&#x6210;&#x672C;&#x7684;&#x90FD;&#x4E0D;&#x505A;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x601D;&#x8003;&#x7684;&#x662F;&#xFF1A;&#x54EA;&#x4E9B;&#x6210;&#x672C;&#x662F;&#x503C;&#x5F97;&#x7684;&#xFF1F;</p>
<blockquote>
<p>&#x5982;&#x679C;&#x6211;&#x4ECA;&#x5929;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x4E9B;&#x9EBB;&#x70E6;&#xFF0C;&#x4F46;&#x6211;&#x989D;&#x5916;&#x82B1;&#x4E86;&#x4E9B;&#x65F6;&#x95F4;&#x505A;&#x4E86;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#xFF0C;&#x4EE5;&#x540E;&#x9047;&#x5230;&#x540C;&#x7C7B;&#x95EE;&#x9898;&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x641E;&#x5B9A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x505A;&#xFF1F;<br>&#x5982;&#x679C;&#x6211;&#x62BD;&#x65F6;&#x95F4;&#x5236;&#x4F5C;&#x4E86;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x7684;&#x5DE5;&#x4F5C;&#x5FEB;&#x597D;&#x51E0;&#x500D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x505A;&#xFF1F;<br>&#x5982;&#x679C;&#x6211;&#x62BD;&#x65F6;&#x95F4;&#x628A;&#x6B63;&#x5728;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x6574;&#x7406;&#x3001;&#x5F52;&#x7C7B;&#x4E00;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x7EF4;&#x62A4;&#x548C;&#x5408;&#x4F5C;&#x6210;&#x672C;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x6211;&#x8FD8;&#x662F;&#x56E2;&#x961F;&#x5176;&#x4ED6;&#x4EBA;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x66F4;&#x6E05;&#x6670;&#x548C;&#x66F4;&#x8F7B;&#x677E;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x505A;&#xFF1F;<br>&#x5982;&#x679C;&#x6211;&#x62BD;&#x65F6;&#x95F4;&#x548C;&#x4E0A;&#x4E0B;&#x6E38;&#x505A;&#x66F4;&#x591A;&#x6C9F;&#x901A;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BF9;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x7684;&#x9700;&#x6C42;&#x66F4;&#x660E;&#x786E;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x6BCF;&#x6B21;&#x5408;&#x4F5C;&#x4E2D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x969C;&#x788D;&#x548C;&#x53CD;&#x590D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x505A;&#xFF1F;</p>
</blockquote>
<p>&#x8868;&#x9762;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x60C5;&#x8DDF;&#x624B;&#x5934;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x5173;&#x7CFB;&#xFF0C;&#x4E5F;&#x4F1A;&#x82B1;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x78E8;&#x5200;&#x4E0D;&#x8BEF;&#x780D;&#x67F4;&#x5DE5;&#xFF0C;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#x5C31;&#x662F;&#x503C;&#x5F97;&#x7684;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E00;&#x6B21;&#x5C31;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x5BF9;&#x3002;</strong></p>
<p>&#x201C;&#x5148;&#x7B80;&#x5355;&#x5F04;&#x4E00;&#x4E0B;&#x5427;&#xFF0C;&#x7B49;&#x4EE5;&#x540E;&#x6709;&#x9700;&#x8981;&#x4E86;&#x518D;&#x8BF4;&#x201D;&#x3002;&#x6211;&#x4EEC;&#x5E38;&#x542C;&#x522B;&#x4EBA;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x7ECF;&#x5E38;&#x8FD9;&#x6837;&#x8BF4;&#xFF0C;&#x4F46;&#x65E0;&#x6570;&#x7684;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x8FD9;&#x662F;&#x5728;&#x6316;&#x5751;&#xFF0C;&#x90A3;&#x4E9B;&#x88AB;&#x7B80;&#x5355;&#x5BF9;&#x5F85;&#x4E86;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5F80;&#x5F80;&#x90FD;&#x9700;&#x8981;&#x82B1;&#x7B2C;&#x4E8C;&#x6B21;&#x7684;&#x6210;&#x672C;&#x53BB;&#x5F80;&#x66F4;&#x590D;&#x6742;&#x7684;&#x65B9;&#x5411;&#x6539;&#x8FDB;&#x3002;</p>
<p>&#x4EE5;&#x524D;&#x4E0D;&#x7406;&#x89E3;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7B2C;&#x4E00;&#x6B21;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x5BF9;&#xFF0C;&#x96BE;&#x9053;&#x660E;&#x77E5;&#x9053;&#x6709;&#x9519;&#x8FD8;&#x53BB;&#x505A;&#xFF1F;&#x540E;&#x6765;&#x624D;&#x660E;&#x767D;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x6216;&#x9519;&#x4E0D;&#x662F;&#x7AD9;&#x5728;&#x5355;&#x6B21;&#x4E8B;&#x4EF6;&#x53BB;&#x8003;&#x91CF;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x53EF;&#x6301;&#x7EED;&#x53D1;&#x5C55;&#x7684;&#x89D2;&#x5EA6;&#x8003;&#x8651;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x65F6;&#x5077;&#x61D2;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x5177;&#x5907;&#x76F8;&#x5E94;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x773C;&#x5149;&#xFF0C;&#x5C31;&#x4F1A;&#x5148;&#x6316;&#x5751;&#x518D;&#x542B;&#x6CEA;&#x586B;&#x5751;&#xFF0C;&#x51FA;&#x529B;&#x4E0D;&#x8BA8;&#x597D;&#x3002;</p>
<p><strong>&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x51B3;&#x5B9A;&#x4E86;&#x6C38;&#x8FDC;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#x3002;</strong></p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x96C6;&#x4F53;&#x91CC;&#xFF0C;&#x6BCF;&#x4EF6;&#x4E8B;&#x90FD;&#x8DDF;&#x5F88;&#x591A;&#x4EBA;&#x76F8;&#x5173;&#xFF0C;&#x4EBA;&#x548C;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x50CF;&#x4E00;&#x5F20;&#x5927;&#x7F51;&#x4E00;&#x6837;&#x5C55;&#x5F00;&#xFF0C;&#x8FDC;&#x8FDC;&#x8D85;&#x51FA;&#x6211;&#x4EEC;&#x7684;&#x638C;&#x63A7;&#x8303;&#x56F4;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5E38;&#x671F;&#x671B;&#x4F9D;&#x9760;&#x4E2A;&#x4EBA;&#x7ECF;&#x9A8C;&#x6765;&#x964D;&#x4F4E;&#x5DE5;&#x4F5C;&#x6210;&#x672C;&#xFF0C;&#x4F46;&#x7ED3;&#x679C;&#x5F80;&#x5F80;&#x4EE4;&#x4EBA;&#x6C14;&#x9981;&#x2014;&#x2014;&#x201C;&#x4E0D;&#x662F;&#x597D;&#x597D;&#x7684;&#x5417;&#xFF1F;&#x600E;&#x4E48;&#x53C8;&#x6709;&#x95EE;&#x9898;&#xFF1F;&#xFF01;&#x201D;&#xFF0C;&#x201C;&#x4E0D;&#x662F;&#x8BF4;&#x597D;&#x4E0D;&#x518D;&#x6539;&#x5417;&#xFF1F;&#x600E;&#x4E48;&#x53C8;&#x6539;&#xFF1F;&#x201D;</p>
<p>&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x4E00;&#x5207;&#x90FD;&#x80FD;&#x56FA;&#x5B9A;&#x4E0B;&#x6765;&#xFF0C;&#x4F46;&#x5230;&#x5904;&#x90FD;&#x5145;&#x6EE1;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x573A;&#x666F;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x548C;&#x601D;&#x7EF4;&#x4E5F;&#x6781;&#x5177;&#x5076;&#x7136;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6CA1;&#x95EE;&#x9898;&#x90FD;&#x53EA;&#x662F;&#x6682;&#x65F6;&#x7684;&#xFF0C;&#x968F;&#x65F6;&#x51C6;&#x5907;&#x9762;&#x5BF9;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x624D;&#x662F;&#x5E38;&#x6001;&#x3002;</p>
<p><strong>&#x4ECE;&#x70B9;&#x5230;&#x9762;&#xFF0C;&#x9010;&#x6B65;&#x5B8C;&#x5584;&#x3002;</strong></p>
<p>&#x6211;&#x4EEC;&#x5E38;&#x4F1A;&#x9762;&#x5BF9;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x601D;&#x8DEF;&#xFF1A;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x5C0F;&#x95EE;&#x9898;A&#xFF0C;&#x8FFD;&#x6EAF;&#x5230;&#x76F8;&#x5173;&#x8D23;&#x4EFB;&#x4EBA;B&#xFF0C;B&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5386;&#x53F2;&#x9057;&#x7559;&#x95EE;&#x9898;C&#xFF0C;&#x89E3;&#x51B3;A&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x8981;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x89E3;&#x51B3;&#xFF0C;&#x5C31;&#x8981;&#x89E3;&#x51B3;C&#xFF0C;&#x4F46;C&#x7684;&#x6210;&#x672C;&#x5F88;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x7D22;&#x6027;&#x5C31;&#x5148;&#x89E3;&#x51B3;A&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#xFF0C;A&#x4E0D;&#x65AD;&#x5730;&#x51FA;&#x73B0;&#xFF0C;&#x4E0D;&#x65AD;&#x5730;&#x88AB;&#x89E3;&#x51B3;&#xFF0C;&#x800C;C&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x90A3;&#x4E48;C&#x662F;&#x5426;&#x65E0;&#x89E3;&#xFF1F;&#x5F53;&#x7136;&#x6709;&#xFF0C;&#x600E;&#x4E48;&#x89E3;&#x51B3;&#xFF1F;&#x7B54;&#x6848;&#x5C31;&#x662F;&#xFF1A;&#x4E0D;&#x8981;&#x60F3;&#x4E00;&#x6B21;&#x628A;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x5B8C;&#xFF0C;&#x501F;&#x9274;&#x4EA7;&#x54C1;&#x8FED;&#x4EE3;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5C06;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x5206;&#x89E3;&#xFF0C;&#x9010;&#x6B65;&#x7684;&#x62FC;&#x51D1;&#x548C;&#x8865;&#x5145;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x89E3;&#x51B3;C&#xFF0C;&#x9700;&#x8981;&#x505A;A&#x3001;B&#x3001;D&#x3001;E&#x3001;F&#x3001;G&#xFF0C;&#x73B0;&#x5728;A&#x548C;B&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x5DF2;&#x7ECF;&#x9519;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4ECE;D&#x5F00;&#x59CB;&#x91C7;&#x7528;&#x6B63;&#x786E;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x4FDD;&#x8BC1;&#x4E86;&#x4ECE;D&#x5F80;&#x540E;&#x90FD;&#x662F;&#x5BF9;&#x7684;&#xFF0C;&#x6709;&#x7A7A;&#x95F2;&#x6216;&#x8005;&#x6B63;&#x597D;&#x8981;&#x505A;AB&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x518D;&#x628A;AB&#x7EA0;&#x6B63;&#x8FC7;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x56E0;&#x4E3A;&#x6210;&#x672C;&#x5927;&#x800C;&#x6401;&#x7F6E;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x7EA0;&#x7ED3;&#x5728;&#x505A;D&#x7684;&#x65F6;&#x5019;&#x8981;&#x4E0D;&#x8981;&#x91CD;&#x65B0;&#x505A;AB&#x3002;</p>
<p>&#x518D;&#x5927;&#x7684;&#x62FC;&#x56FE;&#x90FD;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#xFF0C;&#x8FD8;&#x662F;&#x4E2D;&#x9014;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x67D0;&#x4E2A;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x9010;&#x6B65;&#x5411;&#x5168;&#x5C40;&#x6269;&#x6563;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BA9;&#x5B83;&#x6210;&#x4E3A;&#x524D;&#x8FDB;&#x7684;&#x62E6;&#x8DEF;&#x864E;&#x3002;</p>
<h2 id="&#x88C1;&#x51B3;&#x8005;"><a href="#&#x88C1;&#x51B3;&#x8005;" class="headerlink" title="&#x88C1;&#x51B3;&#x8005;"></a>&#x88C1;&#x51B3;&#x8005;</h2><p><strong>&#x81EA;&#x5DF1;&#x624D;&#x662F;&#x6700;&#x7EC8;&#x7684;&#x88C1;&#x51B3;&#x8005;&#xFF0C;&#x8D62;&#x4E86;&#x81EA;&#x5DF1;&#x5C31;&#x597D;&#x3002;</strong></p>
<p>&#x4EE5;&#x524D;&#x603B;&#x770B;&#x522B;&#x4EBA;&#x5199;&#x201C;XX&#x5E74;&#x8BB0;&#x201D;&#xFF0C;&#x8F6C;&#x773C;&#x6211;&#x4E5F;&#x5DF2;&#x7ECF;&#x5DE5;&#x4F5C;&#x56DB;&#x5E74;&#xFF0C;&#x4ECE;&#x65B0;&#x4EBA;&#x5230;&#x8001;&#x9E1F;&#xFF0C;&#x6539;&#x53D8;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x8BA4;&#x77E5;&#xFF0C;&#x5FC3;&#x6001;&#xFF0C;&#x8DDF;&#x4E4B;&#x524D;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x518D;&#x81EA;&#x5356;&#x81EA;&#x5938;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x662F;&#x6559;&#x8BAD;&#x548C;&#x53CD;&#x601D;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x5E74;&#x6211;&#x6536;&#x83B7;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x770B;&#x4E66;&#x3001;&#x953B;&#x70BC;&#x3001;&#x65C5;&#x6E38;&#x3001;&#x642C;&#x65B0;&#x623F;&#x5B50;&#x3001;&#x4EA4;&#x65B0;&#x670B;&#x53CB;&#xFF0C;&#x4E5F;&#x5931;&#x53BB;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x5DE5;&#x4F5C;&#x65B9;&#x9762;&#x7684;&#x63D0;&#x5347;&#x8FD1;&#x4E4E;&#x505C;&#x6EDE;&#xFF0C;&#x6CA1;&#x6709;&#x5B66;&#x4E60;&#x65B0;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x8F93;&#x51FA;&#x548C;&#x8D21;&#x732E;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x559C;&#x5FE7;&#x53C2;&#x534A;&#xFF0C;&#x6B23;&#x559C;&#x4E2D;&#x63BA;&#x6742;&#x7740;&#x632B;&#x8D25;&#x611F;&#x3002;</p>
<p>&#x632B;&#x8D25;&#x611F;&#x5E26;&#x6765;&#x5371;&#x673A;&#x611F;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x6B21;&#x6B21;&#x5931;&#x7720;&#xFF0C;&#x6211;&#x8EAB;&#x5728;&#x817E;&#x8BAF;&#xFF0C;&#x4EAB;&#x6709;&#x7740;&#x4EE4;&#x4EBA;&#x7FA1;&#x6155;&#x7684;&#x798F;&#x5229;&#xFF0C;&#x5728;&#x901A;&#x5F80;&#x9AD8;&#x7EA7;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x8DEF;&#x4E0A;&#x8FC8;&#x8FDB;&#xFF0C;&#x4F46;&#x8FD9;&#x80FD;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#xFF1F;&#x6CA1;&#x6709;&#x6267;&#x884C;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x5DF2;&#x7ECF;&#x5931;&#x8861;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x9010;&#x6E10;&#x6D88;&#x5931;&#x7684;&#x6FC0;&#x60C5;&#xFF0C;&#x90FD;&#x5728;&#x63D0;&#x9192;&#x7740;&#x6211;&#x6CA1;&#x6709;&#x4ED8;&#x51FA;&#x5C31;&#x6CA1;&#x6709;&#x6536;&#x83B7;&#xFF0C;&#x867D;&#x7136;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x540E;&#x6094;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x6D77;&#x660E;&#x5A01;&#x8BF4;&#x8FC7;&#xFF0C;&#x201C;&#x4EBA;&#x4E0D;&#x662F;&#x4E3A;&#x5931;&#x8D25;&#x800C;&#x751F;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x88AB;&#x6BC0;&#x706D;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x88AB;&#x6253;&#x8D25;&#x201D;&#xFF0C;&#x7ECF;&#x5386;&#x3001;&#x601D;&#x8003;&#x3001;&#x6539;&#x8FDB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6210;&#x957F;&#xFF0C;&#x4E5F;&#x662F;&#x4EBA;&#x751F;&#x5F97;&#x4EE5;&#x4E30;&#x5BCC;&#x548C;&#x539A;&#x91CD;&#x7684;&#x57FA;&#x77F3;&#x3002;</p>
<p>&#x6807;&#x9898;&#x5B9A;&#x4E3A;&#x9E45;&#x5382;&#x4E24;&#x5E74;&#x8BB0;&#xFF0C;&#x56E0;&#x4E3A;&#x6587;&#x7AE0;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x8FD8;&#x662F;&#x4ECE;&#x5DE5;&#x4F5C;&#x4E2D;&#x6765;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x4F1A;&#x7ED9;&#x81EA;&#x5DF1;&#x627E;&#x76EE;&#x6807;&#xFF0C;&#x67D0;&#x4E2A;&#x4EBA;&#xFF0C;&#x6216;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5176;&#x5B9E;&#x90A3;&#x4E9B;&#x76EE;&#x6807;&#x53EA;&#x662F;&#x5047;&#x60F3;&#x654C;&#xFF0C;&#x522B;&#x4EBA;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x522B;&#x4EBA;&#x7684;&#x8BC4;&#x4EF7;&#xFF0C;&#x90FD;&#x6CA1;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x5728;&#x8DDF;&#x81EA;&#x5DF1;&#x8D5B;&#x8DD1;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6210;&#x5C31;&#x548C;&#x5FEB;&#x4E50;&#x53EA;&#x4F1A;&#x5FE0;&#x4E8E;&#x5185;&#x5FC3;&#x3002;</p>
<p>&#x6709;&#x4EBA;&#x8BF4;&#x751F;&#x6D3B;&#x6DE1;&#x5982;&#x6C34;&#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x8BF4;&#x751F;&#x6D3B;&#x4E71;&#x5982;&#x9EBB;&#xFF0C;&#x5176;&#x5B9E;&#x5B83;&#x5E76;&#x4E0D;&#x6B8B;&#x9177;&#xFF0C;&#x4E5F;&#x6CA1;&#x90A3;&#x4E48;&#x7F8E;&#x597D;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E00;&#x5F20;&#x9759;&#x5F85;&#x4E66;&#x5199;&#x7684;&#x767D;&#x7EB8;&#xFF0C;&#x4F60;&#x6325;&#x6D12;&#x7B14;&#x58A8;&#xFF0C;&#x5B83;&#x5448;&#x73B0;&#x8272;&#x5F69;&#xFF0C;&#x53EA;&#x6709;&#x6301;&#x7EED;&#x524D;&#x884C;&#xFF0C;&#x624D;&#x80FD;&#x4E0D;&#x65AD;&#x8D85;&#x8D8A;&#x3002;</p>
<p>&#x8FD8;&#x4F1A;&#x4E0D;&#x4F1A;&#x6709;&#x4E09;&#x5E74;&#x8BB0;&#x5462;&#xFF1F;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#xFF0C;&#x4E5F;&#x5DF2;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x8FFD;&#x5BFB;&#x7406;&#x60F3;&#x7684;&#x8FC7;&#x7A0B;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5728;&#x627E;&#x81EA;&#x5DF1;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x5FC3;&#x6000;&#x8FDC;&#x65B9;&#xFF0C;&#x5C31;&#x6709;&#x62E8;&#x5F00;&#x8FF7;&#x96FE;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x4E0D;&#x8BBA;&#x5728;&#x54EA;&#x91CC;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x65B9;&#x5411;&#xFF0C;&#x53BB;&#x52AA;&#x529B;&#x6210;&#x4E3A;&#x6700;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#xFF01;</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/经历/" rel="tag">#经历</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/12/18/css_conf_2016/" rel="next" title="第三届CSS中国开发者大会纪实">
                <i class="fa fa-chevron-left"></i> 第三届CSS中国开发者大会纪实
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2017/09/09/f2er-club-new-guide/" rel="prev" title="新版前端导航前瞻">
                新版前端导航前瞻 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#新鲜感"><span class="nav-number">1.</span> <span class="nav-text">新鲜感</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#学习"><span class="nav-number">2.</span> <span class="nav-text">学习</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#成长"><span class="nav-number">3.</span> <span class="nav-text">成长</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#团队"><span class="nav-number">4.</span> <span class="nav-text">团队</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#成本"><span class="nav-number">5.</span> <span class="nav-text">成本</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#裁决者"><span class="nav-number">6.</span> <span class="nav-text">裁决者</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
