<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="总结," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x8FD9;&amp;#x4E2A;&amp;#x65F6;&amp;#x5019;&amp;#x81EA;&amp;#x5DF1;&amp;#x63ED;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x77ED;&amp;#x5462;&amp;#xFF1F;&amp;#x56E0;&amp;#x4E3A;&amp;#x88AB;&amp;#x4EBA;&amp;#x6307;&amp;#x51FA;&amp;#x4E86;&amp;#x4E00;">
<meta property="og:type" content="article">
<meta property="og:title" content="那些年我干过的矬事">
<meta property="og:url" content="http://yoursite.com/2015/10/17/those-year-i-do-bad/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x8FD9;&amp;#x4E2A;&amp;#x65F6;&amp;#x5019;&amp;#x81EA;&amp;#x5DF1;&amp;#x63ED;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x77ED;&amp;#x5462;&amp;#xFF1F;&amp;#x56E0;&amp;#x4E3A;&amp;#x88AB;&amp;#x4EBA;&amp;#x6307;&amp;#x51FA;&amp;#x4E86;&amp;#x4E00;">
<meta property="og:updated_time" content="2016-08-16T15:55:44.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="那些年我干过的矬事">
<meta name="twitter:description" content="&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8981;&amp;#x8FD9;&amp;#x4E2A;&amp;#x65F6;&amp;#x5019;&amp;#x81EA;&amp;#x5DF1;&amp;#x63ED;&amp;#x81EA;&amp;#x5DF1;&amp;#x7684;&amp;#x77ED;&amp;#x5462;&amp;#xFF1F;&amp;#x56E0;&amp;#x4E3A;&amp;#x88AB;&amp;#x4EBA;&amp;#x6307;&amp;#x51FA;&amp;#x4E86;&amp;#x4E00;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 那些年我干过的矬事 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                那些年我干过的矬事
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-10-17T00:00:00+08:00" content="2015-10-17">
              2015-10-17
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/总结/" itemprop="url" rel="index">
                    <span itemprop="name">总结</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x81EA;&#x5DF1;&#x63ED;&#x81EA;&#x5DF1;&#x7684;&#x77ED;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x88AB;&#x4EBA;&#x6307;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x4EE5;&#x524D;&#x5199;&#x7684;&#x9875;&#x9762;&#x4E0A;&#x9762;&#x4E0D;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x3002;&#x89C9;&#x5F97;&#x5E72;&#x8FC7;&#x7684;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x4E5F;&#x6709;&#x4E00;&#x7BA9;&#x7B50;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5C0F;&#x7ED3;&#x4E00;&#x4E0B;&#xFF0C;&#x7ED9;&#x5927;&#x5BB6;&#x4E00;&#x4E2A;&#x53C2;&#x8003;&#x3002;</p>
<p><strong>&#x4E00;&#x3001;&#x4E0D;&#x8DDF;&#x56E2;&#x961F;&#x89C4;&#x8303;&#x4E00;&#x81F4;</strong></p>
<p>&#x89C4;&#x8303;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x4EBA;&#x5728;&#x558A;&#xFF0C;&#x4F46;&#x4EBA;&#x4EBA;&#x90FD;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x9075;&#x5B88;&#x7684;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x6709;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x56E2;&#x961F;&#xFF0C;&#x548C;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x5408;&#x4F5C;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x9047;&#x5230;&#x8DDF;&#x81EA;&#x5DF1;&#x4E60;&#x60EF;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x5171;&#x540C;&#x9075;&#x5B88;&#x4E00;&#x4E2A;&#x89C4;&#x8303;&#x6216;&#x8005;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x5236;&#x5B9A;&#x51FA;&#x4E00;&#x4E2A;&#x89C4;&#x8303;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x4EF6;&#x7EC4;&#x7EC7;&#x3001;&#x547D;&#x540D;&#xFF0C;&#x8FD8;&#x662F;&#x4EE3;&#x7801;&#x7684;&#x4E66;&#x5199;&#x65B9;&#x5F0F;&#xFF0C;&#x4EA4;&#x4E92;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x7B49;&#xFF0C;&#x90FD;&#x8981;&#x5C3D;&#x91CF;&#x8DDF;&#x56E2;&#x961F;&#x4E00;&#x81F4;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x5B9A;&#x662F;&#x4F1A;&#x6709;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x51CF;&#x5C11;&#x5F88;&#x591A;&#x7684;&#x6C9F;&#x901A;&#x6210;&#x672C;&#xFF0C;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x4E14;&#x65E2;&#x7136;&#x5B83;&#x6210;&#x4E3A;&#x4E86;&#x4E00;&#x79CD;&#x89C4;&#x8303;&#xFF0C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x6CD5;&#xFF0C;&#x65E0;&#x5F62;&#x4E2D;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x4E13;&#x4E1A;&#x6C34;&#x5E73;&#xFF0C;&#x517B;&#x6210;&#x66F4;&#x597D;&#x7684;&#x4E60;&#x60EF;&#x3002;</p>
<p><strong>&#x4E8C;&#x3001;&#x4E60;&#x60EF;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;</strong></p>
<p>&#x8FD9;&#x91CC;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x662F;&#x4E0D;&#x8981;&#x8FC7;&#x591A;&#x4F7F;&#x7528;&#xFF08;&#x9664;&#x4E86;reset&#xFF09;&#xFF0C;&#x867D;&#x7136;&#x5927;&#x5BB6;&#x90FD;&#x89C9;&#x5F97;&#x547D;&#x540D;&#x662F;&#x4E2A;&#x5934;&#x75BC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x5EFA;&#x8BAE;&#x7ED9;&#x5143;&#x7D20;&#x547D;&#x4E00;&#x4E2A;&#x8BED;&#x4E49;&#x5316;&#x7684;&#x7C7B;&#x6216;&#x8005;ID&#x540D;&#xFF0C;&#x597D;&#x5904;&#x5728;&#x54EA;&#x91CC;&#x5462;&#xFF1F;&#x6BD4;&#x5982;&#x5E38;&#x7528;&#x7684;a&#x3001;span&#x3001;p&#x8FD9;&#x4E9B;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x6570;&#x91CF;&#x662F;&#x4E0D;&#x53EF;&#x63A7;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x7528;&#x4E86;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x53C8;&#x5728;&#x91CC;&#x9762;&#x52A0;&#x5165;&#x4E86;&#x53E6;&#x5916;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6837;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x6216;&#x8005;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x6807;&#x7B7E;&#x4E4B;&#x540E;&#x7A81;&#x7136;&#x89C9;&#x5F97;&#x5E76;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x60F3;&#x6539;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x53BB;&#x91C7;&#x53D6;&#x5B50;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5144;&#x5F1F;&#x9009;&#x62E9;&#x5668;&#xFF0C;css3&#x7684;nth-child&#x751A;&#x81F3;&#x591A;&#x5D4C;&#x5957;&#x4E00;&#x5C42;&#x589E;&#x52A0;&#x6743;&#x91CD;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x4F46;&#x7ECF;&#x9A8C;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E9B;&#x505A;&#x6CD5;&#x628A;&#x7ED3;&#x6784;&#x8D8A;&#x6765;&#x8D8A;&#x9501;&#x6B7B;&#x4E86;&#xFF0C;&#x54EA;&#x91CC;&#x90FD;&#x4E0D;&#x80FD;&#x52A8;&#xFF0C;&#x52A8;&#x4E00;&#x4E0B;&#x6837;&#x5F0F;&#x5C31;&#x8981;&#x91CD;&#x65B0;&#x5199;&#xFF0C;&#x5F88;&#x5934;&#x75BC;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x5982;&#x6700;&#x5F00;&#x59CB;&#x5C31;&#x4E0D;&#x7ED9;&#x81EA;&#x5DF1;&#x6316;&#x5751;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x589E;&#x5F3A;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x51FA;&#x4E8E;&#x6027;&#x80FD;&#x8003;&#x8651;&#xFF0C;css&#x9009;&#x62E9;&#x5668;&#x7684;&#x673A;&#x5236;&#x662F;&#x4ECE;&#x53F3;&#x5F80;&#x5DE6;&#x7684;&#x904D;&#x5386;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x4E86;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x5C31;&#x4F1A;&#x904D;&#x5386;&#x6240;&#x6709;&#x540C;&#x4E00;&#x6807;&#x7B7E;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x663E;&#x7136;&#x66F4;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x4E0D;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x662F;&#x6BD4;&#x5982;ul.list&#xFF0C;&#x8FD9;&#x91CC;&#x7684;ul&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x6CA1;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5F92;&#x589E;&#x6743;&#x91CD;&#x3002;</p>
<p><strong>&#x4E09;&#x3001;&#x4F7F;&#x7528;&#x8F83;&#x901A;&#x7528;&#x7684;&#x7C7B;&#x9009;&#x62E9;&#x5668;</strong></p>
<p>&#x8FD9;&#x4E2A;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x4E0D;&#x7ED9;&#x81EA;&#x5DF1;&#x6316;&#x5751;&#xFF0C;&#x4E5F;&#x4E0D;&#x7ED9;&#x522B;&#x4EBA;&#x6316;&#x5751;&#xFF0C;&#x6BD4;&#x5982;title&#x3001;list&#x3001;item&#x3001;mod&#x7B49;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x7528;&#x5230;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x7528;&#x5230;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x53C8;&#x7528;&#x5230;&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#xFF0C;&#x4F60;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x627E;&#x7406;&#x7531;&#x8BF4;&#x4F60;&#x80FD;&#x627E;&#x5230;&#x67D0;&#x79CD;&#x65B9;&#x6CD5;&#x53BB;&#x907F;&#x514D;&#xFF0C;&#x4F46;&#x4EBA;&#x603B;&#x4F1A;&#x758F;&#x5FFD;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x628A;&#x5B83;&#x627C;&#x6740;&#x5728;&#x840C;&#x82BD;&#x4E2D;&#x5462;&#xFF1F;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x8BF4;&#x8FD9;&#x4E9B;&#x7EDD;&#x5BF9;&#x4E0D;&#x80FD;&#x7528;&#xFF0C;&#x6709;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53EB;&#x524D;&#x7F00;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x7ED9;&#x5B83;&#x4EEC;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6240;&#x5728;&#x6A21;&#x5757;&#x7684;&#x547D;&#x540D;&#x524D;&#x7F00;&#xFF0C;&#x5C31;&#x80FD;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x4E0D;&#x8E29;&#x5751;&#x3002;</p>
<p><strong>&#x56DB;&#x3001;&#x91CD;&#x590D;&#x7684;&#x4E8B;&#x60C5;&#x91CD;&#x590D;&#x505A;</strong></p>
<p>&#x6807;&#x9898;&#x597D;&#x50CF;&#x6709;&#x70B9;&#x5947;&#x602A;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x91CD;&#x590D;&#x505A;&#x5417;&#xFF1F;&#x6BD4;&#x5982;&#xFF0C;&#x5927;&#x5230;&#x6211;&#x4EEC;&#x6BCF;&#x4E2A;&#x9879;&#x76EE;&#x90FD;&#x4F1A;&#x53BB;&#x5EFA;&#x7ACB;&#x4E00;&#x4E9B;&#x6587;&#x4EF6;&#x5939;&#x548C;&#x6587;&#x4EF6;&#xFF0C;&#x5C0F;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x6B21;&#x90FD;&#x8981;&#x4E3A;&#x4E00;&#x4E9B;&#x6548;&#x679C;&#x5199;&#x517C;&#x5BB9;&#x4EE3;&#x7801;&#xFF0C;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#x4E00;&#x4E9B;&#x6D6E;&#x52A8;&#x76F8;&#x5173;&#x3001;&#x6C34;&#x5E73;&#x5782;&#x76F4;&#x5C45;&#x4E2D;&#x76F8;&#x5173;&#x3001;&#x663E;&#x793A;/&#x9690;&#x85CF;&#x3001;&#x6EA2;&#x51FA;&#x9690;&#x85CF;&#x3001;&#x7C7B;&#x4F3C;&#x7684;&#x52A8;&#x753B;&#x6548;&#x679C;&#x7B49;&#x7B49;&#x3002;&#x5176;&#x5B9E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x6765;&#x505A;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x6027;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6BCF;&#x6B21;&#x518D;&#x9700;&#x8981;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x62FF;&#x8FC7;&#x6765;&#x3002;&#x6216;&#x8005;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x5404;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x6211;&#x4EEC;&#x603B;&#x80FD;&#x627E;&#x5230;&#x5171;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x628A;&#x5B83;&#x4EEC;&#x62BD;&#x79BB;&#x51FA;&#x6765;&#x8FDB;&#x884C;&#x5F52;&#x7C7B;&#xFF0C;&#x65E2;&#x65B9;&#x4FBF;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;&#xFF0C;&#x4E5F;&#x65B9;&#x4FBF;&#x590D;&#x7528;&#x3002;&#x6B63;&#x6240;&#x8C13;&#xFF0C;&#x518D;&#x9AD8;&#x6548;&#x7684;&#x505A;&#x4E8B;&#x65B9;&#x6CD5;&#x4E5F;&#x6BD4;&#x4E0D;&#x4E0A;&#x201C;&#x4E0D;&#x7528;&#x505A;&#x201D;~&#x5C31;&#x50CF;&#x6709;&#x4F4D;&#x524D;&#x8F88;&#x66FE;&#x7ECF;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#x201C;&#x6BD4;&#x6211;&#x806A;&#x660E;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x6BD4;&#x4ED6;&#x66F4;&#x52AA;&#x529B;&#xFF0C;&#x6BD4;&#x6211;&#x52AA;&#x529B;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x6BD4;&#x4ED6;&#x66F4;&#x806A;&#x660E;&#x3002;&#x201D;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#xFF0C;&#x90FD;&#x662F;&#x6709;&#x601D;&#x8003;&#x6539;&#x8FDB;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5F97;&#x66F4;&#x806A;&#x660E;&#x3002;</p>
<p><strong>&#x4E94;&#x3001;&#x4E0D;&#x5229;&#x7528;&#x7EE7;&#x627F;</strong></p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x7EE7;&#x627F;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x5927;&#x7684;&#x8303;&#x7574;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5C0F;&#x5230;&#x67D0;&#x4E2A;&#x6280;&#x672F;&#xFF0C;&#x5C31;CSS&#x800C;&#x8A00;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x7EE7;&#x627F;&#xFF0C;&#x6BD4;&#x5982;font-size&#x3001;color&#x3001;line-height&#x7B49;&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5B83;&#x4EEC;&#x7684;&#x7236;&#x5BB9;&#x5668;&#x6216;&#x8005;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x7C7B;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x51FA;&#x6765;&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x91CD;&#x590D;&#x5199;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x7701;&#x4E8B;&#x513F;&#xFF0C;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x4F53;&#x73B0;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x77E5;&#x8BC6;&#x6027;&#x548C;&#x601D;&#x7EF4;&#xFF0C;&#x5168;&#x5C40;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x5171;&#x6027;&#x548C;&#x5DEE;&#x5F02;&#xFF0C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x63D0;&#x5347;&#x4E86;&#x81EA;&#x5DF1;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x4E13;&#x4E1A;&#x7D20;&#x8D28;&#x3002;</p>
<p><strong>&#x516D;&#x3001;&#x4E0D;&#x5199;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;</strong></p>
<p>&#x8FD9;&#x4E2A;&#x5176;&#x5B9E;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x7406;&#x89E3;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x4E5F;&#x5F88;&#x4E0D;&#x91CD;&#x89C6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5199;&#x4EE3;&#x7801;&#x6CE8;&#x91CA;&#xFF1F;&#x6211;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x95ED;&#x7740;&#x773C;&#x775B;&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x54EA;&#x662F;&#x54EA;&#xFF0C;&#x6709;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>1&#x3001;&#x6240;&#x505A;&#x9879;&#x76EE;&#x4EE3;&#x7801;&#x91CF;&#x5F88;&#x5C11;&#xFF0C;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x7684;&#x9879;&#x76EE;&#x5C11; &#xFF1B;</p>
<p>2&#x3001;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#x7684;&#x5730;&#x65B9;&#x4E0D;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x56E2;&#x961F;&#x6574;&#x4F53;&#x6CA1;&#x6709;&#x6CE8;&#x91CA;&#x610F;&#x8BC6;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x4E60;&#x60EF;&#x4E86;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x8FD8;&#x662F;&#x6709;&#x5B83;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x7684;&#xFF0C;&#x6E05;&#x6670;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x8BED;&#x4E49;&#x5316;&#x7684;&#x6807;&#x7B7E;&#x53CA;&#x547D;&#x540D;&#x56FA;&#x7136;&#x5FC5;&#x8981;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x80AF;&#x5B9A;&#x6BD4;&#x4E0D;&#x4E0A;&#x6CE8;&#x91CA;&#x66F4;&#x80FD;&#x76F4;&#x63A5;&#x7684;&#x544A;&#x8BC9;&#x522B;&#x4EBA;&#x4F60;&#x90A3;&#x6BB5;&#x4EE3;&#x7801;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x4EA7;&#x751F;&#x4EC0;&#x4E48;&#x53D8;&#x5316;&#xFF0C;&#x4F1A;&#x6709;&#x54EA;&#x4E9B;&#x4EA4;&#x4E92;&#x3002;&#x7B49;&#x7B49;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x5199;&#x4E86;&#x6CE8;&#x91CA;&#xFF0C;&#x4E0D;&#x4EC5;&#x81EA;&#x5DF1;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x770B;&#x90FD;&#x80FD;&#x660E;&#x767D;&#xFF0C;&#x800C;&#x4E14;&#x522B;&#x4EBA;&#x4E5F;&#x80FD;&#x5F88;&#x5BB9;&#x6613;&#x770B;&#x660E;&#x767D;&#xFF0C;&#x8DDF;&#x540E;&#x53F0;&#x5F00;&#x53D1;&#x5408;&#x4F5C;&#x4EE5;&#x53CA;&#x4F1A;&#x6709;&#x5DE5;&#x4F5C;&#x4EA4;&#x63A5;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x90FD;&#x662F;&#x5F88;&#x6709;&#x597D;&#x5904;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x6CE8;&#x91CA;&#x8FDB;&#x884C;&#x641C;&#x7D22;&#x5B9A;&#x4F4D;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x8981;&#x5077;&#x61D2;&#x3002;</p>
<p><strong>&#x4E03;&#x3001;&#x4E0D;&#x601D;&#x8003;&#xFF0C;&#x4E0D;&#x89C4;&#x5212;&#xFF0C;&#x62FF;&#x6765;&#x5C31;&#x505A;</strong></p>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x62FF;&#x6765;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x901A;&#x8FC7;&#x7B2C;&#x4E00;&#x5370;&#x8C61;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x89C9;&#x5F97;&#x633A;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x5C31;&#x5F00;&#x59CB;&#x505A;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x7EC6;&#x8282;&#x65B9;&#x9762;&#x662F;&#x5426;&#x6709;&#x9057;&#x6F0F;&#xFF0C;&#x89C6;&#x89C9;&#x63D0;&#x4F9B;&#x7684;UI&#x5143;&#x7D20;&#x662F;&#x5426;&#x6709;&#x660E;&#x663E;&#x7684;&#x9519;&#x8BEF;&#x548C;&#x7F3A;&#x5931;&#xFF0C;&#x600E;&#x6837;&#x5B9E;&#x73B0;&#x4E0D;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x9875;&#x9762;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x5171;&#x7528;&#x7684;&#x6A21;&#x5757;&#x6216;&#x8005;&#x9897;&#x7C92;&#xFF0C;&#x54EA;&#x4E9B;&#x56FE;&#x662F;&#x9700;&#x8981;&#x62C6;&#x5F00;&#xFF0C;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x6574;&#x5757;&#x5904;&#x7406;&#xFF0C;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x7528;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#xFF0C;&#x54EA;&#x4E9B;&#x53EF;&#x4EE5;&#x7528;&#x5B57;&#x4F53;&#x56FE;&#x6807;&#xFF0C;&#x54EA;&#x4E9B;&#x9700;&#x8981;&#x5408;&#x5E76;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x4EE5;&#x524D;&#x505A;&#x8FC7;&#x7C7B;&#x4F3C;&#x53EF;&#x4EE5;&#x590D;&#x7528;&#x7B49;&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x8FDB;&#x884C;&#x8FD9;&#x4E9B;&#x89C4;&#x5212;&#xFF0C;&#x5728;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x5F53;&#x4E2D;&#x5C31;&#x4F1A;&#x4E0D;&#x65AD;&#x7684;&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x9700;&#x8981;&#x82B1;&#x66F4;&#x591A;&#x7684;&#x5FC3;&#x601D;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7EC4;&#x7EC7;&#x6574;&#x7406;&#xFF0C;&#x4FEE;&#x4FEE;&#x8865;&#x8865;&#xFF0C;&#x6548;&#x7387;&#x5C31;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#xFF0C;&#x5B8C;&#x6210;&#x8D28;&#x91CF;&#x4E5F;&#x4F1A;&#x76F8;&#x5E94;&#x964D;&#x4F4E;&#x3002;&#x6B63;&#x6240;&#x8C13;&#x201C;&#x78E8;&#x5200;&#x4E0D;&#x8BEF;&#x780D;&#x67F4;&#x5DE5;&#x201D;&#xFF0C;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#x8981;&#x505A;&#x8DB3;&#x3002;</p>
<p><strong>&#x516B;&#x3001;&#x53EA;&#x770B;&#x89C6;&#x89C9;&#x7A3F;&#xFF0C;&#x4E0D;&#x60F3;&#x5B9E;&#x9645;&#x60C5;&#x51B5;</strong></p>
<p>&#x89C6;&#x89C9;&#x7A3F;&#x8FD8;&#x539F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x5DF2;&#x7ECF;&#x88AB;&#x884C;&#x4E1A;&#x63D0;&#x5347;&#x5230;&#x4E00;&#x5B9A;&#x9AD8;&#x5EA6;&#xFF0C;&#x90FD;&#x5728;&#x8FFD;&#x6C42;&#x6BEB;&#x5398;&#x4E0D;&#x5DEE;&#x7684;&#x8FD8;&#x539F;&#x89C6;&#x89C9;&#x7A3F;&#xFF0C;&#x89C9;&#x5F97;&#x90A3;&#x6837;&#x5C31;&#x662F;&#x505A;&#x5230;&#x4E86;&#x7EC6;&#x8282;&#x7684;&#x6781;&#x81F4;&#xFF0C;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6709;&#x4E24;&#x70B9;&#x95EE;&#x9898;&#xFF1A;</p>
<p>1&#x3001;&#x63D0;&#x4F9B;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x89C6;&#x89C9;&#x7A3F;&#x5E76;&#x4E0D;&#x662F;&#xFF0C;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x6240;&#x6709;&#x5C3A;&#x5BF8;&#x548C;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x8BBE;&#x5907;</p>
<p>2&#x3001;&#x89C6;&#x89C9;&#x7A3F;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x6587;&#x5B57;&#xFF0C;&#x56FE;&#x7247;&#x7B49;&#x4E5F;&#x90FD;&#x662F;&#x9759;&#x6001;&#x7684;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8111;&#x5B50;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x58F0;&#x97F3;&#x201C;&#x4E25;&#x683C;&#x6309;&#x7167;&#x89C6;&#x89C9;&#x7A3F;&#x201D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;</p>
<p>1&#x3001;&#x56FE;&#x7247;&#x672C;&#x8EAB;&#x662F;&#x591A;&#x5927;&#x5C31;&#x591A;&#x5927;&#x653E;&#x4E0A;&#x53BB;&#x6CA1;&#x95EE;&#x9898;</p>
<p>2&#x3001;&#x6587;&#x5B57;&#x672C;&#x8EAB;&#x662F;&#x591A;&#x5C11;&#x5C31;&#x662F;&#x591A;&#x5C11;&#x6CA1;&#x95EE;&#x9898;</p>
<p>3&#x3001;&#x5BB9;&#x5668;&#x672C;&#x8EAB;&#x662F;&#x591A;&#x5927;&#x5C31;&#x5B9A;&#x591A;&#x5927;&#x6CA1;&#x95EE;&#x9898;</p>
<p>&#x6700;&#x7EC8;&#x4F1A;&#x5BFC;&#x81F4;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;</p>
<p>1&#x3001;&#x56FE;&#x7247;&#x6EA2;&#x51FA;</p>
<p>2&#x3001;&#x6587;&#x5B57;&#x6EA2;&#x51FA;</p>
<p>3&#x3001;&#x4E0D;&#x7BA1;&#x5C4F;&#x5E55;&#x591A;&#x5927;&#xFF0C;&#x5BB9;&#x5668;&#x3001;&#x56FE;&#x7247;&#x3001;&#x6587;&#x5B57;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x5927;&#xFF0C;&#x4E0D;&#x80FD;&#x81EA;&#x9002;&#x5E94;&#x3002;</p>
<p>&#x6700;&#x8FD1;&#x51E0;&#x5E74;&#x6709;&#x4E2A;&#x8BF4;&#x6CD5;&#xFF0C;&#x89C9;&#x5F97;&#x8FD8;&#x86EE;&#x7B26;&#x5408;&#xFF0C;&#x4E0D;&#x662F;&#x89C6;&#x89C9;&#x7A3F;&#x8FD8;&#x539F;&#xFF0C;&#x800C;&#x662F;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x8FD8;&#x539F;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x53BB;&#x7406;&#x89E3;&#x9700;&#x6C42;&#x65B9;&#x8981;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x7406;&#x89E3;&#x8BBE;&#x8BA1;&#x5E08;&#x60F3;&#x8981;&#x7684;&#x6548;&#x679C;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x7ED3;&#x5408;&#x6211;&#x4EEC;&#x7684;&#x7ECF;&#x9A8C;&#x548C;&#x4E13;&#x4E1A;&#x53BB;&#x8BA9;&#x9875;&#x9762;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x4E2D;&#x5F88;&#x597D;&#x7684;&#x5C55;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x91CC;&#x7684;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x5305;&#x62EC;&#xFF0C;&#x7528;&#x6237;&#x4E0A;&#x4F20;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x6587;&#x5B57;&#xFF0C;&#x6240;&#x7528;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x6240;&#x5904;&#x7684;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x81F3;&#x4E8E;&#x4E0A;&#x9762;&#x90A3;&#x4E9B;&#x60C5;&#x51B5;&#x6240;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x662F;&#x8981;&#x4EE5;&#x9700;&#x6C42;&#x4E3A;&#x5BFC;&#x5411;&#xFF0C;&#x5177;&#x4F53;&#x7B2C;&#x4E5D;&#x6761;&#x548C;&#x5341;&#x4E00;&#x6761;&#x8FD8;&#x4F1A;&#x6709;&#x8BB2;&#x5230;&#x3002;</p>
<p><strong>&#x4E5D;&#x3001;&#x53EA;&#x770B;&#x81EA;&#x5DF1;&#x7528;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x60C5;&#x51B5;&#xFF0C;&#x4E0D;&#x8003;&#x8651;&#x517C;&#x5BB9;</strong></p>
<p>&#x517C;&#x5BB9;&#x73B0;&#x5728;&#x7684;&#x8303;&#x7574;&#x4F1A;&#x6BD4;&#x4EE5;&#x524D;&#x66F4;&#x5E7F;&#x4E86;&#xFF0C;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x7248;&#x672C;&#xFF0C;&#x4E0D;&#x540C;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x8FD8;&#x6709;&#x5FAE;&#x4FE1;&#x3001;&#x624B;Q&#x7B49;&#xFF0C;&#x4E00;&#x822C;&#x5F00;&#x53D1;&#x8005;&#x53EA;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x81EA;&#x5DF1;&#x719F;&#x6089;&#x7684;&#xFF0C;&#x6709;&#x5F88;&#x597D;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x7684;&#xFF0C;&#x5BF9;&#x65B0;&#x7279;&#x6027;&#x652F;&#x6301;&#x5F88;&#x597D;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x8FDB;&#x884C;&#x5236;&#x4F5C;&#x548C;&#x9884;&#x89C8;&#x6548;&#x679C;&#xFF0C;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x5728;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x63A9;&#x76D6;&#x6389;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x6362;&#x4E00;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x6216;&#x8005;&#x6362;&#x4E00;&#x79CD;&#x8BBE;&#x5907;&#x53BB;&#x770B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x4E00;&#x4E0B;&#x5C31;&#x60E8;&#x4E0D;&#x5FCD;&#x7779;&#x3002;</p>
<p>&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#x8981;&#x4ECE;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x8003;&#x8651;&#x5462;&#xFF1F;</p>
<p>1&#x3001;&#x5BF9;&#x4E8E;&#x6709;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;css&#x5C5E;&#x6027;&#xFF0C;&#x517C;&#x5BB9;&#x6027;&#x4EE3;&#x7801;&#x8981;&#x5199;&#x5168;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x517C;&#x5BB9;&#x7684;&#x7248;&#x672C;&#x6BD4;&#x8F83;&#x4F4E;&#xFF0C;&#x90A3;&#x5C31;&#x8861;&#x91CF;&#x4E00;&#x4E0B;&#x662F;&#x7EDF;&#x4E00;&#x4F7F;&#x7528;&#x517C;&#x5BB9;&#x6027;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x8FD8;&#x662F;&#x91C7;&#x53D6;&#x5224;&#x65AD;&#x6D4F;&#x89C8;&#x5668;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x6848;&#x3002;</p>
<p>2&#x3001;&#x4F18;&#x5148;&#x91C7;&#x7528;&#x4E0D;&#x56FA;&#x5B9A;&#x5E03;&#x5C40;&#xFF0C;&#x6BD4;&#x5982;&#x767E;&#x5206;&#x6BD4;&#x3001;&#x7236;&#x5BB9;&#x5668;&#x5185;&#x8FB9;&#x8DDD;&#xFF0C;&#x7ED3;&#x5408;&#x6D6E;&#x52A8;&#x548C;&#x5B9A;&#x4F4D;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x80FD;&#x8BA9;&#x4F60;&#x7684;&#x5E03;&#x5C40;&#x5728;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x7684;&#x8BBE;&#x5907;&#x4E0A;&#x6536;&#x653E;&#x81EA;&#x5982;&#x3002;</p>
<p>3&#x3001;&#x8981;&#x7279;&#x522B;&#x8003;&#x8651;&#x7684;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x8981;&#x6C42;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x6BD4;&#x5982;&#x9700;&#x8981;&#x5360;&#x636E;&#x6574;&#x5C4F;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x9700;&#x8981;&#x5B9A;&#x5728;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x600E;&#x6837;&#x8BA9;&#x5B83;&#x505A;&#x5230;&#x81F3;&#x5C11;&#x4E3B;&#x6D41;&#x673A;&#x578B;&#x90FD;&#x6B63;&#x5E38;&#xFF0C;&#x5E03;&#x5C40;&#x4E0D;&#x4F1A;&#x4E71;&#x3002;</p>
<p><strong>&#x5341;&#x3001;&#x62D2;&#x7EDD;&#x5C1D;&#x8BD5;&#x66F4;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x6CD5;&#x548C;&#x65B0;&#x9C9C;&#x4E8B;&#x7269;</strong></p>
<p>&#x6BD4;&#x5982;&#x5F53;&#x4F60;&#x4E60;&#x60EF;&#x4E86;css&#xFF0C;&#x662F;&#x5426;&#x613F;&#x610F;&#x5C1D;&#x8BD5;less&#x3001;sass&#x3001;stylus&#x7B49;&#xFF1F;&#x5F53;&#x4F60;&#x4E60;&#x60EF;&#x4E86;px&#x5355;&#x4F4D;&#xFF0C;&#x662F;&#x5426;&#x613F;&#x610F;&#x5C1D;&#x8BD5;em&#x3001;rem&#xFF1F;&#x5F53;&#x4F60;&#x4E60;&#x60EF;&#x4E86;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x5DE5;&#x5177;&#x6765;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x548C;&#x56FE;&#x7247;&#xFF0C;&#x662F;&#x5426;&#x613F;&#x610F;&#x5C1D;&#x8BD5;grunt&#x3001;gulp&#xFF0C;&#x5F53;&#x7136;&#x73B0;&#x5728;&#x8FD8;&#x6709;webpack&#x3001;browserify&#x7B49;&#x5F88;&#x591A;&#x3002;&#x662F;&#x5426;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x96EA;&#x78A7;&#x56FE;&#x3001;&#x5B57;&#x4F53;&#x56FE;&#x6807;&#x751A;&#x81F3;&#x66F4;&#x591A;&#xFF1F;&#x662F;&#x5426;&#x613F;&#x610F;&#x5C1D;&#x8BD5;&#x4E00;&#x4E9B;&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x662F;&#x5426;&#x613F;&#x610F;&#x53BB;&#x73A9;&#x4E00;&#x4E0B;css&#x7684;&#x65B0;&#x5C5E;&#x6027;&#xFF0C;&#x54EA;&#x6015;&#x8FD8;&#x6CA1;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#xFF08;chrome&#x5F00;&#x542F;&#x5B9E;&#x9A8C;&#x529F;&#x80FD;&#x53EF;&#x7528;&#x7684;&#xFF09;&#x3002;&#x5F53;&#x4F60;&#x4E60;&#x60EF;&#x4E86;dw&#xFF0C;&#x662F;&#x5426;&#x613F;&#x610F;&#x53BB;&#x5C1D;&#x8BD5;notepad++&#x3001;sublimetext&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#x66F4;&#x8F7B;&#x91CF;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5B66;&#x4E60;&#x6210;&#x672C;&#x66F4;&#x9AD8;&#x4F46;&#x53EF;&#x80FD;&#x66F4;&#x597D;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF1F;&#x5F53;&#x4F60;&#x4E60;&#x60EF;&#x4E86;&#x624B;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x7684;&#x624B;&#x8DB3;&#x591F;&#x5FEB;&#xFF0C;&#x90A3;&#x4F60;&#x662F;&#x5426;&#x613F;&#x610F;&#x7EE7;&#x7EED;&#x53BB;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x6709;&#x54EA;&#x4E9B;&#x5FEB;&#x6377;&#x64CD;&#x4F5C;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x514D;&#x53BB;&#x4E00;&#x6B21;&#x6B21;&#x7684;&#x9F20;&#x6807;&#x70B9;&#x51FB;&#x548C;&#x590D;&#x5236;&#x7C98;&#x8D34;&#xFF1F;&#x4F60;&#x8BD5;&#x8FC7;&#x5C31;&#x77E5;&#x9053;&#x6709;&#x591A;&#x597D;&#x73A9;&#xFF0C;&#x8BD5;&#x8FC7;&#x5C31;&#x4E00;&#x53D1;&#x4E0D;&#x53EF;&#x6536;&#x62FE;~</p>
<p><strong>&#x5341;&#x4E00;&#x3001;&#x60F3;&#x7701;&#x4E8B;</strong></p>
<p>&#x4E0D;&#x91CD;&#x89C6;&#x6C9F;&#x901A;&#xFF0C;&#x4E0D;&#x91CD;&#x89C6;&#x81EA;&#x67E5;&#xFF0C;&#x8BA4;&#x4E3A;&#x6CA1;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x89C6;&#x89C9;&#x7A3F;&#xFF0C;&#x770B;&#x4EA4;&#x4E92;&#x7A3F;&#xFF08;&#x6709;&#x65F6;&#x5019;&#x8FD8;&#x6CA1;&#x6709;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x7ECF;&#x9A8C;&#x53BB;&#x5224;&#x65AD;&#xFF0C;&#x53BB;&#x60F3;&#x8C61;&#x9875;&#x9762;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x5B50;&#xFF0C;&#x600E;&#x6837;&#x5408;&#x7406;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5E94;&#x8BE5;&#x662F;&#x5927;&#x591A;&#x6570;&#x516C;&#x53F8;&#x6216;&#x8005;&#x56E2;&#x961F;&#x90FD;&#x6709;&#x3002;&#x9274;&#x4E8E;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x559C;&#x597D;&#x548C;&#x7ECF;&#x9A8C;&#x4E0D;&#x540C;&#xFF0C;&#x6211;&#x4EEC;&#x60F3;&#x7684;&#x8DDF;&#x9700;&#x6C42;&#x65B9;/&#x4EA7;&#x54C1;/&#x8BBE;&#x8BA1;&#x5E08;&#x60F3;&#x7684;&#x5F88;&#x53EF;&#x80FD;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6709;&#x7591;&#x95EE;&#x6216;&#x8005;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x65F6;&#x5019;&#x5ACC;&#x9EBB;&#x70E6;&#x4E0D;&#x53BB;&#x6C9F;&#x901A;&#xFF0C;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x540E;&#x679C;&#x662F;&#xFF0C;&#x90FD;&#x505A;&#x597D;&#x4E86;&#xFF0C;&#x7ED9;&#x5230;&#x56E2;&#x961F;&#x8FDB;&#x884C;&#x8D70;&#x67E5;&#xFF0C;&#x90FD;&#x63D0;&#x51FA;&#x6765;&#x4E00;&#x5927;&#x5806;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x4F60;&#x52A8;&#x5927;&#x5200;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x8BE5;&#x4F60;&#x53EB;&#x82E6;&#x4E0D;&#x8FED;&#x4E86;&#x3002;&#x60F3;&#x7701;&#x4E8B;&#xFF0C;&#x5176;&#x5B9E;&#x7ED9;&#x81EA;&#x5DF1;&#x7559;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x540E;&#x60A3;&#xFF0C;&#x5F97;&#x4E0D;&#x507F;&#x5931;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x6D88;&#x6781;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x505A;&#x4E4B;&#x524D;&#x548C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x505A;&#x4E4B;&#x540E;&#x7684;&#x81EA;&#x67E5;&#x4E5F;&#x662F;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x96BE;&#x4EE5;&#x907F;&#x514D;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x589E;&#x51CF;&#xFF0C;&#x6CE8;&#x91CA;&#xFF0C;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x628A;&#x8FD9;&#x4E9B;&#x8FDB;&#x884C;&#x6574;&#x7406;&#x5220;&#x51CF;&#x4E86;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x867D;&#x7136;&#x6709;&#x5F88;&#x591A;&#x540C;&#x4E8B;&#x548C;&#x6D4B;&#x8BD5;&#x6765;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x4EA7;&#x51FA;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5148;&#x68C0;&#x67E5;&#x51FA;&#x6765;&#x603B;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x4E00;&#x6765;&#x4E8C;&#x53BB;&#x7684;&#x53CD;&#x9988;&#x548C;&#x53CD;&#x590D;&#x4FEE;&#x6539;&#xFF0C;&#x5BF9;&#x6211;&#x4EEC;&#x7684;&#x81EA;&#x8EAB;&#x7684;&#x5DE5;&#x4F5C;&#x4F53;&#x9A8C;&#x548C;&#x8282;&#x594F;&#x4E5F;&#x662F;&#x6709;&#x597D;&#x5904;&#x3002;</p>
<p><strong>&#x5341;&#x4E8C;&#x3001;&#x5728;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#x5730;&#x65B9;&#x627E;&#x95EE;&#x9898;</strong></p>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x72AF;&#x4E00;&#x4E9B;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x662F;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x7B26;&#x53F7;&#x4E0D;&#x5C0F;&#x5FC3;&#x6F0F;&#x5199;&#x4E86;&#xFF0C;&#x5220;&#x9664;&#x4E86;&#xFF0C;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x5B9A;&#x4E49;&#x4E86;&#x53E6;&#x5916;&#x7684;&#x89C4;&#x5219;&#x628A;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x8986;&#x76D6;&#x4E86;&#xFF0C;&#x6539;&#x9519;&#x6587;&#x4EF6;&#x4E86;&#x3002;&#x6216;&#x8005;&#x56E0;&#x4E3A;&#x5BF9;&#x67D0;&#x4E2A;&#x5C5E;&#x6027;&#x53EA;&#x662F;&#x5B57;&#x9762;&#x4E0A;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6CA1;&#x6709;&#x7406;&#x89E3;&#x672C;&#x8D28;&#xFF0C;&#x7528;&#x7684;&#x65F6;&#x5019;&#x8D77;&#x4E0D;&#x4E86;&#x4F5C;&#x7528;&#xFF0C;&#x7136;&#x540E;&#x6392;&#x67E5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6CA1;&#x6709;&#x9488;&#x5BF9;&#x6027;&#xFF0C;&#x4E71;&#x67E5;&#xFF0C;&#x8981;&#x4E48;&#x5220;&#x70B9;&#x4EE3;&#x7801;&#xFF0C;&#x8981;&#x4E48;&#x5927;&#x5E45;&#x5EA6;&#x7684;&#x4FEE;&#x6539;&#x6570;&#x503C;&#x60F3;&#x66B4;&#x9732;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x5F80;&#x4E8B;&#x4E0E;&#x613F;&#x8FDD;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x65B9;&#x6CD5;&#x4E0D;&#x5BF9;&#x4E86;&#x3002;</p>
<p>&#x600E;&#x6837;&#x80FD;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x627E;&#x95EE;&#x9898;&#x5462;&#xFF1F;&#x6211;&#x89C9;&#x5F97;&#x4E0B;&#x9762;&#x51E0;&#x70B9;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;</p>
<p>1&#x3001;&#x7531;&#x7ECF;&#x9A8C;&#x5224;&#x65AD;&#xFF0C;&#x54EA;&#x91CC;&#x6700;&#x53EF;&#x80FD;&#x6709;&#x95EE;&#x9898;&#x6216;&#x8005;&#x56DE;&#x5FC6;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x64CD;&#x4F5C;&#x4E0D;&#x5F53;&#x7684;&#x5730;&#x65B9;</p>
<p>2&#x3001;&#x517B;&#x6210;&#x597D;&#x7684;&#x7F16;&#x7801;&#x4E60;&#x60EF;&#xFF0C;&#x4E0D;&#x72AF;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#x7ED9;&#x81EA;&#x5DF1;&#x6316;&#x5751;</p>
<p>3&#x3001;&#x7F16;&#x7A0B;&#x5DE5;&#x5177;&#x6709;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;</p>
<p>4&#x3001;&#x67E5;&#x770B;&#x63A7;&#x5236;&#x53F0;&#x62A5;&#x9519;</p>
<p>5&#x3001;&#x9009;&#x62E9;&#x6027;&#x6CE8;&#x91CA;&#x4EE3;&#x7801;&#x6765;&#x66B4;&#x9732;&#x95EE;&#x9898;&#x4EE3;&#x7801;&#x6BB5;</p>
<p><strong>&#x5341;&#x4E09;&#x3001;&#x53EA;&#x60F3;&#x628A;&#x4E8B;&#x60C5;&#x505A;&#x5BF9;&#xFF0C;&#x6CA1;&#x60F3;&#x7740;&#x505A;&#x597D;</strong></p>
<p>&#x4E3E;&#x4E2A;&#x6781;&#x7AEF;&#x4E00;&#x70B9;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x8DDF;&#x540C;&#x4E8B;&#x66FE;&#x7ECF;&#x73A9;&#x7B11;&#x7684;&#x8C08;&#x8BBA;&#x4E86;&#x4E00;&#x4E0B;&#x6807;&#x7B7E;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x8BF4;&#x5C31;&#x7B97;&#x662F;&#x4F60;&#x6574;&#x4E2A;&#x7F51;&#x7AD9;&#x5168;&#x90FD;&#x7528;&#x4E00;&#x79CD;&#x6807;&#x7B7E;&#x53BB;&#x5199;&#xFF0C;&#x90A3;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x5199;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ECE;&#x8868;&#x73B0;&#x7C7B;&#x522B;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x5206;&#x4E3A;&#x201C;&#x884C;&#x5185;&#x201D;&#x548C;&#x201C;&#x5757;&#x7EA7;&#x201D;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;display&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x5B83;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x4E86;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x7684;&#x9875;&#x9762;&#x5E94;&#x8BE5;&#x4E5F;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;&#x597D;&#x50CF;&#x4E5F;&#x6CA1;&#x9519;&#x662F;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x80AF;&#x5B9A;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x603B;&#x4F1A;&#x505A;&#x5F88;&#x591A;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x7684;&#x201C;&#x5BF9;&#x201D;&#x7684;&#x4E8B;&#xFF0C;&#x4F46;&#x8FDC;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x79D1;&#x5B66;&#x3001;&#x5408;&#x7406;&#x3002;</p>
<p>&#x4EBA;&#x4EBA;&#x90FD;&#x66F4;&#x52A0;&#x613F;&#x610F;&#x8C08;&#x81EA;&#x5DF1;&#x64C5;&#x957F;&#x7684;&#x65B0;&#x4E1C;&#x897F;&#xFF0C;&#x597D;&#x73A9;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x9AD8;&#x7EA7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x67D0;&#x79CD;&#x6280;&#x5DE7;&#x7B49;&#xFF0C;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x5199;&#x8FD9;&#x4E48;&#x4E00;&#x7BC7;&#x6587;&#x6765;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x505A;&#x8FC7;&#x7684;&#x77EC;&#x4E8B;&#x5462;&#xFF1F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x662F;&#x4ECE;&#x65E0;&#x77E5;&#x5230;&#x6709;&#x77E5;&#xFF0C;&#x4ECE;&#x505A;&#x5F97;&#x5DEE;&#x5230;&#x505A;&#x5F97;&#x597D;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x79CD;&#x74F6;&#x9888;&#xFF0C;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x5BF9;&#x6BD4;&#xFF0C;&#x6CA1;&#x6709;&#x53BB;&#x63A5;&#x89E6;&#x66F4;&#x597D;&#xFF0C;&#x66F4;&#x5E7F;&#x9614;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6CA1;&#x6709;&#x8DDF;&#x5916;&#x754C;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x4EA4;&#x6D41;&#xFF0C;&#x5C31;&#x6BD4;&#x8F83;&#x96BE;&#x53D1;&#x73B0;&#x81EA;&#x8EAB;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x52C7;&#x4E8E;&#x53BB;&#x4E3B;&#x52A8;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x603B;&#x7ED3;&#x601D;&#x8003;&#xFF0C;&#x52A0;&#x4EE5;&#x6539;&#x8FDB;&#xFF0C;&#x5C31;&#x80FD;&#x4ECE;&#x4E2D;&#x5B66;&#x5230;&#x4E1C;&#x897F;&#xFF0C;&#x5F97;&#x5230;&#x63D0;&#x5347;&#x3002;&#x6211;&#x5199;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5E94;&#x8BE5;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x540C;&#x6837;&#x9047;&#x5230;&#x8FC7;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x7ECF;&#x5386;&#x5E94;&#x8BE5;&#x90FD;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x8D77;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x53C2;&#x8003;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x8BE5;&#x544A;&#x4E00;&#x6BB5;&#x843D;&#x4E86;&#x54C8;&#xFF0C;&#x4EE5;&#x540E;&#x5E94;&#x8BE5;&#x8FD8;&#x4F1A;&#x5E72;&#x66F4;&#x591A;&#x77EC;&#x4E8B;&#xFF0C;&#x54C8;&#x3002;&#x6709;&#x9700;&#x8981;&#x4EA4;&#x6D41;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x627E;&#x6211;&#xFF0C;&#x76F8;&#x4E92;&#x5B66;&#x4E60;&#xFF0C;&#x4FC3;&#x8FDB;&#x8FDB;&#x6B65;~</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/总结/" rel="tag">#总结</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/09/13/zuiniu-birth/" rel="next" title="醉牛前端诞生记">
                <i class="fa fa-chevron-left"></i> 醉牛前端诞生记
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/10/23/zaoduke-visit/" rel="prev" title="前端早读课专访">
                前端早读课专访 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://f2er.club/" target="_blank">醉牛前端导航</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
