<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="CSS," />





  <link rel="alternate" href="/atom.xml" title="灵感的小窝" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x5148;&amp;#x8BF4;&amp;#x4E24;&amp;#x53E5;&amp;#x95F2;&amp;#x8BDD;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x53EB;&amp;#x518D;&amp;#x8C08;&amp;#x5462;&amp;#xFF1F;&amp;#x56E0;&amp;#x4E3A;&amp;#x4EE5;&amp;#x524D;&amp;#x6709;&amp;#x8C08;&amp;#x8FC7;&amp;#xFF0C;&amp;#x8BF7;&amp;#x770B;">
<meta property="og:type" content="article">
<meta property="og:title" content="再谈css">
<meta property="og:url" content="http://yoursite.com/2015/06/22/再谈css/index.html">
<meta property="og:site_name" content="灵感的小窝">
<meta property="og:description" content="&amp;#x5148;&amp;#x8BF4;&amp;#x4E24;&amp;#x53E5;&amp;#x95F2;&amp;#x8BDD;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x53EB;&amp;#x518D;&amp;#x8C08;&amp;#x5462;&amp;#xFF1F;&amp;#x56E0;&amp;#x4E3A;&amp;#x4EE5;&amp;#x524D;&amp;#x6709;&amp;#x8C08;&amp;#x8FC7;&amp;#xFF0C;&amp;#x8BF7;&amp;#x770B;">
<meta property="og:updated_time" content="2016-02-24T12:56:02.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="再谈css">
<meta name="twitter:description" content="&amp;#x5148;&amp;#x8BF4;&amp;#x4E24;&amp;#x53E5;&amp;#x95F2;&amp;#x8BDD;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x53EB;&amp;#x518D;&amp;#x8C08;&amp;#x5462;&amp;#xFF1F;&amp;#x56E0;&amp;#x4E3A;&amp;#x4EE5;&amp;#x524D;&amp;#x6709;&amp;#x8C08;&amp;#x8FC7;&amp;#xFF0C;&amp;#x8BF7;&amp;#x770B;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 再谈css | 灵感的小窝 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感的小窝</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                再谈css
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-06-22T00:00:00+08:00" content="2015-06-22">
              2015-06-22
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5148;&#x8BF4;&#x4E24;&#x53E5;&#x95F2;&#x8BDD;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x53EB;&#x518D;&#x8C08;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x4EE5;&#x524D;&#x6709;&#x8C08;&#x8FC7;&#xFF0C;&#x8BF7;&#x770B;&#x8FD9;&#x91CC;<a href="http://ideazhao.com/2014/08/16/%E5%88%9D%E8%B0%88%E6%80%8E%E6%A0%B7%E6%9B%B4%E5%A5%BD%E7%9A%84%E5%8E%BB%E8%A7%84%E5%88%92CSS/" target="_blank" rel="external">&#x521D;&#x8C08;&#x600E;&#x6837;&#x66F4;&#x597D;&#x7684;&#x53BB;&#x89C4;&#x5212;CSS</a></p>
<p>&#x65F6;&#x95F4;&#x5DEE;&#x4E0D;&#x591A;&#x662F;&#x4E00;&#x5E74;&#x524D;&#xFF0C;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x8FD8;&#x6CA1;&#x6709;&#x6362;&#x5DE5;&#x4F5C;&#xFF0C;&#x516C;&#x53F8;&#x5C31;&#x6211;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#xFF0C;&#x8D1F;&#x8D23;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6240;&#x6709;&#x524D;&#x7AEF;&#x76F8;&#x5173;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8BF4;&#x662F;&#x8FD9;&#x6837;&#x8BF4;&#xFF0C;&#x6211;&#x662F;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x53BB;&#x987E;&#x53CA;&#x90A3;&#x4E48;&#x591A;&#x7684;&#xFF0C;&#x81EA;&#x5DF1;&#x61C2;&#x7684;&#x6216;&#x8005;&#x610F;&#x8BC6;&#x5230;&#x7684;&#x4E1C;&#x897F;&#x672C;&#x8EAB;&#x5C31;&#x6709;&#x9650;&#xFF0C;&#x53EA;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6298;&#x817E;&#xFF0C;&#x603B;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x65F6;&#x5019;&#x4EE3;&#x7801;&#x5199;&#x5F97;&#x81EA;&#x5DF1;&#x90FD;&#x5FCD;&#x65E0;&#x53EF;&#x5FCD;&#xFF0C;&#x6709;&#x75DB;&#x5C31;&#x6709;&#x9886;&#x609F;&#xFF0C;&#x81EA;&#x7136;&#x5C31;&#x80FD;&#x603B;&#x7ED3;&#x51FA;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x90A3;&#x7BC7;&#x521D;&#x8C08;&#x3002;&#x5F53;&#x65F6;&#x5199;&#x5B8C;&#x4E4B;&#x540E;&#x86EE;&#x6709;&#x6210;&#x5C31;&#x611F;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x6765;&#x8FD8;&#x662F;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x8DB3;&#xFF0C;&#x56E0;&#x4E3A;&#x662F;&#x521D;&#x8C08;&#xFF0C;&#x4E3A;&#x7167;&#x987E;&#x4E00;&#x4E9B;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x5305;&#x542B;&#x4E86;&#x591A;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E00;&#x5E74;&#x8FC7;&#x53BB;&#x4E86;&#xFF0C;&#x524D;&#x6BB5;&#x65F6;&#x95F4;&#x5728;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x6B21;css&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x501F;&#x6B64;&#x673A;&#x4F1A;&#x518D;&#x8C08;&#x8C08;&#x5427;&#xFF0C;&#x867D;&#x7136;&#x4F9D;&#x65E7;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x8DB3;~</p>
<h2 id="&#x9009;&#x62E9;&#x5668;"><a href="#&#x9009;&#x62E9;&#x5668;" class="headerlink" title="&#x9009;&#x62E9;&#x5668;"></a>&#x9009;&#x62E9;&#x5668;</h2><p>&#x8FD9;&#x662F;css&#x7684;&#x6C38;&#x6052;&#x8BDD;&#x9898;&#xFF0C;&#x4E5F;&#x662F;&#x6838;&#x5FC3;&#x8BDD;&#x9898;&#x3002;&#x4F46;&#x8FD9;&#x91CC;&#x5982;&#x679C;&#x7F57;&#x5217;&#x51FA;&#x6765;&#x5C31;&#x6CA1;&#x610F;&#x601D;&#x4E86;&#xFF0C;&#x4E0D;&#x5982;&#x5927;&#x5BB6;&#x53BB;&#x770B;&#x6587;&#x6863;~</p>
<p><strong>&#x5143;&#x7D20;&#x3001;&#x7C7B;&#x3001;id&#x3001;&#x5B50;&#x9009;&#x62E9;&#x5668;&#x3001;&#x540E;&#x4EE3;&#x9009;&#x62E9;&#x5668;&#x3001;&#x5144;&#x5F1F;&#x9009;&#x62E9;&#x5668;&#x3001;&#x5C5E;&#x6027;&#x9009;&#x62E9;&#x5668;&#x3001;&#x4F2A;&#x7C7B;&#x9009;&#x62E9;&#x5668;&#x3001;&#x4F2A;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x3001;&#x7FA4;&#x7EC4;&#x9009;&#x62E9;&#x5668;</strong></p>
<p>&#x5728;&#x8FD9;&#x4E00;&#x5806;&#x9009;&#x62E9;&#x5668;&#x4E2D;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x5462;&#xFF1F;&#x8001;&#x751F;&#x5E38;&#x8C08;&#x7684;&#x4E1C;&#x897F;&#x54B1;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#xFF0C;&#x8BF4;&#x8BF4;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x6709;&#x76CA;&#x505A;&#x6CD5;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8981;&#x660E;&#x786E;&#x7684;&#x662F;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;&#xFF1F;&#x5B83;&#x662F;css&#x548C;html&#x4E4B;&#x95F4;&#x6C9F;&#x901A;&#x7684;&#x6865;&#x6881;&#x3002; &#x65E2;&#x7136;&#x8DDF;html&#x6709;&#x5173;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x8C08;&#x8C08;html&#xFF0C;&#x53C8;&#x548C;&#x4EC0;&#x4E48;&#x6709;&#x5173;&#x5462;&#xFF1F;&#x548C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x9875;&#x9762;&#x6709;&#x5173;&#xFF0C;&#x597D;&#x7684;&#xFF0C;&#x90A3;&#x5C31;&#x5230;&#x4E86;&#x89C6;&#x89C9;&#x7A3F;&#x3002;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x8BCD;&#x6765;&#x5F62;&#x5BB9;&#x770B;&#x89C6;&#x89C9;&#x7A3F;&#x7684;&#x611F;&#x89C9;&#x2014;&#x2014;&#x201C;&#x5E96;&#x4E01;&#x89E3;&#x725B;&#x201D;&#x3002;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#xFF1F;</p>
<p>&#x5B83;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x90E8;&#x5206;&#xFF1A;&#x9876;&#x90E8;&#x3001;&#x5934;&#x90E8;&#x3001;&#x5BFC;&#x822A;&#x3001;&#x4FA7;&#x8FB9;&#x680F;&#x3001;banner&#x533A;&#x3001;&#x5217;&#x8868;&#x3001;&#x5E95;&#x90E8;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x5927;&#x7684;&#x533A;&#x5757;&#x3002; &#x81F3;&#x5C11;&#x5230;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x80FD;&#x770B;&#x5230;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x7684;css&#x80FD;&#x5927;&#x81F4;&#x5212;&#x5206;&#x591A;&#x5C11;&#x5927;&#x5757;&#xFF0C;&#x80FD;&#x628A;&#x201C;&#x5BBD;&#x5EA6;&#x3001;&#x5C45;&#x4E2D;&#x3001;&#x6D6E;&#x52A8;&#x3001;&#x6587;&#x672C;&#x4F4D;&#x7F6E;&#x3001;&#x5B57;&#x4F53;&#x7C7B;&#x578B;&#x3001;&#x989C;&#x8272;&#x201D;&#x7B49;&#x5265;&#x79BB;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x518D;&#x7EC6;&#x770B;&#xFF0C;&#x7EE7;&#x7EED;&#x627E;&#x5171;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x201C;&#x5706;&#x89D2;&#x3001;&#x8FB9;&#x6846;&#x3001;&#x80CC;&#x666F;&#x3001;&#x9634;&#x5F71;&#x201D;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x627E;&#x4E0D;&#x540C;&#xFF0C;&#x88AB;&#x6211;&#x4EEC;&#x5265;&#x79BB;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5728;&#x54EA;&#x4E9B;&#x533A;&#x5757;&#x662F;&#x6709;&#x7279;&#x6B8A;&#x6027;&#x7684;&#xFF1F;</p>
<p>&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x2014;&#x2014;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x589E;&#x5F3A;&#x590D;&#x7528;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x4E2A;&#x5730;&#x65B9;&#x7528;&#x4E00;&#x5957;&#x72EC;&#x7ACB;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x5171;&#x540C;&#x7684;&#x89C4;&#x5219;&#x4E66;&#x5199;&#x5F88;&#x591A;&#x904D;&#x3002;&#x53EF;&#x4EE5;&#x628A;&#x5171;&#x540C;&#x7684;&#x90E8;&#x5206;&#x5199;&#x6210;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x7C7B;&#xFF0C;&#x7279;&#x6B8A;&#x7684;&#x89C4;&#x5219;&#x518D;&#x53E6;&#x5916;&#x5B9A;&#x4E49;&#xFF0C;&#x6B64;&#x6240;&#x8C13;&#x201C;&#x57FA;&#x7C7B; &#x6269;&#x5C55;&#x7C7B; &#x5B9E;&#x4F8B;&#x7C7B;&#x201D;&#x3002;</p>
<p>&#x597D;&#x7684;&#xFF0C;&#x6839;&#x636E;&#x9875;&#x9762;&#x7ED3;&#x6784;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6210;&#x529F;&#x7684;&#x628A;&#x5B83;&#x4EEC;&#x62C6;&#x89E3;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x8981;&#x505A;&#x597D;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x2014;&#x2014;&#x89E3;&#x8026;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF0C;&#x9996;&#x5148;html&#x7684;&#x6807;&#x7B7E;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x8981;&#x5C3D;&#x91CF;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x91CC;&#x9762;&#x7528;&#x5230;&#x76F8;&#x540C;&#x6807;&#x7B7E;&#x7684;&#x5730;&#x65B9;&#x53EF;&#x80FD;&#x5C31;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;h1~h6&#x3001;ul&#x3001;p&#x3001;span&#x7B49;&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x6765;&#x5B9A;&#x4E49;&#x89C4;&#x5219;&#xFF1A;</p>
<p>1&#x3001; &#x5982;&#x679C;&#x6211;&#x4EEC;&#x89C9;&#x5F97;&#x90A3;&#x4E2A;&#x5143;&#x7D20;&#x53EF;&#x80FD;&#x4E0D;&#x5408;&#x9002;&#x5462;&#xFF0C;&#x8981;&#x6362;&#x6389;&#xFF0C;css&#x4E5F;&#x8981;&#x6539;&#x4E86;&#x3002;</p>
<p>2&#x3001; &#x5982;&#x679C;&#x8981;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x79CD;&#x6807;&#x7B7E;&#x5374;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x6837;&#x5F0F;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x8981;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E00;&#x6761;&#x89C4;&#x5219;&#xFF0C;&#x6216;&#x8005;&#x88AB;&#x8FEB;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x4E5F;&#x8BB8;&#x80FD;&#x591F;&#x6682;&#x65F6;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#xFF0C;&#x4F46;&#x7075;&#x6D3B;&#x6027;&#x662F;&#x5F88;&#x5DEE;&#x7684;&#xFF0C;&#x4E07;&#x4E00;&#x53C8;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x5C31;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5E38;&#x5E38;&#x63D0;&#x5230;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4E0D;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x4E5F;&#x4F1A;&#x589E;&#x52A0;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x5212;&#x5206;&#x597D;&#x7684;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x547D;&#x540D;&#xFF0C;&#x589E;&#x5F3A;&#x53EF;&#x8BFB;&#x6027;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x4E5F;&#x5F88;&#x597D;&#x7684;&#x907F;&#x514D;&#x4E86;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x597D;&#xFF0C;&#x63A5;&#x7740;&#x8BF4;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x8C08;&#x5230;&#x5D4C;&#x5957;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x822C;&#x8BF4;&#x6CD5;&#x662F;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x591A;&#x4E8E;&#x4E09;&#x5C42;&#x6216;&#x8005;&#x56DB;&#x5C42;&#xFF0C;&#x610F;&#x4E49;&#x5728;&#x4E8E;&#x54EA;&#x91CC;&#x5462;&#xFF1F;&#x8FD9;&#x5F97;&#x4ECE;css&#x7684;&#x89E3;&#x6790;&#x65B9;&#x5F0F;&#x8BF4;&#x8D77;&#xFF0C;&#x5B83;&#x662F;&#x4ECE;&#x6700;&#x53F3;&#x7AEF;&#x5F80;&#x5DE6;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x7684;&#xFF0C;&#x5C42;&#x8FC7;&#x591A;&#x81EA;&#x7136;&#x4F1A;&#x8017;&#x6389;&#x66F4;&#x591A;&#x89E3;&#x6790;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E5F;&#x540C;&#x6837;&#x8DDF;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x90A3;&#x4E2A;&#x543B;&#x5408;&#xFF0C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x56E0;&#x4E3A;&#x89E3;&#x8026;&#x624D;&#x4E0D;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x6700;&#x53F3;&#x4E00;&#x5C42;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x4F1A;&#x904D;&#x5386;&#x5B8C;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x540C;&#x7C7B;&#x5143;&#x7D20;&#xFF0C;&#x518D;&#x5F80;&#x4E0A;&#x5BFB;&#x627E;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x9020;&#x6210;&#x4E86;&#x672C;&#x6765;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x54EA;&#x4E9B;css2.1&#x7684;&#x9009;&#x62E9;&#x5668;&#x53EF;&#x4EE5;&#x53D1;&#x6325;&#x5999;&#x7528;&#x5462;&#xFF1F;</p>
<p>&#x6BD4;&#x5982;&#xFF1A;&#x5144;&#x5F1F;&#x9009;&#x62E9;&#x5668;&#x201C;+/~&#x201D;&#x3001;&#x4F2A;&#x7C7B;&#x9009;&#x62E9;&#x5668;&#x2019;:selector&#x2019;&#x3001;&#x4F2A;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x2019;::selector&#x2019;&#x3001;&#x7FA4;&#x7EC4;&#x9009;&#x62E9;&#x5668;&#x201D;.a.b.c&#x201D; &#x76F8;&#x6BD4;css2.1&#xFF0C;css3&#x65B0;&#x52A0;&#x5165;&#x7684;&#x4E1C;&#x897F;&#x7684;&#x786E;&#x662F;&#x8BA9;&#x4EBA;&#x5174;&#x594B;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x9009;&#x62E9;&#x5668;&#x548C;&#x4E00;&#x4E9B;&#x4F2A;&#x7C7B;&#x3001;&#x4F2A;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x80FD;&#x591F;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x7684;&#x53BB;&#x63A7;&#x5236;&#x9875;&#x9762;&#x6837;&#x5F0F;&#xFF0C;&#x51CF;&#x5C11;&#x7ED9;html&#x6253;&#x7684;&#x8865;&#x4E01;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x9650;&#x5236;&#x7528;&#x6237;&#x884C;&#x4E3A;&#xFF0C;&#x6BD4;&#x5982;selection&#x3001;resize&#x7B49;&#x3002;</p>
<p>Css4&#x9009;&#x62E9;&#x5668;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;css3&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x7EE7;&#x7EED;&#x52A0;&#x5F3A;&#xFF0C;&#x5177;&#x4F53;&#x4E0D;&#x7EC6;&#x8C08;&#x3002;&#x7ED9;&#x51FA;&#x4E24;&#x4E2A;&#x94FE;&#x63A5;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x770B;&#x3002;</p>
<p><a href="http://css4-selectors.com/selectors/" target="_blank" rel="external">css4-selectors</a></p>
<p><a href="http://dev.w3.org/csswg/selectors-4/" target="_blank" rel="external">w3 selectors-4</a></p>
<p>&#x4EE5;&#x4E0A;&#x7ED3;&#x5408;&#x9875;&#x9762;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x8C08;&#x4E86;&#x4E00;&#x4E0B;&#xFF0C;&#x7528;&#x4EC0;&#x4E48;&#x9009;&#x62E9;&#x5668;&#x548C;&#x600E;&#x4E48;&#x7528;&#xFF0C;&#x4EE3;&#x7801;&#x600E;&#x4E48;&#x7EC4;&#x7EC7;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x518D;&#x7B80;&#x5355;&#x8C08;&#x8C08;&#x5DE5;&#x5177;&#x3001;&#x6846;&#x67B6;&#x548C;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x70B9;&#xFF1A;</p>
<p><strong>1&#x3001; &#x7528;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;</strong></p>
<p>&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<p>&#x9884;&#x5904;&#x7406;&#x5DE5;&#x5177;less&#x3001;sass&#x3001;stylus&#xFF0C;&#x7F16;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5199;css&#xFF0C;&#x6709;&#x53D8;&#x91CF;&#x3001;&#x5D4C;&#x5957;&#x3001;&#x51FD;&#x6570;&#x3001;&#x6761;&#x4EF6;&#x3001;&#x7B97;&#x672F;&#x3001;&#x8BCD;&#x6CD5;&#x4F5C;&#x7528;&#x57DF;&#x7B49;&#x7B49;</p>
<p><a href="https://github.com/less/ http://www.lesscss.net/" target="_blank" rel="external">Less</a>&#x3001;<a href="http://sass-lang.com/ https://github.com/sass/sass" target="_blank" rel="external">Sass</a><br>&#x3001;<a href="http://www.w3cplus.com/sassguide/" target="_blank" rel="external">sassguide</a>&#x3001;<a href="https://github.com/stylus/stylus http://www.zhangxinxu.com/jq/stylus/" target="_blank" rel="external">Stylus</a></p>
<p>&#x66F4;&#x591A;&#x5DE5;&#x5177;: <a href="http://www.oschina.net/news/22745/8-css-preprocessors-speed" target="_blank" rel="external">http://www.oschina.net/news/22745/8-css-preprocessors-speed</a></p>
<p>&#x540E;&#x5904;&#x7406;&#x5DE5;&#x5177;Autoprefixer&#x3001;Css Grace</p>
<p>&#x7528;&#x5904;</p>
<ul>
<li><p>&#x4E0D;&#x6539;&#x53D8;css&#x539F;&#x751F;&#x5199;&#x6CD5;</p>
</li>
<li><p>IE hack&#x5904;&#x7406;&#x517C;&#x5BB9;</p>
</li>
<li><p>&#x6DFB;&#x52A0;css3&#x524D;&#x7F00;</p>
</li>
<li><p>&#x68C0;&#x67E5;&#x9519;&#x8BEF;&#xFF08;&#x54EA;&#x4E9B;&#x8BEF;&#x7528;&#xFF1F;&#x4F8B;&#x5982;&#xFF1A;float: left/right &#x6216;&#x8005; position: absolute &#x540E;&#x8FD8;&#x5199;&#x4E0A; display: block;&#x66F4;&#x591A;&#x8BF7;&#x6233;<a href="http://www.zhihu.com/question/20979831" target="_blank" rel="external">&#x54EA;&#x4E9B;&#x8BEF;&#x7528;</a></p>
</li>
</ul>
<p><a href="https://github.com/cssdream/cssgrace" target="_blank" rel="external">CSS Grace</a></p>
<p><a href="https://github.com/postcss/autoprefixer" target="_blank" rel="external">Autoprefixer</a></p>
<p>&#x8FD8;&#x6709;&#x4EE3;&#x7801;&#x683C;&#x5F0F;&#x5316;&#x5DE5;&#x5177;&#x3001;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x5DE5;&#x5177;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5199;&#x51FA;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x8C08;&#x5230;&#x5DE5;&#x5177;&#x4E86;&#xFF0C;&#x8981;&#x8BF4;&#x7684;&#x4E00;&#x70B9;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x505A;&#x6280;&#x672F;&#x7684;&#x8981;&#x6562;&#x4E8E;&#x3001;&#x4E50;&#x4E8E;&#x5C1D;&#x8BD5;&#xFF0C;&#x73B0;&#x5728;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x4E60;&#x60EF;&#x4E8E;&#x5199;css&#xFF0C;&#x800C;&#x4E0D;&#x53BB;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4E0D;&#x89C9;&#x5F97;&#x5B83;&#x4EEC;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF0C;&#x53CD;&#x800C;&#x89C9;&#x5F97;&#x5B66;&#x4E60;&#x8D77;&#x6765;&#x9EBB;&#x70E6;&#xFF0C;&#x8FD8;&#x6709;&#x4E9B;&#x670B;&#x53CB;&#xFF0C;&#x63A5;&#x89E6;&#x4E00;&#x4E0B;&#xFF0C;&#x77E5;&#x9053;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x53EF;&#x5D4C;&#x5957;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x89C9;&#x5F97;&#x592A;&#x590D;&#x6742;&#x6CA1;&#x505A;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x653E;&#x5F03;&#x4E86;&#xFF0C;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x548C;&#x5DE5;&#x5177;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x8BDD;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5BF9;&#x81EA;&#x5DF1;&#x6280;&#x672F;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x7684;&#x4F18;&#x5316;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x4E0D;&#x5229;&#x7684;&#x3002;&#x5176;&#x5B9E;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x90A3;&#x4E48;&#x590D;&#x6742;&#xFF0C;&#x597D;&#x5904;&#x5374;&#x662F;&#x5927;&#x5927;&#x7684;&#x3002;</p>
<p><strong>2&#x3001; &#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;</strong></p>
<p>&#x6216;&#x8BB8;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x80FD;&#x8131;&#x53E3;&#x800C;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x662F;bootstrap&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x7ED9;&#x5B83;&#x6253;&#x5E7F;&#x544A;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;&#x5462;&#xFF1F;&#x9996;&#x5148;&#x8FD8;&#x662F;&#x8282;&#x7701;&#x4E86;&#x65F6;&#x95F4;&#xFF0C;&#x4E0D;&#x518D;&#x505A;&#x91CD;&#x590D;&#x52B3;&#x52A8;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x5B83;&#x662F;&#x505A;&#x8FC7;&#x4E86;&#x5404;&#x79CD;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x96C6;&#x5927;&#x5BB6;&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x7ECF;&#x8FC7;&#x8003;&#x9A8C;&#x7684;&#xFF0C;&#x5BF9;&#x5F88;&#x591A;&#x8BBE;&#x5907;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x90FD;&#x9002;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x6709;&#x5B83;&#x7684;&#x4E00;&#x5957;UI&#x8BBE;&#x8BA1;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x7701;&#x53BB;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x52B3;&#x52A8;&#x3002;</p>
<p><strong>3&#x3001; &#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x70B9;</strong></p>
<p>a&#x3001; &#x6587;&#x4EF6;&#x4E2A;&#x6570;&#x548C;&#x5927;&#x5C0F;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5C31;&#x4F1A;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x4E0D;&#x5B9C;&#x8FC7;&#x591A;&#xFF0C;&#x4E00;&#x822C;&#x4EE5;&#x4E0D;&#x8D85;&#x8FC7;&#x56DB;&#x4E2A;&#x4E3A;&#x5B9C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x53EF;&#x80FD;&#x7528;&#x5230;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x53D1;&#x5E03;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x548C;&#x538B;&#x7F29;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x3002;</p>
<p>b&#x3001; &#x6587;&#x4EF6;&#x662F;&#x5426;&#x6709;&#x52A0;&#x8F7D;&#x7684;&#x5FC5;&#x8981;&#xFF1F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5E38;&#x89C1;&#x4E8E;&#x9700;&#x8981;&#x517C;&#x5BB9;&#x4F4E;&#x7248;&#x672C;IE&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x662F;&#x76F4;&#x63A5;&#x5199;css hack&#x5728;&#x6587;&#x4EF6;&#x91CC;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x9879;&#x76EE;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x90A3;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x4E3A;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x5668;&#x4EE5;&#x53CA;&#x9AD8;&#x7248;&#x672C;&#x6D4F;&#x89C8;&#x5668;&#x53BB;&#x52A0;&#x8F7D;&#x517C;&#x5BB9;&#x4EE3;&#x7801;&#x3002;&#x4E00;&#x822C;&#x503E;&#x5411;&#x4E8E;&#x5199;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#x8BED;&#x53E5;&#x6765;&#x9009;&#x62E9;&#x6027;&#x52A0;&#x8F7D;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;IE10&#x4E0D;&#x8BC6;&#x522B;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#x7ED9;&#x51FA;&#x4E86;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x4E00;&#x4E0B;<a href="http://www.stepday.com/topic/?690" target="_blank" rel="external">IE10&#x4E0D;&#x8BC6;&#x522B;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</a></p>
<h2 id="Css&#x7684;&#x51FA;&#x8F68;"><a href="#Css&#x7684;&#x51FA;&#x8F68;" class="headerlink" title="Css&#x7684;&#x51FA;&#x8F68;"></a>Css&#x7684;&#x51FA;&#x8F68;</h2><p>&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x968F;&#x7740;css3&#x7684;&#x8086;&#x8650;&#xFF0C;&#x5F88;&#x591A;&#x6548;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x7528;ps&#x6765;&#x505A;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;border-radius&#x3001;box-shadow&#x3001;opacity&#x3001;filter&#x3001;text-fill-color&#x3001;text-stroke&#x3001;box-reflect&#x7B49;&#xFF0C;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x5C31;&#x80FD;&#x5199;&#x51FA;&#x5F88;&#x591A;&#x597D;&#x770B;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4E5F;&#x589E;&#x52A0;&#x4E86;&#x7075;&#x6D3B;&#x6027;&#x3002;</p>
<p>&#x6837;&#x5F0F;&#x6027;&#x6807;&#x7B7E;&#x6DE1;&#x51FA;&#x5386;&#x53F2;&#x821E;&#x53F0;&#xFF0C;&#x5982;&#xFF1A;&#x5C45;&#x4E2D;&#x3001;&#x52A0;&#x7C97;&#x3002;</p>
<p>&#x52A8;&#x6548;&#x6807;&#x7B7E;css&#x66FF;&#x4EE3;&#xFF0C;&#x5982;&#x95EA;&#x70C1;&#x3001;&#x8DD1;&#x9A6C;&#x706F;&#x3002;</p>
<p>&#x8054;&#x59FB;js&#x52A8;&#x8D77;&#x6765;transform&#x3001;transition&#x3001;animation</p>
<p>&#x65E2;&#x7136;css&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x7075;&#x6D3B;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x7684;&#x4E00;&#x4E2A;&#x8BDD;&#x9898;&#x5C31;&#x662F;&#x201C;&#x7EAF;css&#x201D;&#x5B9E;&#x73B0;&#xFF0C;&#x5F88;&#x591A;&#x5E74;&#x4E86;&#xFF0C;&#x9AD8;&#x9891;&#x4E2D;&#x67AA;&#x7684;&#x6709;&#xFF1A;&#x4E8C;&#x7EA7;&#x5BFC;&#x822A;&#x3001;tab&#x5207;&#x6362;&#x3001;&#x624B;&#x98CE;&#x7434;&#x3001;&#x8F6E;&#x64AD;&#x56FE;&#x7B49;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x7EAF;css&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x5904;&#xFF1F;&#x9996;&#x5148;&#x4F60;&#x4E0D;&#x4F1A;js&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x80AF;&#x5B9A;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x8BF4;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x662F;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x66F4;&#x5BB9;&#x6613;&#x63A7;&#x5236;&#xFF0C;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x4F1A;&#x66F4;&#x5C0F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x51E1;&#x4E8B;&#x7686;&#x9700;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x6743;&#x8861;&#xFF0C;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x601D;&#x8003;&#x3002;</p>
<h2 id="&#x201C;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#x201D;&#x7684;&#x672A;&#x6765;"><a href="#&#x201C;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#x201D;&#x7684;&#x672A;&#x6765;" class="headerlink" title="&#x201C;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#x201D;&#x7684;&#x672A;&#x6765;"></a>&#x201C;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#x201D;&#x7684;&#x672A;&#x6765;</h2><p>&#x4E3A;&#x4EC0;&#x4E48;&#x8BF4;&#x5B83;&#x65E0;&#x6240;&#x4E0D;&#x80FD;&#xFF0C;&#x5148;&#x6765;&#x770B;&#x770B;&#x5E03;&#x5C40;&#xFF1A;</p>
<p>&#x9002;&#x5E94;&#x591A;&#x7EC8;&#x7AEF;</p>
<p>&#x5A92;&#x4F53;&#x67E5;&#x8BE2;Media query&#x3001;&#x6D41;&#x5F0F;Flow&#x3001;&#x4F38;&#x7F29;&#x76D2;Flexbox&#x3001;&#x8BA1;&#x7B97;&#x5E03;&#x5C40;calc&#x3001;&#x7F51;&#x683C;&#x5E03;&#x5C40;Grid&#x3001;&#x591A;&#x680F;&#x5E03;&#x5C40;Multi columns&#x7B49;&#x7B49;&#xFF1B;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x6253;&#x7834;&#x4E86;&#x603B;&#x662F;&#x65B9;&#x65B9;&#x6B63;&#x6B63;&#x7684;&#x5F62;&#x8C61;&#x3002;</p>
<p>&#x51E0;&#x4E2A;&#x6234;&#x8868;&#xFF1A;transform&#x3001;border-radius&#x3001; multiple backgrounds&#x3001;shapes&#x3001;appearance&#x3001;@font-face&#x7B49;&#x7B49;</p>
<p>&#x5F62;&#x72B6;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x7684;&#x3002;&#x5B57;&#x4F53;&#x53EF;&#x4EE5;&#x662F;&#x591A;&#x6837;&#x7684;&#x3002; &#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x4E0D;&#x518D;&#x62D8;&#x6CE5;&#x4E8E;&#x5355;&#x8C03;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x8FD9;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x65E0;&#x9650;&#x53EF;&#x80FD;&#xFF0C;&#x5C31;&#x770B;&#x4F60;&#x7684;&#x601D;&#x7EF4;&#x662F;&#x5426;&#x88AB;&#x5C40;&#x9650;&#x4F4F;&#xFF01;~</p>
<p>&#x542C;&#x8BF4;&#x8FD8;&#x6709;pointer-events;will-change;</p>
<p>&#x8FD8;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x8BF4;high&#x4E86;&#x3002;&#x4E0D;&#x7BA1;&#x5B83;&#x4EEC;&#x6700;&#x7EC8;&#x6709;&#x65E0;&#xFF0C;&#x6700;&#x7EC8;&#x80FD;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF0C;css&#x90FD;&#x8FD8;&#x5728;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x7740;&#xFF0C;&#x6216;&#x8005;&#x65B0;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x6216;&#x8005;&#x65B0;&#x7684;&#x5C5E;&#x6027;&#x3001;&#x5C5E;&#x6027;&#x503C;&#x3002;&#x6211;&#x4EEC;&#x80FD;&#x505A;&#x7684;&#xFF0C;&#x5C31;&#x53EA;&#x6709;&#x671F;&#x5F85;&#xFF01;~</p>
<p>&#x8FD9;&#x6B21;&#x5C31;&#x5148;&#x8C08;&#x5230;&#x8FD9;&#x91CC;&#x5427;&#xFF0C;&#x4EBA;&#x7684;&#x8BA4;&#x8BC6;&#x3001;&#x601D;&#x60F3;&#x548C;&#x65B9;&#x6CD5;&#x8BBA;&#x90FD;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x7ECF;&#x5386;&#x7684;&#x589E;&#x591A;&#x53D1;&#x751F;&#x4E00;&#x4E9B;&#x5FAE;&#x5999;&#x7684;&#x53D8;&#x5316;&#x3002;&#x76F8;&#x4FE1;&#x6211;&#x8FD8;&#x4F1A;&#x518D;&#x8C08;&#x7684;&#xFF0C;&#x90A3;&#x4E0B;&#x6B21;&#x89C1;&#xFF1F;~</p>
<p>&#x6B22;&#x8FCE;&#x8BA2;&#x9605;&#x6211;&#x7684;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x524D;&#x7AEF;&#x5468;&#x672B;</p>
<p>&#x6B22;&#x8FCE;&#x52A0;&#x5165;&#x6211;&#x7684;&#x4F01;&#x9E45;&#x7FA4;&#xFF1A;152128548</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/CSS/" rel="tag">#CSS</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/06/19/front-home-lineheight-and-vertical/" rel="next" title="浅析line-height和vertical">
                <i class="fa fa-chevron-left"></i> 浅析line-height和vertical
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/08/07/front-end-home-margin-that-thing/" rel="prev" title="margin那些事儿">
                margin那些事儿 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#选择器"><span class="nav-number">1.</span> <span class="nav-text">选择器</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#Css的出轨"><span class="nav-number">2.</span> <span class="nav-text">Css的出轨</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#“无所不能”的未来"><span class="nav-number">3.</span> <span class="nav-text">“无所不能”的未来</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
