<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>关于学习和前端 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">关于学习和前端</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">关于学习和前端</h1><div class="post-meta">Feb 23, 2014<span> | </span><span class="category"><a href="/categories/思考/">思考</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2014/02/23/关于学习和前端/" href="/2014/02/23/关于学习和前端/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#前端"><span class="toc-number">1.</span> <span class="toc-text">前端</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#前端到底追求的是什么呢？"><span class="toc-number">2.</span> <span class="toc-text">前端到底追求的是什么呢？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#前端的发展前景怎样？"><span class="toc-number">3.</span> <span class="toc-text">前端的发展前景怎样？</span></a></li></ol></div></div><div class="post-content"><p>&#x5B66;&#x4E60;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x5BB6;&#x90FD;&#x975E;&#x5E38;&#x719F;&#x6089;&#x7684;&#x8BCD;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x56E0;&#x4E3A;&#x53D7;&#x6559;&#x80B2;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x9996;&#x5148;&#x8DC3;&#x5165;&#x6211;&#x4EEC;&#x8111;&#x6D77;&#x7684;&#x5C31;&#x662F;&#x8DDF;&#x8BFB;&#x4E66;&#xFF0C;&#x505A;&#x9898;&#xFF0C;&#x8003;&#x8BD5;&#x7B49;&#x7B49;&#x76F8;&#x5173;&#x3002;&#x4F46;&#x8FD9;&#x662F;&#x5728;&#x6821;&#x56ED;&#xFF0C;&#x51FA;&#x4E86;&#x6821;&#x56ED;&#x4E4B;&#x540E;&#x7684;&#x5B66;&#x4E60;&#x53C8;&#x662F;&#x600E;&#x6837;&#x7684;&#x5462;&#xFF1F;&#x5728;&#x8FD9;&#x91CC;&#x53D1;&#x8868;&#x4E00;&#x4E0B;&#x964B;&#x89C1;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x51FA;&#x4E86;&#x6821;&#x95E8;&#x8FD8;&#x662F;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x4F1A;&#xFF0C;&#x539F;&#x56E0;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x4E8E;&#x662F;&#x4E4E;&#x73B0;&#x5728;&#x793E;&#x4F1A;&#x4E0A;&#x5F88;&#x591A;&#x7684;&#x57F9;&#x8BAD;&#x673A;&#x6784;&#x5C31;&#x6210;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x53C8;&#x4E00;&#x51FA;&#x8DEF;&#xFF0C;&#x82B1;&#x4E2A;&#x51E0;&#x5343;&#x5757;&#xFF0C;&#x8FD8;&#x6709;&#x5148;&#x5B66;&#x4E60;&#x540E;&#x4ED8;&#x6B3E;&#xFF0C;&#x4FDD;&#x8BC1;&#x80FD;&#x7B7E;&#x7EA6;&#x5230;&#x4EC0;&#x4E48;&#x4F01;&#x4E1A;&#xFF0C;&#x770B;&#x7740;&#x6EE1;&#x6EE1;&#x7684;&#x8BFE;&#x7A0B;&#x8868;&#xFF0C;&#x4F3C;&#x4E4E;&#x5C31;&#x662F;&#x770B;&#x5230;&#x4E86;&#x5E0C;&#x671B;&#xFF0C;&#x53EF;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x662F;&#x600E;&#x6837;&#x7684;&#x5462;&#xFF1F;&#x8001;&#x5E08;&#x7684;&#x6388;&#x8BFE;&#x65B9;&#x5F0F;&#x4F60;&#x4E0D;&#x559C;&#x6B22;&#xFF0C;&#x53D1;&#x7684;&#x6559;&#x6750;&#x6BD4;&#x8F83;&#x6C34;&#xFF0C;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#x5931;&#x53BB;&#x4E86;&#x65B0;&#x9C9C;&#x611F;&#xFF0C;&#x53C8;&#x6CA1;&#x6709;&#x5F88;&#x4E25;&#x5389;&#x7684;&#x7BA1;&#x6559;&#xFF0C;&#x6700;&#x7EC8;&#x80FD;&#x771F;&#x6B63;&#x5B66;&#x51FA;&#x6765;&#x7684;&#x4EBA;&#x5BE5;&#x5BE5;&#x65E0;&#x51E0;&#xFF0C;&#x60F3;&#x60F3;&#x8DDF;&#x4E4B;&#x524D;&#x90A3;&#x4E9B;&#x5E74;&#x7684;&#x6C42;&#x5B66;&#x65E0;&#x592A;&#x5927;&#x533A;&#x522B;&#xFF0C;&#x9000;&#x4E00;&#x4E07;&#x6B65;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x7B97;&#x4F60;&#x82B1;&#x529F;&#x592B;&#x53BB;&#x5B66;&#x4E86;&#xFF0C;&#x50CF;java&#x3001;C++&#x3001;&#x5D4C;&#x5165;&#x5F0F;&#x7B49;&#x7B49;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F60;&#x6307;&#x671B;&#x901A;&#x8FC7;&#x4E09;&#x56DB;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x5B66;&#x5230;&#x591A;&#x5C11;&#xFF0C;&#x7406;&#x89E3;&#x5230;&#x591A;&#x5C11;&#xFF1F;&#x80FD;&#x8BB0;&#x4F4F;&#x4E00;&#x4E9B;&#x8BED;&#x6CD5;&#x89C4;&#x5219;&#x3001;&#x65B9;&#x6CD5;&#x3001;&#x51FD;&#x6570;&#xFF0C;&#x80FD;&#x5199;&#x51E0;&#x6BB5;&#x7B80;&#x77ED;&#x7684;&#x4EE3;&#x7801;&#x505A;&#x51FA;&#x51E0;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x8FD8;&#x884C;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x7B97;&#x5B66;&#x4F1A;&#x4E86;&#x4E48;&#xFF1F;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x8001;&#x5E08;&#x66FE;&#x7ECF;&#x5BF9;&#x4ED6;&#x7684;&#x5B66;&#x751F;&#x6240;&#x8BF4;&#xFF1A;&#x4F60;&#x4EEC;&#x53BB;&#x5E94;&#x8058;&#xFF0C;&#x4F1A;&#x770B;&#x5230;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7684;&#x8981;&#x6C42;&#xFF1A;&#x4E86;&#x89E3;&#x3001;&#x4F1A;&#x3001;&#x719F;&#x7EC3;&#x3001;&#x7CBE;&#x901A;&#x7B49;&#x7B49;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x77E5;&#x9053;&#x70B9;&#x5C31;&#x53EB;&#x4E86;&#x89E3;&#xFF0C;&#x7565;&#x61C2;&#x8BED;&#x6CD5;&#xFF0C;&#x80FD;&#x5199;&#x51FA;&#x7B80;&#x5355;&#x7684;&#x6B63;&#x786E;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x662F;&#x4F1A;&#xFF0C;&#x80FD;&#x5199;&#x5B9E;&#x73B0;&#x7A0D;&#x5FAE;&#x590D;&#x6742;&#x529F;&#x80FD;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x53EB;&#x719F;&#x7EC3;&#xFF0C;&#x719F;&#x7EC3;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x61C2;&#x70B9;&#x601D;&#x60F3;&#x4F1A;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x5E94;&#x7528;&#xFF0C;&#x5C31;&#x662F;&#x7CBE;&#x901A;&#x3002;&#x3002;&#x3002;&#x3002;&#x4E2D;&#x56FD;&#x6709;&#x592A;&#x591A;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x771F;&#x6B63;&#x6C34;&#x5E73;&#x9AD8;&#x7684;&#xFF0C;&#x80FD;&#x4E0A;&#x5F97;&#x4E86;&#x53F0;&#x9762;&#x7684;&#x5F88;&#x5C11;&#x3002;&#x98CE;&#x6C14;&#x6682;&#x4E0D;&#x8C08;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x56FD;&#x60C5;&#x561B;~</p>
<p>&#x6709;&#x4E00;&#x53E5;&#x8BDD;&#x8BF4;&#x7684;&#x597D;&#xFF1A;&#x5174;&#x8DA3;&#x662F;&#x6700;&#x597D;&#x7684;&#x8001;&#x5E08;&#x3002;&#x9996;&#x5148;&#x4F60;&#x8981;&#x9009;&#x62E9;&#x4E86;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x751A;&#x81F3;&#x662F;&#x70ED;&#x7231;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x4F1A;&#x6709;&#x4E00;&#x79CD;&#x5916;&#x90E8;&#x5F3A;&#x52A0;&#x7ED9;&#x4F60;&#x7684;&#x538B;&#x8FEB;&#x611F;&#xFF0C;&#x5B66;&#x4E60;&#x5C31;&#x6210;&#x4E86;&#x4E00;&#x79CD;&#x6B32;&#x671B;&#x3002;&#x518D;&#x8005;&#x505A;&#x6280;&#x672F;&#x8FD9;&#x7C7B;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x4F1A;&#x95EE;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x8BE5;&#x5B66;&#x4EC0;&#x4E48;&#xFF0C;&#x73B0;&#x5728;&#x5B66;&#x4EC0;&#x4E48;&#x524D;&#x666F;&#x6700;&#x597D;&#xFF1F;&#x6211;&#x662F;&#x4E0D;&#x662F;&#x5B66;&#x4F1A;&#x4EC0;&#x4E48;&#x5C31;&#x80FD;&#x600E;&#x6837;&#x4E86;&#xFF1F;&#x8BE5;&#x770B;&#x4EC0;&#x4E48;&#x4E66;&#x6216;&#x89C6;&#x9891;&#x5462;&#xFF1F;&#x4F60;&#x5B66;&#x7684;&#x65F6;&#x5019;&#x7528;&#x4E86;&#x591A;&#x4E45;&#xFF1F;&#x8FD9;&#x4E48;&#x60F3;&#x7684;&#x4EBA;&#xFF0C;&#x516B;&#x6210;&#x60F3;&#x5F97;&#x591A;&#x505A;&#x5F97;&#x5C11;&#xFF0C;&#x60F3;&#x8C61;&#x5F88;&#x7F8E;&#x597D;&#xFF0C;&#x6267;&#x884C;&#x529B;&#x5F88;&#x5DEE;&#xFF0C;&#x4E0D;&#x8E0F;&#x5B9E;&#xFF0C;&#x6D6E;&#x8E81;&#x7684;&#x8868;&#x73B0;&#x3002;</p>
<p>&#x6211;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x4E00;&#x4E2A;&#x8BCD;&#x513F;&#xFF0C;&#x53EB;&#x68A6;&#x60F3;&#x6216;&#x8005;&#x7406;&#x60F3;&#x3002;&#x800C;&#x4E14;&#x6211;&#x559C;&#x6B22;&#x8DDF;&#x6709;&#x7406;&#x60F3;&#x7684;&#x4EBA;&#x4EA4;&#x670B;&#x53CB;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x51E0;&#x4E2A;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x5439;&#x725B;&#xFF0C;&#x5E7B;&#x60F3;&#xFF0C;&#x800C;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4EBA;&#x5FC3;&#x91CC;&#x603B;&#x6709;&#x4E00;&#x80A1;&#x529B;&#x91CF;&#x53BB;&#x514B;&#x670D;&#x5F88;&#x591A;&#x56F0;&#x96BE;&#xFF0C;&#x6BD4;&#x5982;&#x67AF;&#x71E5;&#xFF0C;&#x5B64;&#x72EC;&#xFF0C;&#x5931;&#x8D25;&#xFF0C;&#x5632;&#x7B11;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x6709;&#x4E00;&#x79CD;&#x4E0D;&#x65AD;&#x524D;&#x884C;&#x7684;&#x52A8;&#x529B;&#x4E0D;&#x65AD;&#x8FFD;&#x6C42;&#x66F4;&#x597D;&#x7684;&#x52A8;&#x529B;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x9886;&#x57DF;&#x5185;&#x505A;&#x51FA;&#x7A81;&#x51FA;&#x8D21;&#x732E;&#x4E3A;&#x7528;&#x6237;&#x521B;&#x9020;&#x597D;&#x7684;&#x4EA7;&#x54C1;&#x7684;&#x90A3;&#x4EFD;&#x8654;&#x8BDA;&#xFF01;&#x4E5F;&#x5C31;&#x6709;&#x4E86;&#x4E0D;&#x65AD;&#x5B66;&#x4E60;&#x63D0;&#x5347;&#x81EA;&#x6211;&#x7684;&#x6B32;&#x671B;&#xFF01;</p>
<p>&#x5929;&#x624D;&#x5F88;&#x5C11;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5927;&#x8111;&#x7684;&#x6F5C;&#x529B;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x6709;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x5F3A;&#x5927;&#x3002;&#x5B66;&#x4E60;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4ECE;&#x964C;&#x751F;&#x5230;&#x77E5;&#x9053;&#xFF0C;&#x4ECE;&#x77E5;&#x9053;&#x5230;&#x719F;&#x6089;&#xFF0C;&#x4ECE;&#x719F;&#x6089;&#x5230;&#x7CBE;&#x901A;&#x3002;&#x6700;&#x96BE;&#x7684;&#x662F;&#x524D;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x964C;&#x751F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5168;&#x662F;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x65B0;&#x5230;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#xFF0C;&#x627E;&#x4E0D;&#x7740;&#x5317;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x77E5;&#x6240;&#x4E91;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x522B;&#x8BF4;&#x662F;&#x8BA9;&#x4F60;&#x535A;&#x89C8;&#x7FA4;&#x4E66;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x4F60;&#x770B;&#x51E0;&#x9875;&#x90FD;&#x4F1A;&#x89C9;&#x5F97;&#x662F;&#x4E00;&#x79CD;&#x75DB;&#x82E6;&#xFF0C;&#x4F46;&#x522B;&#x5FD8;&#x4E86;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x964C;&#x751F;&#x611F;&#x5E26;&#x6765;&#x7684;&#x77ED;&#x6682;&#x7684;&#x4E0D;&#x9002;&#x5E94;&#xFF0C;&#x5B66;&#x4E60;&#x4ECE;&#x6765;&#x90FD;&#x662F;&#x6E10;&#x8FDB;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x6CA1;&#x4EBA;&#x80FD;&#x4E00;&#x53E3;&#x5403;&#x6210;&#x80D6;&#x5B50;&#xFF01;&#x4ECE;&#x77E5;&#x9053;&#x5230;&#x719F;&#x6089;&#x4F3C;&#x4E4E;&#x4ECD;&#x7136;&#x662F;&#x4E2A;&#x65E0;&#x89E3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#xFF0C;&#x4E5F;&#x77E5;&#x9053;&#x90A3;&#x4E2A;&#xFF0C;&#x8FD8;&#x77E5;&#x9053;&#x90A3;&#x4E2A;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x53C8;&#x80FD;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF1F;&#x8FD8;&#x662F;&#x5F88;&#x96F6;&#x6563;&#xFF0C;&#x4E0D;&#x80FD;&#x903B;&#x8F91;&#x5316;&#x7CFB;&#x7EDF;&#x5316;&#x3002;&#x8FD9;&#x4F1A;&#x8BA9;&#x4EBA;&#x628A;&#x4ECE;&#x672A;&#x77E5;&#x5230;&#x77E5;&#x9053;&#x83B7;&#x5F97;&#x7684;&#x90A3;&#x70B9;&#x6210;&#x5C31;&#x611F;&#x6467;&#x6B8B;&#x7684;&#x8361;&#x7136;&#x65E0;&#x5B58;&#xFF0C;&#x9677;&#x5165;&#x90C1;&#x95F7;&#x548C;&#x56F0;&#x60D1;&#xFF0C;&#x6211;&#x8FD8;&#x7F3A;&#x70B9;&#x513F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x8FD8;&#x8981;&#x4ECE;&#x54EA;&#x65B9;&#x9762;&#x5F97;&#x5230;&#x63D0;&#x9AD8;&#x5462;&#xFF1F;&#x4FD7;&#x8BDD;&#x8BF4;&#x7684;&#x597D;&#xFF0C;&#x5B9E;&#x8DF5;&#x51FA;&#x771F;&#x77E5;&#xFF0C;&#x5F53;&#x4F60;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8FD8;&#x53EF;&#x4EE5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x968F;&#x4FBF;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x5C31;&#x628A;&#x4F60;&#x5361;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x9700;&#x8981;&#x7684;&#x5C31;&#x662F;&#x52A0;&#x5F3A;&#x81EA;&#x5DF1;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x7684;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x628A;&#x5B83;&#x7CFB;&#x7EDF;&#x5316;&#xFF0C;&#x52A0;&#x6DF1;&#x7406;&#x89E3;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x79EF;&#x7D2F;&#x7ECF;&#x9A8C;&#xFF0C;&#x5047;&#x4EE5;&#x65F6;&#x65E5;&#xFF0C;&#x5C31;&#x4F1A;&#x8FBE;&#x5230;&#x770B;&#x8D77;&#x6765;&#x4FE1;&#x624B;&#x62C8;&#x6765;&#xFF0C;&#x5175;&#x6765;&#x5C06;&#x6321;&#x6C34;&#x6765;&#x571F;&#x63A9;&#x7684;&#x5883;&#x754C;&#xFF01;~</p>
<h2 id="&#x524D;&#x7AEF;"><a href="#&#x524D;&#x7AEF;" class="headerlink" title="&#x524D;&#x7AEF;"></a>&#x524D;&#x7AEF;</h2><p>&#x662F;&#x4E2A;&#x4E0D;&#x90A3;&#x4E48;&#x65B0;&#x7684;&#x8BCD;&#x513F;&#x4E86;&#xFF0C;&#x5728;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x505A;&#x540E;&#x53F0;&#x7684;&#x8FDC;&#x6BD4;&#x505A;&#x524D;&#x7AEF;&#x66F4;&#x725B;&#x5427;&#xFF08;&#x6216;&#x8BB8;&#x73B0;&#x5728;&#x8FD8;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x8FD9;&#x4E48;&#x8BA4;&#x4E3A;~&#xFF09;&#xFF0C;&#x6211;&#x4E3A;&#x4EC0;&#x4E48;&#x9009;&#x62E9;&#x4E86;&#x524D;&#x7AEF;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x6211;&#x521A;&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x60F3;&#xFF0C;&#x8981;&#x505A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x548C;&#x542C;&#x8D77;&#x6765;&#x90FD;&#x633A;&#x725B;&#x7684;&#xFF0C;&#x4E5F;&#x6709;&#x94B1;&#x9014;~&#x90A3;&#x505A;&#x8F6F;&#x4EF6;&#x8981;&#x5B66;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x597D;&#x5427;&#xFF0C;&#x7528;C&#x6765;&#x6253;&#x57FA;&#x7840;&#xFF0C;&#x7136;&#x540E;&#x505A;&#x8F6F;&#x4EF6;&#x597D;&#x50CF;&#x7528;java&#x5F88;&#x591A;&#x5F88;&#x706B;&#x5427;&#xFF0C;&#x5C31;&#x5B66;java&#xFF0C;&#x53EF;&#x662F;&#x3002;&#x3002;&#x53EF;&#x662F;&#x6700;&#x7EC8;&#xFF0C;&#x54CE;&#xFF0C;&#x81EA;&#x8BA4;&#x4E3A;&#x6CA1;&#x90A3;&#x4E2A;&#x5929;&#x8D4B;&#xFF0C;&#x653E;&#x5F03;&#x5427;&#x3002;&#x5F53;&#x6211;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x5F53;&#x521D;&#x9009;&#x62E9;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x5BF9;&#x8FD8;&#x662F;&#x9519;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7075;&#x5149;&#x4E00;&#x73B0;~html&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x597D;&#x50CF;&#x86EE;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x4E5F;&#x86EE;&#x6709;&#x610F;&#x601D;&#x7684;&#xFF0C;&#x4F60;&#x60F3;&#x554A;&#xFF0C;&#x81EA;&#x5DF1;&#x6BCF;&#x5929;&#x4E0A;&#x7F51;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x81EA;&#x5DF1;&#x4E5F;&#x80FD;&#x5199;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x6240;&#x89C1;&#x5373;&#x4E3A;&#x6240;&#x5F97;&#xFF0C;&#x5199;&#x4E00;&#x70B9;&#x9A6C;&#x4E0A;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x6548;&#x679C;&#xFF0C;&#x8FD9;&#x6BD4;&#x6574;&#x5929;&#x5728;&#x90A3;&#x91CC;&#x5199;C&#xFF0C;&#x8F93;&#x51FA;&#x6570;&#x5B57;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x4EC0;&#x4E48;&#x7684;&#x6709;&#x8DA3;&#x592A;&#x591A;&#x4E86;&#x3002;&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x6211;&#x5C31;&#x5F00;&#x59CB;&#x5B66;&#x4E86;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x5B83;&#x7B80;&#x5355;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#x5B83;&#x786E;&#x5B9E;&#x4E5F;&#x76F8;&#x5BF9;&#x800C;&#x8A00;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x6211;&#x5F00;&#x59CB;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x4ECE;&#x964C;&#x751F;&#x5230;&#x77E5;&#x9053;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FC7;&#x7A0B;&#x4E0D;&#x518D;&#x8BE6;&#x8FF0;&#xFF0C;&#x603B;&#x4E4B;&#x81EA;&#x8BA4;&#x4E3A;&#x633A;&#x6709;&#x6BC5;&#x529B;&#x7684;&#x542C;&#x4E86;&#x82E5;&#x5E72;&#x8282;&#x89C6;&#x9891;&#x8BFE;&#x7A0B;&#xFF0C;&#x6700;&#x540E;&#x4EE5;&#x9AD8;&#x7EA7;&#x8BFE;&#x7A0B;&#x9700;&#x8981;&#x4E70;&#x5149;&#x76D8;&#x800C;&#x544A;&#x7EC8;&#x3002;&#x3002;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5C31;&#x53EA;&#x662F;&#x4F1A;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;html&#x7F16;&#x5199;&#xFF0C;&#x548C;&#x5D4C;&#x5165;&#x4EE5;&#x53CA;&#x5185;&#x8054;css&#x65B9;&#x6CD5;&#x5199;&#x70B9;&#x7B80;&#x5355;&#x7684;&#x9875;&#x9762;&#x800C;&#x5DF2;&#xFF0C;&#x56DE;&#x60F3;&#x8D77;&#x6765;&#xFF0C;&#x65E2;&#x771F;&#x5B9E;&#x53C8;&#x6709;&#x8DA3;~&#x540E;&#x6765;&#x6211;&#x5F00;&#x59CB;&#x501F;&#x4E66;&#x770B;&#xFF0C;&#x8FB9;&#x770B;&#x4E66;&#x8FB9;&#x5B9E;&#x8DF5;&#xFF0C;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x6211;&#x7684;&#x80FD;&#x529B;&#x5F97;&#x5230;&#x4E86;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x6765;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x83DC;&#x9E1F;&#x7EA7;&#x522B;&#x3002;&#x5176;&#x5B9E;&#x5B66;&#x4E60;&#x5C31;&#x50CF;&#x662F;&#x5728;&#x62FC;&#x56FE;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x5199;&#x7684;&#x4E66;&#x4F1A;&#x5B8C;&#x5168;&#x7684;&#x77E5;&#x9053;&#x4F60;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x4F46;&#x603B;&#x6709;&#x53EF;&#x80FD;&#x4F60;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x5C31;&#x770B;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x62D3;&#x5BBD;&#x81EA;&#x5DF1;&#x7684;&#x89C6;&#x91CE;&#xFF0C;&#x591A;&#x770B;&#x4E66;&#x6216;&#x8005;&#x6587;&#x7AE0;&#xFF0C;&#x548C;&#x80FD;&#x529B;&#x6BD4;&#x81EA;&#x5DF1;&#x5F3A;&#x7684;&#x4EBA;&#x4EA4;&#x6D41;&#x90FD;&#x662F;&#x80FD;&#x53D7;&#x76CA;&#x532A;&#x6D45;&#x7684;&#x3002;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x4F60;&#x4E00;&#x76F4;&#x4EE5;&#x4E00;&#x79CD;&#x79EF;&#x6781;&#x7684;&#x6001;&#x5EA6;&#x53BB;&#x9762;&#x5BF9;&#x95EE;&#x9898;&#x548C;&#x56F0;&#x96BE;&#x3002;</p>
<h2 id="&#x524D;&#x7AEF;&#x5230;&#x5E95;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;"><a href="#&#x524D;&#x7AEF;&#x5230;&#x5E95;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;" class="headerlink" title="&#x524D;&#x7AEF;&#x5230;&#x5E95;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;"></a>&#x524D;&#x7AEF;&#x5230;&#x5E95;&#x8FFD;&#x6C42;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</h2><p>&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#xFF1A;&#x5305;&#x62EC;&#x529F;&#x80FD;&#x3001;&#x98CE;&#x683C;&#x3001;&#x989C;&#x8272;&#x3001;&#x5E03;&#x5C40;&#x3001;&#x4EA4;&#x4E92;&#x7B49;&#x7B49;&#x3002;<br>&#x6280;&#x672F;&#x5E73;&#x8861;&#x7684;&#x3001;&#x79D1;&#x5B66;&#x7684;&#x8FD0;&#x7528;&#xFF1A;&#x6682;&#x4E14;&#x4E0D;&#x8BF4;&#x7F8E;&#x611F;&#x548C;&#x4F18;&#x96C5;&#xFF0C;&#x628A;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x600E;&#x4E48;&#x6837;&#x4EE5;&#x6BD4;&#x8F83;&#x9002;&#x5F53;&#x7684;&#x4EE3;&#x7801;&#x91CF;&#x53BB;&#x505A;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x4E8B;&#xFF08;&#x4E0D;&#x4E00;&#x5B9A;&#x5C11;&#x7684;&#x5C31;&#x662F;&#x597D;&#x7684;&#xFF09;&#xFF0C;&#x6548;&#x7387;&#x548C;&#x8D28;&#x91CF;&#x7684;&#x5E73;&#x8861;&#xFF0C;&#x53EF;&#x91CD;&#x7528;&#x6027;&#xFF0C;&#x517C;&#x5BB9;&#x6027;&#x7B49;&#x7B49;&#x3002;</p>
<h2 id="&#x524D;&#x7AEF;&#x7684;&#x53D1;&#x5C55;&#x524D;&#x666F;&#x600E;&#x6837;&#xFF1F;"><a href="#&#x524D;&#x7AEF;&#x7684;&#x53D1;&#x5C55;&#x524D;&#x666F;&#x600E;&#x6837;&#xFF1F;" class="headerlink" title="&#x524D;&#x7AEF;&#x7684;&#x53D1;&#x5C55;&#x524D;&#x666F;&#x600E;&#x6837;&#xFF1F;"></a>&#x524D;&#x7AEF;&#x7684;&#x53D1;&#x5C55;&#x524D;&#x666F;&#x600E;&#x6837;&#xFF1F;</h2><p>&#x8BDD;&#x8BF4;&#x53EA;&#x8981;&#x4F60;&#x60F3;&#x5F97;&#x5230;&#x505A;&#x5F97;&#x5230;&#xFF0C;&#x5C31;&#x6709;&#x4F60;&#x7684;&#x4E00;&#x7247;&#x5929;&#x4E0B;&#x3002;&#x8BBE;&#x8BA1;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x80FD;&#x65F6;&#x4E0D;&#x65F6;&#x7684;&#x611F;&#x53D7;&#x5230;&#x7F51;&#x9875;&#x4E0A;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x53D8;&#x5316;&#xFF0C;&#x4EBA;&#x4EEC;&#x5BF9;&#x7F8E;&#x548C;&#x4FBF;&#x6377;&#x7684;&#x8FFD;&#x6C42;&#x4E0D;&#x4F1A;&#x505C;&#x4E0B;&#x811A;&#x6B65;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x6E05;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x505A;&#x51FA;&#x4E86;&#x9009;&#x62E9;&#xFF0C;&#x5C31;&#x8981;&#x6709;&#x628A;&#x5B83;&#x5B66;&#x597D;&#x7684;&#x4FE1;&#x5FC3;&#x548C;&#x51B3;&#x5FC3;&#xFF0C;&#x575A;&#x6301;&#x4E0B;&#x53BB;&#x5B9A;&#x6709;&#x4E0D;&#x51E1;&#x6210;&#x679C;&#xFF01;~</p>
<p>&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x8BB2;&#x6280;&#x672F;&#x65B9;&#x9762;&#x7684;&#x4E8B;&#x513F;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x91CC;&#x4E0D;&#x662F;&#x7ED9;&#x5927;&#x5BB6;&#x8BB2;&#x8BFE;&#x7684;&#xFF0C;&#x6211;&#x4E5F;&#x8FD8;&#x6CA1;&#x8FBE;&#x5230;&#x53EF;&#x4EE5;&#x8BB2;&#x8BFE;&#x7684;&#x6C34;&#x51C6;&#xFF0C;&#x53EA;&#x662F;&#x7ED9;&#x540E;&#x6765;&#x8005;&#x4E00;&#x70B9;&#x70B9;&#x771F;&#x5B9E;&#x60C5;&#x51B5;&#x7684;&#x62AB;&#x9732;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x5E26;&#x7ED9;&#x4F60;&#x70B9;&#x542F;&#x53D1;&#x4E5F;&#x5C31;&#x591F;&#x4E86;&#x3002;</p>
</div><a data-url="http://yoursite.com/2014/02/23/关于学习和前端/" data-id="cil0wkudm0018flqiclgtjup8" class="article-share-link">分享到</a><div class="tags"><a href="/tags/前端/">前端</a><a href="/tags/学习/">学习</a></div><div class="post-nav"><a href="/2014/03/05/学习最关键的阶段/" class="pre">学习最关键的阶段</a></div><div data-thread-key="2014/02/23/关于学习和前端/" data-title="关于学习和前端" data-url="http://yoursite.com/2014/02/23/关于学习和前端/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2014/02/23/关于学习和前端/" data-title="关于学习和前端" data-url="http://yoursite.com/2014/02/23/关于学习和前端/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/01/01/2015-summary/">梦幻般的2015，更丰盈的2016</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/14/自学者需要具备的基本技能和素质/">自学者需要具备的基本技能和素质</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/12/01/basic-layout/">说说基本的布局观</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/10/17/those-year-i-do-bad/">那些年我干过的矬事</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/09/13/zuiniu-birth/">醉牛前端诞生记</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/08/08/two-years-fe/">两年前端行</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/08/07/front-end-home-margin-that-thing/">margin那些事儿</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/22/再谈css/">再谈css</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/19/front-home-lineheight-and-vertical/">浅析line-height和vertical</a></li><li class="post-list-item"><a class="post-list-link" href="/2015/06/12/zindex-zoom-and-the-brothers-home-front/">z-index和zoom这哥俩</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>