<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="javascript," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="js&amp;#x91CC;&amp;#x7684;&amp;#x53D8;&amp;#x91CF;&amp;#x548C;&amp;#x5176;&amp;#x4ED6;&amp;#x8BED;&amp;#x8A00;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x5B83;&amp;#x662F;&amp;#x677E;&amp;#x6563;&amp;#x578B;&amp;#x7684;&amp;#xFF0C;&amp;#x8FD9;&amp;#x51B3;&amp;#x5B9A;&amp;#x4E86;&amp;#x5B83;&amp;#x53E">
<meta property="og:type" content="article">
<meta property="og:title" content="征服javascript学习笔记（四）——变量、作用域和内存">
<meta property="og:url" content="http://yoursite.com/2016/03/27/javascript-study-four/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="js&amp;#x91CC;&amp;#x7684;&amp;#x53D8;&amp;#x91CF;&amp;#x548C;&amp;#x5176;&amp;#x4ED6;&amp;#x8BED;&amp;#x8A00;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x5B83;&amp;#x662F;&amp;#x677E;&amp;#x6563;&amp;#x578B;&amp;#x7684;&amp;#xFF0C;&amp;#x8FD9;&amp;#x51B3;&amp;#x5B9A;&amp;#x4E86;&amp;#x5B83;&amp;#x53E">
<meta property="og:updated_time" content="2016-03-27T13:26:44.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="征服javascript学习笔记（四）——变量、作用域和内存">
<meta name="twitter:description" content="js&amp;#x91CC;&amp;#x7684;&amp;#x53D8;&amp;#x91CF;&amp;#x548C;&amp;#x5176;&amp;#x4ED6;&amp;#x8BED;&amp;#x8A00;&amp;#x4E0D;&amp;#x540C;&amp;#xFF0C;&amp;#x5B83;&amp;#x662F;&amp;#x677E;&amp;#x6563;&amp;#x578B;&amp;#x7684;&amp;#xFF0C;&amp;#x8FD9;&amp;#x51B3;&amp;#x5B9A;&amp;#x4E86;&amp;#x5B83;&amp;#x53E">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 征服javascript学习笔记（四）——变量、作用域和内存 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                征服javascript学习笔记（四）——变量、作用域和内存
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-03-27T00:00:00+08:00" content="2016-03-27">
              2016-03-27
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/javascript学习笔记/" itemprop="url" rel="index">
                    <span itemprop="name">javascript学习笔记</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>js&#x91CC;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x662F;&#x677E;&#x6563;&#x578B;&#x7684;&#xFF0C;&#x8FD9;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x53EA;&#x662F;&#x5728;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x4FDD;&#x5B58;&#x7279;&#x5B9A;&#x503C;&#x7684;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x800C;&#x5DF2;&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x5B58;&#x5728;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x7ED1;&#x5B9A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x548C;&#x7C7B;&#x578B;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x811A;&#x672C;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x6539;&#x53D8;&#x3002;</p>
<h2 id="&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;"><a href="#&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;" class="headerlink" title="&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;"></a>&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;</h2><p>ES&#x53D8;&#x91CF;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF1A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x548C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x3002;</p>
<p><strong>&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;</strong>&#x6307;&#x7684;&#x662F;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x6BB5;</p>
<p><strong>&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;</strong>&#x6307;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x591A;&#x4E2A;&#x503C;&#x6784;&#x6210;&#x7684;&#x5BF9;&#x8C61;</p>
<p>&#x5728;&#x5C06;&#x4E00;&#x4E2A;&#x503C;&#x8D4B;&#x7ED9;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x89E3;&#x6790;&#x5668;&#x5FC5;&#x987B;&#x786E;&#x5B9A;&#x8FD9;&#x4E2A;&#x503C;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#x8FD8;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#xFF0C;&#x524D;&#x9762;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x503C;&#xFF0C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x662F;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4E0E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E0D;&#x540C;&#xFF0C;js&#x4E0D;&#x5141;&#x8BB8;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5728;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5728;&#x64CD;&#x4F5C;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x9645;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4E3A;&#x6B64;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x662F;&#x6309;&#x5F15;&#x7528;&#x8BBF;&#x95EE;&#x7684;&#x3002;</p>
<p>1&#x3001;&#x52A8;&#x6001;&#x5C5E;&#x6027;</p>
<p>&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x53D8;&#x91CF;&#x5B9A;&#x4E49;&#x65B9;&#x5F0F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x4F46;&#x503C;&#x5B58;&#x5230;&#x53D8;&#x91CF;&#x4E2D;&#x540E;&#xFF0C;&#x53EF;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x5219;&#x5927;&#x76F8;&#x5F84;&#x5EAD;&#x3002;&#x5BF9;&#x4E8E;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E3A;&#x5176;&#x6DFB;&#x52A0;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x548C;&#x5220;&#x9664;&#x5176;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x4E0B;</p>
<pre><code>var person=new Object();
    person.name=&quot;idea&quot;;
    alert(person.name); //&quot;idea&quot;
</code></pre><p>&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x628A;&#x5B83;&#x4FDD;&#x5B58;&#x5728;&#x4E86;&#x53D8;&#x91CF;person&#x4E2D;&#xFF0C;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x4E3A;&#x5176;&#x6DFB;&#x52A0;&#x4E86;name&#x5C5E;&#x6027;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x4E86;&#x8D4B;&#x503C;&#xFF0C;&#x7D27;&#x63A5;&#x7740;&#x901A;&#x8FC7;alert&#xFF08;&#xFF09;&#x51FD;&#x6570;&#x8BBF;&#x95EE;&#x4E86;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x4E0D;&#x88AB;&#x9500;&#x6BC1;&#x6216;&#x8005;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x4E0D;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x5C06;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x7ED9;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x6DFB;&#x52A0;&#x5C5E;&#x6027;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x6837;&#x505A;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x3002;</p>
<p>2&#x3001;&#x590D;&#x5236;&#x53D8;&#x91CF;&#x503C;</p>
<p>&#x9664;&#x4E86;&#x4FDD;&#x5B58;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x5728;&#x4ECE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x590D;&#x5236;&#x503C;&#x65F6;&#xFF0C;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x4E5F;&#x4E0D;&#x540C;&#x3002;<br>&#x5982;&#x679C;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x65B0;&#x503C;&#x590D;&#x5236;&#x5230;&#x4E3A;&#x65B0;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x7684;&#x4F4D;&#x7F6E;&#x4E0A;&#x3002;<br>&#x5982;&#x679C;&#x662F;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&#x540C;&#x6837;&#x4E5F;&#x4F1A;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x7684;&#x503C;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x5230;&#x65B0;&#x5206;&#x914D;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x526F;&#x672C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x6307;&#x9488;&#x6307;&#x5411;&#x5B58;&#x50A8;&#x5728;&#x5806;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x5B9E;&#x9645;&#x4E0A;&#x5C06;&#x5F15;&#x7528;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x6539;&#x53D8;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x91CF;&#xFF0C;&#x5C31;&#x4F1A;&#x5F71;&#x54CD;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x3002;<br>&#x5982;&#x4E0B;&#x4F8B;&#xFF1A;</p>
<pre><code>var obj1=new Object();
    var obj2=obj1;
    obj1.name=&quot;idea&quot;;
    alert(obj2.name); //&quot;idea&quot;
</code></pre><p>3&#x3001;&#x4F20;&#x9012;&#x53C2;&#x6570;</p>
<p>ES&#x4E2D;&#x7684;&#x6240;&#x6709;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x6309;&#x503C;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x5373;&#x628A;&#x51FD;&#x6570;&#x5916;&#x90E8;&#x7684;&#x503C;&#x590D;&#x5236;&#x5230;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5C31;&#x50CF;&#x628A;&#x503C;&#x4ECE;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4E00;&#x6837;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x590D;&#x5236;&#x53D8;&#x91CF;&#x4E0A;&#x9762;&#x5DF2;&#x7ECF;&#x8BB2;&#x8FC7;&#xFF0C;&#x6709;&#x4E0D;&#x5C11;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x56F0;&#x60D1;&#xFF0C;&#x8BBF;&#x95EE;&#x53D8;&#x91CF;&#x6709;&#x6309;&#x503C;&#x548C;&#x6309;&#x5F15;&#x7528;&#x4E24;&#x79CD;&#xFF0C;&#x800C;&#x53C2;&#x6570;&#x53EA;&#x80FD;&#x6309;&#x503C;&#x4F20;&#x9012;&#x3002;&#x4E0B;&#x9762;&#x89E3;&#x60D1;&#xFF1A;<br>&#x5728;&#x4F20;&#x9012;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x65F6;&#xFF0C;&#x88AB;&#x4F20;&#x9012;&#x7684;&#x503C;&#x4F1A;&#x88AB;&#x590D;&#x5236;&#x7ED9;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x5373;&#x547D;&#x540D;&#x53C2;&#x6570;&#x3002;<br>&#x5728;&#x4F20;&#x9012;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x65F6;&#xFF0C;&#x4F1A;&#x628A;&#x8FD9;&#x4E2A;&#x503C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5730;&#x5740;&#x590D;&#x5236;&#x7ED9;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x53D8;&#x5316;&#x4F1A;&#x53CD;&#x6620;&#x5728;&#x51FD;&#x6570;&#x7684;&#x5916;&#x90E8;&#x3002;</p>
<p>&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>function addTen(num){
    num+=10;
    return num;
    }
    var count=20;
    var result=addTen(count);
    alert(count);
    alert(result);
</code></pre><p>&#x8FD9;&#x91CC;&#x7684;&#x51FD;&#x6570;addTen()&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;num&#xFF0C;&#x53C2;&#x6570;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x53D8;&#x91CF;count&#x88AB;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x51FD;&#x6570;&#xFF0C;&#x4E8E;&#x662F;20&#x88AB;&#x590D;&#x5236;&#x7ED9;&#x53C2;&#x6570;num&#x4EE5;&#x4FBF;&#x5728;addTen()&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;&#x53C2;&#x6570;num&#x7684;&#x503C;&#x88AB;&#x52A0;&#x4E0A;&#x4E86;10&#xFF1B;&#x4F46;&#x8FD9;&#x4E00;&#x53D8;&#x5316;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5916;&#x90E8;&#x7684;count&#x53D8;&#x91CF;&#xFF0C;num&#x548C;count&#x4EC5;&#x4EC5;&#x662F;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x503C;&#xFF0C;&#x5047;&#x5982;num&#x662F;&#x6309;&#x7167;&#x5F15;&#x7528;&#x4F20;&#x9012;&#x7684;&#x8BDD;&#xFF0C;&#x53D8;&#x91CF;count&#x7684;&#x503C;&#x4E5F;&#x4F1A;&#x53D8;&#x6210;30&#xFF0C;&#x4ECE;&#x800C;&#x53CD;&#x6620;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5BF9;&#x8C61;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x4E0D;&#x600E;&#x4E48;&#x597D;&#x7406;&#x89E3;&#x4E86;&#xFF0C;&#x770B;&#x4E0B;&#x9762;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>function setName(obj){
    obj.name=&quot;idea&quot;;
    }
    var person=new Object();
    setName(person);
    alert(person.name);
</code></pre><p>&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x5176;&#x4FDD;&#x5B58;&#x5728;&#x4E86;person&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x4F20;&#x9012;&#x5230;setName()&#x4E4B;&#x540E;&#x590D;&#x5236;&#x7ED9;&#x4E86;Obj&#x3002;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;obj&#x548C;person&#x5F15;&#x7528;&#x7684;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;**&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x6309;&#x503C;&#x4F20;&#x9012;&#x7684;&#xFF0C;obj&#x4E5F;&#x4F1A;&#x6309;&#x5F15;&#x7528;&#x6765;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4E8E;&#x662F;&#xFF0C;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x4E3A;obj&#x6DFB;&#x52A0;&#x5C5E;&#x6027;&#x540E;&#xFF0C;&#x51FD;&#x6570;&#x5916;&#x90E8;&#x7684;person&#x4E5F;&#x4F1A;&#x6709;&#x6240;&#x53CD;&#x5E94;&#x3002;&#x4F46;&#x6709;&#x4E0D;&#x5C11;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x4E3A;&#xFF1A;&#x5728;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x4FEE;&#x6539;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x5728;&#x5168;&#x5C40;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x53CD;&#x6620;&#x51FA;&#x6765;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;&#x53C2;&#x6570;&#x662F;&#x6309;&#x5F15;&#x7528;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x5176;&#x662F;&#x6309;&#x503C;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>function setName(obj){
    obj.name=&quot;idea&quot;;
    obj=new Object();
    obj.name=&quot;alien&quot;;
    }
    var person=new Object();
    setName(person);
    alert(person.name);//&quot;idea&quot;
</code></pre><p>&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x548C;&#x524D;&#x9762;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#x552F;&#x4E00;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x662F;&#x5728;&#x51FD;&#x6570;&#x5185;&#x6DFB;&#x52A0;&#x4E86;&#x4E24;&#x884C;&#x4EE3;&#x7801;&#x3002;<br>&#x4EA7;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#x5462;&#xFF0C;&#x65B0;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6539;&#x53D8;&#x4E86;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;name&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x6309;&#x7167;&#x5F15;&#x7528;&#x6765;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x90A3;&#x4E48;person&#x7684;name&#x5C5E;&#x6027;&#x5C31;&#x662F;alien&#xFF0C;&#x800C;&#x4E0D;&#x662F;idea&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5F53;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x91CD;&#x5199;obj&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x5BF9;&#x8C61;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C40;&#x90E8;&#x5BF9;&#x8C61;&#x4F1A;&#x5728;&#x51FD;&#x6570;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#x7ACB;&#x5373;&#x9500;&#x6BC1;&#x3002;</p>
<p>&#x6CE8;&#xFF1A;&#x53EF;&#x4EE5;&#x628A;ES&#x4E2D;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x60F3;&#x8C61;&#x4E3A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3002;</p>
<p>4&#x3001;&#x68C0;&#x6D4B;&#x7C7B;&#x578B;</p>
<p>&#x8981;&#x68C0;&#x6D4B;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x4E0D;&#x662F;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#x7684;typeof&#x64CD;&#x4F5C;&#x7B26;&#x662F;&#x6700;&#x4F73;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x8BF4;&#x5177;&#x4F53;&#x70B9;&#xFF0C;typeof&#x662F;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3001;&#x6570;&#x503C;&#x3001;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x8FD8;&#x662F;undefined&#x7684;&#x6700;&#x4F73;&#x5DE5;&#x5177;&#xFF0C;&#x5982;&#x679C;&#x53D8;&#x91CF;&#x7684;&#x503C;&#x662F;&#x5BF9;&#x8C61;&#x6216;null&#xFF0C;&#x5219;typeof&#x4F1A;&#x8FD4;&#x56DE;&#x201C;object&#x201D;&#x3002;</p>
<p>&#x867D;&#x7136;typeof&#x662F;&#x4E2A;&#x6709;&#x529B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x68C0;&#x6D4B;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x7528;&#x5904;&#x4E0D;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x60F3;&#x77E5;&#x9053;&#x67D0;&#x4E2A;&#x503C;&#x662F;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x662F;&#x60F3;&#x77E5;&#x9053;&#x5B83;&#x5177;&#x4F53;&#x662F;&#x4EC0;&#x4E48;&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x6B64;&#xFF0C;ES&#x63D0;&#x4F9B;&#x4E86;instanceof&#x64CD;&#x4F5C;&#x7B26;&#x3002;</p>
<p>&#x4F8B;&#x5B50;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>alert(person instanceof Object);    
</code></pre><p>&#x5982;&#x679C;&#x53D8;&#x91CF;&#x662F;&#x7ED9;&#x5B9A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x8FD4;&#x56DE;true&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x7528;instanceof&#x68C0;&#x6D4B;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x59CB;&#x7EC8;&#x4F1A;&#x8FD4;&#x56DE;false&#xFF0C;&#x56E0;&#x4E3A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x4E0D;&#x662F;&#x5BF9;&#x8C61;&#x3002;</p>
<h2 id="&#x6267;&#x884C;&#x73AF;&#x5883;&#x548C;&#x4F5C;&#x7528;&#x57DF;"><a href="#&#x6267;&#x884C;&#x73AF;&#x5883;&#x548C;&#x4F5C;&#x7528;&#x57DF;" class="headerlink" title="&#x6267;&#x884C;&#x73AF;&#x5883;&#x548C;&#x4F5C;&#x7528;&#x57DF;"></a>&#x6267;&#x884C;&#x73AF;&#x5883;&#x548C;&#x4F5C;&#x7528;&#x57DF;</h2><p>&#x6267;&#x884C;&#x73AF;&#x5883;&#x662F;js&#x4E2D;&#x6700;&#x4E3A;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x53D8;&#x91CF;&#x6216;&#x51FD;&#x6570;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x7684;&#x5176;&#x4ED6;&#x6570;&#x636E;&#xFF0C;&#x51B3;&#x5B9A;&#x4E86;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x6BCF;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#x90FD;&#x6709;&#x4E0E;&#x4E4B;&#x5173;&#x8054;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#xFF0C;&#x73AF;&#x5883;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x90FD;&#x4FDD;&#x5B58;&#x5728;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x4F46;&#x89E3;&#x6790;&#x5668;&#x5728;&#x5904;&#x7406;&#x6570;&#x636E;&#x65F6;&#x4F1A;&#x5728;&#x540E;&#x53F0;&#x4F7F;&#x7528;&#x5B83;&#x3002;<br>&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#x662F;&#x6700;&#x5916;&#x56F4;&#x7684;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x6839;&#x636E;ES&#x5B9E;&#x73B0;&#x6240;&#x5728;&#x7684;&#x5BBF;&#x4E3B;&#x73AF;&#x5883;&#x4E0D;&#x540C;&#xFF0C;&#x8868;&#x793A;&#x6267;&#x884C;&#x73AF;&#x5883;&#x7684;&#x5BF9;&#x8C61;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5728;web&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;window&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x4F5C;&#x4E3A;window&#x7684;&#x5C5E;&#x6027;&#x548C;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x67D0;&#x4E2A;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x8BE5;&#x73AF;&#x5883;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E5F;&#x968F;&#x4E4B;&#x9500;&#x6BC1;&#xFF08;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9000;&#x51FA;&#x65F6;&#x624D;&#x88AB;&#x9500;&#x6BC1;&#xFF09;&#x3002;<br>&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x5F53;&#x6267;&#x884C;&#x6D41;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x51FD;&#x6570;&#x7684;&#x73AF;&#x5883;&#x5C31;&#x4F1A;&#x88AB;&#x63A8;&#x5165;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#x6808;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x6267;&#x884C;&#x540E;&#xFF0C;&#x6808;&#x5C06;&#x5176;&#x51FD;&#x6570;&#x5F39;&#x51FA;&#xFF0C;&#x628A;&#x63A7;&#x5236;&#x6743;&#x8FD4;&#x56DE;&#x7ED9;&#x4E4B;&#x524D;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#x3002;<br>&#x5F53;&#x4EE3;&#x7801;&#x5728;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#x4E2D;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x4F1A;&#x521B;&#x5EFA;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x3002;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7684;&#x7528;&#x9014;&#xFF0C;&#x662F;&#x4FDD;&#x8BC1;&#x5BF9;&#x6267;&#x884C;&#x73AF;&#x5883;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x7684;&#x6709;&#x5E8F;&#x8BBF;&#x95EE;&#x3002;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x59CB;&#x7EC8;&#x90FD;&#x662F;&#x5F53;&#x524D;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x6240;&#x5728;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x6700;&#x5F00;&#x59CB;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5373;arguments&#x5BF9;&#x8C61;&#xFF08;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5728;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x4E2D;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#xFF09;&#xFF0C;&#x3002;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x6765;&#x81EA;&#x5305;&#x542B;&#xFF08;&#x5916;&#x90E8;&#xFF09;&#x73AF;&#x5883;&#xFF0C;&#x518D;&#x4E0B;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x5219;&#x6765;&#x81EA;&#x4E0B;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x73AF;&#x5883;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x4E00;&#x76F4;&#x5EF6;&#x7EED;&#x5230;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x5168;&#x5C40;&#x6267;&#x884C;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x59CB;&#x7EC8;&#x90FD;&#x662F;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;<br>&#x6807;&#x8BC6;&#x7B26;&#x89E3;&#x6790;&#x662F;&#x6CBF;&#x7740;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E00;&#x7EA7;&#x4E00;&#x7EA7;&#x7684;&#x641C;&#x7D22;&#x8FC7;&#x7A0B;&#xFF0C;&#x641C;&#x7D22;&#x8FC7;&#x7A0B;&#x59CB;&#x7EC8;&#x4ECE;&#x94FE;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x59CB;&#x9010;&#x7EA7;&#x5411;&#x540E;&#x56DE;&#x6EAF;&#xFF0C;&#x76F4;&#x81F3;&#x627E;&#x5230;&#x6807;&#x8BC6;&#x7B26;&#x4E3A;&#x6B62;&#xFF0C;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x53D1;&#x751F;&#x3002;</p>
<pre><code>var color=&quot;blue&quot;;
    function changeColor(){
        if (color===&quot;blue&quot;) {
            color=&quot;red&quot;;
        } else {
            color=&quot;blue&quot;;
        }
    }
    changeColor();
    alert(&quot;Color is now*+color&quot;);
</code></pre><p>changeColor()&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x548C;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#x8BBF;&#x95EE;color&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;&#x627E;&#x5230;&#x5B83;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x5728;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x4E2D;&#x548C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E92;&#x6362;&#x4F7F;&#x7528;&#x3002;&#x5185;&#x90E8;&#x73AF;&#x5883;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x5916;&#x90E8;&#x73AF;&#x5883;&#xFF0C;&#x5916;&#x90E8;&#x73AF;&#x5883;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5185;&#x90E8;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x4E9B;&#x73AF;&#x5883;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x662F;&#x7EBF;&#x6027;&#x3001;&#x6709;&#x6B21;&#x5E8F;&#x7684;&#x3002;&#x6BCF;&#x4E2A;&#x73AF;&#x5883;&#x90FD;&#x53EF;&#x4EE5;&#x5411;&#x4E0A;&#x641C;&#x7D22;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x4EE5;&#x67E5;&#x8BE2;&#x53D8;&#x91CF;&#x548C;&#x51FD;&#x6570;&#x540D;&#xFF1B;&#x4F46;&#x4EFB;&#x4F55;&#x73AF;&#x5883;&#x90FD;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x5411;&#x4E0B;&#x641C;&#x7D22;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x800C;&#x8FDB;&#x5165;&#x6267;&#x884C;&#x73AF;&#x5883;&#x3002;</p>
<p>1&#x3001;&#x5EF6;&#x957F;&#x4F5C;&#x7528;&#x57DF;&#x94FE;</p>
<p>&#x867D;&#x7136;&#x6267;&#x884C;&#x73AF;&#x5883;&#x7684;&#x7C7B;&#x578B;&#x53EA;&#x6709;&#x4E24;&#x79CD;&#x2014;&#x2014;&#x5168;&#x5C40;&#x548C;&#x5C40;&#x90E8;&#xFF0C;&#x4F46;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x529E;&#x6CD5;&#x6765;&#x5EF6;&#x957F;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x5728;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7684;&#x524D;&#x7AEF;&#x4E34;&#x65F6;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x3002;&#x8BE5;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x4F1A;&#x5728;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x540E;&#x88AB;&#x79FB;&#x9664;&#xFF0C;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#xFF0C;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x5F53;&#x6267;&#x884C;&#x6D41;&#x8FDB;&#x5165;&#x4E0B;&#x5217;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x5C31;&#x4F1A;&#x52A0;&#x957F;&#xFF1A;</p>
<ul>
<li>try-catch&#x8BED;&#x53E5;&#x7684;catch&#x5757;</li>
<li>with&#x8BED;&#x53E5;</li>
</ul>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;&#x90FD;&#x4F1A;&#x5728;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x7684;&#x524D;&#x7AEF;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x5BF9;with&#x8BED;&#x53E5;&#x6765;&#x8BF4;&#xFF0C;&#x4F1A;&#x5C06;&#x6307;&#x5B9A;&#x7684;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x5230;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x4E2D;</p>
<p>&#x5BF9;catch&#x8BED;&#x53E5;&#x6765;&#x8BF4;&#xFF0C;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x662F;&#x88AB;&#x629B;&#x51FA;&#x7684;&#x9519;&#x8BEF;&#x5BF9;&#x8C61;&#x7684;&#x58F0;&#x660E;</p>
<p>2&#x3001;&#x6CA1;&#x6709;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;</p>
<p>js&#x6CA1;&#x6709;&#x5757;&#x7EA7;&#x4F5C;&#x7528;&#x57DF;&#x7ECF;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x7406;&#x89E3;&#x4E0A;&#x7684;&#x56F0;&#x60D1;&#xFF0C;</p>
<p>&#x5728;&#x5176;&#x4ED6;&#x7C7B;C&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x7528;&#x82B1;&#x62EC;&#x53F7;&#x5305;&#x542B;&#x8D77;&#x6765;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#xFF0C;&#x56E0;&#x800C;&#x652F;&#x6301;&#x6839;&#x636E;&#x6761;&#x4EF6;&#x6765;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x3002;&#x5373;&#x5728;&#x8BED;&#x53E5;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#x5B83;&#x4E0D;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x53D8;&#x91CF;&#x6DFB;&#x52A0;&#x5230;&#x5F53;&#x524D;&#x7684;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4E2D;&#x3002;</p>
<p>2.1 &#x58F0;&#x660E;&#x53D8;&#x91CF;</p>
<p>&#x4F7F;&#x7528;var&#x58F0;&#x660E;&#x7684;&#x53D8;&#x91CF;&#x4F1A;&#x81EA;&#x52A8;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x5185;&#x90E8;&#xFF0C;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x73AF;&#x5883;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x7684;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#xFF1B;&#x5728;with&#x8BED;&#x53E5;&#x4E2D;&#xFF0C;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x5C31;&#x662F;&#x51FD;&#x6570;&#x73AF;&#x5883;&#x3002;&#x5982;&#x679C;&#x521D;&#x59CB;&#x5316;&#x53D8;&#x91CF;&#x6CA1;&#x6709;&#x4F7F;&#x7528;var&#xFF0C;&#x8BE5;&#x53D8;&#x91CF;&#x4F1A;&#x81EA;&#x52A8;&#x6DFB;&#x52A0;&#x5230;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x5199;js&#x4EE3;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E0D;&#x58F0;&#x660E;&#x800C;&#x76F4;&#x63A5;&#x521D;&#x59CB;&#x5316;&#x53D8;&#x91CF;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x505A;&#x6CD5;&#xFF0C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x610F;&#x5916;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E00;&#x5B9A;&#x5148;&#x58F0;&#x660E;&#x3002;</p>
<p>2.2 &#x67E5;&#x8BE2;&#x6807;&#x8BC6;&#x7B26;</p>
<p>&#x5F53;&#x5728;&#x67D0;&#x4E2A;&#x73AF;&#x5883;&#x4E3A;&#x4E86;&#x8BFB;&#x53D6;&#x6216;&#x8005;&#x5199;&#x5165;&#x800C;&#x5F15;&#x7528;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x6765;&#x786E;&#x5B9A;&#x8BE5;&#x6807;&#x8BC6;&#x7B26;&#x5B9E;&#x9645;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#xFF0C;&#x641C;&#x7D22;&#x8FC7;&#x7A0B;&#x4ECE;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x524D;&#x7AEF;&#x5F00;&#x59CB;&#xFF0C;&#x5411;&#x4E0A;&#x9010;&#x7EA7;&#x67E5;&#x8BE2;&#xFF0C;&#x5982;&#x672A;&#x627E;&#x5230;&#xFF0C;&#x4E00;&#x76F4;&#x641C;&#x7D22;&#x5230;&#x5168;&#x5C40;&#x73AF;&#x5883;&#xFF0C;&#x82E5;&#x8FD8;&#x672A;&#x627E;&#x5230;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x8BE5;&#x53D8;&#x91CF;&#x672A;&#x58F0;&#x660E;&#x3002;&#x5982;&#x679C;&#x5C40;&#x90E8;&#x73AF;&#x5883;&#x4E2D;&#x5B58;&#x5728;&#x7740;&#x540C;&#x540D;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x4F4D;&#x4E8E;&#x7236;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3002;</p>
<p>ps&#xFF1A;&#x53D8;&#x91CF;&#x67E5;&#x8BE2;&#x4E5F;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x4EE3;&#x4EF7;&#x7684;&#xFF0C;&#x660E;&#x663E;&#xFF0C;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x8981;&#x6BD4;&#x8BBF;&#x95EE;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x66F4;&#x5FEB;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x7528;&#x5411;&#x4E0A;&#x641C;&#x7D22;&#x4F5C;&#x7528;&#x57DF;&#x94FE;&#x3002;&#x4F46;&#x968F;&#x7740;js&#x5F15;&#x64CE;&#x7684;&#x9010;&#x6B65;&#x4F18;&#x5316;&#xFF0C;&#x5C06;&#x6765;&#x8FD9;&#x4E2A;&#x5DEE;&#x522B;&#x53EF;&#x80FD;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x3002;</p>
<p>3&#x3001;&#x5783;&#x573E;&#x6536;&#x96C6;</p>
<p>js&#x4E2D;&#x5177;&#x6709;&#x81EA;&#x52A8;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#xFF0C;&#x6267;&#x884C;&#x73AF;&#x5883;&#x4F1A;&#x8D1F;&#x8D23;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x9700;&#x5185;&#x5B58;&#x7684;&#x5206;&#x914D;&#x548C;&#x65E0;&#x7528;&#x5185;&#x5B58;&#x7684;&#x56DE;&#x6536;&#x5B8C;&#x5168;&#x5B9E;&#x73B0;&#x4E86;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x3002;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x5176;&#x5B9E;&#x4E5F;&#x7B80;&#x5355;&#xFF0C;&#x627E;&#x51FA;&#x90A3;&#x4E9B;&#x4E0D;&#x518D;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x91CA;&#x653E;&#x5176;&#x5185;&#x5B58;&#x3002;&#x4E3A;&#x6B64;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4F1A;&#x6309;&#x7167;&#x56FA;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5468;&#x671F;&#x6027;&#x7684;&#x6267;&#x884C;&#x8FD9;&#x4E00;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x5148;&#x6765;&#x5206;&#x6790;&#x4E00;&#x4E0B;&#x51FD;&#x6570;&#x4E2D;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x53EA;&#x5728;&#x51FD;&#x6570;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B58;&#x5728;&#xFF0C;&#x800C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x4E3A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5728;&#x6808;&#x6216;&#x5806;&#x5185;&#x5B58;&#x4E0A;&#x5206;&#x914D;&#x76F8;&#x5E94;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B58;&#x50A8;&#x5B83;&#x4EEC;&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x51FD;&#x6570;&#x4E2D;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x503C;&#xFF0C;&#x76F4;&#x81F3;&#x51FD;&#x6570;&#x6267;&#x884C;&#x7ED3;&#x675F;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5C31;&#x6CA1;&#x6709;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x4F9B;&#x5C06;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x4F46;&#x5E76;&#x975E;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x8FD9;&#x4E48;&#x5BB9;&#x6613;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5FC5;&#x987B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#xFF0C;&#x5BF9;&#x4E0D;&#x518D;&#x6709;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x6253;&#x4E0A;&#x6807;&#x8BB0;&#x4EE5;&#x5907;&#x5C06;&#x6765;&#x6536;&#x56DE;&#x5B83;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6807;&#x8BC6;&#x7B56;&#x7565;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x5B9E;&#x73B0;&#x800C;&#x5F02;&#xFF0C;&#x4F46;&#x5177;&#x4F53;&#x5230;&#x6D4F;&#x89C8;&#x5668;&#x5B9E;&#x73B0;&#x901A;&#x5E38;&#x6709;&#x4E24;&#x4E2A;&#x7B56;&#x7565;&#x3002;</p>
<p>3.1 &#x6807;&#x8BB0;&#x6E05;&#x9664;</p>
<p>&#x662F;js&#x4E2D;&#x6700;&#x5E38;&#x7528;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65B9;&#x5F0F;&#xFF0C;&#x5F53;&#x53D8;&#x91CF;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#xFF0C;&#x5C31;&#x5C06;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x6807;&#x8BB0;&#x4E3A;&#x201C;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#x201D;&#x3002;&#x903B;&#x8F91;&#x4E0A;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x91CA;&#x653E;&#x8FDB;&#x5165;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x91CF;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x8981;&#x6267;&#x884C;&#x6D41;&#x8FDB;&#x5165;&#x76F8;&#x5E94;&#x73AF;&#x5883;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x7528;&#x5230;&#x5B83;&#x4EEC;&#xFF0C;&#x800C;&#x5F53;&#x53D8;&#x91CF;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x65F6;&#xFF0C;&#x5C06;&#x5176;&#x6807;&#x8BB0;&#x201C;&#x79BB;&#x5F00;&#x73AF;&#x5883;&#x201D;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x6765;&#x6807;&#x8BB0;&#x53D8;&#x91CF;&#xFF0C;&#x8BF4;&#x5230;&#x5E95;&#xFF0C;&#x5982;&#x4F55;&#x6807;&#x8BB0;&#x53D8;&#x91CF;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5173;&#x952E;&#x5728;&#x4E8E;&#x91C7;&#x53D6;&#x4EC0;&#x4E48;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x7ED9;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x90FD;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x4F1A;&#x53BB;&#x6389;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x4EE5;&#x53CA;&#x88AB;&#x73AF;&#x5883;&#x4E2D;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x800C;&#x5728;&#x6B64;&#x4E4B;&#x540E;&#x518D;&#x88AB;&#x52A0;&#x4E0A;&#x6807;&#x8BB0;&#x7684;&#x53D8;&#x91CF;&#x5C06;&#x88AB;&#x89C6;&#x4E3A;&#x51C6;&#x5907;&#x5220;&#x9664;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x73AF;&#x5883;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5230;&#x8FD9;&#x4E9B;&#x53D8;&#x91CF;&#x4E86;&#xFF0C;&#x6700;&#x540E;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5B8C;&#x6210;&#x5185;&#x5B58;&#x6E05;&#x9664;&#x5DE5;&#x4F5C;&#xFF0C;&#x9500;&#x6BC1;&#x90A3;&#x4E9B;&#x5E26;&#x6807;&#x8BB0;&#x7684;&#x503C;&#x5E76;&#x56DE;&#x6536;&#x5B83;&#x4EEC;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;</p>
<p>3.2 &#x5F15;&#x7528;&#x8BA1;&#x6570;</p>
<p>&#x542B;&#x4E49;&#x662F;&#x8DDF;&#x8E2A;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x503C;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x5F53;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x5E76;&#x5C06;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x503C;&#x8D4B;&#x7ED9;&#x8BE5;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x662F;1&#xFF0C;&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x503C;&#x53C8;&#x88AB;&#x8D4B;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x52A0;1&#xFF0C;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x5305;&#x542B;&#x5BF9;&#x8FD9;&#x4E2A;&#x503C;&#x5F15;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x53C8;&#x53D6;&#x5F97;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5219;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x51CF;1&#xFF0C;&#x5F15;&#x7528;&#x6B21;&#x6570;&#x53D8;&#x6210;0&#xFF0C;&#x8BF4;&#x660E;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x518D;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x56E0;&#x800C;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x56DE;&#x6536;&#x3002;</p>
<p>3.3 &#x6027;&#x80FD;&#x95EE;&#x9898;</p>
<p>&#x5783;&#x573E;&#x6536;&#x96C6;&#x662F;&#x5468;&#x671F;&#x6027;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4E3A;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x5F88;&#x53EF;&#x89C2;&#xFF0C;&#x90A3;&#x4E48;&#x56DE;&#x6536;&#x5DE5;&#x4F5C;&#x91CF;&#x4E5F;&#x662F;&#x5F88;&#x5927;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x786E;&#x5B9A;&#x6536;&#x96C6;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5C31;&#x5F88;&#x91CD;&#x8981;&#x4E86;&#x3002;</p>
<p>3.4 &#x7BA1;&#x7406;&#x5185;&#x5B58;</p>
<p>&#x5728;&#x4F7F;&#x7528;&#x5177;&#x5907;&#x5783;&#x573E;&#x6536;&#x96C6;&#x673A;&#x5236;&#x7684;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x822C;&#x4E0D;&#x5FC5;&#x64CD;&#x5FC3;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;js&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5206;&#x914D;&#x7ED9;web&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x901A;&#x5E38;&#x6BD4;&#x5206;&#x914D;&#x7ED9;&#x684C;&#x9762;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5C11;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x51FA;&#x4E8E;&#x5B89;&#x5168;&#x8003;&#x8651;&#xFF0C;&#x9632;&#x6B62;&#x8FD0;&#x884C;js&#x7684;&#x7F51;&#x9875;&#x8017;&#x5C3D;&#x5168;&#x90E8;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x800C;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x3002;&#x5185;&#x5B58;&#x9650;&#x5236;&#x95EE;&#x9898;&#x4E0D;&#x4EC5;&#x4F1A;&#x5F71;&#x54CD;&#x7ED9;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x4F1A;&#x5F71;&#x54CD;&#x8C03;&#x7528;&#x6808;&#x4EE5;&#x53CA;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x80FD;&#x591F;&#x540C;&#x65F6;&#x6267;&#x884C;&#x7684;&#x8BED;&#x53E5;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x786E;&#x4FDD;&#x4F7F;&#x7528;&#x6700;&#x5C11;&#x7684;&#x5185;&#x5B58;&#x53EF;&#x4EE5;&#x8BA9;&#x9875;&#x9762;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x800C;&#x4F18;&#x5316;&#x5185;&#x5B58;&#x5360;&#x7528;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x4E3A;&#x6267;&#x884C;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x53EA;&#x4FDD;&#x5B58;&#x5FC5;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E00;&#x65E6;&#x6570;&#x636E;&#x4E0D;&#x518D;&#x6709;&#x7528;&#xFF0C;&#x6700;&#x597D;&#x901A;&#x8FC7;&#x5C06;&#x5176;&#x503C;&#x8BBE;&#x7F6E;&#x4E3A;null&#x6765;&#x91CA;&#x653E;&#x5176;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x505A;&#x6CD5;&#x53EB;&#x89E3;&#x9664;&#x5F15;&#x7528;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x89E3;&#x9664;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x5F15;&#x7528;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x81EA;&#x52A8;&#x56DE;&#x6536;&#x8BE5;&#x503C;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x7684;&#x771F;&#x6B63;&#x4F5C;&#x7528;&#x662F;&#x8BA9;&#x503C;&#x8131;&#x79BB;&#x6267;&#x884C;&#x73AF;&#x5883;&#xFF0C;&#x4EE5;&#x4FBF;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E0B;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#x5C06;&#x5176;&#x56DE;&#x6536;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x5173;&#x4E8E;&#x201C;&#x53D8;&#x91CF;&#x3001;&#x4F5C;&#x7528;&#x57DF;&#x548C;&#x5185;&#x5B58;&#x201D;&#x5C31;&#x5148;&#x7B80;&#x5355;&#x8BF4;&#x5230;&#x8FD9;&#x513F;&#x4E86;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x86EE;&#x591A;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8010;&#x5FC3;&#x7684;&#x54C1;&#x5473;&#x4E00;&#x4E0B;&#x5C31;&#x80FD;&#x6709;&#x4E0D;&#x5C11;&#x6536;&#x83B7;&#x3002;&#x4E0B;&#x6B21;&#x5C31;&#x8BE5;&#x662F;js&#x4E2D;&#x7684;&#x5927;&#x5757;&#x5934;&#x4E4B;&#x4E00;&#x2014;&#x2014;&#x201C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x201D;&#x4E86;&#xFF0C;&#x656C;&#x8BF7;&#x671F;&#x5F85;~</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/javascript/" rel="tag">#javascript</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/03/20/javascript-study-three/" rel="next" title="征服javascript学习笔记（三）——基本概念（下）">
                <i class="fa fa-chevron-left"></i> 征服javascript学习笔记（三）——基本概念（下）
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/29/前端资源收集小思/" rel="prev" title="前端资源收集小思">
                前端资源收集小思 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#基本类型和引用类型的值"><span class="nav-number">1.</span> <span class="nav-text">基本类型和引用类型的值</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#执行环境和作用域"><span class="nav-number">2.</span> <span class="nav-text">执行环境和作用域</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
