<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>《前端圈技术论坛-腾讯互娱专场》观后感 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">《前端圈技术论坛-腾讯互娱专场》观后感</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">《前端圈技术论坛-腾讯互娱专场》观后感</h1><div class="post-meta">Nov 23, 2014<span> | </span><span class="category"><a href="/categories/分享交流/">分享交流</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2014/11/23/fequan_2014/" href="/2014/11/23/fequan_2014/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div></div></div><div class="post-content"><p>&#x81EA;&#x4ECE;&#x77E5;&#x9053;&#x4E86;<a href="http://www.fequan.com/" target="_blank" rel="external">&#x524D;&#x7AEF;&#x5708;</a>&#x4F1A;&#x6709;&#x8D70;&#x8FDB;&#x540D;&#x4F01;&#x7684;&#x8BBA;&#x575B;&#xFF0C;&#x5C31;&#x671F;&#x5F85;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x53BB;&#x53C2;&#x52A0;&#xFF0C;10&#x6708;&#x4EFD;&#x6709;&#x4E00;&#x6B21;&#x5728;&#x5E7F;&#x5DDE;vip&#xFF0C;&#x4E0D;&#x7B97;&#x8FDC;&#xFF0C;&#x672C;&#x6765;&#x8981;&#x53BB;&#x7684;&#xFF0C;&#x4F46;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x672A;&#x80FD;&#x53BB;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x5076;&#x7136;&#x77E5;&#x9053;&#x4E86;&#x8D70;&#x8FDB;&#x4E92;&#x5A31;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x8BB2;&#x91CD;&#x6784;&#x548C;H5&#x6E38;&#x620F;&#x65B9;&#x9762;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x521A;&#x6765;&#x5230;&#x4F01;&#x9E45;&#x505A;&#x91CD;&#x6784;&#xFF0C;&#x4F3C;&#x4E4E;&#x6CA1;&#x7406;&#x7531;&#x4E0D;&#x53BB;&#x4E86;~</p>
<p>&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p>1&#x3001;TGideas&#x526F;&#x603B;&#x76D1;PANTHER&#x81F4;&#x8F9E;<br>2&#x3001;TGideas&#x91CD;&#x6784;&#x56DB;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x9EC4;&#x52C7;&#x5C24;&#xFF1A;<strong>Can I use webp&#xFF1F;</strong></p>
<p>&#x9996;&#x5148;&#x4E0D;&#x5F97;&#x4E0D;&#x5766;&#x8BDA;&#x7684;&#x8BF4;&#x7B2C;&#x4E00;&#x6B21;&#x5230;&#x4E92;&#x5A31;&#x53BB;&#xFF0C;&#x800C;&#x4E14;&#x4EA4;&#x901A;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x8FDF;&#x5230;&#x4E86;&#xFF0C;&#x5F88;&#x9057;&#x61BE;&#x7684;&#x9519;&#x8FC7;&#x4E86;&#x524D;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x7B49;&#x6211;&#x53BB;&#x4E86;&#x4E4B;&#x540E;&#x5DF2;&#x7ECF;&#x5230;&#x4E86;&#x7B2C;&#x4E09;&#x4E2A;&#x8BDD;&#x9898;&#x7684;&#x63D0;&#x95EE;&#x73AF;&#x8282;&#x3002;&#x7ACB;&#x5373;&#x5750;&#x4E0B;&#x4E13;&#x5FC3;&#x542C;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x90E8;&#x5206;&#x7684;&#x5982;&#x679C;&#x540E;&#x9762;&#x6709;&#x8D44;&#x6599;&#x653E;&#x51FA;&#xFF0C;&#x4F1A;&#x505A;&#x4E2A;&#x5F25;&#x8865;&#x3002;</p>
<p>3&#x3001;TGideas&#x91CD;&#x6784;&#x4E00;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x8C2D;&#x6770;&#x4FCA;&#xFF1A;<strong>&#x9010;&#x5E27;&#x52A8;&#x753B;-&#x8BA9;&#x9B54;&#x6CD5;&#x5C0F;&#x7CBE;&#x7075;&#x5728;&#x4F60;&#x7684;&#x9875;&#x9762;&#x4E0A;&#x8D77;&#x821E;</strong></p>
<p>&#x8FD9;&#x4E2A;&#x90E8;&#x5206;&#x53EA;&#x542C;&#x5230;&#x4E86;&#x63D0;&#x95EE;&#x7684;&#x73AF;&#x8282;&#xFF0C;&#x4E5F;&#x7A0D;&#x6709;&#x9057;&#x61BE;&#xFF0C;&#x63D0;&#x95EE;&#x7684;&#x65F6;&#x5019;&#x6709;&#x95EE;&#x5230;&#x56FE;&#x7247;&#x538B;&#x7F29;&#x548C;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x505A;&#x52A8;&#x753B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x4F55;&#x9009;&#x62E9;css3&#x548C;js&#xFF0C;&#x8981;&#x628A;&#x6587;&#x4EF6;&#x6700;&#x597D;&#x63A7;&#x5236;&#x5230;&#x591A;&#x5927;&#x3002;&#x8FD9;&#x65B9;&#x9762;&#x4E4B;&#x524D;&#x4E5F;&#x6709;&#x4E86;&#x89E3;&#xFF0C;&#x8BB2;&#x5E08;&#x4E3B;&#x5F20;&#x4F18;&#x5148;&#x9009;&#x62E9;css3&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x505A;&#x4E00;&#x4E9B;&#x964D;&#x7EA7;&#x7684;&#x5904;&#x7406;&#x3002;&#x8FD8;&#x6709;&#x63D0;&#x5230;&#x4E86;Gpu&#x52A0;&#x901F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x6709;&#x4E9B;css3&#x7684;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x89E6;&#x53D1;gpu&#x52A0;&#x901F;&#x7684;&#x3002;</p>
<p>4&#x3001;TGideas&#x591A;&#x5A92;&#x4F53;&#x5F00;&#x53D1;&#x7EC4;&#xFF08;&#x591A;&#x5A92;&#x4F53;&#x5F00;&#x53D1;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09; &#x7F57;&#x98DE;&#x864E;</p>
<p>&#x8FD9;&#x6BB5;&#x662F;&#x6211;&#x4E0D;&#x719F;&#x6089;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4E0D;&#x719F;&#x6089;&#x624D;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x5E73;&#x65F6;&#x4E5F;&#x7231;&#x73A9;&#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x9177;&#x8DD1;~&#x6E38;&#x620F;&#x6CA1;&#x6709;&#x505A;&#x8FC7;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x6536;&#x83B7;&#xFF0C;&#x6BD4;&#x5982;&#x6E38;&#x620F;&#x5927;&#x6982;&#x8981;&#x505A;&#x7684;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#xFF0C;&#x52A0;&#x8F7D;&#x72B6;&#x6001;&#x3001;&#x6B22;&#x8FCE;&#x72B6;&#x6001;&#x3001;&#x65B0;&#x624B;&#x5F15;&#x5BFC;&#x3001;&#x6E38;&#x620F;&#x4E2D;&#x3001;&#x7ED3;&#x7B97;&#x5206;&#x6570;&#x3001;&#x5206;&#x4EAB;&#x6218;&#x7EE9;&#x7B49;&#x7B49;&#xFF0C;&#x7A81;&#x7136;&#x4E00;&#x4E0B;&#x5B50;&#x4F7F;&#x5F97;&#x5BF9;&#x4E8E;&#x6E38;&#x620F;&#x7684;&#x51E0;&#x4E2A;&#x90E8;&#x5206;&#x53D8;&#x5F97;&#x660E;&#x6717;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x6E38;&#x620F;&#x5F00;&#x53D1;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD8;&#x89C1;&#x8BC6;&#x5230;&#x4E86;&#x4E00;&#x6B3E;&#x6E38;&#x620F;&#x5F53;&#x4E2D;&#x8981;&#x7528;&#x5230;&#x591A;&#x5C11;&#x79CD;&#x7C7B;&#x548C;&#x72B6;&#x6001;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x63D0;&#x5230;&#x4E86;&#x4E24;&#x79CD;&#x5F15;&#x64CE;&#xFF0C;cocos2d-html5&#x548C;createjs&#x3002;&#x4F46;&#x6211;&#x4E2A;&#x4EBA;&#x5BF9;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4E86;&#x89E3;&#x4E0D;&#x591A;&#xFF0C;&#x4EE5;&#x540E;&#x8981;&#x52A0;&#x5F3A;&#x4E86;&#x3002; &#x63D0;&#x95EE;&#x73AF;&#x8282;&#x6709;&#x4EBA;&#x95EE;&#x5230;&#x4E86;&#x5982;&#x4F55;&#x505A;&#x5230;&#x624B;&#x673A;&#x4E0A;&#x548C;ipad&#x4E0A;&#x7684;&#x9002;&#x914D;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x65F6;&#x4ED6;&#x672A;&#x505A;&#x8FC7;&#x591A;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x540E;&#x6765;&#x53E6;&#x4E00;&#x4F4D;&#x5609;&#x5BBE;&#x8865;&#x5145;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x4E24;&#x5957;&#x65B9;&#x6848;&#xFF0C;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x8BBE;&#x5907;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;css&#x6216;&#x56FE;&#x7247;&#x3002;</p>
<p>5&#x3001;TGideas&#x91CD;&#x6784;&#x4E8C;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x4E01;&#x4EAE;&#x4EAE;&#xFF1A;<strong>&#x91CD;&#x6784;&#x4EE3;&#x7801;&#x4FEE;&#x70BC;&#x4E4B;&#x9053;</strong></p>
<p>&#x8FD9;&#x4E00;&#x6BB5;&#x662F;&#x4E2D;&#x95F4;&#x4F11;&#x606F;&#x4E4B;&#x540E;&#x7684;&#xFF0C;&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E00;&#x4E2A;&#x8BDD;&#x9898;&#x52A0;&#x4E0A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#xFF0C;&#x662F;&#x8DDF;&#x6211;&#x5E73;&#x65F6;&#x5DE5;&#x4F5C;&#x6700;&#x8D34;&#x5207;&#x7684;&#x3002;smallni&#x7684;&#x535A;&#x5BA2;&#x5E73;&#x65F6;&#x4E5F;&#x5E38;&#x770B;&#xFF0C;whycss&#x7F51;&#x5740;&#x5BFC;&#x822A;&#x5E94;&#x8BE5;&#x4E5F;&#x662F;&#x4ED6;&#x505A;&#x7684;&#xFF0C;&#x90FD;&#x5F88;&#x4E0D;&#x9519;&#xFF0C;&#x8FD9;&#x6B21;&#x6709;&#x5E78;&#x542C;&#x5230;&#x4ED6;&#x8BB2;&#x89E3;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#x4E5F;&#x5F88;&#x8363;&#x5E78;&#x3002;&#x8BED;&#x901F;&#x9002;&#x4E2D;&#xFF0C;&#x4E0D;&#x662F;&#x90A3;&#x79CD;&#x8BA9;&#x4EBA;&#x60F3;&#x7761;&#x7740;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x633A;&#x597D;~</p>
<p>&#x4ED6;&#x63D0;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x4F18;&#x96C5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4ED6;&#x91C7;&#x7528;&#x4E86;&#x4EE3;&#x7801;&#x622A;&#x56FE;&#x4F5C;&#x5BF9;&#x6BD4;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C55;&#x793A;&#x4E86;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x7F29;&#x8FDB;&#xFF0C;&#x4E0D;&#x540C;&#x7C7B;&#x547D;&#x540D;&#x65B9;&#x6CD5;&#x4E4B;&#x4E0B;&#x7684;html&#x548C;css&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4E0D;&#x4EC5;&#x4EC5;&#x505A;&#x5230;&#x6807;&#x7B7E;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x540C;&#x6837;&#x7C7B;&#x7684;&#x547D;&#x540D;&#x4E5F;&#x8981;&#x8BED;&#x4E49;&#x5316;&#xFF0C;&#x5229;&#x7528;&#x597D;&#x57FA;&#x7C7B;&#xFF0C;&#x6269;&#x5C55;&#x7C7B;&#xFF0C;&#x5B9E;&#x4F8B;&#x7C7B;&#x8FD9;&#x4E9B;&#x6280;&#x5DE7;&#x3002;&#x600E;&#x6837;&#x5199;&#x4EE3;&#x7801;&#x66F4;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#xFF0C;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x4FBF;&#x80FD;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x4F18;&#x96C5;&#x3002;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6CE8;&#x91CA;&#xFF0C;&#x63D0;&#x51FA;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x4E0D;&#x8981;&#x6CE8;&#x91CA;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x7EF4;&#x62A4;&#x6216;&#x8005;&#x56E2;&#x961F;&#x534F;&#x4F5C;&#xFF0C;&#x8981;&#x52A0;&#x4E0A;&#x5408;&#x7406;&#x7684;&#x6CE8;&#x91CA;&#x3002;&#x786E;&#x8BA4;&#x8BBE;&#x8BA1;&#x7A3F;&#x4E2D;&#x4EA4;&#x4E92;&#x662F;&#x5426;&#x5B8C;&#x6574;&#xFF0C;&#x6BD4;&#x5982;&#x662F;&#x5426;&#x5177;&#x6709;&#x4E86;&#x5404;&#x79CD;&#x72B6;&#x6001;&#x4E0B;&#x5E94;&#x6709;&#x7684;UI&#xFF0C;&#x786E;&#x8BA4;&#x56FA;&#x5B9A;&#x6807;&#x9898;&#x5B57;&#x6570;&#x3001;&#x56FA;&#x5B9A;&#x56FE;&#x7247;&#x4F4D;&#x5927;&#x5C0F;&#x89C4;&#x8303;&#x7B49;&#x7B49;&#x3002;&#x4E5F;&#x63D0;&#x5230;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x6BD4;&#x5982;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x770B;&#x8D77;&#x6765;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x6807;&#x9898;&#x548C;&#x5185;&#x5BB9;&#xFF0C;&#x90A3;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x53EA;&#x6709;&#x8DDF;&#x5B83;&#x76F8;&#x4F3C;&#x7684;&#x6807;&#x9898;&#xFF0C;&#x800C;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x53EA;&#x6709;&#x8DDF;&#x5B83;&#x76F8;&#x4F3C;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x53BB;&#x628A;&#x6574;&#x4E2A;&#x4E00;&#x5927;&#x5757;&#x6A21;&#x5757;&#x5316;&#x660E;&#x663E;&#x5C31;&#x884C;&#x4E0D;&#x901A;&#x4E86;&#xFF0C;&#x4E5F;&#x505A;&#x4E0D;&#x5230;&#x5F88;&#x597D;&#x7684;&#x590D;&#x7528;&#x3002;&#x7531;&#x6B64;&#x5F15;&#x51FA;&#x4E86;&#x5230;&#x5E95;&#x600E;&#x6837;&#x53BB;&#x5212;&#x5206;&#xFF0C;&#x4EE5;&#x600E;&#x6837;&#x7684;&#x6807;&#x51C6;&#x53BB;&#x5212;&#x5206;&#xFF0C;&#x63D0;&#x5230;&#x4E86;&#x9897;&#x7C92;&#x5316;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x4F60;&#x8981;&#x6A21;&#x5757;&#x5316;&#x7684;&#x4E1C;&#x897F;&#x8303;&#x56F4;&#x7F29;&#x5C0F;&#xFF0C;&#x53E6;&#x5916;&#x7684;&#x90E8;&#x5206;&#x5212;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x9897;&#x7C92;&#xFF0C;&#x8FD9;&#x6837;&#x5B50;&#x5C31;&#x50CF;&#x662F;&#x9897;&#x7C92;&#x548C;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x534F;&#x4F5C;&#x4E00;&#x6837;&#x53BB;&#x5B8C;&#x6210;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x3002;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x601D;&#x8DEF;&#x3002;</p>
<p>6&#x3001;TGideas&#x91CD;&#x6784;&#x4E8C;&#x7EC4;&#xFF08;&#x91CD;&#x6784;&#x5DE5;&#x7A0B;&#x5E08;&#xFF09;&#x8096;&#x946B;&#x88D5;&#xFF1A;<strong>&#x524D;&#x7AEF;&#x722C;&#x5751;&#x6307;&#x5357;</strong></p>
<p>&#x6B64;&#x4EBA;&#x98CE;&#x683C;&#x5E7D;&#x9ED8;&#x8BD9;&#x8C10;&#xFF0C;&#x81EA;&#x6211;&#x4ECB;&#x7ECD;&#x662F;css&#x68EE;&#x6797;&#x7FA4;&#x91CC;&#x9762;&#x7684;&#x201C;&#x602A;&#x517D;&#x201D;&#xFF0C;PPT&#x80CC;&#x666F;&#x662F;&#x7C89;&#x7EA2;&#x8272;&#xFF0C;&#x81EA;&#x6211;&#x8C03;&#x4F83;&#x6BD4;&#x8F83;&#x201C;&#x9A9A;&#x201D;&#x3002;&#x6CA1;&#x6709;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#xFF0C;&#x4E0D;&#x4F1A;&#x663E;&#x5F97;&#x5F88;&#x95F7;&#x3002;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x4ECE;&#x4E1A;&#x7ECF;&#x5386;&#xFF0C;&#x63D0;&#x51FA;&#x4E86;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x4E00;&#x5B9A;&#x8981;&#x517C;&#x5BB9;IE&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x76F8;&#x5173;&#x4F60;&#x7684;&#x7528;&#x6237;&#x7FA4;&#x5230;&#x5E95;&#x662F;&#x54EA;&#x90E8;&#x5206;&#xFF0C;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x8FD8;&#x6709;&#x8BB2;&#x5230;&#x8BF4;&#x5982;&#x679C;&#x91CD;&#x6784;&#x6BD4;&#x8F83;&#x65E9;&#x7684;&#x8FDB;&#x5165;&#x5230;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x62FF;&#x5230;&#x8BBE;&#x8BA1;&#x7A3F;&#x4E4B;&#x524D;&#xFF0C;&#x5982;&#x4F55;&#x53BB;&#x786E;&#x5B9A;&#x516C;&#x7528;&#x6216;&#x8005;&#x53EF;&#x590D;&#x7528;&#x548C;&#x6269;&#x5C55;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x4E4B;&#x524D;&#x4E00;&#x4E2A;&#x7AE5;&#x978B;&#x63D0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x505A;&#x4E86;&#x8865;&#x5145;&#x89E3;&#x7B54;&#xFF0C;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4ED6;&#x7ED9;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C31;&#x628A;&#x6240;&#x6709;&#x7684;&#x90FD;&#x505A;&#x6210;&#x516C;&#x7528;&#x90E8;&#x5206;~&#x5475;&#x5475;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x662F;&#x5426;&#x53EF;&#x884C;&#x8FD8;&#x662F;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x8003;&#x91CF;&#x4E86;&#x3002;&#x7136;&#x540E;&#x8FD8;&#x4E3E;&#x4E86;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4EA7;&#x54C1;&#x4F8B;&#x5B50;&#x6BD4;&#x5982;Qzone&#xFF0C;&#x6211;&#x53CB;&#x7F51;&#x548C;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x6B3E;&#x4EA7;&#x54C1;&#x8BB0;&#x4E0D;&#x5927;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x6765;&#x4E3E;&#x4F8B;&#x5B50;&#x53BB;&#x5206;&#x6790;&#x5728;&#x4E0D;&#x540C;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x4E0D;&#x7528;&#x91CF;&#x7EA7;&#x7528;&#x6237;&#x7FA4;&#xFF0C;&#x4E0D;&#x540C;&#x4EA7;&#x54C1;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#xFF0C;&#x4E0D;&#x540C;&#x89C4;&#x6A21;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x600E;&#x6837;&#x53D6;&#x820D;&#x3002;&#x5728;&#x8DDF;&#x540C;&#x4E8B;&#x4E4B;&#x95F4;&#x7684;&#x5408;&#x4F5C;&#x4E5F;&#x662F;&#x4E0D;&#x80FD;&#x201C;&#x8A00;&#x542C;&#x5373;&#x4ECE;&#x201D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x522B;&#x4EBA;&#x8BA9;&#x4F60;&#x6539;&#x4F60;&#x5C31;&#x6539;&#xFF0C;&#x522B;&#x4EBA;&#x8BA9;&#x4F60;&#x52A0;&#x73ED;&#x91CD;&#x505A;&#xFF0C;&#x4F60;&#x5C31;&#x52A0;&#x73ED;&#x91CD;&#x505A;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x4E2A;&#x4EBA;&#x548C;&#x56E2;&#x961F;&#x90FD;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x597D;&#x4E8B;&#x60C5;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x8981;&#x4F1A;&#x9002;&#x5F53;&#x7684;&#x4E3A;&#x81EA;&#x5DF1;&#x53BB;&#x4E89;&#x53D6;&#x800C;&#x62D2;&#x7EDD;&#x4E00;&#x4E9B;&#x8981;&#x6C42;&#x3002;&#x8FD8;&#x4E3E;&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x53BB;&#x8BF4;&#x660E;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x4E1C;&#x897F;&#x8DDF;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x540C;&#xFF0C;&#x505A;&#x51FA;&#x6765;&#x7684;&#x4E1C;&#x897F;&#x8DDF;&#x5BA2;&#x6237;&#x771F;&#x6B63;&#x60F3;&#x8981;&#x7684;&#x53EF;&#x80FD;&#x53C8;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x66F4;&#x597D;&#x7684;&#x6C9F;&#x901A;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x591A;&#x7684;&#x53BB;&#x5173;&#x6CE8;&#x7528;&#x6237;&#xFF0C;&#x5173;&#x6CE8;&#x6570;&#x636E;&#x5206;&#x6790;&#x7B49;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x8981;&#x505A;&#x5230;&#x6709;&#x7406;&#x6709;&#x636E;&#xFF0C;&#x6BD4;&#x5982;&#x4EA7;&#x54C1;&#x8BA4;&#x4E3A;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x6216;&#x8005;&#x8BBE;&#x8BA1;&#x8BA4;&#x4E3A;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x4F60;&#x4E0D;&#x540C;&#x610F;&#xFF0C;&#x4ED6;&#x4EEC;&#x95EE;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x4F60;&#x56DE;&#x7B54;&#xFF1A;&#x6211;&#x5C31;&#x662F;&#x89C9;&#x5F97;&#x90A3;&#x6837;&#x6BD4;&#x8FD9;&#x6837;&#x597D;&#x3002;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E0D;&#x80FD;&#x591F;&#x6709;&#x8BF4;&#x670D;&#x529B;&#x7684;&#xFF0C;&#x8BA8;&#x8BBA;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F88;&#x5FEB;&#x6709;&#x7ED3;&#x679C;&#xFF0C;&#x6700;&#x597D;&#x662F;&#x62FF;&#x51FA;&#x5B9E;&#x4F8B;&#x6216;&#x8005;&#x5B9E;&#x9645;&#x7684;&#x5E02;&#x573A;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F88;&#x660E;&#x663E;&#x7684;&#x770B;&#x51FA;&#x5B70;&#x4F18;&#x5B70;&#x52A3;&#x3002;<br>&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x6240;&#x8BB2;&#x7684;&#x662F;&#x4E00;&#x4E9B;&#x722C;&#x5751;&#xFF0C;&#x5185;&#x5BB9;&#x4E0D;&#x6B62;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x4FE1;&#x606F;&#x91CF;&#x7A0D;&#x5927;&#xFF0C;&#x5F53;&#x65F6;&#x53C8;&#x53BB;&#x665A;&#x4E86;&#x5750;&#x5728;&#x540E;&#x6392;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x6CA1;&#x62CD;&#x7167;&#xFF0C;&#x540E;&#x671F;&#x524D;&#x7AEF;&#x7FA4;&#x5E94;&#x8BE5;&#x4F1A;&#x6709;PPT&#x53D1;&#x5E03;&#x51FA;&#x6765;&#x5230;&#x65F6;&#x518D;&#x56DE;&#x5473;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x6B21;&#x7684;&#x5206;&#x4EAB;&#x5C31;&#x5148;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x628A;&#x8BBA;&#x575B;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x542C;&#x5B8C;&#xFF0C;&#x4F46;&#x6536;&#x83B7;&#x4E5F;&#x662F;&#x86EE;&#x5927;&#x7684;&#x3002;&#x89C1;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x725B;&#x4EBA;&#x4EEC;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x4E5F;&#x53C2;&#x52A0;&#x4E86;&#x6700;&#x540E;&#x7684;&#x6E38;&#x620F;&#x73AF;&#x8282;&#x5E76;&#x62FF;&#x5230;&#x4E86;&#x4E00;&#x4EFD;&#x793C;&#x7269;&#x54E6;&#xFF01;&#x4E0B;&#x9762;&#x5949;&#x4E0A;&#x7167;&#x7247;&#x3002;</p>
<p>&#x96C6;&#x4F53;&#x5408;&#x7167;&#x7559;&#x5FF5;&#xFF08;&#x5973;&#x751F;&#x540E;&#x9762;&#x90A3;&#x6392;&#x4E2D;&#x95F4;&#x5DE6;&#x624B;&#x62FF;&#x793C;&#x7269;&#x7684;&#x683C;&#x683C;&#x77ED;&#x8896;&#x7537;&#x751F;&#x5C31;&#x662F;&#x6211;&#x54E6;~&#xFF09;</p>
<p><img src="/2014/11/23/fequan_2014/1.jpg" alt="&#x5927;&#x5408;&#x5F71;"><br>&#x5F97;&#x5230;&#x7684;&#x5C0F;&#x793C;&#x7269;</p>
<p><img src="/2014/11/23/fequan_2014/2.jpg" alt="&#x5145;&#x7535;&#x5B9D;"> </p>
</div><a data-url="http://yoursite.com/2014/11/23/fequan_2014/" data-id="cimozt1r1004ki8qin7pnitib" class="article-share-link">分享到</a><div class="tags"><a href="/tags/分享交流/">分享交流</a></div><div class="post-nav"><a href="/2014/12/27/webrebuild_2015/" class="pre">第八届webrebuild年会总结暨“如何做一个理想主义者”</a><a href="/2014/11/14/导航类“不定宽水平居中”的几种思路/" class="next">导航类“不定宽水平居中”的几种思路</a></div><div data-thread-key="2014/11/23/fequan_2014/" data-title="《前端圈技术论坛-腾讯互娱专场》观后感" data-url="http://yoursite.com/2014/11/23/fequan_2014/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2014/11/23/fequan_2014/" data-title="《前端圈技术论坛-腾讯互娱专场》观后感" data-url="http://yoursite.com/2014/11/23/fequan_2014/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/05/javascript-study-two/">征服javascript学习笔记（二）——基本概念（上）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/28/my-love-with-words/">我的文字情结</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/25/javascript-study-one/">征服javascript学习笔记（一）——认识js</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/24/new-year-first-do/">新年伊始，我都做了些什么</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>