<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="CSS," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x6027;&amp;#x80FD;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BCD;&amp;#x5982;&amp;#x4ECA;&amp;#x88AB;&amp;#x7092;&amp;#x7684;&amp;#x5F88;&amp;#x70ED;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x6BCF;&amp;#x4E2A;&amp;#x5F00;&amp;#x53D1;&amp;#x8005;&amp;#xFF0C;&amp;#x7531;&amp;#x201C;&amp;#x77E5;">
<meta property="og:type" content="article">
<meta property="og:title" content="《web前端最佳实践》—高性能css">
<meta property="og:url" content="http://yoursite.com/2015/03/30/《web前端最佳实践》—高性能css/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x6027;&amp;#x80FD;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BCD;&amp;#x5982;&amp;#x4ECA;&amp;#x88AB;&amp;#x7092;&amp;#x7684;&amp;#x5F88;&amp;#x70ED;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x6BCF;&amp;#x4E2A;&amp;#x5F00;&amp;#x53D1;&amp;#x8005;&amp;#xFF0C;&amp;#x7531;&amp;#x201C;&amp;#x77E5;">
<meta property="og:updated_time" content="2016-02-24T12:52:58.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《web前端最佳实践》—高性能css">
<meta name="twitter:description" content="&amp;#x6027;&amp;#x80FD;&amp;#xFF0C;&amp;#x8FD9;&amp;#x4E2A;&amp;#x8BCD;&amp;#x5982;&amp;#x4ECA;&amp;#x88AB;&amp;#x7092;&amp;#x7684;&amp;#x5F88;&amp;#x70ED;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x6BCF;&amp;#x4E2A;&amp;#x5F00;&amp;#x53D1;&amp;#x8005;&amp;#xFF0C;&amp;#x7531;&amp;#x201C;&amp;#x77E5;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 《web前端最佳实践》—高性能css | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                《web前端最佳实践》—高性能css
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2015-03-30T00:00:00+08:00" content="2015-03-30">
              2015-03-30
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x6027;&#x80FD;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BCD;&#x5982;&#x4ECA;&#x88AB;&#x7092;&#x7684;&#x5F88;&#x70ED;&#xFF0C;&#x4E5F;&#x662F;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x7531;&#x201C;&#x77E5;&#x9053;&#x201D;&#x3001;&#x201C;&#x4F1A;&#x505A;&#x201D;&#x4E4B;&#x540E;&#x5FC5;&#x7ECF;&#x7684;&#x4E00;&#x4E2A;&#x201C;&#x600E;&#x6837;&#x505A;&#x597D;&#x201D;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x6027;&#x80FD;&#x5173;&#x4E4E;&#x7528;&#x6237;&#x5728;&#x4E0D;&#x540C;&#x8BBE;&#x5907;&#x548C;&#x4E0D;&#x540C;&#x7F51;&#x7EDC;&#x72B6;&#x6001;&#x4E0B;&#x7684;&#x4F53;&#x9A8C;&#x3002;&#x4E5F;&#x88AB;&#x591A;&#x65B9;&#x9762;&#x56E0;&#x7D20;&#x6240;&#x5F71;&#x54CD;&#x3002;&#x6B64;&#x6587;&#x8BF4;&#x8BF4;css&#x65B9;&#x9762;&#x600E;&#x6837;&#x505A;&#x5230;&#x9AD8;&#x6027;&#x80FD;&#x3002;</p>
<h2 id="&#x9AD8;&#x6027;&#x80FD;css"><a href="#&#x9AD8;&#x6027;&#x80FD;css" class="headerlink" title="&#x9AD8;&#x6027;&#x80FD;css"></a>&#x9AD8;&#x6027;&#x80FD;css</h2><p>Html&#x548C;css&#x672C;&#x8EAB;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x7A81;&#x51FA;&#xFF0C;&#x5728;&#x63D0;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x8BA9;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x548C;&#x89E3;&#x6790;&#x7684;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF0C;&#x5219;&#x662F;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#x4E86;&#x3002;</p>
<p><strong>&#x4E00;&#x3001;&#x4F7F;&#x7528;&#x9AD8;&#x6548;css&#x9009;&#x62E9;&#x5668;</strong></p>
<p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x88AB;&#x6D4F;&#x89C8;&#x5668;&#x5FEB;&#x901F;&#x89E3;&#x6790;&#x548C;&#x5339;&#x914D;&#x7684;css&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5C31;&#x662F;&#x9AD8;&#x6548;&#x7684;&#x9009;&#x62E9;&#x5668;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8981;&#x77E5;&#x9053;&#x6D4F;&#x89C8;&#x5668;&#x5982;&#x4F55;&#x89E3;&#x6790;css</p>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code>.nav ul.list li div{}
</code></pre><p>&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;&#x601D;&#x7EF4;&#x662F;&#xFF0C;&#x5148;&#x53BB;&#x627E;&#x5230;nav&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x518D;&#x627E;&#x7C7B;&#x5305;&#x542B;&#x7684;ul&#xFF0C;&#x518D;&#x627E;ul&#x4E2D;&#x7C7B;&#x4E3A;list&#x7684;&#x540E;&#x4EE3;&#x6240;&#x6709;li&#x4E2D;&#x6240;&#x6709;&#x7684;div&#xFF0C;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x3002;&#x53EF;&#x4E8B;&#x5B9E;&#x662F;&#x8FD9;&#x6837;&#x4E48;&#xFF1F;&#x4E48;&#xFF1F;&#x4E48;&#xFF1F;~</p>
<p>&#x4E8B;&#x5B9E;&#x662F;&#x76F8;&#x53CD;&#x7684;&#xFF01;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4E0D;&#x662F;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x5F00;&#x59CB;&#x53BB;&#x6162;&#x6162;&#x7684;&#x7F29;&#x5C0F;&#x8303;&#x56F4;&#xFF0C;&#x800C;&#x662F;&#x4ECE;div&#x8FD9;&#x4E2A;&#x201C;&#x88F8;&#x5954;&#x201D;&#x7684;&#x76D2;&#x5B50;&#x5F00;&#x59CB;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x904D;&#x5386;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x627E;&#x5230;li&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x597D;&#x5427;&#x4E0D;&#x7528;&#x6211;&#x5F62;&#x5BB9;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x8FD9;&#x5F53;&#x4E2D;&#x7684;&#x6D88;&#x8017;&#x3002;&#x7406;&#x89E3;&#x8FD9;&#x4E00;&#x539F;&#x7406;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x9AD8;&#x6548;&#x7684;&#x9009;&#x62E9;&#x5668;&#x610F;&#x5473;&#x7740;&#x5339;&#x914D;&#x66F4;&#x5FEB;&#xFF0C;&#x67E5;&#x627E;&#x6B21;&#x6570;&#x66F4;&#x5C11;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x9009;&#x62E9;&#x5668;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x8BA9;&#x7B2C;&#x4E00;&#x6B21;&#x5339;&#x914D;&#x65F6;&#x7684;&#x6570;&#x91CF;&#x8FBE;&#x5230;&#x6700;&#x5C11;&#xFF0C;&#x5E76;&#x4E14;&#x8BA9;&#x6574;&#x4F53;&#x7684;&#x5339;&#x914D;&#x67E5;&#x627E;&#x6B21;&#x6570;&#x6700;&#x5C11;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x8FD9;&#x4E9B;&#x89E3;&#x91CA;&#x6070;&#x6070;&#x9075;&#x5FAA;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E9B;&#x539F;&#x5219;</p>
<p>&#xFF08;1&#xFF09;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x901A;&#x914D;&#x7B26;</p>
<p>&#xFF08;2&#xFF09;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x6807;&#x7B7E;&#x9009;&#x62E9;&#x5668;&#x548C;&#x5355;&#x4E2A;&#x5C5E;&#x6027;&#x9009;&#x62E9;&#x5668;&#x4F5C;&#x4E3A;&#x5173;&#x952E;&#x9009;&#x62E9;&#x5668;</p>
<p>&#xFF08;3&#xFF09;&#x4E0D;&#x8981;&#x5728;id&#x9009;&#x62E9;&#x5668;&#x524D;&#x52A0;&#x6807;&#x7B7E;&#x540D;</p>
<p>&#xFF08;4&#xFF09;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x5728;&#x9009;&#x62E9;&#x7B26;&#x5B9A;&#x4E49;&#x8FC7;&#x591A;&#x5C42;&#x7EA7;&#xFF0C;&#x5C42;&#x7EA7;&#x8D8A;&#x5C11;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x964D;&#x4F4E;&#x4E86;css&#x548C;dom&#x7ED3;&#x6784;&#x7684;&#x8026;&#x5408;&#x7A0B;&#x5EA6;&#xFF0C;&#x63D0;&#x9AD8;&#x6837;&#x5F0F;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;</p>
<p>&#xFF08;ps&#xFF1A;&#x8001;&#x5B9E;&#x8BF4;&#x4E0A;&#x9762;&#x7684;&#x8FD9;&#x4E9B;&#x201C;&#x7981;&#x5FCC;&#x201D;&#x4F60;&#x662F;&#x4E0D;&#x662F;&#x90FD;&#x6709;&#x72AF;&#x8FC7;&#xFF1F;~&#xFF09;</p>
<p>&#x505A;&#x4E2A;&#x5C0F;&#x7ED3;&#xFF0C;&#x4EE5;&#x4E0A;&#x6240;&#x8BF4;&#xFF0C;&#x6709;&#x4E24;&#x70B9;&#x9700;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x7B2C;&#x4E00;&#x70B9;&#x5728;&#x5F00;&#x5934;&#x5C31;&#x5DF2;&#x7ECF;&#x63D0;&#x5230;&#xFF0C;css&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x8868;&#x73B0;&#x7684;&#x5E76;&#x4E0D;&#x7A81;&#x51FA;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x5C0F;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x4E3A;&#x5148;&#xFF1B;&#x7B2C;&#x4E8C;&#x70B9;&#x662F;&#x867D;&#x7136;&#x5B9A;&#x4E49;id&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x6709;&#x552F;&#x4E00;&#x6027;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x53EA;&#x80FD;&#x5B9A;&#x4E49;&#x552F;&#x4E00;id&#xFF0C;&#x5B9A;&#x4E49;&#x8FC7;&#x591A;id&#x4F1A;&#x4F7F;&#x91CD;&#x7528;&#x6027;&#x964D;&#x4F4E;&#xFF0C;&#x7EF4;&#x62A4;&#x66F4;&#x56F0;&#x96BE;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x5EFA;&#x8BAE;&#x591A;&#x7528;id&#x3002;</p>
<p><strong>&#x4E8C;&#x3001;css&#x76F8;&#x5173;&#x7684;&#x56FE;&#x7247;&#x5904;&#x7406;</strong></p>
<p>&#x73B0;&#x5728;&#x7684;&#x7F51;&#x9875;&#x5F53;&#x4E2D;&#xFF0C;&#x56FE;&#x7247;&#x6240;&#x5360;&#x7684;&#x6BD4;&#x91CD;&#x4EE5;&#x53CA;&#x5B83;&#x7684;&#x91CD;&#x8981;&#x6027;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x3002;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x5904;&#x7406;&#x597D;&#x56FE;&#x7247;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4E3A;&#x56FE;&#x7247;&#x8BBE;&#x7F6E;&#x6837;&#x5F0F;&#xFF0C;&#x624D;&#x80FD;&#x8BA9;&#x7528;&#x6237;&#x6253;&#x5F00;&#x7F51;&#x9875;&#x65F6;&#x4F53;&#x9A8C;&#x66F4;&#x597D;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4E00;&#x4E9B;&#x610F;&#x89C1;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x4E0D;&#x7ED9;&#x56FE;&#x7247;&#x8BBE;&#x7F6E;&#x5C3A;&#x5BF8;</p>
<p>&#x5728;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x4ECE;&#x4E1A;&#x7ECF;&#x5386;&#x5F53;&#x4E2D;&#xFF0C;&#x6709;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x6309;&#x7167;&#x8BBE;&#x8BA1;&#x7A3F;&#x505A;&#x597D;&#x4E86;&#x9875;&#x9762;&#xFF0C;&#x4EA4;&#x7ED9;&#x540E;&#x53F0;&#x53BB;&#x6D4B;&#x8BD5;&#xFF0C;&#x4ED6;&#x5C31;&#x7A81;&#x7136;&#x8DD1;&#x8FC7;&#x6765;&#x8DDF;&#x6211;&#x8BF4;&#xFF1A;hi&#xFF0C;&#x4F60;&#x770B;&#xFF0C;&#x8FD9;&#x513F;&#x51FA;&#x72B6;&#x51B5;&#x4E86;&#xFF0C;&#x6211;&#x4E00;&#x770B;&#xFF0C;&#x574F;&#x83DC;&#xFF0C;&#x56FE;&#x7247;&#x51FA;&#x683C;&#x4E86;&#xFF0C;&#x6211;&#x624D;&#x60F3;&#x8D77;&#x6CA1;&#x6709;&#x7ED9;&#x56FE;&#x7247;&#x5B9A;&#x4E49;&#x5BBD;&#x9AD8;&#xFF08;&#x76F4;&#x63A5;&#x4ECE;&#x8BBE;&#x8BA1;&#x7A3F;&#x91CC;&#x5207;&#x7684;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x72AF;&#x9519;&#x4E86;&#x4F3C;&#x7684;&#x5728;css&#x6837;&#x5F0F;&#x91CC;&#x5B9A;&#x4E49;&#x4E86;&#x5BBD;&#x9AD8;&#x3002;&#x4EE5;&#x81F3;&#x4E8E;&#x540E;&#x6765;&#x6211;&#x628A;&#x8FD9;&#x4E2A;&#x4F5C;&#x4E3A;&#x4E0B;&#x6B21;&#x518D;&#x505A;&#x9875;&#x9762;&#x65F6;&#x5019;&#x7684;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#x3002;&#x5F53;&#x6211;&#x770B;&#x5230;&#x8FD9;&#x4E00;&#x6761;&#x610F;&#x89C1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x66F4;&#x77E5;&#x4E00;&#x4E8C;&#x3002;</p>
<p>&#x6765;&#x770B;&#x89E3;&#x91CA;&#xFF0C;&#x7B2C;&#x4E00;&#x3001;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x4E3A;&#x4E86;&#x753B;&#x9762;&#x7684;&#x7CBE;&#x7F8E;&#xFF0C;&#x4F1A;&#x5236;&#x4F5C;&#x4E00;&#x4E9B;&#x8D85;&#x51FA;&#x9700;&#x6C42;&#x5C3A;&#x5BF8;&#x7684;&#x56FE;&#x7247;&#xFF1B;&#x7B2C;&#x4E8C;&#x3001;&#x540C;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x9875;&#x9762;&#x4E0D;&#x540C;&#x5730;&#x65B9;&#x591A;&#x6B21;&#x4F7F;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x7F29;&#x7565;&#x56FE;&#x3001;&#x6B63;&#x5E38;&#x56FE;&#x3001;&#x5927;&#x56FE;&#x3002;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x7247;&#x539F;&#x59CB;&#x5C3A;&#x5BF8;&#x548C;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#x4E0D;&#x540C;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C31;&#x4F1A;&#x5B58;&#x5728;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x5229;&#x7528;&#x6837;&#x5F0F;&#x7F29;&#x653E;&#x4F1A;&#x5E26;&#x6765;cpu&#x7684;&#x989D;&#x5916;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x56FE;&#x7247;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6E32;&#x67D3;&#x65F6;&#x95F4;&#xFF0C;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E5F;&#x4F1A;&#x5360;&#x66F4;&#x591A;&#x5E26;&#x5BBD;&#xFF0C;&#x589E;&#x52A0;&#x4E0B;&#x8F7D;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x4F73;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x4E3A;&#x9700;&#x8981;&#x7684;&#x90E8;&#x5206;&#x5355;&#x72EC;&#x505A;&#x4E00;&#x5957;&#x56FE;&#x7247;&#xFF0C;&#x521D;&#x59CB;&#x9875;&#x9762;&#x52A0;&#x8F7D;&#x65F6;&#x5C31;&#x80FD;&#x66F4;&#x5FEB;&#x5C55;&#x793A;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x4F7F;&#x7528;css&#x201C;&#x96EA;&#x78A7;&#x56FE;&#x201C;</p>
<p>&#x662F;&#x5C06;&#x96F6;&#x6563;&#x7684;&#x56FE;&#x7247;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x5F20;&#x5927;&#x56FE;&#xFF0C;&#x5728;&#x5229;&#x7528;css&#x8FDB;&#x884C;&#x80CC;&#x666F;&#x5B9A;&#x4F4D;&#x3002;&#x597D;&#x5904;&#x662F;&#x51CF;&#x5C11;&#x8BF7;&#x6C42;&#x6570;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x56FE;&#x7247;&#x6574;&#x4F53;&#x7684;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x4F46;&#x5B83;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x7F3A;&#x70B9;&#xFF1A;</p>
<p>&#x6BD4;&#x5982;&#xFF0C;&#x591A;&#x5F20;&#x56FE;&#x7247;&#x5408;&#x5E76;&#x6210;&#x5927;&#x56FE;&#xFF0C;&#x9700;&#x8981;&#x7CBE;&#x786E;&#x8BA1;&#x7B97;&#xFF0C;&#x4ED4;&#x7EC6;&#x7684;&#x8C03;&#x6574;&#x4F4D;&#x7F6E;&#xFF0C;&#x5355;&#x7EAF;&#x624B;&#x5DE5;&#x5236;&#x4F5C;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#xFF08;&#x6240;&#x5E78;&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x5E2E;&#x6211;&#x4EEC;&#x505A;&#xFF09;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x7EF4;&#x62A4;&#x8FC7;&#x7A0B;&#x590D;&#x6742;&#xFF0C;&#x8981;&#x5C3D;&#x91CF;&#x8BA9;&#x5DF2;&#x6709;&#x7684;&#x56FE;&#x7247;&#x4FDD;&#x6301;&#x539F;&#x6765;&#x7684;&#x4F4D;&#x7F6E;&#x4E0D;&#x53D8;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x80CC;&#x666F;&#x56FE;&#x7684;&#x5C3A;&#x5BF8;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x5BFC;&#x81F4;&#x539F;&#x6709;&#x533A;&#x57DF;&#x65E0;&#x6CD5;&#x653E;&#x7F6E;&#xFF0C;&#x90A3;&#x5C31;&#x53EA;&#x597D;&#x653E;&#x5F03;&#xFF0C;&#x5982;&#x679C;&#x975E;&#x8981;&#x5728;&#x539F;&#x6709;&#x4F4D;&#x7F6E;&#x4FEE;&#x6539;&#xFF0C;&#x5219;&#x5269;&#x4F59;&#x7684;&#x56FE;&#x7247;&#x6837;&#x5F0F;&#x90FD;&#x9700;&#x8981;&#x4FEE;&#x6539;&#xFF0C;&#x662F;&#x5F88;&#x7E41;&#x7410;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x65B0;&#x52A0;&#x7684;&#x56FE;&#x7247;&#x6700;&#x597D;&#x653E;&#x5728;&#x6700;&#x540E;&#x9762;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x4E0D;&#x5F53;&#x4F1A;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x3002;&#x5982;&#x679C;&#x5236;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;&#x7684;&#x89C4;&#x5212;&#xFF0C;&#x968F;&#x610F;&#x6446;&#x653E;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x56FE;&#x7247;&#x53D8;&#x5F97;&#x76F8;&#x5F53;&#x5927;&#xFF0C;&#x4ECE;&#x800C;&#x5F88;&#x5360;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E9B;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF1A;</p>
<p>1&#x3001;&#x5728;&#x9879;&#x76EE;&#x540E;&#x671F;&#x5E94;&#x7528;css sprite&#x6280;&#x672F;</p>
<p>&#x56E0;&#x4E3A;&#x4E00;&#x822C;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F1A;&#x6BD4;&#x8F83;&#x9891;&#x7E41;&#x7684;&#x4FEE;&#x6539;&#x6216;&#x8005;&#x66F4;&#x6362;&#x56FE;&#x7247;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F7F;&#x7528;sprite&#x6280;&#x672F;&#xFF0C;&#x5C31;&#x4F1A;&#x589E;&#x52A0;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x3002;</p>
<p>2&#x3001;&#x5408;&#x7406;&#x7EC4;&#x7EC7;&#x201C;&#x96EA;&#x78A7;&#x201D;&#x56FE;</p>
<p>&#x5982;&#x679C;&#x8981;&#x628A;&#x6240;&#x6709;&#x7684;&#x56FE;&#x7247;&#x653E;&#x5728;&#x4E00;&#x5F20;&#x56FE;&#x4E0A;&#x9762;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x4E0D;&#x59A5;&#xFF0C;&#x7EF4;&#x62A4;&#x65B9;&#x9762;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F88;&#x65B9;&#x4FBF;&#x3002;&#x7EC4;&#x7EC7;&#x80CC;&#x666F;&#x56FE;&#x4E3B;&#x8981;&#x6309;&#x7167;&#x6A21;&#x5757;&#x548C;&#x80CC;&#x666F;&#x56FE;&#x7684;&#x98CE;&#x683C;&#x6765;&#x5212;&#x5206;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F5C;&#x4E3A;&#x5C55;&#x793A;&#x7684;&#x7F29;&#x7565;&#x56FE;&#x653E;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8BC4;&#x8BBA;&#x3001;&#x70B9;&#x8D5E;&#x3001;&#x4E0A;&#x4E0B;&#x7BAD;&#x5934;&#x7B49;&#x56FE;&#x6807;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x7B49;&#x3002;</p>
<p>3&#x3001;&#x63A7;&#x5236;&#x201C;&#x96EA;&#x78A7;&#x201D;&#x56FE;&#x7684;&#x5C3A;&#x5BF8;&#x548C;&#x5927;&#x5C0F;</p>
<p>&#x56E0;&#x4E3A;&#x5927;&#x5C3A;&#x5BF8;&#x7684;&#x56FE;&#x7247;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x63A7;&#x5236;&#x5728;&#x5408;&#x7406;&#x5C3A;&#x5BF8;&#xFF0C;&#x63A8;&#x8350;&#x957F;&#x5BBD;&#x76F8;&#x4E58;&#x4E0D;&#x8D85;&#x8FC7;2500&#xFF0C;&#x5927;&#x5C0F;&#x5728;200kb&#x5185;</p>
<p>4&#x3001;&#x5408;&#x7406;&#x63A7;&#x5236;&#x80CC;&#x666F;&#x56FE;&#x5355;&#x5143;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#x53CA;&#x80CC;&#x666F;&#x56FE;&#x4F4D;&#x7F6E;</p>
<p>&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x662F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x5728;&#x80CC;&#x666F;&#x56FE;&#x6BD4;&#x5143;&#x7D20;&#x5927;&#x5C0F;&#x66F4;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x533A;&#x57DF;&#x51FA;&#x73B0;&#x522B;&#x7684;&#x65E0;&#x5173;&#x80CC;&#x666F;&#x56FE;</p>
<p>5&#x3001;&#x501F;&#x52A9;&#x76F8;&#x5173;&#x5DE5;&#x5177;&#x5904;&#x7406;sprite</p>
<p><strong>&#x4E09;&#x3001;&#x51CF;&#x5C11;css&#x7684;&#x4EE3;&#x7801;&#x91CF;</strong></p>
<p>&#x63D0;&#x9AD8;&#x7F51;&#x7AD9;&#x6574;&#x4F53;&#x52A0;&#x8F7D;&#x901F;&#x5EA6;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x624B;&#x6BB5;&#xFF0C;&#x5C31;&#x662F;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x7684;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x901F;&#x5EA6;&#x3002;&#x9664;&#x4E86;&#x4EE3;&#x7801;&#x538B;&#x7F29;&#xFF0C;&#x7CBE;&#x7B80;&#x4EE3;&#x7801;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x624B;&#x6BB5;&#x3002;</p>
<p>&#xFF08;1&#xFF09;&#x5B9A;&#x4E49;&#x7B80;&#x6D01;&#x7684;css&#x89C4;&#x5219;</p>
<p>&#x5408;&#x5E76;&#x76F8;&#x5173;&#x89C4;&#x5219;&#xFF0C;&#x5B9A;&#x4E49;&#x7B80;&#x6D01;&#x7684;&#x5C5E;&#x6027;&#x503C;</p>
<p>&#x5408;&#x5E76;&#x89C4;&#x5219;&#x662F;&#x6307;&#x6BD4;&#x5982;font-family&#x3001;font-size&#x3001;font-weight&#x7B49;&#x7B49;&#xFF0C;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x4E3A;font&#x3002; &#x7B80;&#x6D01;&#x5C5E;&#x6027;&#x503C;&#xFF0C;&#x6BD4;&#x5982;&#x989C;&#x8272;&#x503C;&#xFF1A;color&#xFF0C;#33AAFF&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x4E3A;#3AF&#x7B49;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x5408;&#x5E76;&#x76F8;&#x540C;&#x5B9A;&#x4E49;</p>
<p>&#x7F51;&#x9875;&#x4E2D;&#x603B;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6A21;&#x5757;&#x6709;&#x8F83;&#x9AD8;&#x76F8;&#x4F3C;&#x5EA6;&#xFF0C;&#x5219;&#x53EF;&#x628A;&#x540C;&#x6837;&#x7684;&#x90E8;&#x5206;&#x5171;&#x7528;&#x4E00;&#x6B21;&#x5B9A;&#x4E49;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x90E8;&#x5206;&#x518D;&#x5355;&#x72EC;&#x5B9A;&#x4E49;&#x3002;&#x800C;&#x4E14;&#x5728;css&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x5C5E;&#x6027;&#x662F;&#x53EF;&#x4EE5;&#x7EE7;&#x627F;&#x7684;&#xFF0C;&#x5219;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5408;&#x9002;&#x7684;&#x5730;&#x65B9;&#x5B9A;&#x4E49;&#x4E00;&#x6B21;&#x5373;&#x53EF;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x5220;&#x9664;&#x65E0;&#x6548;&#x7684;&#x5B9A;&#x4E49;</p>
<p>&#x65E0;&#x6548;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5E76;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x9875;&#x9762;&#x529F;&#x80FD;&#x663E;&#x793A;&#xFF0C;&#x4F46;&#x4F1A;&#x5F71;&#x54CD;&#x9875;&#x9762;&#x5C55;&#x793A;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x589E;&#x52A0;&#x4EE3;&#x7801;&#x91CF;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x589E;&#x52A0;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x89E3;&#x6790;&#x4EE3;&#x7801;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x65E0;&#x6548;&#x7684;&#x5B9A;&#x4E49;&#x5305;&#x62EC;&#x65E0;&#x6548;&#x7684;&#x89C4;&#x5219;&#x53CA;&#x65E0;&#x6548;&#x7684;&#x6837;&#x5F0F;&#x5C5E;&#x6027;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F15;&#x5165;&#x7684;&#xFF0C;&#x800C;&#x4ECE;&#x76F4;&#x89C2;&#x4E0A;&#x65E0;&#x6CD5;&#x5224;&#x65AD;&#xFF0C;&#x8FD9;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5DE5;&#x5177;&#xFF0C;chrome&#x81EA;&#x5E26;&#x7684;&#x5DE5;&#x5177;&#x5C31;&#x53EF;&#x4EE5;&#x67E5;&#x627E;css&#x4E2D;&#x7684;&#x65E0;&#x6548;&#x6837;&#x5F0F;&#x3002;&#x3002;</p>
<p><strong>&#x5176;&#x4ED6;css&#x9AD8;&#x6027;&#x80FD;&#x5B9E;&#x8DF5;</strong></p>
<p>&#xFF08;1&#xFF09;&#x907F;&#x514D;&#x4F7F;&#x7528;@import</p>
<p>@import&#x5BFC;&#x5165;&#x7684;&#x65B0;&#x6837;&#x5F0F;&#x6587;&#x4EF6;&#x4F1A;&#x963B;&#x6B62;&#x9875;&#x9762;&#x7684;&#x5E76;&#x884C;&#x4E0B;&#x8F7D;&#xFF0C;&#x8FD9;&#x6837;&#x589E;&#x52A0;&#x4E86;&#x6587;&#x4EF6;&#x7684;&#x6574;&#x4F53;&#x52A0;&#x8F7D;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x907F;&#x514D;&#x4F7F;&#x7528;IE&#x6D4F;&#x89C8;&#x5668;&#x72EC;&#x6709;&#x6837;&#x5F0F;&#xFF1A;&#x56FE;&#x7247;&#x6EE4;&#x955C;&#x548C;css&#x8868;&#x8FBE;&#x5F0F;</p>
<p>&#x56FE;&#x7247;&#x6EE4;&#x955C;&#x7684;&#x4F7F;&#x7528;&#x4F1A;&#x5728;&#x56FE;&#x7247;&#x52A0;&#x8F7D;&#x65F6;&#x963B;&#x585E;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x52A0;&#x8F7D;&#x548C;&#x6E32;&#x67D3;&#xFF0C;&#x5E76;&#x4F1A;&#x589E;&#x52A0;&#x989D;&#x5916;&#x7684;&#x5185;&#x5B58;&#x5F00;&#x9500;&#x3002; Css&#x8868;&#x8FBE;&#x5F0F;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x52A8;&#x6001;&#x8BBE;&#x7F6E;css&#x5C5E;&#x6027;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x4E0D;&#x53EA;&#x662F;&#x6709;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x8FD8;&#x6709;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x6D4F;&#x89C8;&#x5668;&#x5927;&#x5C0F;&#x6539;&#x52A8;&#x3001;&#x7A97;&#x53E3;&#x6539;&#x52A8;&#x65F6;&#xFF0C;&#x4F1A;&#x4F7F;&#x5F97;&#x6D4F;&#x89C8;&#x5668;&#x9891;&#x7E41;&#x8BA1;&#x7B97;&#xFF0C;&#x6027;&#x80FD;&#x6D88;&#x8017;&#x6781;&#x5927;&#x3002;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#x53EF;&#x4EE5;&#x7528;javascript&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<h2 id="css3&#x6700;&#x4F73;&#x5B9E;&#x8DF5;"><a href="#css3&#x6700;&#x4F73;&#x5B9E;&#x8DF5;" class="headerlink" title="css3&#x6700;&#x4F73;&#x5B9E;&#x8DF5;"></a>css3&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</h2><p><strong>&#x67E5;&#x770B;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x60C5;&#x51B5;</strong></p>
<p>&#x5728;&#x6211;&#x4EEC;&#x4F7F;&#x7528;css3&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x95EE;&#x7684;&#x6700;&#x591A;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x5C31;&#x662F;&#xFF1A;&#x517C;&#x5BB9;&#x6027;&#x5982;&#x4F55;&#xFF1F;&#x6CA1;&#x529E;&#x6CD5;&#xFF0C;&#x968F;&#x7740;css&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4E3A;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x9047;&#x5230;&#x7684;&#x5F88;&#x591A;&#x4E0D;&#x597D;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5FCD;&#x4E0D;&#x4F4F;&#x53BB;&#x60F3;&#x80FD;&#x4E0D;&#x80FD;&#x90A3;&#x6837;&#x53BB;&#x505A;&#x3002;PC&#x7AEF;&#x6709;&#x9971;&#x53D7;&#x8BDF;&#x75C5;&#x7684;IE&#x7CFB;&#x5217;&#xFF0C;&#x5230;&#x4E86;&#x79FB;&#x52A8;&#x7AEF;&#x4F1A;&#x597D;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x8FD8;&#x662F;&#x4E0D;&#x592A;&#x597D;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x67E5;&#x770B;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x60C5;&#x51B5;&#x51E0;&#x4E4E;&#x6210;&#x4E86;&#x5FC5;&#x5907;&#x52A8;&#x4F5C;&#x3002; &#x5982;&#x679C;&#x4F7F;&#x7528;&#x7684;&#x7279;&#x6027;&#x4EC5;&#x4EC5;&#x662F;&#x88C5;&#x9970;&#x70B9;&#x7F00;&#x6027;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4E0D;&#x5F71;&#x54CD;&#x5927;&#x5C40;&#xFF0C;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x592A;&#x591A;&#x517C;&#x5BB9;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x51FA;&#x4E8E;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#xFF0C;&#x5FC5;&#x987B;&#x652F;&#x6301;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5219;&#x8981;&#x7279;&#x522B;&#x7684;&#x5173;&#x6CE8;&#x4E00;&#x4E0B;&#x4E86;&#x3002; &#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6BD4;&#x5982;&#xFF1A;caniuse.com&#x3001;css3 Click Chart&#x3001;css contents and browser compatibility&#x8FD9;&#x4E9B;&#x5728;&#x7EBF;&#x5DE5;&#x5177;&#x6765;&#x67E5;&#x770B;&#x517C;&#x5BB9;&#x6027;&#x3002;</p>
<p><strong>&#x6DFB;&#x52A0;&#x5FC5;&#x8981;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;</strong></p>
<p>&#x5BF9;&#x4E8E;&#x521A;&#x4F7F;&#x7528;css&#x4E0D;&#x4E45;&#x7684;&#x670B;&#x53CB;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5076;&#x5C14;&#x5728;&#x67D0;&#x7F51;&#x7AD9;&#x6E90;&#x7801;&#x5F53;&#x4E2D;&#x770B;&#x5230;&#x8BF8;&#x5982;&#xFF1A;&#x201C;-webkit-&#x3001;-moz-&#x201D;&#x7B49;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x5F88;&#x5947;&#x602A;&#xFF0C;&#x8FD9;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5B83;&#x4EEC;&#x662F;&#x5BF9;&#x5E94;&#x4E0D;&#x540C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x5382;&#x5546;&#x6240;&#x52A0;&#x4E0A;&#x7684;&#x524D;&#x7F00;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x6D4F;&#x89C8;&#x5668;&#x5728;&#x652F;&#x6301;css3&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x5B9E;&#x73B0;&#x4E86;&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E2A;&#x65E9;&#x671F;&#x7248;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5C1A;&#x4E0D;&#x652F;&#x6301;&#x6807;&#x51C6;&#x5199;&#x6CD5;&#xFF0C;&#x7ED9;&#x4EE3;&#x7801;&#x6DFB;&#x52A0;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;&#x4E5F;&#x662F;&#x65E0;&#x5948;&#x4E4B;&#x4E3E;&#xFF0C;&#x4F1A;&#x4F7F;&#x5F97;&#x4EE3;&#x7801;&#x66F4;&#x591A;&#xFF0C;&#x66F4;&#x96BE;&#x7EF4;&#x62A4;&#x3002;</p>
<p>&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x201C;&#x5B8C;&#x7F8E;&#x201D;&#x800C;&#x4E00;&#x5B9A;&#x8981;&#x53BB;&#x517C;&#x5BB9;&#x6240;&#x6709;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E00;&#x822C;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x6D4F;&#x89C8;&#x5668;&#x6216;&#x8005;&#x7CFB;&#x7EDF;&#x7684;&#x7248;&#x672C;&#x7684;&#x5E02;&#x573A;&#x5360;&#x6709;&#x7387;&#x548C;&#x76EE;&#x6807;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x6BD4;&#x4F8B;&#xFF0C;&#x6765;&#x51B3;&#x5B9A;&#x52A0;&#x4E0D;&#x52A0;&#x524D;&#x7F00;&#x4EE5;&#x53CA;&#x52A0;&#x51E0;&#x79CD;&#x524D;&#x7F00;&#x3002;&#x800C;&#x4E14;&#x76F8;&#x4FE1;&#x968F;&#x7740;&#x9010;&#x6B65;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x7CFB;&#x7EDF;&#x3001;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x4E0D;&#x65AD;&#x5347;&#x7EA7;&#x3001;&#x66F4;&#x65B0;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x524D;&#x7F00;&#x7684;&#x60C5;&#x51B5;&#x4F1A;&#x51CF;&#x5C11;&#x3002;</p>
<p>&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x65E2;&#x7136;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5FC5;&#x8981;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x8FD8;&#x662F;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x90A3;&#x4E0D;&#x5F97;&#x4E0D;&#x52A0;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x90A3;&#x4E0D;&#x662F;&#x633A;&#x9EBB;&#x70E6;&#x7684;&#xFF1F;&#x540C;&#x6837;&#x7684;&#x4E00;&#x6761;&#x89C4;&#x5219;&#x8981;&#x5199;&#x4E09;&#x56DB;&#x904D;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x90FD;&#x8981;&#x7528;&#xFF0C;&#x5982;&#x4F55;&#x662F;&#x597D;&#xFF1F;&#x522B;&#x6025;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x51E0;&#x4E2A;&#x5BF9;&#x7B56;&#xFF1A;</p>
<p>1&#x3001;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x6765;&#x6DFB;&#x52A0;css&#x5C5E;&#x6027;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;</p>
<p>Prefixr&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x540E;&#x671F;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x5B83;&#x4F1A;&#x81EA;&#x52A8;&#x7684;&#x6DFB;&#x52A0;&#x9700;&#x8981;&#x7684;&#x524D;&#x7F00;&#x548C;&#x5220;&#x53BB;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x524D;&#x7F00;&#x3002;</p>
<p>Autoprefixer&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x66F4;&#x591A;&#x7684;&#x81EA;&#x4E3B;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x81EA;&#x5B9A;&#x4E49;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x8303;&#x56F4;&#xFF0C;&#x5B83;&#x4E5F;&#x6709;&#x591A;&#x79CD;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x96C6;&#x6210;&#x5230;&#x591A;&#x4E2A;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x4E2D;&#x3002; &#x6B64;&#x5916;&#x8FD8;&#x6709;&#x51E0;&#x79CD;&#x5DE5;&#x5177;&#x53EF;&#x4F9B;&#x4F7F;&#x7528;&#xFF1A;cssFx&#x3001;<em>css Agent</em>&#x548C;-prefix-free&#x3002;</p>
<p>2&#x3001;&#x501F;&#x52A9;css&#x9884;&#x5904;&#x7406;&#x6280;&#x672F;</p>
<p>&#x76EE;&#x524D;&#x6D41;&#x884C;&#x7684;&#x6709;sass&#x3001;less&#xFF0C;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x9488;&#x5BF9;css3&#x6837;&#x5F0F;&#x7279;&#x6027;&#x5B9A;&#x4E49;&#x4E00;&#x4EFD;&#x6A21;&#x677F;&#x6837;&#x5F0F;&#x3002; &#x4F18;&#x70B9;&#x662F;&#xFF1A;&#x907F;&#x514D;&#x5927;&#x91CF;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x4E00;&#x4EFD;&#x5B9A;&#x4E49;&#x3002;</p>
<p>3&#x3001;&#x4E0D;&#x8981;&#x8FC7;&#x5EA6;&#x6DFB;&#x52A0;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;</p>
<p>&#x6709;&#x4E9B;&#x5F00;&#x53D1;&#x8005;&#x4E3A;&#x4E86;&#x517C;&#x5BB9;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x4E0D;&#x7BA1;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x90FD;&#x4E3A;css&#x4EE3;&#x7801;&#x52A0;&#x4E0A;&#x4E86;&#x6240;&#x6709;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6D88;&#x6781;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x592A;&#x591A;&#x7684;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x89E3;&#x6790;&#x6027;&#x80FD;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x540C;&#x65F6;&#x67D0;&#x4E9B;&#x524D;&#x7F00;&#x7684;&#x5C5E;&#x6027;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x88AB;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x8FC7;&#x3002;</p>
<p>4&#x3001;&#x6DFB;&#x52A0;css3&#x6807;&#x51C6;&#x5C5E;&#x6027;&#x5B9A;&#x4E49;</p>
<p>&#x4F55;&#x4E3A;&#x6807;&#x51C6;&#x5C5E;&#x6027;&#x5B9A;&#x4E49;&#x5462;&#xFF1F;&#x5C31;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x5F88;&#x591A;&#x4F7F;&#x7528;css3&#x7684;&#x5730;&#x65B9;&#x90FD;&#x4F1A;&#x5728;&#x6700;&#x540E;&#x7684;&#x5730;&#x65B9;&#x5199;&#x6807;&#x51C6;&#x5C5E;&#x6027;&#x5B9A;&#x4E49;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x652F;&#x6301;&#x6807;&#x51C6;&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x524D;&#x9762;&#x6DFB;&#x52A0;&#x4E86;&#x524D;&#x7F00;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;css3&#x4E2D;&#x7684;&#x5C5E;&#x6027;&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x624D;&#x662F;&#x7B26;&#x5408;&#x89C4;&#x8303;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x6DFB;&#x52A0;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;&#x7684;&#x5B9A;&#x4E49;&#x4F1A;&#x968F;&#x7740;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x66F4;&#x65B0;&#x9010;&#x6E10;&#x88AB;&#x6DD8;&#x6C70;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x67D0;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x76EE;&#x524D;&#x662F;&#x5C5E;&#x4E8E;Only webkit&#x6216;&#x8005;Only firefox&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x518D;&#x5199;&#x4E0A;&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x53CA;&#x5176;&#x4ED6;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;&#x4E86;&#x3002;</p>
<p><strong>&#x505A;&#x597D;css3&#x4E2D;&#x65B0;&#x7279;&#x6027;&#x7684;&#x517C;&#x5BB9;&#x5904;&#x7406;</strong></p>
<p>&#x8BF4;&#x5230;&#x517C;&#x5BB9;&#xFF0C;&#x5C31;&#x4F1A;&#x63D0;&#x5230;&#x4F4E;&#x7248;&#x672C;IE&#xFF0C;&#x6BD4;&#x5982;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x5706;&#x89D2;&#x3001;&#x900F;&#x660E;&#x56FE;&#x7247;&#x7B49;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x7ED9;&#x5B83;&#x4EEC;&#x964D;&#x7EA7;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x6BD4;&#x5982;filter&#x6216;&#x8005;javascript&#xFF0C;&#x4F7F;&#x7528;box-sizing&#x3001;transform&#xFF0C;&#x63A8;&#x8350;&#x4F7F;&#x7528;Modernizr,&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;css3&#x65B0;&#x7279;&#x6027;&#x7684;&#x517C;&#x5BB9;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x65E0;&#x8BBA;&#x662F;&#x54EA;&#x79CD;&#x65B9;&#x6848;&#xFF0C;&#x90FD;&#x4F1A;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x635F;&#x8017;&#xFF0C;&#x4E0D;&#x80FD;&#x6BEB;&#x65E0;&#x7AE0;&#x6CD5;&#x7684;&#x6EE5;&#x7528;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x9700;&#x8981;&#x5927;&#x5BB6;&#x53BB;&#x6743;&#x8861;&#x548C;&#x9009;&#x62E9;&#x3002;&#x63A8;&#x8350;&#x4E00;&#x4E2A;&#x5982;&#x4F55;&#x66F4;&#x6709;&#x6548;&#x7387;&#x7684;&#x4F7F;&#x7528;HTML5&#x7684;&#x5EFA;&#x8BAE;&#x7F51;&#x7AD9;&#xFF1A;html5please&#x3002;&#x7F51;&#x7AD9;&#x6309;&#x7167;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x628A;css3&#x4E2D;&#x7684;&#x65B0;&#x7279;&#x6027;&#x5206;&#x6210;&#x4E86;&#x4E09;&#x7C7B;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x76F4;&#x63A5;&#x4F7F;&#x7528;</p>
<p>&#x5305;&#x542B;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x65B0;&#x7279;&#x6027;&#xFF0C;&#x6709;&#x4E9B;&#x7279;&#x6027;&#x672C;&#x8EAB;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x5982;border-radius&#x3001;media queries&#x7B49;&#xFF0C;&#x6709;&#x4E9B;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x964D;&#x7EA7;&#x5904;&#x7406;&#xFF0C;&#x5982;&#x591A;&#x80CC;&#x666F;&#x56FE;&#xFF0C;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5355;&#x80CC;&#x666F;&#x56FE;&#x6216;&#x8005;&#x80CC;&#x666F;&#x8272;&#x4F5C;&#x4E3A;&#x5907;&#x9009;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x8C28;&#x614E;&#x4F7F;&#x7528;</p>
<p>&#x8FD9;&#x90E8;&#x5206;&#x4E3B;&#x8981;&#x662F;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x6846;&#x9634;&#x5F71;&#x5E94;&#x7528;&#x4E8E;&#x5360;&#x7528;&#x5F88;&#x5927;&#x533A;&#x57DF;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x9875;&#x9762;&#x6EDA;&#x52A8;&#x6216;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x65F6;&#xFF0C;&#x4F1A;&#x5F15;&#x8D77;&#x4E0D;&#x5C0F;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x907F;&#x514D;&#x4F7F;&#x7528;</p>
<p>&#x8FD9;&#x90E8;&#x5206;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4EC5;&#x652F;&#x6301;&#x67D0;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x6BD4;&#x5982;&#x5012;&#x5F71;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;css&#x80FD;&#x591F;&#x7528;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x65B9;&#x6CD5;&#x8FD8;&#x662F;&#x86EE;&#x591A;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5F88;&#x5BB9;&#x6613;&#x5FFD;&#x7565;&#x5B83;&#x4EEC;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6240;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x660E;&#x663E;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x53EF;&#x80FD;&#x4E3A;&#x4E86;&#x56FE;&#x65B9;&#x4FBF;&#xFF0C;&#x4EFB;&#x610F;&#x6325;&#x6D12;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x624D;&#x534E;&#xFF0C;&#x60F3;&#x600E;&#x4E48;&#x5199;&#x5C31;&#x600E;&#x4E48;&#x5199;&#xFF0C;&#x80FD;&#x8FBE;&#x5230;&#x6548;&#x679C;&#x5C31;&#x884C;&#xFF0C;&#x8FD9;&#x4E5F;&#x6709;&#x70B9;&#x5C0F;&#x6D88;&#x6781;&#x54C8;&#xFF0C;&#x5FD8;&#x4E86;&#x4F60;&#x7684;&#x4F18;&#x79C0;&#x5DE5;&#x7A0B;&#x5E08;&#x76EE;&#x6807;&#x4E86;&#x9EBB;&#xFF1F;&#xFF01;~~css&#x89C4;&#x5219;&#x867D;&#x4E0D;&#x4E0D;&#x96BE;&#xFF0C;&#x771F;&#x6B63;&#x5199;&#x597D;&#x4E5F;&#x4E0D;&#x6613;&#xFF0C;&#x8FD8;&#x662F;&#x8981;&#x6709;&#x4E9B;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x7684;&#x7CBE;&#x795E;&#x6EF4;&#x3002;&#x8BF8;&#x541B;&#x4E14;&#x5199;&#x4E14;&#x73CD;&#x60DC;&#x5427;&#xFF01;~</p>
<p>&#x6B22;&#x8FCE;&#x6765;&#x8FD9;&#x91CC;&#x4EA4;&#x6D41;&#xFF1A; 152128548</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/CSS/" rel="tag">#CSS</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/03/28/《web前端最佳实践》—高维护性css/" rel="next" title="《web前端最佳实践》—高维护性css">
                <i class="fa fa-chevron-left"></i> 《web前端最佳实践》—高维护性css
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2015/04/11/inline-block-gap/" rel="prev" title="小谈inline-block的那点空隙">
                小谈inline-block的那点空隙 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#高性能css"><span class="nav-number">1.</span> <span class="nav-text">高性能css</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#css3最佳实践"><span class="nav-number">2.</span> <span class="nav-text">css3最佳实践</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
