<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="经历," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x524D;&amp;#x51E0;&amp;#x5929;&amp;#x9519;&amp;#x8FC7;&amp;#x4E86;&amp;#x6BD5;&amp;#x4E1A;&amp;#x548C;&amp;#x6765;&amp;#x6DF1;&amp;#x5733;&amp;#x4E00;&amp;#x5468;&amp;#x5E74;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x4E00;&amp;#x770B;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x6070;&amp;#x662F;">
<meta property="og:type" content="article">
<meta property="og:title" content="新工作一个月，深圳工作一周年记">
<meta property="og:url" content="http://yoursite.com/2014/07/04/新工作一个月，深圳工作一周年记/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x524D;&amp;#x51E0;&amp;#x5929;&amp;#x9519;&amp;#x8FC7;&amp;#x4E86;&amp;#x6BD5;&amp;#x4E1A;&amp;#x548C;&amp;#x6765;&amp;#x6DF1;&amp;#x5733;&amp;#x4E00;&amp;#x5468;&amp;#x5E74;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x4E00;&amp;#x770B;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x6070;&amp;#x662F;">
<meta property="og:updated_time" content="2016-02-24T12:57:17.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="新工作一个月，深圳工作一周年记">
<meta name="twitter:description" content="&amp;#x524D;&amp;#x51E0;&amp;#x5929;&amp;#x9519;&amp;#x8FC7;&amp;#x4E86;&amp;#x6BD5;&amp;#x4E1A;&amp;#x548C;&amp;#x6765;&amp;#x6DF1;&amp;#x5733;&amp;#x4E00;&amp;#x5468;&amp;#x5E74;&amp;#xFF0C;&amp;#x4ECA;&amp;#x5929;&amp;#x4E00;&amp;#x770B;&amp;#x65F6;&amp;#x95F4;&amp;#xFF0C;&amp;#x6070;&amp;#x662F;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 新工作一个月，深圳工作一周年记 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                新工作一个月，深圳工作一周年记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-07-04T00:00:00+08:00" content="2014-07-04">
              2014-07-04
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/经历/" itemprop="url" rel="index">
                    <span itemprop="name">经历</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x524D;&#x51E0;&#x5929;&#x9519;&#x8FC7;&#x4E86;&#x6BD5;&#x4E1A;&#x548C;&#x6765;&#x6DF1;&#x5733;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x4ECA;&#x5929;&#x4E00;&#x770B;&#x65F6;&#x95F4;&#xFF0C;&#x6070;&#x662F;&#x5DE5;&#x4F5C;&#x4E00;&#x5468;&#x5E74;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x80FD;&#x518D;&#x9519;&#x8FC7;&#x4E86;~</p>
<p>&#x4E00;&#x5E74;&#x4ECD;&#x662F;&#x804C;&#x573A;&#x65B0;&#x4EBA;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x6211;&#x5E38;&#x5411;&#x522B;&#x4EBA;&#x8FD9;&#x4E48;&#x63CF;&#x8FF0;&#xFF1A;&#x201C;&#x6211;&#x6BD5;&#x4E1A;&#x7684;&#x7B2C;&#x4E8C;&#x5929;&#x4E0B;&#x5348;&#x5C31;&#x6765;&#x5230;&#x4E86;&#x6DF1;&#x5733;&#x201D;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x6211;&#x60F3;&#x8868;&#x8FBE;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x5BF9;&#x5916;&#x9762;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x5BF9;&#x6DF1;&#x5733;&#xFF0C;&#x5BF9;&#x5DE5;&#x4F5C;&#xFF0C;&#x5BF9;&#x6211;&#x70ED;&#x7231;&#x7684;&#x524D;&#x7AEF;&#xFF0C;&#x662F;&#x591A;&#x4E48;&#x575A;&#x5B9A;&#x548C;&#x671F;&#x5F85;&#x3002;&#x4E0D;&#x77E5;&#x662F;&#x5426;&#x66FE;&#x6709;&#x4EBA;&#x611F;&#x53D7;&#x5230;&#x8FC7;&#xFF0C;&#x5475;&#x5475;&#x3002;</p>
<p>&#x4F9D;&#x7136;&#x8BB0;&#x5F97;&#x90A3;&#x5929;&#x662F;&#x600E;&#x4E48;&#x6765;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x53C8;&#x80CC;&#x53C8;&#x62D6;&#x7684;&#x62FF;&#x7740;&#x4E09;&#x4E2A;&#x91CD;&#x91CD;&#x7684;&#x884C;&#x674E;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x8981;&#x8F6C;&#x4E00;&#x8D9F;&#x706B;&#x8F66;&#xFF0C;&#x884C;&#x674E;&#x91CD;&#x4E0D;&#x91CD;&#x7684;&#x5012;&#x662F;&#x5728;&#x5176;&#x6B21;&#x4E86;&#x3002;&#x6700;&#x62C5;&#x5FC3;&#x7684;&#x662F;&#xFF0C;&#x5305;&#x5343;&#x4E07;&#x522B;&#x88AB;&#x6491;&#x7834;&#x6216;&#x8005;&#x80CC;&#x5305;&#x7684;&#x888B;&#x5B50;&#x5343;&#x4E07;&#x522B;&#x65AD;&#x6389;&#x554A;&#xFF0C;&#x4E0D;&#x7136;&#x6211;&#x771F;&#x7684;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x62FF;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x4EC0;&#x4E48;&#x610F;&#x5916;&#xFF0C;&#x90A3;&#x4E5F;&#x7B49;&#x6211;&#x4E0A;&#x4E86;&#x76F4;&#x8FBE;&#x7EC8;&#x70B9;&#x7684;&#x8F66;&#x518D;&#x5230;&#x6765;&#x5427;&#xFF0C;&#x5C31;&#x8FD9;&#x6837;&#x4E00;&#x8FB9;&#x7740;&#x6025;&#x7684;&#x8D76;&#xFF0C;&#x4E00;&#x8FB9;&#x8FD8;&#x5C0F;&#x5FC3;&#x7FFC;&#x7FFC;&#x3002;&#x8FD8;&#x597D;&#x4E00;&#x5207;&#x987A;&#x5229;&#x3002;&#x5230;&#x4E86;&#x6DF1;&#x5733;&#x6765;&#x4E0D;&#x53CA;&#x53BB;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x53BB;&#x901B;&#xFF0C;&#x53BB;&#x73A9;&#x513F;&#xFF0C;&#x5F88;&#x70ED;&#xFF0C;&#x8981;&#x642C;&#x4E1C;&#x897F;&#x5230;&#x79DF;&#x623F;&#x7684;9&#x697C;&#xFF0C;&#x6CA1;&#x6709;&#x7535;&#x68AF;&#xFF0C;&#x8981;&#x6574;&#x7406;&#x623F;&#x95F4;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x51C6;&#x5907;&#x627E;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x8BF4;&#x4E86;&#x6BD5;&#x4E1A;&#x540E;&#x4E0D;&#x518D;&#x627E;&#x5BB6;&#x91CC;&#x8981;&#x94B1;&#xFF0C;&#x867D;&#x7136;&#x4EBA;&#x8BF4;&#x5230;&#x505A;&#x4E0D;&#x5230;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x4E5F;&#x6709;&#x670B;&#x53CB;&#x8BF4;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x627E;&#x5BB6;&#x91CC;&#x8981;&#x70B9;&#x94B1;&#x662F;&#x5E94;&#x8BE5;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x7A33;&#x5B9A;&#x4E86;&#x53EF;&#x4EE5;&#x9760;&#x81EA;&#x5DF1;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x8FD9;&#x6B21;&#x6211;&#x60F3;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x3002;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x5176;&#x5B9E;&#x771F;&#x8C08;&#x4E0D;&#x4E0A;&#x82E6;&#xFF08;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;~&#xFF09;&#xFF0C;&#x6CA1;&#x6709;&#x997F;&#x8FC7;&#x4E00;&#x987F;&#xFF0C;&#x4F46;&#x751F;&#x6D3B;&#x4E2D;&#x7684;&#x8BF8;&#x591A;&#x4E8B;&#x60C5;&#x4ECD;&#x7136;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x8F7B;&#x677E;&#x7684;&#xFF0C;&#x6211;&#x4E00;&#x4E00;&#x514B;&#x670D;&#x7740;&#xFF0C;&#x4E5F;&#x5E76;&#x6CA1;&#x611F;&#x89C9;&#x591A;&#x7D2F;&#xFF0C;&#x6216;&#x8BB8;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5E74;&#x8F7B;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x6211;&#x90FD;&#x4E0D;&#x4F1A;&#x592A;&#x5728;&#x4E4E;&#xFF0C;&#x518D;&#x8BF4;&#x4E86;&#xFF0C;&#x6211;&#x6765;&#x7684;&#x662F;&#x6DF1;&#x5733;&#xFF0C;&#x90A3;&#x80A1;&#x5174;&#x594B;&#x52B2;&#x513F;&#x4E5F;&#x80FD;&#x652F;&#x6491;&#x6211;&#x597D;&#x4E00;&#x9635;&#x513F;&#x5427;~</p>
<p>&#x6211;&#x66FE;&#x7ECF;&#x53BB;&#x8FC7;&#x5317;&#x4EAC;&#x627E;&#x5B9E;&#x4E60;&#xFF0C;&#x8FD9;&#x6B21;&#x662F;&#x6765;&#x6DF1;&#x5733;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BCF;&#x6B21;&#x627E;&#x5DE5;&#x4F5C;&#x90FD;&#x6CA1;&#x7528;&#x591A;&#x4E45;&#xFF0C;&#x8FD9;&#x6B21;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x5728;&#x6211;&#x5373;&#x5C06;&#x4E0D;&#x62B1;&#x4EC0;&#x4E48;&#x5E0C;&#x671B;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x79F0;&#x5FC3;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x627E;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x4E0A;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x624D;&#x534E;&#x7F51;&#x7EDC;&#xFF0C;&#x6211;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x5F88;&#x611F;&#x8C22;&#x5B83;&#xFF0C;&#x4E5F;&#x611F;&#x8C22;&#x6625;&#x54E5;&#xFF0C;&#x4E5F;&#x5F88;&#x611F;&#x8C22;&#x5C0F;&#x806A;&#xFF0C;&#x6625;&#x54E5;&#x201C;&#x6536;&#x7559;&#x201D;&#x4E86;&#x6211;&#xFF0C;&#x800C;&#x5C0F;&#x806A;&#xFF0C;&#x5E74;&#x9F84;&#x6BD4;&#x6211;&#x5C0F;&#xFF0C;&#x5374;&#x6210;&#x4E86;&#x6211;&#x7684;&#x4E3B;&#x7BA1;&#xFF0C;&#x7B97;&#x662F;&#x6211;&#x804C;&#x573A;&#x7B2C;&#x4E00;&#x4E2A;&#x5E08;&#x5085;&#x5427;&#x3002;&#x4F9D;&#x7136;&#x6E05;&#x6670;&#x7684;&#x8BB0;&#x5F97;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x5C0F;&#x806A;&#x5728;&#x64CD;&#x4F5C;&#x90A3;&#x5BC6;&#x5BC6;&#x9EBB;&#x9EBB;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#x5019;&#x6211;&#x5934;&#x5927;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x6211;&#x8DDF;&#x4E0D;&#x61C2;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x611F;&#x89C9;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x5FCD;&#x4E0D;&#x4F4F;&#x95EE;&#x4E86;&#x4ED6;&#x4E00;&#x53E5;&#xFF1A;&#x201C;&#x90A3;&#x4E48;&#x591A;&#x4EE3;&#x7801;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x662F;&#x54EA;&#x4E2A;&#x5440;&#xFF1F;&#x201D;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F30;&#x8BA1;&#x4E5F;&#x53EA;&#x6709;&#x83DC;&#x9E1F;&#x624D;&#x95EE;&#x5F97;&#x51FA;&#x5427;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x5C31;&#x662F;&#x6BCF;&#x5929;&#x90FD;&#x8FDB;&#x6B65;&#x7684;&#x8BA9;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5174;&#x594B;&#x662F;&#x540E;&#x8BDD;&#xFF0C;&#x5174;&#x594B;&#x4E4B;&#x524D;&#xFF0C;&#x662F;&#x63A5;&#x8FDE;&#x4E0D;&#x65AD;&#x7684;&#x90C1;&#x95F7;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x6211;&#x6700;&#x5E38;&#x8BF4;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#xFF1A;&#x201D;&#x6211;&#x90FD;&#x60F3;&#x6B7B;&#x201C;&#x3002;&#x8FD9;&#x662F;&#x53E5;&#x73A9;&#x7B11;&#x8BDD;&#xFF0C;&#x53EF;&#x662F;&#x4F60;&#x80FD;&#x60F3;&#x8C61;&#x5230;&#x6709;&#x591A;&#x90C1;&#x95F7;&#xFF0C;&#x90C1;&#x95F7;&#x5728;&#x4E8E;&#xFF0C;&#x6709;&#x4E9B;&#x4F60;&#x6839;&#x672C;&#x68C0;&#x67E5;&#x4E0D;&#x51FA;&#x6216;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x7684;&#x8D85;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#xFF0C;&#x522B;&#x4EBA;&#x7ED9;&#x4F60;&#x6307;&#x51FA;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x552F;&#x4E00;&#x4F1A;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5C31;&#x662F;&#x6000;&#x7591;&#x81EA;&#x5DF1;&#x7684;&#x667A;&#x5546;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B21;&#x603B;&#x662F;&#x8BA9;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#x7684;&#xFF0C;&#x505A;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x7F51;&#x7AD9;&#x8BB0;&#x4E0D;&#x6E05;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x72EC;&#x7ACB;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x5374;&#x8BB0;&#x5F97;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x867D;&#x7136;&#x90A3;&#x6B21;&#x6211;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9996;&#x9875;&#x5C31;&#x7528;&#x4E86;&#x4E24;&#x5929;&#xFF0C;&#x5475;&#x5475;&#x3002;</p>
<p>&#x624D;&#x534E;&#x5E26;&#x7ED9;&#x6211;&#x7684;&#x6210;&#x957F;&#x662F;&#x5168;&#x65B9;&#x4F4D;&#x7684;&#xFF0C;&#x516C;&#x53F8;&#x521D;&#x521B;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x4E1A;&#x52A1;&#x5F00;&#x5C55;&#x3001;&#x4E1A;&#x52A1;&#x91CF;&#x589E;&#x957F;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x5404;&#x79CD;&#x9500;&#x552E;&#x3001;&#x6C9F;&#x901A;&#x6280;&#x5DE7;&#xFF0C;&#x4EBA;&#x5458;&#x7BA1;&#x7406;&#xFF0C;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#x7B49;&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x5F88;&#x591A;&#x3002;&#x53EF;&#x662F;&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x4E2A;&#x4EBA;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x9009;&#x62E9;&#x79BB;&#x53BB;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;&#x6211;&#x4EEC;&#x73A9;&#x513F;&#x8FC7;&#x5F88;&#x591A;&#x6E38;&#x620F;&#xFF0C;&#x5728;&#x5E74;&#x4F1A;&#x821E;&#x53F0;&#x4E0A;&#x8868;&#x6F14;&#x6392;&#x7EC3;&#x4E86;&#x4E24;&#x4E2A;&#x6708;&#x7684;&#x821E;&#x8E48;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x52A0;&#x73ED;&#x5230;&#x8FD1;12&#x70B9;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x53BB;&#x6F02;&#x6D41;&#xFF0C;&#x4E00;&#x8D77;&#x51FA;&#x53BB;&#x5230;&#x666F;&#x70B9;&#x6E38;&#x73A9;&#x3002;&#x3002;&#x3002;&#x5F88;&#x591A;&#x7F8E;&#x597D;&#x8BB0;&#x5FC6;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x7528;&#x8FD9;&#x4E00;&#x5E74;&#x7ECF;&#x5386;&#x6765;&#x5206;&#x4EAB;&#x7ED9;&#x540E;&#x6765;&#x7684;&#x6CA1;&#x7ECF;&#x5386;&#x8FC7;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x4EBA;&#xFF1A;&#x9752;&#x6625;&#x5B9D;&#x8D35;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x4E0A;&#x6CA1;&#x4E0A;&#x8FC7;&#x5927;&#x5B66;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x5927;&#x5B66;&#x767D;&#x4E0A;&#x4E86;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x8FC7;&#x53BB;&#x7684;&#x4E8B;&#xFF0C;20&#x5DE6;&#x53F3;&#xFF0C;&#x4EBA;&#x751F;&#x624D;&#x521A;&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x4E0D;&#x665A;&#xFF0C;&#x4F60;&#x9996;&#x5148;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x628A;&#x559C;&#x6B22;&#x7684;&#x53D8;&#x6210;&#x64C5;&#x957F;&#x7684;&#xFF0C;&#x6709;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x5954;&#x7740;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x53BB;&#x52AA;&#x529B;&#xFF0C;&#x4E0D;&#x8981;&#x4EBA;&#x4E91;&#x4EA6;&#x4E91;&#xFF0C;&#x4E0D;&#x8981;&#x76F2;&#x76EE;&#x8DDF;&#x98CE;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x53EA;&#x770B;&#x91CD;&#x773C;&#x524D;&#x5229;&#x76CA;&#x3001;&#x53EA;&#x770B;&#x5230;&#x773C;&#x524D;&#x7684;&#x82E6;&#xFF0C;&#x8981;&#x6709;&#x6240;&#x8FFD;&#x6C42;&#xFF0C;&#x5F53;&#x4F60;&#x633A;&#x4E86;&#x8FC7;&#x6765;&#xFF0C;&#x6709;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x7B11;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x8FC7;&#x5F80;&#xFF0C;&#x4E5F;&#x80FD;&#x7B11;&#x5BF9;&#x90A3;&#x4E9B;&#x66FE;&#x8BF4;&#x4F60;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x6709;&#x4E0D;&#x5C11;&#x5E74;&#x8F7B;&#x4EBA;&#x56FE;&#x8F7B;&#x677E;&#xFF0C;&#x56FE;&#x80FD;&#x8D5A;&#x94B1;&#xFF0C;&#x89C9;&#x5F97;&#x4E00;&#x4E2A;&#x6708;&#x4E09;&#x56DB;&#x5343;&#x7684;&#x85AA;&#x6C34;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x5DE5;&#x4F5C;&#x53C8;&#x4E0D;&#x96BE;&#xFF0C;&#x4E00;&#x8FB9;&#x8FD9;&#x4E48;&#x60F3;&#x7740;&#xFF0C;&#x4E00;&#x8FB9;&#x53C8;&#x5728;&#x7A7A;&#x95F2;&#x7684;&#x65F6;&#x5019;&#x8DDF;&#x4EBA;&#x804A;&#x5929;&#x6709;&#x6C14;&#x65E0;&#x529B;&#x7684;&#x8BF4;&#x201D;&#x6211;&#x597D;&#x65E0;&#x804A;&#x554A;&#x201C;&#x201D;&#x80FD;&#x600E;&#x4E48;&#x6837;&#x5462;&#xFF0C;&#x8FD8;&#x90A3;&#x6837;&#x5457;&#x201C;&#xFF0C;&#x5F53;&#x4F60;&#x662F;&#x8FD9;&#x6837;&#x63CF;&#x8FF0;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x751F;&#x6D3B;&#x548C;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x4E0D;&#x7D2F;&#xFF0C;&#x867D;&#x7136;&#x4F60;&#x80FD;&#x517B;&#x6D3B;&#x81EA;&#x5DF1;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x6837;&#x7684;&#x9752;&#x6625;&#x4F60;&#x6562;&#x4FDD;&#x8BC1;&#x662F;&#x65E0;&#x6094;&#x7684;&#x5417;&#xFF1F;~</p>
<p>&#x5927;&#x56DB;&#x8003;&#x7814;&#x5931;&#x8D25;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x679C;&#x65AD;&#x653E;&#x5F03;&#x4E86;&#x4E8C;&#x6218;&#xFF0C;&#x540C;&#x5B66;&#x548C;&#x5BB6;&#x4EBA;&#x90FD;&#x66FE;&#x95EE;&#x8FC7;&#x6211;&#x751A;&#x81F3;&#x529D;&#x8FC7;&#x6211;&#xFF0C;&#x518D;&#x6765;&#x4E00;&#x5E74;&#x5427;&#xFF0C;&#x6211;&#x62D2;&#x7EDD;&#x4E86;&#xFF0C;&#x5C31;&#x50CF;&#x5F53;&#x521D;&#x9009;&#x62E9;&#x8003;&#x7814;&#x4E00;&#x6837;&#x6CA1;&#x72B9;&#x8C6B;&#x3002;&#x56E0;&#x4E3A;&#x6211;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x81EA;&#x5DF1;&#x60F3;&#x8981;&#x4EC0;&#x4E48;&#xFF0C;&#x90A3;&#x4F55;&#x4E0D;&#x5168;&#x8EAB;&#x5FC3;&#x6295;&#x5165;&#x4E8E;&#x5B83;&#xFF1F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x8003;&#x7814;&#x672C;&#x8EAB;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x60F3;&#x5BF9;&#x4E0D;&#x7BA1;&#x662F;&#x4E00;&#x6218;&#x8FD8;&#x662F;&#x4E8C;&#x6218;&#x6210;&#x529F;&#x7684;&#x540C;&#x5B66;&#x597D;&#x53CB;&#x8BF4;&#xFF0C;&#x4F60;&#x4EEC;&#x4E00;&#x5B9A;&#x8981;&#x52A0;&#x6CB9;&#x597D;&#x597D;&#x5E72;&#xFF0C;&#x53D1;&#x6325;&#x597D;&#x5B83;&#x7684;&#x6700;&#x5927;&#x4EF7;&#x503C;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5BF9;&#x4E8C;&#x6218;&#x4ECD;&#x7136;&#x5931;&#x5229;&#x7684;&#x540C;&#x5B66;&#x8BF4;&#xFF0C;&#x5931;&#x8D25;&#x5E76;&#x4E0D;&#x53EF;&#x6015;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;&#x6765;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;&#x800C;&#x5DF2;&#xFF0C;&#x627E;&#x5230;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4E13;&#x6CE8;&#x7684;&#x53BB;&#x505A;&#xFF0C;&#x51E0;&#x5E74;&#x4EE5;&#x540E;&#x6216;&#x8BB8;&#x4F60;&#x5E76;&#x4E0D;&#x4F1A;&#x5BF9;&#x5F53;&#x5E74;&#x7684;&#x843D;&#x699C;&#x611F;&#x5230;&#x9057;&#x61BE;~</p>
<p>&#x65B0;&#x516C;&#x53F8;&#x53EB;inser &#x5F71;&#x81F4;&#x79D1;&#x6280;&#xFF0C;&#x65B0;&#x5DE5;&#x4F5C;&#x662F;&#x505A;&#x5FAE;&#x7535;&#x5F71;app&#x548C;&#x5FAE;&#x7535;&#x5F71;&#x5E73;&#x53F0;&#x7684;&#xFF0C;&#x6211;&#x672C;&#x8EAB;&#x4E5F;&#x6BD4;&#x8F83;&#x559C;&#x6B22;&#x5FAE;&#x7535;&#x5F71;&#xFF0C;&#x8001;&#x677F;&#x4EBA;&#x5F88;&#x597D;&#xFF0C;&#x540C;&#x4E8B;&#x5F88;&#x5E74;&#x8F7B;&#xFF0C;&#x5BCC;&#x6709;&#x671D;&#x6C14;&#xFF0C;&#x5173;&#x6CE8;&#x524D;&#x6CBF;&#xFF0C;&#x6709;&#x6FC0;&#x60C5;&#x548C;&#x521B;&#x9020;&#x529B;&#x3002;&#x4E00;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x4E0D;&#x5C11;&#x56F0;&#x96BE;&#xFF0C;&#x4F46;&#x514B;&#x670D;&#x56F0;&#x96BE;&#x540E;&#x7684;&#x6536;&#x83B7;&#x66F4;&#x8BA9;&#x6211;&#x5174;&#x594B;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x2014;&#x2014;&#x524D;&#x7AEF;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x662F;&#x9526;&#x4E0A;&#x6DFB;&#x82B1;&#xFF0C;&#x6211;&#x5230;&#x5E95;&#x6709;&#x591A;&#x559C;&#x6B22;&#x524D;&#x7AEF;&#x5462;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x559C;&#x6B22;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x524D;&#x7AEF;&#xFF0C;&#x800C;&#x662F;&#x521B;&#x9020;&#x4F18;&#x79C0;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x521B;&#x9020;&#x7F8E;&#x611F;&#xFF0C;&#x7ED9;&#x4EBA;&#x4EEC;&#x63D0;&#x4F9B;&#x7B80;&#x5355;&#x3001;&#x5FEB;&#x6377;&#x3001;&#x5BCC;&#x6709;&#x7F8E;&#x611F;&#x7684;&#x4F7F;&#x7528;&#x4F53;&#x9A8C;&#x3002;&#x6211;&#x5EFA;&#x4E86;QQ&#x7FA4;&#xFF0C;&#x540D;&#x5B57;&#x53EB;&#x201D;&#x7F8E;&#x662F;&#x7F16;&#x51FA;&#x6765;&#x7684;&#x201C;&#xFF0C;&#x5E76;&#x5728;&#x91CC;&#x9762;&#x5206;&#x4EAB;&#x4E86;&#x6211;&#x641C;&#x96C6;&#x4E00;&#x5E74;&#x591A;&#x7684;&#x597D;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x4E70;&#x4E86;&#x5F88;&#x591A;&#x672C;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x4E66;&#xFF0C;&#x7ED3;&#x8BC6;&#x4E86;&#x5728;&#x6DF1;&#x5733;&#x3001;&#x4E0A;&#x6D77;&#x3001;&#x5317;&#x4EAC;&#x7B49;&#x5730;&#x5DE5;&#x4F5C;&#x7684;&#x884C;&#x4E1A;&#x5927;&#x725B;&#xFF0C;&#x6211;&#x4F1A;&#x53BB;&#x817E;&#x8BAF;&#x542C;&#x8BB2;&#x5EA7;&#x5E76;&#x8BA4;&#x771F;&#x8BB0;&#x7B14;&#x8BB0;&#x3002;&#x597D;&#x5427;&#xFF0C;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x662F;&#x4E2A;&#x524D;&#x7AEF;&#x83DC;&#x9E1F;&#xFF0C;&#x7EAF;&#x5C4C;&#x4E1D;&#x3002;&#x53EF;&#x90A3;&#x53C8;&#x600E;&#x6837;&#xFF0C;&#x8C01;&#x80FD;&#x4FDD;&#x8BC1;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x4E0D;&#x4F1A;&#x4E0A;&#x6F14;&#x5C4C;&#x4E1D;&#x9006;&#x88AD;&#xFF1F;~</p>
<p>&#x8C28;&#x4EE5;&#x6B64;&#x6587;&#xFF0C;&#x7EAA;&#x5FF5;&#x5DE5;&#x4F5C;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x6DF1;&#x5733;&#x4E00;&#x5468;&#x5E74;&#xFF0C;&#x6211;&#x4E0D;&#x786E;&#x5B9A;&#x4EE5;&#x540E;&#x4F1A;&#x4E0D;&#x4F1A;&#x6709;&#x201D;&#x4E8C;&#x5468;&#x5E74;&#x201C; &#x3001;&#x201D;&#x4E09;&#x5468;&#x5E74;&#x201C;..&#x4E0D;&#x53BB;&#x7BA1;&#x5B83;&#xFF0C;&#x8D70;&#x597D;&#x811A;&#x4E0B;&#x6BCF;&#x4E00;&#x6B65;&#xFF0C;&#x628A;&#x63E1;&#x81EA;&#x5DF1;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x8981;&#x5BF9;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x5173;&#x5FC3;&#x652F;&#x6301;&#x6211;&#x7684;&#x5BB6;&#x4EBA;&#x3001;&#x670B;&#x53CB;&#x8BF4;&#x58F0;&#x611F;&#x8C22;&#x3002;&#x6211;&#x4F1A;&#x7EE7;&#x7EED;&#x52AA;&#x529B;&#xFF01;~ </p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/经历/" rel="tag">#经历</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2014/07/04/inser工作一月/" rel="next" title="inser工作一月">
                <i class="fa fa-chevron-left"></i> inser工作一月
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" rel="prev" title="初接触移动开发可能遇到的一部分问题（一无所知的可以看看）">
                初接触移动开发可能遇到的一部分问题（一无所知的可以看看） <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
