<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>初接触移动开发可能遇到的一部分问题（一无所知的可以看看） | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">初接触移动开发可能遇到的一部分问题（一无所知的可以看看）</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">初接触移动开发可能遇到的一部分问题（一无所知的可以看看）</h1><div class="post-meta">Jul 5, 2014<span> | </span><span class="category"><a href="/categories/移动端/">移动端</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" href="/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#一、以前都是在电脑上的网页，现在要在手机上看了，可怎么搞？"><span class="toc-number">1.</span> <span class="toc-text">一、以前都是在电脑上的网页，现在要在手机上看了，可怎么搞？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#二、知道了第一点，那接下来该怎么做呢，设备多种多样，不同品牌，不同尺寸，不同默认显示方式等等…"><span class="toc-number">2.</span> <span class="toc-text">二、知道了第一点，那接下来该怎么做呢，设备多种多样，不同品牌，不同尺寸，不同默认显示方式等等…</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#三、文字已经做了相对大小处理了，那么图片呢？"><span class="toc-number">3.</span> <span class="toc-text">三、文字已经做了相对大小处理了，那么图片呢？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#四、使用了百分比就万事大吉了吗？"><span class="toc-number">4.</span> <span class="toc-text">四、使用了百分比就万事大吉了吗？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#五、屏幕的尺寸跟你用肉眼看的一样吗？"><span class="toc-number">5.</span> <span class="toc-text">五、屏幕的尺寸跟你用肉眼看的一样吗？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#六、不想设置百分比怎么办？"><span class="toc-number">6.</span> <span class="toc-text">六、不想设置百分比怎么办？</span></a></li></ol></div></div><div class="post-content"><h2 id="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"><a href="#&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;" class="headerlink" title="&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;"></a>&#x4E00;&#x3001;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x73B0;&#x5728;&#x8981;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x770B;&#x4E86;&#xFF0C;&#x53EF;&#x600E;&#x4E48;&#x641E;&#xFF1F;</h2><p>&#x662F;&#x7684;&#xFF0C;&#x7535;&#x8111;&#x4E0A;&#x9762;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x5927;&#x81F4;&#x662F;&#x80CC;&#x666F;&#x5BBD;&#x5EA6;100%&#xFF0C;&#x4E3B;&#x4F53;&#x5185;&#x5BB9;&#x5C45;&#x4E2D;&#xFF0C;&#x5206;&#x680F;&#x5E03;&#x5C40;&#x6D6E;&#x52A8;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x5185;&#x5916;&#x8FB9;&#x8DDD;&#x7B49;&#x4FBF;&#x53EF;&#x89E3;&#x51B3;&#xFF0C;&#x4F46;&#x5230;&#x4E86;&#x79FB;&#x52A8;&#x7AEF;&#x5462;&#xFF1F;&#x5C4F;&#x5E55;&#x672C;&#x6765;&#x5C31;&#x5F88;&#x5C0F;&#xFF0C;&#x4F60;&#x522B;&#x544A;&#x8BC9;&#x6211;&#x8981;&#x628A;&#x56FE;&#x7247;&#x548C;&#x6587;&#x5B57;&#x90FD;&#x8C03;&#x6574;&#x5230;&#x5F88;&#x5C0F;&#x7136;&#x540E;&#x628A;&#x7F51;&#x9875;&#x4E0A;&#x7684;&#x7ECF;&#x9A8C;&#x518D;&#x5168;&#x90E8;&#x642C;&#x8FC7;&#x6765;&#xFF0C;&#x663E;&#x7136;&#x4E0D;&#x9760;&#x8C31;&#xFF0C;&#x672C;&#x8EAB;&#x624B;&#x673A;&#x7F51;&#x9875;&#x6709;&#x7740;&#x5C4F;&#x5E55;&#x5C0F;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4FFA;&#x5C31;&#x610F;&#x5473;&#x7740;&#x7A7A;&#x95F4;&#x975E;&#x5E38;&#x5B9D;&#x8D35;&#xFF0C;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x5730;&#x65B9;&#x7ED9;&#x4F60;&#x7559;&#x767D;&#xFF0C;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x533A;&#x57DF;&#x8981;&#x4E48;&#x53EF;&#x64CD;&#x4F5C;&#xFF0C;&#x8981;&#x4E48;&#x7528;&#x6765;&#x5C55;&#x793A;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x7ED9;&#x7528;&#x6237;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x611F;&#x5B98;&#x548C;&#x64CD;&#x4F5C;&#x4FBF;&#x5229;&#x3002;</p>
<h2 id="&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;"><a href="#&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;" class="headerlink" title="&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;"></a>&#x4E8C;&#x3001;&#x77E5;&#x9053;&#x4E86;&#x7B2C;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x63A5;&#x4E0B;&#x6765;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x5462;&#xFF0C;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#xFF0C;&#x4E0D;&#x540C;&#x54C1;&#x724C;&#xFF0C;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#xFF0C;&#x4E0D;&#x540C;&#x9ED8;&#x8BA4;&#x663E;&#x793A;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x2026;</h2><p>&#x9996;&#x5148;&#x5C31;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x767E;&#x5206;&#x6BD4;&#xFF0C;&#x767E;&#x5206;&#x6BD4;&#x5BBD;&#x5EA6;&#x548C;&#x9AD8;&#x5EA6;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x4E3A;&#x4E86;&#x8BBE;&#x7F6E;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x5BB9;&#x5668;&#x5927;&#x5C0F;&#xFF0C;&#x4F46;&#x6709;&#x4E86;&#x5BB9;&#x5668;&#x5927;&#x5C0F;&#xFF0C;&#x5185;&#x5BB9;&#x533A;&#x57DF;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;&#x8FD9;&#x5C31;&#x6D89;&#x53CA;&#x5230;&#x5B57;&#x4F53;&#x548C;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x731C;&#x5BF9;&#x4E86;&#xFF0C;&#x5B57;&#x4F53;&#x4E5F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x60EF;&#x4E86;&#x50CF;&#x7D20;&#xFF08;px&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x4F60;&#x7528;em&#xFF0C;&#x6216;&#x8005;rem&#x4E4B;&#x7C7B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4E00;&#x4E0B;&#x5F88;&#x4E0D;&#x4E60;&#x60EF;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x8003;&#x6807;&#x51C6;&#x8FD8;&#x662F;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x4E86;&#x798F;&#x97F3;&#xFF0C;&#x4E00;&#x822C;&#x9ED8;&#x8BA4;&#x5927;&#x5C0F;16px&#x662F;1em&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x4F60;&#x51C6;&#x5907;&#x4E2A;&#x8BA1;&#x7B97;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x628A;&#x50CF;&#x7D20;&#x8BA1;&#x7B97;&#x4E00;&#x4E0B;&#x4E00;&#x8F6C;&#x6362;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x770B;&#x6837;&#x5B50;&#x8FD9;&#x6837;&#x662F;&#x51D1;&#x5408;&#x89E3;&#x51B3;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x8BF4;&#x662F;&#x51D1;&#x5408;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x603B;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x201C;&#x83AB;&#x540D;&#x201D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x7684;&#x7EE7;&#x627F;&#x6027;&#xFF0C;&#x4F7F;&#x7528;px&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x60F3;&#x8BBE;&#x7F6E;&#x591A;&#x5C11;&#x5C31;&#x662F;&#x591A;&#x5C11;&#x5BF9;&#x5427;&#xFF1F;&#x4EFB;&#x4F60;&#x6446;&#x5E03;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4E2A;&#x7EDF;&#x4E00;&#x6807;&#x51C6;&#xFF08;px&#xFF09;&#x7EDD;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x800C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x6BD4;&#x5982;&#x7236;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x7684;2em&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;32px&#x5927;&#x5C0F;&#xFF0C;&#x5B50;&#x5143;&#x7D20;&#x4F60;&#x518D;&#x8BBE;&#x7F6E;&#x4E2A;2em&#xFF0C;&#x4E0D;&#x597D;&#x610F;&#x601D;&#xFF0C;&#x8FD9;&#x91CC;&#x597D;&#x50CF;2em&#x2260;2em&#x4E86;&#xFF0C;&#x5177;&#x4F53;&#x81EA;&#x5DF1;&#x53BB;&#x5B9E;&#x9A8C;&#x5427;~&#x5982;&#x679C;&#x6211;&#x8FD9;&#x4E48;&#x8BF4;&#x4F60;&#x89C9;&#x5F97;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5408;&#x60C5;&#x5408;&#x7406;&#xFF0C;&#x90A3;&#x8BF4;&#x660E;&#x4F60;&#x6BD4;&#x8F83;&#x806A;&#x660E;&#xFF0C;&#x4F46;&#x5F53;&#x4F60;&#x6446;&#x8131;&#x4E0D;&#x6389;px&#x5E26;&#x6765;&#x7684;&#x4E60;&#x60EF;&#x800C;&#x9047;&#x5230;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x5019;&#x56DE;&#x6765;&#x770B;&#x6216;&#x8BB8;&#x4F1A;&#x53D1;&#x73B0;&#x70B9;&#x513F;&#x4EF7;&#x503C;&#x3002;</p>
<h2 id="&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;"><a href="#&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;" class="headerlink" title="&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;"></a>&#x4E09;&#x3001;&#x6587;&#x5B57;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x56FE;&#x7247;&#x5462;&#xFF1F;</h2><p>&#x4F60;&#x4F1A;&#x5802;&#x800C;&#x7687;&#x4E4B;&#x7684;&#x53BB;&#x8DDF;&#x8BBE;&#x8BA1;&#x8BF4;&#xFF0C;&#x6211;&#x9700;&#x8981;&#x9002;&#x5E94;&#x5404;&#x79CD;&#x5C3A;&#x5BF8;&#xFF0C;&#x4F60;&#x7ED9;&#x6211;&#x8BBE;&#x8BA1;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;&#x56FE;&#x7247;&#x5427;&#xFF0C;&#x4F60;&#x786E;&#x5B9A;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF1F;&#x53EF;&#x4E8B;&#x5B9E;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E5F;&#x884C;&#x554A;~&#x53EA;&#x53EF;&#x60DC;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x56FE;&#x7247;&#x53EF;&#x5927;&#x90FD;&#x662F;&#x4ECE;&#x540E;&#x53F0;&#x81EA;&#x884C;&#x4E0A;&#x4F20;&#x7684;&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;&#x53EA;&#x80FD;&#x7528;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x6211;&#x53EA;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x4EE3;&#x7801;&#x7684;&#x6838;&#x5FC3;&#x53EA;&#x7528;&#x5230;&#x4E00;&#x70B9;&#xFF1A;max-width&#xFF1A;100%&#xFF0C;&#x81F3;&#x4E8E;&#x9700;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x4E0A;max-height:100%,&#x6216;&#x8005;height&#xFF1A;auto&#x3002;&#x670B;&#x53CB;&#xFF0C;&#x81EA;&#x5DF1;&#x53BB;&#x8BD5;&#x9A8C;&#x5427;&#xFF0C;&#x6216;&#x8BB8;&#x6211;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x9519;&#x7684;&#x5462;&#xFF1F;&#x591A;&#x5C1D;&#x8BD5;&#x624D;&#x80FD;&#x63A5;&#x8FD1;&#x771F;&#x7406;&#x3002;</p>
<h2 id="&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;"><a href="#&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;" class="headerlink" title="&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;"></a>&#x56DB;&#x3001;&#x4F7F;&#x7528;&#x4E86;&#x767E;&#x5206;&#x6BD4;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x4E86;&#x5417;&#xFF1F;</h2><p>&#x4E8B;&#x5B9E;&#x597D;&#x50CF;&#x4E0D;&#x5C3D;&#x7136;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x6B63;&#x786E;&#x8BA1;&#x7B97;&#x767E;&#x5206;&#x6BD4;&#x5417;&#xFF1F;&#x6709;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x516C;&#x5F0F;&#xFF1A;&#x76EE;&#x6807;&#x5143;&#x7D20;&#x5BBD;&#x5EA6;/&#x4E0A;&#x4E0B;&#x6587;&#x5143;&#x7D20;&#x5BBD;&#x5EA6;=&#x767E;&#x5206;&#x6BD4;&#x5BBD;&#x5EA6;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5B83;&#x4E5F;&#x662F;&#x76F8;&#x5BF9;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x7236;&#x5143;&#x7D20;&#x53EA;&#x5360;&#x5230;&#x4E86;60%&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x60F3;&#x5B83;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5B50;&#x5143;&#x7D20;&#x5360;&#x5230;&#x5B83;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x90A3;&#x5C31;&#x9664;&#x4EE5;2&#x5417;&#xFF1F;&#x5475;&#x5475;&#xFF0C;&#x6216;&#x8BB8;&#x806A;&#x660E;&#x7684;&#x4F60;&#x60F3;&#x5230;&#x4E86;&#xFF0C;&#x662F;50%&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x60F3;&#x5F53;&#x7136;&#x7684;30%&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x548C;em&#x540C;&#x7406;&#x3002;</p>
<h2 id="&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;"><a href="#&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;" class="headerlink" title="&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;"></a>&#x4E94;&#x3001;&#x5C4F;&#x5E55;&#x7684;&#x5C3A;&#x5BF8;&#x8DDF;&#x4F60;&#x7528;&#x8089;&#x773C;&#x770B;&#x7684;&#x4E00;&#x6837;&#x5417;&#xFF1F;</h2><p>&#x786E;&#x5B9E;&#x5B58;&#x5728;&#x7740;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x574F;&#x4E60;&#x60EF;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4F60;&#x5DF2;&#x7ECF;&#x4E60;&#x60EF;&#x4E86;&#x67D0;&#x79CD;&#x5C4F;&#x5E55;&#x7684;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4F60;&#x8111;&#x6D77;&#x4E2D;&#x5C31;&#x6709;&#x4E86;&#x90A3;&#x4E2A;&#x5206;&#x8FA8;&#x7387;&#x4E0B;&#x76F8;&#x5E94;&#x6570;&#x503C;&#x6240;&#x5BF9;&#x5E94;&#x7684;&#x5BBD;&#x5EA6;&#xFF0C;&#x4F60;&#x518D;&#x53BB;&#x770B;&#x624B;&#x673A;&#x6216;&#x8005;&#x5E73;&#x677F;&#x7535;&#x8111;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x89C9;&#x5F97;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BBD;&#x5EA6;&#x5927;&#x6982;&#x4E5F;&#x5C31;300px&#x5DE6;&#x53F3;&#xFF0C;&#x90A3;&#x4E2A;&#x5BBD;&#x5EA6;&#x4E5F;&#x5C31;500px&#x5DE6;&#x53F3;&#x5427;&#x3002;&#x7AE5;&#x978B;&#xFF0C;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x8981;&#x5F88;&#x8C28;&#x614E;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x773C;&#x89C1;&#x4E0D;&#x4E3A;&#x5B9E;&#xFF0C;&#x7ECF;&#x9A8C;&#x4E0D;&#x53EF;&#x4FE1;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x63D0;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x5462;&#xFF0C;&#x8DDF;&#x4E0B;&#x9762;&#x8981;&#x8BF4;&#x7684;&#x6709;&#x5173;~</p>
<h2 id="&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;"><a href="#&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;" class="headerlink" title="&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;"></a>&#x516D;&#x3001;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x767E;&#x5206;&#x6BD4;&#x600E;&#x4E48;&#x529E;&#xFF1F;</h2><p>&#x5982;&#x679C;&#x4F60;&#x5B9E;&#x5728;&#x4E0D;&#x60F3;&#x90A3;&#x4E48;&#x8D39;&#x52B2;&#x7684;&#x53BB;&#x8BBE;&#x7F6E;&#x548C;&#x8BA1;&#x7B97;&#x767E;&#x5206;&#x6BD4;&#x548C;&#x76F8;&#x5BF9;&#x5927;&#x5C0F;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#xFF0C;&#x4E0D;&#x8FC7;&#x4F60;&#x8981;&#x641E;&#x6E05;&#x695A;&#x7F51;&#x9875;&#x8981;&#x5728;&#x54EA;&#x4E9B;&#x8BBE;&#x5907;&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x4EE5;&#x53CA;&#x5206;&#x8FA8;&#x7387;&#x8303;&#x56F4;&#xFF0C;&#x8BB0;&#x4F4F;&#x662F;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8BA9;&#x4F60;&#x53BB;&#x72AF;&#x201C;&#x7B2C;&#x4E94;&#x70B9;&#x201D;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#xFF1A;@media screen and &#xFF08;max-width:xx px&#xFF09;{}.&#x662F;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8FD9;&#x4E48;&#x505A;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4F60;&#x5B9A;&#x4E49;&#x7684;xx&#x5BBD;&#x5EA6;&#x4EE5;&#x5185;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7EDD;&#x5BF9;&#x5BBD;&#x5EA6;&#x548C;&#x5927;&#x5C0F;&#x4E86;&#xFF0C;&#x6211;&#x6CA1;&#x9A97;&#x4F60;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x76F4;&#x63A5;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;html&#x6587;&#x4EF6;&#x7684;&#x5934;&#x90E8;&#x52A0;&#x5165;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5F15;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6837;&#x5F0F;&#x8868;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6837;&#x5F0F;&#x8868;&#x91CC;&#x76F4;&#x63A5;&#x8FD9;&#x6837;&#x5199;&#xFF0C;&#x7136;&#x540E;&#x8986;&#x76D6;&#x6389;&#x4E4B;&#x524D;&#x5B9A;&#x4E49;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x4F46;&#x5B83;&#x5E26;&#x7ED9;&#x6211;&#x4EEC;&#x7684;&#x4E0D;&#x53EA;&#x662F;&#x597D;&#x5904;&#xFF0C;&#x8FD8;&#x6709;&#x4E0D;&#x4FBF;&#x5229;&#xFF0C;&#x56E0;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x8003;&#x8651;&#x7684;&#x8BBE;&#x5907;&#x4E0D;&#x591A;&#x8FD8;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x5F88;&#x591A;&#x6216;&#x8005;&#x4F60;&#x8FFD;&#x6C42;&#x8FBE;&#x5230;&#x67D0;&#x79CD;&#x7279;&#x6B8A;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x6BCF;&#x5C0F;10px&#xFF0C;&#x5B57;&#x4F53;&#x5927;&#x5C0F;&#x5C31;&#x53D8;&#xFF0C;&#x90A3;&#x4F60;&#x8981;&#x5199;&#x591A;&#x5C11;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x624D;&#x80FD;&#x6EE1;&#x8DB3;&#x5462;&#xFF1F;~</p>
<p>&#x6216;&#x8BB8;&#x6709;&#x4EBA;&#x6CA1;&#x770B;&#x5B8C;&#x5C31;&#x60F3;&#x5FCD;&#x4E0D;&#x4F4F;&#x5728;&#x5FC3;&#x91CC;&#x53D1;&#x51FA;&#x58F0;&#x97F3;&#xFF0C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x7528;jquery mobile&#x4E4B;&#x7C7B;&#x7684;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x554A;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x7528;&#x7BA1;&#x4E86;&#x591A;&#x597D;&#x3002;&#x597D;&#x5427;&#x6211;&#x627F;&#x8BA4;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6211;&#x5BF9;&#x5B83;&#x4E86;&#x89E3;&#x7684;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x53EA;&#x662F;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x9A8C;&#xFF0C;&#x5B83;&#x7684;&#x786E;&#x4E0D;&#x9700;&#x8981;&#x8BA9;&#x4F60;&#x8003;&#x8651;&#x5E03;&#x5C40;&#x65B9;&#x9762;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x53EF;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x8BA9;&#x4F60;&#x5F88;&#x96BE;&#x4E0B;&#x624B;&#x53BB;&#x5957;&#x7528;&#x5B83;&#x4F60;&#x53C8;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;~</p>
<p>&#x6700;&#x540E;&#x6211;&#x60F3;&#x8BF4;&#xFF0C;&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x53EA;&#x662F;&#x5F88;&#x5C11;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8FD8;&#x6709;&#x6D41;&#x5F0F;&#x5E03;&#x5C40;&#x3001;&#x6839;&#x636E;&#x5185;&#x5BB9;&#x91CD;&#x8981;&#x7A0B;&#x5EA6;&#x6539;&#x53D8;&#x987A;&#x5E8F;&#x7B49;&#x7B49;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x95EE;&#x9898;&#x8FD8;&#x5F88;&#x591A;&#xFF0C;&#x7B49;&#x4F60;&#x53BB;&#x4E0D;&#x65AD;&#x63A2;&#x7D22;&#x5427;&#xFF01;~</p>
</div><a data-url="http://yoursite.com/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" data-id="ciwusm1cy0017jlqioos7riql" class="article-share-link">分享到</a><div class="tags"><a href="/tags/移动端/">移动端</a></div><div class="post-nav"><a href="/2014/08/09/再谈移动页面之移动开发方面新的小收获/" class="pre">再谈移动页面之移动开发方面新的小收获</a><a href="/2014/07/04/inser工作一月/" class="next">inser工作一月</a></div><div data-thread-key="2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" data-title="初接触移动开发可能遇到的一部分问题（一无所知的可以看看）" data-url="http://yoursite.com/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" data-title="初接触移动开发可能遇到的一部分问题（一无所知的可以看看）" data-url="http://yoursite.com/2014/07/05/初接触移动开发可能遇到的一部分问题（一无所知的可以看看）/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/成长，经历，思考/" style="font-size: 15px;">成长，经历，思考</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/12/18/css_conf_2016/">第三届CSS中国开发者大会纪实</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/11/28/ui_developer/">明白了这些，你不仅仅能成长为优秀的UI工程师</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/09/21/javascript-study-six/">征服javascript学习笔记（六）——面向对象的程序设计之创建对象</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/17/tencent_oneyear/">总有一个地方，我们未曾到达——我的鹅厂周年记</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/15/readbook_seetheworld/">静静的打开一本书，你会看到新的世界</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>