<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="CSS," />





  <link rel="alternate" href="/atom.xml" title="灵感的小窝" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF1F;&amp;#x66FE;&amp;#x6709;&amp;#x4EBA;&amp;#x8C03;&amp;#x4F83;&amp;#xFF0C;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6A21;&amp;#x5F0F;&amp;#x662F;&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x7528;&amp;#x4E8E;&amp;#x8DDF;">
<meta property="og:type" content="article">
<meta property="og:title" content="没那么难，谈CSS的设计模式">
<meta property="og:url" content="http://yoursite.com/2016/08/07/css_design_method/index.html">
<meta property="og:site_name" content="灵感的小窝">
<meta property="og:description" content="&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF1F;&amp;#x66FE;&amp;#x6709;&amp;#x4EBA;&amp;#x8C03;&amp;#x4F83;&amp;#xFF0C;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6A21;&amp;#x5F0F;&amp;#x662F;&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x7528;&amp;#x4E8E;&amp;#x8DDF;">
<meta property="og:image" content="http://yoursite.com/2016/08/07/css_design_method/01">
<meta property="og:image" content="http://yoursite.com/2016/08/07/css_design_method/02">
<meta property="og:image" content="http://yoursite.com/2016/08/07/css_design_method/03">
<meta property="og:image" content="http://yoursite.com/2016/08/07/css_design_method/04">
<meta property="og:image" content="http://yoursite.com/2016/08/07/css_design_method/05">
<meta property="og:updated_time" content="2016-08-07T09:00:21.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="没那么难，谈CSS的设计模式">
<meta name="twitter:description" content="&amp;#x4EC0;&amp;#x4E48;&amp;#x662F;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6A21;&amp;#x5F0F;&amp;#xFF1F;&amp;#x66FE;&amp;#x6709;&amp;#x4EBA;&amp;#x8C03;&amp;#x4F83;&amp;#xFF0C;&amp;#x8BBE;&amp;#x8BA1;&amp;#x6A21;&amp;#x5F0F;&amp;#x662F;&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x7528;&amp;#x4E8E;&amp;#x8DDF;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 没那么难，谈CSS的设计模式 | 灵感的小窝 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感的小窝</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                没那么难，谈CSS的设计模式
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-08-07T00:00:00+08:00" content="2016-08-07">
              2016-08-07
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/CSS/" itemprop="url" rel="index">
                    <span itemprop="name">CSS</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <h2 id="&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;</h2><p>&#x66FE;&#x6709;&#x4EBA;&#x8C03;&#x4F83;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x5DE5;&#x7A0B;&#x5E08;&#x7528;&#x4E8E;&#x8DDF;&#x522B;&#x4EBA;&#x663E;&#x6446;&#x7684;&#xFF0C;&#x663E;&#x5F97;&#x9AD8;&#x5927;&#x4E0A;&#xFF1B;&#x4E5F;&#x66FE;&#x6709;&#x4EBA;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x4E0D;&#x662F;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6CA1;&#x7528;&#xFF0C;&#x662F;&#x4F60;&#x8FD8;&#x6CA1;&#x6709;&#x5230;&#x80FD;&#x61C2;&#x5B83;&#xFF0C;&#x4F1A;&#x7528;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x5148;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x6BD4;&#x8F83;&#x5B98;&#x65B9;&#x7684;&#x89E3;&#x91CA;&#xFF1A;&#x201D;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF08;Design pattern&#xFF09;&#x662F;&#x4E00;&#x5957;&#x88AB;&#x53CD;&#x590D;&#x4F7F;&#x7528;&#x3001;&#x591A;&#x6570;&#x4EBA;&#x77E5;&#x6653;&#x7684;&#x3001;&#x7ECF;&#x8FC7;&#x5206;&#x7C7B;&#x7684;&#x3001;&#x4EE3;&#x7801;&#x8BBE;&#x8BA1;&#x7ECF;&#x9A8C;&#x7684;&#x603B;&#x7ED3;&#x3002;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x4E3A;&#x4E86;&#x53EF;&#x91CD;&#x7528;&#x4EE3;&#x7801;&#x3001;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x5BB9;&#x6613;&#x88AB;&#x4ED6;&#x4EBA;&#x7406;&#x89E3;&#x3001;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x53EF;&#x9760;&#x6027;&#x3002; &#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E8E;&#x5DF1;&#x4E8E;&#x4ED6;&#x4EBA;&#x4E8E;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x591A;&#x8D62;&#x7684;&#xFF1B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4F7F;&#x4EE3;&#x7801;&#x7F16;&#x5236;&#x771F;&#x6B63;&#x5DE5;&#x7A0B;&#x5316;&#xFF1B;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x7684;&#x57FA;&#x77F3;&#x8109;&#x7EDC;&#xFF0C;&#x5982;&#x540C;&#x5927;&#x53A6;&#x7684;&#x7ED3;&#x6784;&#x4E00;&#x6837;&#x3002;&#x201D;</p>
<p>&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x6765;&#x804A;&#x804A;CSS&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BCD;&#x6C47;&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x4F1A;&#x6709;&#x51E0;&#x5957;&#xFF0C;&#x4F46;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#x7684;&#x4EBA;&#x4E0D;&#x591A;&#xFF0C;&#x539F;&#x56E0;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>1&#x3001;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5FC5;&#x8981;&#x6027;&#x53BB;&#x5F3A;&#x8C03;&#x5B83;&#xFF0C;&#x6709;&#x95EE;&#x9898;&#x4E86;&#x6539;&#x4E00;&#x4E0B;&#x6216;&#x8005;&#x6309;&#x56E2;&#x961F;&#x89C4;&#x8303;&#x6765;&#x5C31;&#x884C;&#xFF1B;<br>2&#x3001;&#x4E0D;&#x53BB;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x65E2;&#x6709;&#x7684;&#x6A21;&#x5F0F;&#x4E5F;&#x65E0;&#x4F24;&#x5927;&#x96C5;&#xFF1B;<br>3&#x3001;&#x4E0D;&#x5C11;&#x4EBA;&#x6240;&#x63A5;&#x89E6;&#x7684;&#x4E1A;&#x52A1;&#x91CF;&#x7EA7;&#x8FD8;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x9700;&#x8981;&#x89C4;&#x5212;&#x548C;&#x7EC4;&#x7EC7;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x5149;&#x5199;&#x5E03;&#x5C40;&#xFF0C;&#x5199;&#x7279;&#x6548;&#xFF0C;&#x7167;&#x987E;&#x517C;&#x5BB9;&#xFF0C;&#x5C31;&#x591F;&#x559D;&#x4E00;&#x58F6;&#x7684;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x53BB;&#x601D;&#x8003;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x8BBA;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x4E09;&#x8005;&#x90FD;&#x662F;&#x6211;&#x7ECF;&#x5386;&#x8FC7;&#x7684;&#xFF0C;&#x76F8;&#x4FE1;&#x4F60;&#x4E5F;&#x662F;~</p>
<p>&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x957F;&#x5927;&#xFF0C;&#x90FD;&#x4F1A;&#x6162;&#x6162;&#x7684;&#x505A;&#x66F4;&#x591A;&#x3001;&#x66F4;&#x5927;&#x3001;&#x66F4;&#x590D;&#x6742;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#xFF0C;&#x5168;&#x6D41;&#x7A0B;&#x7684;&#x53BB;&#x601D;&#x8003;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x540E;&#x53F0;&#x4E0D;&#x8BF4;&#xFF0C;&#x53EA;&#x8BB2;&#x524D;&#x7AEF;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x98CE;&#x683C;&#x7684;&#x5236;&#x5B9A;&#x3001;&#x8272;&#x8C03;&#x3001;&#x6A21;&#x5757;&#x3001;&#x5E03;&#x5C40;&#x65B9;&#x5F0F;&#x3001;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x3001;&#x903B;&#x8F91;&#x7B49;&#x7B49;&#xFF0C;&#x5982;&#x679C;&#x518D;&#x52A0;&#x4E0A;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#xFF0C;&#x82E5;&#x518D;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x89C4;&#x5212;&#x7684;&#x8BDD;&#xFF0C;&#x8981;&#x4E0D;&#x4E86;&#x591A;&#x4E45;&#xFF0C;&#x90A3;&#x4E9B;&#x770B;&#x8D77;&#x6765;&#x6CA1;&#x95EE;&#x9898;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x4F1A;&#x66B4;&#x9732;&#x51FA;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x6A21;&#x5757;&#x547D;&#x540D;&#x3001;&#x7C7B;&#x7684;&#x547D;&#x540D;&#x3001;&#x6587;&#x4EF6;&#x7684;&#x7EC4;&#x7EC7;&#x3001;&#x5171;&#x7528;&#x6A21;&#x5757;&#x7684;&#x63D0;&#x53D6;&#x3001;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x7528;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x3001;&#x6269;&#x5C55;&#x6027;&#x3001;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x53EA;&#x662F;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x5C0F;&#x52A8;&#x4F5C;&#xFF0C;&#x5374;&#x9700;&#x8981;&#x4F60;&#x770B;&#x5F97;&#x66F4;&#x8FDC;&#xFF0C;&#x907F;&#x514D;&#x5C06;&#x6765;&#x51FA;&#x95EE;&#x9898;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x66F4;&#x5927;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x751A;&#x81F3;&#x88AB;&#x8FEB;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x91CD;&#x6784;&#xFF0C;&#x53EF;&#x8C13;&#xFF0C;&#x529F;&#x5728;&#x5F53;&#x4EE3;&#xFF0C;&#x5229;&#x5728;&#x5343;&#x79CB;~</p>
<p>&#x65E2;&#x7136;&#x8981;&#x5BF9;CSS&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x90A3;&#x4E48;&#x80AF;&#x5B9A;&#x662F;&#x5B83;&#x672C;&#x8EAB;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x6216;&#x8005;&#x7F3A;&#x9677;&#xFF0C;&#x5176;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6700;&#x660E;&#x663E;&#x7684;&#x5C31;&#x662F;&#xFF0C;<strong>&#x5B83;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x89C4;&#x5219;&#xFF0C;&#x90FD;&#x662F;&#x5168;&#x5C40;&#x6027;&#x7684;&#x58F0;&#x660E;&#xFF0C;&#x4F1A;&#x5BF9;&#x5F15;&#x5165;&#x5B83;&#x7684;&#x9875;&#x9762;&#x5F53;&#x4E2D;&#x6240;&#x6709;&#x76F8;&#x5173;&#x5143;&#x7D20;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x4E0D;&#x7BA1;&#x90A3;&#x662F;&#x4E0D;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x3002;&#x800C;&#x72EC;&#x7ACB;&#x53CA;&#x53EF;&#x7EC4;&#x5408;&#x7684;&#x6A21;&#x5757;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x7EF4;&#x62A4;&#x7CFB;&#x7EDF;&#x7684;&#x5173;&#x952E;&#x6240;&#x5728;&#x3002;</strong>&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4ECE;&#x591A;&#x4E2A;&#x5C42;&#x9762;&#x6765;&#x63A2;&#x8BA8;&#x4E00;&#x4E0B;&#xFF0C;&#x5230;&#x5E95;&#x8BE5;&#x600E;&#x6837;&#x5199;CSS&#xFF0C;&#x624D;&#x662F;&#x66F4;&#x79D1;&#x5B66;&#x7684;&#x3002;</p>
<h2 id="&#x4ECE;&#x9700;&#x6C42;&#x51FA;&#x53D1;"><a href="#&#x4ECE;&#x9700;&#x6C42;&#x51FA;&#x53D1;" class="headerlink" title="&#x4ECE;&#x9700;&#x6C42;&#x51FA;&#x53D1;"></a>&#x4ECE;&#x9700;&#x6C42;&#x51FA;&#x53D1;</h2><p><strong>&#x5206;</strong><br>&#x6211;&#x4EEC;&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x5199;&#x5B57;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x53BB;&#x8003;&#x8651;&#xFF0C;&#x5199;&#x51FA;&#x6765;&#x7684;&#x67D0;&#x53E5;&#x8BDD;&#x597D;&#x4E0D;&#x597D;&#xFF0C;&#x6587;&#x7AE0;&#x7ED3;&#x6784;&#x5408;&#x9002;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x662F;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x7684;&#x3002;&#x5199;&#x4EE3;&#x7801;&#x4E5F;&#x4E00;&#x6837;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x53BB;&#x5B9A;&#x4E49;&#x89C4;&#x5219;&#xFF0C;&#x80FD;&#x7528;&#x5BF9;&#x4E86;&#x5C5E;&#x6027;&#xFF0C;&#x8BED;&#x6CD5;&#x6B63;&#x786E;&#xFF0C;&#x628A;&#x9875;&#x9762;&#x5B9E;&#x73B0;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x5C31;&#x597D;&#x3002;&#x6162;&#x6162;&#x5730;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x9875;&#x9762;&#x4E5F;&#x662F;&#x6709;&#x7ED3;&#x6784;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x6309;&#x7167;&#x9875;&#x9762;&#x7684;&#x7ED3;&#x6784;&#x53BB;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#xFF0C;&#x4F1A;&#x4E0D;&#x4F1A;&#x66F4;&#x597D;&#xFF1F;&#x6BD4;&#x5982;&#xFF0C;&#x5206;&#x6210;&#x5934;&#x90E8;&#x3001;&#x5BFC;&#x822A;&#x3001;&#x4FA7;&#x8FB9;&#x680F;&#x3001;banner&#x533A;&#x3001;&#x4E3B;&#x5185;&#x5BB9;&#x533A;&#x3001;&#x5E95;&#x90E8;&#x7B49;&#x3002;</p>
<p>&#x7136;&#x800C;&#x8FD9;&#x6837;&#x8C8C;&#x4F3C;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x590D;&#x7528;&#x5EA6;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#xFF0C;&#x53C8;&#x4E0D;&#x597D;&#x628A;&#x5B83;&#x5F52;&#x4E3A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x56FA;&#x6709;&#x6A21;&#x5757;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x9762;&#x5305;&#x5C51;&#x3001;&#x5206;&#x9875;&#x3001;&#x5F39;&#x7A97;&#x7B49;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x9002;&#x5408;&#x88AB;&#x653E;&#x5230;&#x67D0;&#x4E00;&#x4E2A;&#x56FA;&#x6709;&#x6A21;&#x5757;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x7684;&#x5206;&#x51FA;&#x4E00;&#x6BB5;&#x4E13;&#x5C5E;&#x7684;css&#x548C;js&#xFF0C;&#x6216;&#x8BB8;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x7EC4;&#x4EF6;&#x5316;&#x7684;&#x7531;&#x6765;~</p>
<p><strong>&#x62C6;</strong><br>&#x5728;&#x5206;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x5DF2;&#x7ECF;&#x6BD4;&#x4E4B;&#x524D;&#x597D;&#x5F88;&#x591A;&#x4E86;&#xFF0C;&#x7EC4;&#x7EC7;&#x6E05;&#x6670;&#xFF0C;&#x7EF4;&#x62A4;&#x6027;&#x5927;&#x5E45;&#x63D0;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x597D;&#x50CF;&#x8FD8;&#x662F;&#x4E0D;&#x591F;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x5F88;&#x7EC6;&#x5C0F;&#xFF0C;&#x4F46;&#x590D;&#x7528;&#x5EA6;&#x4E5F;&#x5F88;&#x9AD8;&#xFF0C;&#x5B83;&#x4EEC;&#x540C;&#x6837;&#x4E0D;&#x9002;&#x5408;&#x88AB;&#x653E;&#x5230;&#x6A21;&#x5757;&#x4E2D;&#x53BB;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x8FB9;&#x6846;&#x3001;&#x80CC;&#x666F;&#x3001;&#x56FE;&#x6807;&#x3001;&#x5B57;&#x4F53;&#x3001;&#x8FB9;&#x8DDD;&#x3001;&#x5E03;&#x5C40;&#x65B9;&#x5F0F;&#x7B49;&#x7B49;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5728;&#x6BCF;&#x4E2A;&#x9700;&#x8981;&#x5B83;&#x4EEC;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x90FD;&#x5B9A;&#x4E49;&#x4E00;&#x6B21;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x88AB;&#x91CD;&#x590D;&#x5F88;&#x591A;&#x6B21;&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x80CC;&#x79BB;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x4EE3;&#x7801;&#x5197;&#x4F59;&#x548C;&#x7EF4;&#x62A4;&#x56F0;&#x96BE;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x201C;&#x62C6;&#x201D;&#x3002;&#x62C6;&#x8FC7;&#x4E4B;&#x540E;&#x4F1A;&#x600E;&#x6837;&#xFF1F;&#x6211;&#x4EEC;&#x60F3;&#x5728;&#x54EA;&#x91CC;&#x7528;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x52A0;&#xFF0C;&#x9700;&#x8981;&#x6539;&#x7684;&#x65F6;&#x5019;&#x7EDF;&#x4E00;&#x6539;&#x3002;</p>
<p><strong>&#x6392;</strong><br>&#x7ECF;&#x8FC7;&#x4E86;&#x201C;&#x5206;&#x201D;&#x3001;&#x201C;&#x62C6;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x5DF2;&#x7ECF;&#x5341;&#x5206;&#x6E05;&#x6670;&#xFF0C;&#x5404;&#x4E2A;&#x5185;&#x5BB9;&#x6A21;&#x5757;&#xFF0C;&#x529F;&#x80FD;&#x6A21;&#x5757;&#xFF0C;UI&#x6A21;&#x5757;&#x90FD;&#x4E56;&#x5DE7;&#x7684;&#x7B49;&#x5F85;&#x53EC;&#x5524;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x5DEE;&#x4EC0;&#x4E48;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x8FD8;&#x5DEE;&#x6709;&#x5E8F;&#x7684;&#x7EC4;&#x7EC7;&#xFF0C;&#x5206;&#x7C7B;&#x6E05;&#x6670;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6392;&#x5217;&#x6709;&#x5E8F;&#xFF0C;&#x4ECE;&#x4E0D;&#x540C;&#x7EAC;&#x5EA6;&#x53BB;&#x8003;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x80FD;&#x7CBE;&#x76CA;&#x6C42;&#x7CBE;&#x3002;&#x4E3E;&#x4E2A;&#x6817;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p>@import &#x201C;mod_reset.css&#x201D;;<br>@import &#x201C;ico_sprite.css&#x201D;;<br>@import &#x201C;mod_btns.css&#x201D;;<br>@import &#x201C;header.css&#x201D;;<br>@import &#x201C;mod_tab.css&#x201D;;<br>@import &#x201C;footer.css&#x201D;;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x90E8;&#x5206;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#x53BB;&#x6446;&#x653E;&#xFF0C;&#x80FD;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x52A0;&#x6709;&#x5E8F;&#xFF0C;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x6709;&#x5229;&#x4E8E;&#x8FDB;&#x884C;&#x7EE7;&#x627F;&#x6216;&#x5C42;&#x53E0;&#x8986;&#x76D6;&#x3002;&#x4E0D;&#x8981;&#x5C0F;&#x770B;&#x8FD9;&#x4E00;&#x6B65;&#xFF0C;&#x770B;&#x4F3C;&#x53EF;&#x6709;&#x53EF;&#x65E0;&#xFF0C;&#x5B9E;&#x9645;&#x8981;&#x6C42;&#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x7EDF;&#x7B79;&#x89C4;&#x5212;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5197;&#x4F59;&#x4EE3;&#x7801;&#x548C;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x95EE;&#x9898;&#x4F4D;&#x7F6E;&#x7B49;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x533A;&#x5206;&#x4EE3;&#x7801;&#x8303;&#x56F4;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<p>1&#x3001;&#x5728;&#x6587;&#x4EF6;&#x5934;&#x90E8;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7B80;&#x8981;&#x7684;&#x76EE;&#x5F55;</p>
<p><img src="/2016/08/07/css_design_method/01" alt=""></p>
<p>2&#x3001;&#x4F7F;&#x7528;&#x533A;&#x5757;&#x6CE8;&#x91CA;</p>
<p><img src="/2016/08/07/css_design_method/02" alt=""></p>
<p>&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#xFF0C;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x8BE6;&#x7EC6;&#x7684;&#x5199;&#x6E05;&#x695A;&#x8BE5;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x72B6;&#x6001;&#x5207;&#x6362;&#xFF0C;&#x8C03;&#x6574;&#x539F;&#x56E0;&#xFF0C;&#x4EA4;&#x4E92;&#x903B;&#x8F91;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4EC5;&#x5229;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x7EF4;&#x62A4;&#xFF0C;&#x66F4;&#x52A0;&#x5229;&#x4E8E;&#x522B;&#x4EBA;&#x63A5;&#x624B;&#x7EF4;&#x62A4;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="&#x4ECE;&#x7ED3;&#x8BBA;&#x51FA;&#x53D1;"><a href="#&#x4ECE;&#x7ED3;&#x8BBA;&#x51FA;&#x53D1;" class="headerlink" title="&#x4ECE;&#x7ED3;&#x8BBA;&#x51FA;&#x53D1;"></a>&#x4ECE;&#x7ED3;&#x8BBA;&#x51FA;&#x53D1;</h2><p>&#x9664;&#x4E86;&#x9700;&#x6C42;&#x5F53;&#x4E2D;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x90E8;&#x5206;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x88AB;&#x6B63;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x4EEC;&#x6765;&#x6E90;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<p><strong>&#x5C42;&#x7EA7;&#x5D4C;&#x5957;&#x4E0D;&#x8981;&#x592A;&#x6DF1;</strong></p>
<p>&#x7A0D;&#x5FAE;&#x4E86;&#x89E3;&#x4E00;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x6E32;&#x67D3;&#x539F;&#x7406;&#x7684;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5B83;&#x5728;&#x89E3;&#x6790;CSS&#x89C4;&#x5219;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x662F;&#x4ECE;&#x53F3;&#x5411;&#x5DE6;&#xFF0C;&#x4E00;&#x5C42;&#x5C42;&#x7684;&#x53BB;&#x904D;&#x5386;&#x5BFB;&#x627E;&#xFF0C;&#x5982;&#x679C;&#x5C42;&#x7EA7;&#x592A;&#x591A;&#xFF0C;&#x5FC5;&#x7136;&#x589E;&#x52A0;&#x4E86;&#x6E32;&#x67D3;&#x65F6;&#x95F4;&#xFF0C;&#x5F71;&#x54CD;&#x6E32;&#x67D3;&#x901F;&#x5EA6;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x9009;&#x62E9;&#x5668;&#x5C42;&#x7EA7;&#x8FC7;&#x591A;&#xFF0C;&#x4E5F;&#x5C31;&#x95F4;&#x63A5;&#x53CD;&#x5E94;&#x4E86;&#xFF0C;&#x4F60;&#x7684;HTML&#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x5199;&#x5F97;&#x4E0D;&#x591F;&#x7B80;&#x6D01;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5177;&#x4F53;&#x591A;&#x5C11;&#x5C42;&#x5408;&#x9002;&#xFF1F;&#x4E00;&#x822C;&#x5EFA;&#x8BAE;&#x662F;&#x4E0D;&#x8D85;&#x8FC7;4&#x5C42;&#xFF0C;&#x4F46;&#x8BDD;&#x53C8;&#x8BF4;&#x56DE;&#x6765;&#xFF0C;&#x8D85;&#x8FC7;4&#x5C42;&#x4F1A;&#x600E;&#x6837;&#x5417;&#xFF1F;&#x4E0D;&#x4F1A;&#x6709;&#x591A;&#x660E;&#x663E;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x5199;&#x5230;&#x5F88;&#x6050;&#x6016;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x6216;&#x8005;&#x9879;&#x76EE;&#x6781;&#x5176;&#x5E9E;&#x6742;&#xFF0C;&#x53EF;&#x80FD;&#x80FD;&#x770B;&#x51FA;&#x6765;&#x5F71;&#x54CD;&#xFF0C;&#x5176;&#x5B9E;&#x4ECE;&#x6211;&#x4EEC;&#x65E5;&#x5E38;&#x9700;&#x6C42;&#x6765;&#x770B;&#xFF0C;4&#x5C42;&#x4EE5;&#x5185;&#x8DB3;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x95EE;&#x9898;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<p><strong>&#x907F;&#x514D;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;</strong></p>
<p>&#x51FA;&#x4E8E;&#x4E24;&#x70B9;&#x8003;&#x8651;&#xFF1A;</p>
<p><strong>&#x7B2C;&#x4E00;&#x70B9;</strong>&#xFF0C;&#x548C;&#x4E0A;&#x4E00;&#x6BB5;&#x63D0;&#x5230;&#x7684;&#x76F8;&#x5173;&#xFF0C;&#x5728;HTML&#x4E2D;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x5E38;&#x7528;&#x7684;&#x9AD8;&#x9891;&#x5143;&#x7D20;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;div&#x3001;p&#x3001;span&#x3001;a&#x3001;ul&#x7B49;&#xFF0C;&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x5728;&#x591A;&#x5C42;&#x9009;&#x62E9;&#x5668;&#x7684;&#x6700;&#x5185;&#x5C42;&#x4F7F;&#x7528;&#x4E86;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x5F00;&#x59CB;&#x5BFB;&#x627E;&#x65F6;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5C31;&#x4F1A;&#x904D;&#x5386;HTML&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BE5;&#x5143;&#x7D20;&#xFF0C;&#x663E;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E8C;&#x70B9;</strong>&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x548C;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x90FD;&#x662F;&#x5B58;&#x5728;&#x7740;&#x6F5C;&#x5728;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x4ECA;&#x5929;&#x5199;&#x597D;&#x4E86;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#xFF0C;&#x660E;&#x5929;&#x53EF;&#x80FD;&#x5C31;&#x8981;&#x518D;&#x52A0;&#x8FDB;&#x53BB;&#x4E00;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x518D;&#x52A0;&#x8FDB;&#x53BB;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x518D;&#x52A0;&#x8FDB;&#x53BB;&#x4E00;&#x4E2A;&#x56FE;&#x6807;&#x3002;&#x6211;&#x4EEC;&#x5199;&#x597D;&#x7684;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x968F;&#x65F6;&#x53EF;&#x80FD;&#x88AB;&#x590D;&#x7528;&#x5230;&#x522B;&#x7684;&#x7ED3;&#x6784;&#x4E2D;&#x53BB;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#xFF0C;&#x4F60;&#x4F7F;&#x7528;&#x4E86;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x53BB;&#x5B9A;&#x6B7B;&#x67D0;&#x4E2A;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x65B0;&#x52A0;&#x8FDB;&#x6765;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x662F;&#x88AB;&#x590D;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x52A0;&#x5230;&#x522B;&#x7684;&#x7ED3;&#x6784;&#x91CC;&#x53BB;&#xFF0C;&#x90FD;&#x6781;&#x6709;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x6837;&#x5F0F;&#x7684;&#x51B2;&#x7A81;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53C8;&#x4E0D;&#x5F97;&#x4E0D;&#x5199;&#x591A;&#x4F59;&#x7684;&#x6837;&#x5F0F;&#x8FDB;&#x884C;&#x8986;&#x76D6;&#x4FEE;&#x6B63;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x7C7B;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x51FA;&#x4E8E;&#x4EE5;&#x4E0A;&#x8003;&#x8651;&#xFF0C;&#x5728;&#x5177;&#x4F53;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x5757;&#x4E2D;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x4F7F;&#x7528;&#x5143;&#x7D20;&#x9009;&#x62E9;&#x5668;&#x7684;&#x524D;&#x63D0;&#x662F;&#xFF0C;&#x4F60;&#x5B8C;&#x5168;&#x7684;&#x786E;&#x5B9A;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x6211;&#x7528;&#x7684;&#x9650;&#x5B9A;&#x8303;&#x56F4;&#x662F;&#x201C;&#x5177;&#x4F53;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x5757;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x901A;&#x7528;&#x89C4;&#x5219;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;reset&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x522B;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x81EA;&#x884C;&#x8003;&#x91CF;&#x3002;</p>
<p><strong>&#x907F;&#x514D;&#x4F7F;&#x7528;&#x7FA4;&#x7EC4;&#x9009;&#x62E9;&#x5668;</strong></p>
<p>&#x7FA4;&#x7EC4;&#x9009;&#x62E9;&#x5668;&#x4F1A;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x76F4;&#x63A5;&#x4E0A;&#x56FE;&#x5427;&#x3002;</p>
<p><img src="/2016/08/07/css_design_method/03" alt=""></p>
<p>&#x56FE;&#x4E2D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x591A;&#x89C1;&#xFF0C;&#x6B64;&#x5904;&#x53EA;&#x662F;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x91CC;&#x5199;&#x4E86;&#x4E09;&#x7EC4;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#x5730;&#x65B9;&#x7684;&#x540C;&#x4E00;&#x79CD;&#x6837;&#x5F0F;&#xFF0C;&#x5176;&#x660E;&#x663E;&#x7684;&#x7F3A;&#x9677;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7B2C;&#x56DB;&#x4E2A;&#x5730;&#x65B9;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5230;&#xFF0C;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x518D;&#x5F80;&#x91CC;&#x52A0;&#x4E00;&#x7EC4;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5982;&#x679C;&#x6709;10&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F60;&#x5C31;&#x5199;10&#x4E2A;&#xFF1F;&#x8FD9;&#x5BF9;&#x4E8E;&#x7EF4;&#x62A4;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x5F88;&#x75DB;&#x82E6;&#x7684;&#xFF0C;&#x806A;&#x660E;&#x7684;&#x6211;&#x4EEC;&#xFF0C;&#x600E;&#x80FD;&#x88AB;&#x5982;&#x6B64;&#x7E41;&#x590D;&#x53C8;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x52B3;&#x52A8;&#x6240;&#x56F0;&#x6270;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x5899;&#x88C2;&#x4E0D;&#x63A8;&#x8350;&#x6B64;&#x79CD;&#x505A;&#x6CD5;&#xFF0C;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x516C;&#x7528;&#x7C7B;&#xFF0C;&#x5B9A;&#x4E49;&#x7EDF;&#x4E00;&#x6837;&#x5F0F;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x54EA;&#x91CC;&#x9700;&#x8981;&#x653E;&#x54EA;&#x91CC;&#xFF0C;&#x590D;&#x7528;&#x548C;&#x7EF4;&#x62A4;&#x90FD;&#x4F1A;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x6211;&#x5728;&#x5199;&#x7B2C;&#x4E00;&#x4E2A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x540E;&#x9762;&#x8FD8;&#x6709;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x63D0;&#x53D6;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x9700;&#x8981;&#x4F60;&#x6839;&#x636E;&#x7ECF;&#x9A8C;&#x53BB;&#x5224;&#x65AD;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x5728;&#x9879;&#x76EE;&#x63A8;&#x8FDB;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9002;&#x65F6;&#x7684;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x6574;&#x7406;&#x548C;&#x91CD;&#x6784;&#x3002;</p>
<p><strong>&#x6587;&#x4EF6;&#x5F15;&#x5165;&#x7684;&#x6570;&#x91CF;&#x548C;&#x987A;&#x5E8F;</strong></p>
<p>&#x5BF9;&#x4E8E;&#x521A;&#x63A5;&#x89E6;&#x7F51;&#x9875;&#x7684;&#x670B;&#x53CB;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E24;&#x70B9;&#x4E5F;&#x662F;&#x5BB9;&#x6613;&#x5FFD;&#x89C6;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x6CA1;&#x4EC0;&#x4E48;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x591A;&#x51E0;&#x6B21;&#x8BF7;&#x6C42;&#xFF0C;&#x6837;&#x5F0F;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x52A0;&#x8F7D;&#xFF0C;&#x90FD;&#x6CA1;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#x628A;&#x4EBA;&#x903C;&#x75AF;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x4E8E;&#x5BF9;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x6781;&#x81F4;&#x8FFD;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x6587;&#x4EF6;&#x8BF7;&#x6C42;&#x6B21;&#x6570;&#x5C3D;&#x91CF;&#x5C11;&#xFF0C;&#x5185;&#x5BB9;&#x7684;&#x663E;&#x793A;&#x6709;&#x4E2A;&#x4F18;&#x5148;&#x987A;&#x5E8F;&#xFF0C;&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x6709;&#x4E2A;&#x5148;&#x540E;&#x987A;&#x5E8F;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5728;&#x5B9E;&#x5728;&#x96BE;&#x4EE5;&#x7F29;&#x51CF;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x5148;&#x770B;&#x5230;&#x66F4;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x6B63;&#x5E38;&#x5C55;&#x793A;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x53EA;&#x662F;&#x51E0;&#x70B9;&#x4E3E;&#x4F8B;&#xFF0C;&#x66F4;&#x591A;&#x5B9E;&#x6218;&#x7ED3;&#x8BBA;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x591A;&#x8BFB;&#x76F8;&#x5173;&#x7684;&#x535A;&#x6587;&#x6216;&#x8005;&#x4E66;&#x7C4D;&#xFF0C;&#x90FD;&#x4F1A;&#x6709;&#x524D;&#x8F88;&#x4EEC;&#x7684;&#x7ECF;&#x9A8C;&#x4E4B;&#x8C08;&#x3002;</p>
<h2 id="&#x4ECE;&#x77DB;&#x76FE;&#x51FA;&#x53D1;"><a href="#&#x4ECE;&#x77DB;&#x76FE;&#x51FA;&#x53D1;" class="headerlink" title="&#x4ECE;&#x77DB;&#x76FE;&#x51FA;&#x53D1;"></a>&#x4ECE;&#x77DB;&#x76FE;&#x51FA;&#x53D1;</h2><p><strong>&#x901A;&#x7528;&#x548C;&#x8BED;&#x4E49;</strong></p>
<p>Naming convention is beneficial for immediately understanding which category a particular style belongs to and its role within the overall scope of the page. On large projects, it is more likely to have styles broken up across multiple files. In these cases, naming convention also makes it easier to find which file a style belongs to.</p>
<p>&#x547D;&#x540D;&#x89C4;&#x5219;&#x6709;&#x52A9;&#x4E8E;&#x7ACB;&#x5373;&#x7406;&#x89E3;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x6837;&#x5F0F;&#x5C5E;&#x4E8E;&#x54EA;&#x4E00;&#x7C7B;&#xFF0C;&#x5B83;&#x5728;&#x9875;&#x9762;&#x7684;&#x6574;&#x4F53;&#x8303;&#x56F4;&#x5185;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5728;&#x5927;&#x578B;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x5B83;&#x66F4;&#x53EF;&#x80FD;&#x6709;&#x5728;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#x88AB;&#x6253;&#x7834;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x547D;&#x540D;&#x7EA6;&#x5B9A;&#x4E5F;&#x53EF;&#x4EE5;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6837;&#x5F0F;&#x5C5E;&#x4E8E;&#x54EA;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E1C;&#x897F;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x4EE5;&#x4FBF;&#x590D;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x6A21;&#x5757;&#x6807;&#x9898;&#x3001;&#x6309;&#x94AE;&#x3001;&#x63D0;&#x793A;&#x6587;&#x5B57;&#x3001;&#x56FE;&#x6807;&#x7B49;&#xFF0C;&#x6700;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x4E60;&#x60EF;&#x53BB;&#x770B;&#x89C6;&#x89C9;&#x7A3F;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x662F;&#x201C;&#x65B0;&#x95FB;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5B9A;&#x4E49;&#x201C;new&#x201D;&#xFF0C;&#x662F;&#x201C;&#x5173;&#x4E8E;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5B9A;&#x4E49;&#x201C;about&#x201D;&#xFF0C;&#x662F;&#x7EA2;&#x8272;&#x7684;&#x6309;&#x94AE;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5B9A;&#x4E49;&#x201C;red-btn&#x201D;&#x7B49;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8DDF;&#x65B0;&#x95FB;&#x5217;&#x8868;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x6837;&#x5F0F;&#x548C;&#x7ED3;&#x6784;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x65B0;&#x95FB;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x201C;new&#x201D;&#x663E;&#x7136;&#x4E0D;&#x5408;&#x9002;&#xFF0C;&#x8FD9;&#x5C31;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x4E0D;&#x80FD;&#x628A;&#x76EE;&#x5149;&#x5C40;&#x9650;&#x4E8E;&#x5185;&#x5BB9;&#xFF0C;&#x9700;&#x8981;&#x5185;&#x5BB9;&#x548C;&#x7ED3;&#x6784;&#x5206;&#x79BB;&#x3002;</p>
<p>&#x4E0D;&#x80FD;&#x7528;&#x201C;new&#x201D;&#x4E86;&#xFF0C;&#x90A3;&#x7528;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;abc&#xFF1F;123&#xFF1F;&#x8FD9;&#x6837;&#x603B;&#x4E0D;&#x4F1A;&#x51B2;&#x7A81;&#x4E86;&#x5427;&#xFF0C;&#x4E07;&#x4E8B;&#x5927;&#x5409;~&#x5176;&#x5B9E;&#xFF0C;&#x8FD9;&#x662F;&#x8D70;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x6781;&#x7AEF;&#xFF0C;&#x8FD9;&#x6837;&#x867D;&#x7136;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x907F;&#x514D;&#x4E86;&#x548C;&#x522B;&#x7684;&#x6A21;&#x5757;&#x51B2;&#x7A81;&#xFF0C;&#x4F46;&#x5176;&#x672C;&#x8EAB;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x5C31;&#x88AB;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#xFF0C;&#x522B;&#x4EBA;&#xFF0C;&#x751A;&#x81F3;&#x4F60;&#x81EA;&#x5DF1;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x90FD;&#x4F1A;&#x5FD8;&#x8BB0;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x662F;&#x5F88;&#x4E0D;&#x5229;&#x7684;&#x3002;&#x81F3;&#x4E8E;&#x9700;&#x8981;&#x7528;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#xFF0C;&#x9700;&#x8981;&#x4F60;&#x6839;&#x636E;&#x9879;&#x76EE;&#x7684;&#x6574;&#x4F53;&#x6765;&#x8FDB;&#x884C;&#x89C4;&#x5212;&#xFF0C;&#x9002;&#x5408;&#x6839;&#x636E;&#x4EC0;&#x4E48;&#x7279;&#x70B9;&#x6765;&#x533A;&#x5206;&#x4E0E;&#x4E4B;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x53C8;&#x80FD;&#x8BA9;&#x4EBA;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x7684;&#x5728;&#x540D;&#x79F0;&#x548C;&#x7ED3;&#x6784;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x8054;&#x7CFB;&#xFF0C;&#x6BD4;&#x5982;&#x6240;&#x5C5E;&#x7C7B;&#x522B;&#x3001;&#x529F;&#x80FD;&#x3001;&#x9875;&#x9762;&#x7B49;&#x3002;</p>
<p><strong>&#x56E2;&#x961F;&#x548C;&#x4E2A;&#x4EBA;</strong></p>
<p>&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x5F53;&#x4E2D;&#xFF0C;&#x5927;&#x5BB6;&#x7684;&#x7ECF;&#x5386;&#x4E0D;&#x540C;&#xFF0C;&#x7F16;&#x7801;&#x6C34;&#x5E73;&#x548C;&#x4E60;&#x60EF;&#x4E5F;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x4E00;&#x4E2A;&#x5199;&#x6CD5;&#xFF0C;&#x4F60;&#x7528;&#x4E2D;&#x5212;&#x7EBF;&#xFF0C;&#x6211;&#x7528;&#x4E0B;&#x5212;&#x7EBF;&#xFF1B;&#x6211;&#x7528;&#x82F1;&#x6587;&#x5168;&#x62FC;&#xFF0C;&#x4F60;&#x7528;&#x7B80;&#x5199;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5BF9;&#x9519;&#x4E4B;&#x5206;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x6210;&#x5458;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x9020;&#x6210;&#x4E86;&#x4E0D;&#x5C0F;&#x7684;&#x969C;&#x788D;&#xFF0C;&#x522B;&#x4EBA;&#x5FC5;&#x987B;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x9002;&#x5E94;&#x548C;&#x8BFB;&#x61C2;&#x4F60;&#x662F;&#x600E;&#x6837;&#x7EC4;&#x7EC7;&#x548C;&#x5B9A;&#x4E49;&#x7684;&#xFF0C;&#x8FD9;&#x5C31;&#x65E0;&#x5F62;&#x4E4B;&#x4E2D;&#x63D0;&#x9AD8;&#x4E86;&#x6210;&#x672C;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x201C;&#x56E2;&#x961F;&#x89C4;&#x8303;&#x201D;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#xFF0C;&#x89C4;&#x8303;&#x9664;&#x4E86;&#x4E00;&#x4E9B;&#x5199;&#x6CD5;&#x4E0A;&#x7684;&#x89C4;&#x5B9A;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x7EDF;&#x4E00;&#xFF0C;&#x6E05;&#x6670;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x66F4;&#x5F3A;&#xFF0C;&#x8FA8;&#x8BC6;&#x5EA6;&#x66F4;&#x9AD8;&#x3002;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x4E00;&#x4E9B;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x548C;&#x590D;&#x7528;&#x6A21;&#x5757;&#x7B49;&#xFF0C;&#x5BF9;&#x4E8E;&#x56E2;&#x961F;&#x91CC;&#x6BCF;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x90FD;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x96BE;&#x7684;&#xFF0C;&#x83AB;&#x8FC7;&#x4E8E;&#x8C03;&#x6574;&#x65E2;&#x6709;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x8FD9;&#x5C31;&#x4F1A;&#x6709;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E4B;&#x540E;&#x201C;&#x8F6C;&#x578B;&#x201D;&#x7684;&#x9635;&#x75DB;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x79CD;&#x75DB;&#x4E5F;&#x662F;&#x6210;&#x957F;&#x7684;&#x75DB;&#xFF0C;&#x4F60;&#x4F1A;&#x5B66;&#x4E60;&#x5230;&#x66F4;&#x597D;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x6CD5;&#xFF0C;&#x4F1A;&#x4ECE;&#x9879;&#x76EE;&#x6216;&#x8005;&#x56E2;&#x961F;&#x7684;&#x6574;&#x4F53;&#x53BB;&#x8003;&#x91CF;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x610F;&#x4E49;&#x3002;</p>
<p><strong>CSS&#x548C;&#x9884;&#x5904;&#x7406;&#x5668;</strong></p>
<p>&#x524D;&#x9762;&#x6211;&#x6709;&#x6587;&#x7AE0;&#x8BE6;&#x7EC6;&#x7684;&#x8C08;&#x8FC7;CSS&#x9884;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x5BF9;&#x5B83;&#x4E5F;&#x662F;&#x6392;&#x65A5;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B66;&#x4E60;&#x6210;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x89C9;&#x5F97;&#x5E94;&#x7528;&#x8D77;&#x6765;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x53EF;&#x662F;&#x4E00;&#x65E6;&#x4F60;&#x51B3;&#x5B9A;&#x53BB;&#x5B66;&#x4E60;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5C31;&#x4F1A;&#x89C9;&#x5F97;&#x4E0D;&#x662F;&#x90A3;&#x6837;&#xFF0C;&#x9884;&#x5904;&#x7406;&#x5668;&#x5728;&#x5411;&#x4F60;&#x4ECB;&#x7ECD;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x6709;&#x7279;&#x610F;&#x5F3A;&#x8C03;&#x8FC7;&#xFF0C;&#x5B83;&#x7684;&#x8BED;&#x6CD5;&#x662F;&#x548C;CSS&#x5B8C;&#x5168;&#x517C;&#x5BB9;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F60;&#x5728;LESS&#x6216;&#x8005;SASS&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x76F4;&#x63A5;&#x5199;CSS&#x4EE3;&#x7801;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x80FD;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x5F88;&#x591A;&#x4FBF;&#x5229;&#xFF0C;&#x6BD4;&#x5982;&#x5B9A;&#x4E49;&#x7EDF;&#x4E00;&#x7684;&#x53D8;&#x91CF;&#xFF1B;&#x4F7F;&#x7528;&#x5D4C;&#x5957;&#x800C;&#x4E0D;&#x7528;&#x4E00;&#x76F4;&#x91CD;&#x590D;&#x7740;&#x5199;&#x4E00;&#x4E9B;&#x9009;&#x62E9;&#x5668;&#xFF1B;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x516C;&#x5171;&#x7684;&#x4EE3;&#x7801;&#x5757;&#x7136;&#x540E;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x590D;&#x7528;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x6545;&#x800C;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x628A;CSS&#x7EC4;&#x7EC7;&#x548C;&#x4E66;&#x5199;&#x5F97;&#x5F88;&#x597D;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x9884;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5C31;&#x662F;&#x518D;&#x6B21;&#x4E3A;&#x6211;&#x4EEC;&#x63D2;&#x4E0A;&#x4E00;&#x53CC;&#x7FC5;&#x8180;&#xFF0C;&#x80FD;&#x66F4;&#x7075;&#x6D3B;&#x548C;&#x9AD8;&#x6548;&#x7684;&#x7F16;&#x7801;&#x3002;</p>
<h2 id="&#x4ECE;&#x73B0;&#x6709;&#x6A21;&#x5F0F;&#x51FA;&#x53D1;"><a href="#&#x4ECE;&#x73B0;&#x6709;&#x6A21;&#x5F0F;&#x51FA;&#x53D1;" class="headerlink" title="&#x4ECE;&#x73B0;&#x6709;&#x6A21;&#x5F0F;&#x51FA;&#x53D1;"></a>&#x4ECE;&#x73B0;&#x6709;&#x6A21;&#x5F0F;&#x51FA;&#x53D1;</h2><p>&#x518D;&#x6765;&#x7B80;&#x5355;&#x770B;&#x770B;&#x4E00;&#x4E9B;&#x5E7F;&#x4E3A;&#x6D41;&#x4F20;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#xFF08;ps&#xFF1A;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x4E0E;&#x6392;&#x540D;&#x3001;&#x597D;&#x574F;&#x65E0;&#x5173;&#xFF09;</p>
<p><strong>&#x4E00;&#x3001;OOCSS&#x2014;&#x2014;Object Oriented CSS</strong><br>&#x63A5;&#x89E6;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5E94;&#x8BE5;&#x90FD;&#x77E5;&#x9053;&#xFF0C;OOP&#x2014;&#x2014;Object Oriented Programming&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x63A5;&#x89E6;OOCSS&#xFF0C;&#x4F60;&#x4F1A;&#x5F88;&#x56F0;&#x60D1;&#xFF0C;&#x96BE;&#x9053;&#x662F;&#x201C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;CSS&#x201D;&#x5417;&#xFF1F;&#x5B83;&#x4E0D;&#x662F;&#x4E00;&#x672C;&#x771F;&#x6B63;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x554A;&#xFF0C;&#x5982;&#x4F55;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF1F;</p>
<p>OOCSS&#xFF0C;&#x6700;&#x65E9;&#x88AB;&#x63D0;&#x53CA;&#xFF0C;&#x662F;&#x5728;2009&#x5E74;&#xFF0C;&#x5B83;&#x7684;&#x4E24;&#x5927;&#x539F;&#x5219;&#x662F;&#xFF1A;</p>
<p>separating structure from skin and container from content.</p>
<p>&#x76F4;&#x8BD1;&#x8FC7;&#x6765;&#x5C31;&#x662F;&#xFF0C;&#x7ED3;&#x6784;&#x548C;&#x76AE;&#x80A4;&#x5206;&#x79BB;&#xFF0C;&#x5BB9;&#x5668;&#x548C;&#x5185;&#x5BB9;&#x5206;&#x79BB;&#x3002;</p>
<p>&#x5373;&#x4E0D;&#x8981;&#x628A;&#x7ED3;&#x6784;&#x548C;&#x76AE;&#x80A4;&#x4EE5;&#x53CA;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x5F3A;&#x8026;&#x5408;&#xFF0C;&#x800C;&#x662F;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#xFF0C;&#x6240;&#x8981;&#x8FBE;&#x5230;&#x7684;&#x76EE;&#x6807;&#x662F;&#x66F4;&#x6613;&#x590D;&#x7528;&#x548C;&#x7EC4;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#xFF0C;&#x9009;&#x62E9;&#x5F15;&#x7528;&#x7B49;&#x3002;</p>
<p>&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x94FE;&#x63A5;&#xFF1A;<a href="https://www.smashingmagazine.com/2011/12/an-introduction-to-object-oriented-css-oocss/" target="_blank" rel="external">https://www.smashingmagazine.com/2011/12/an-introduction-to-object-oriented-css-oocss/</a></p>
<p><strong>&#x4E8C;&#x3001;SMACSS&#x2014;&#x2014;Scalable and Modular Architecture for CSS</strong></p>
<p>&#x4ECE;&#x5B9E;&#x8DF5;&#x4E0A;&#x8BF4;&#xFF0C;OOCSS&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x503C;&#x5F97;&#x501F;&#x9274;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x4F46;&#x5728;&#x4EE3;&#x7801;&#x7684;&#x7EC4;&#x7EC7;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x5E76;&#x672A;&#x7ED9;&#x51FA;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x65BD;&#x65B9;&#x6CD5;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;SMACSS&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x3002;</p>
<p>&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x662F;&#xFF1A;</p>
<p>1&#x3001;Base&#xFF08;&#x57FA;&#x7840;&#xFF09;<br>&#x57FA;&#x7840;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x6700;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#xFF0C;&#x9488;&#x5BF9;&#x4E8E;&#x67D0;&#x4E00;&#x7C7B;&#x5143;&#x7D20;&#x7684;&#x901A;&#x7528;&#x56FA;&#x5B9A;&#x6837;&#x5F0F;&#x3002;</p>
<p>2&#x3001;Layout&#xFF08;&#x5E03;&#x5C40;&#xFF09;<br>&#x5E03;&#x5C40;&#x6837;&#x5F0F;&#xFF0C;&#x662F;&#x8DDF;&#x9875;&#x9762;&#x6574;&#x4F53;&#x7ED3;&#x6784;&#x76F8;&#x5173;&#xFF0C;&#x8B6C;&#x5982;&#xFF0C;&#x5217;&#x8868;&#xFF0C;&#x4E3B;&#x5185;&#x5BB9;&#xFF0C;&#x4FA7;&#x8FB9;&#x680F;&#x7684;&#x4F4D;&#x7F6E;&#x3001;&#x5BBD;&#x9AD8;&#x3001;&#x5E03;&#x5C40;&#x65B9;&#x5F0F;&#x7B49;&#x3002;</p>
<p>3&#x3001;Module&#xFF08;&#x6A21;&#x5757;&#xFF09;<br>&#x6A21;&#x5757;&#x6837;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x5BF9;&#x9875;&#x9762;&#x8FDB;&#x884C;&#x62C6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6240;&#x62BD;&#x53D6;&#x5206;&#x7C7B;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x7C7B;&#x7684;&#x6837;&#x5F0F;&#x5206;&#x522B;&#x5199;&#x5230;&#x4E00;&#x8D77;&#x3002;</p>
<p>4&#x3001;State&#xFF08;&#x72B6;&#x6001;&#xFF09;<br>&#x9875;&#x9762;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x5143;&#x7D20;&#x4F1A;&#x9700;&#x8981;&#x54CD;&#x5E94;&#x4E0D;&#x540C;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x53EF;&#x7528;&#x3001;&#x4E0D;&#x53EF;&#x7528;&#x3001;&#x5DF2;&#x7528;&#x3001;&#x8FC7;&#x671F;&#x3001;&#x8B66;&#x544A;&#x7B49;&#x7B49;&#x3002;&#x5C06;&#x8FD9;&#x7C7B;&#x6837;&#x5F0F;&#x53EF;&#x4EE5;&#x7EC4;&#x7EC7;&#x5230;&#x4E00;&#x8D77;&#x3002;</p>
<p>5&#x3001;Theme&#xFF08;&#x4E3B;&#x9898;&#xFF09;<br>&#x4E3B;&#x9898;&#x662F;&#x6307;&#x7248;&#x9762;&#x6574;&#x4E2A;&#x7684;&#x989C;&#x8272;&#x3001;&#x98CE;&#x683C;&#x4E4B;&#x7C7B;&#xFF0C;&#x4E00;&#x822C;&#x7F51;&#x7AD9;&#x4E0D;&#x4F1A;&#x6709;&#x9891;&#x7E41;&#x7684;&#x8F83;&#x5927;&#x7684;&#x6539;&#x52A8;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x5370;&#x8C61;&#x6BD4;&#x8F83;&#x6DF1;&#x7684;&#x662F;QQ&#x7A7A;&#x95F4;&#xFF0C;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7684;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x7528;&#x5230;&#xFF0C;&#x4F46;&#x6709;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x610F;&#x8BC6;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x6837;&#x89C4;&#x5212;&#x3002;</p>
<p>&#x6709;&#x4E86;&#x4EE5;&#x4E0A;5&#x70B9;&#x5206;&#x7C7B;&#x7B56;&#x7565;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x7EC4;&#x7EC7;&#x8D77;&#x6765;&#xFF0C;&#x601D;&#x8DEF;&#x5C31;&#x4F1A;&#x5F88;&#x6E05;&#x6670;&#xFF0C;&#x4F1A;&#x5B89;&#x6392;&#x7684;&#x5F88;&#x6709;&#x5E8F;&#xFF0C;&#x53E6;&#x5916;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x547D;&#x540D;&#x96BE;&#x548C;&#x6DF7;&#x4E71;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x6709;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E3B;&#x56E0;&#x4FBF;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x4EE5;&#x600E;&#x6837;&#x7684;&#x6807;&#x51C6;&#x53BB;&#x5B9A;&#x4E49;&#x5143;&#x7D20;&#x7684;&#x6240;&#x5C5E;&#x548C;&#x7279;&#x70B9;&#xFF0C;&#x6709;&#x4E86;&#x5206;&#x7C7B;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5F88;&#x968F;&#x610F;&#x548C;&#x6DF7;&#x4E71;&#x7684;&#x53BB;&#x547D;&#x540D;&#xFF0C;&#x6709;&#x4E86;&#x4F9D;&#x636E;&#xFF0C;&#x5C31;&#x80FD;&#x66F4;&#x8F7B;&#x677E;&#xFF0C;&#x4E5F;&#x4E0D;&#x6613;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x94FE;&#x63A5;&#xFF1A;<a href="https://smacss.com/" target="_blank" rel="external">https://smacss.com/</a></p>
<p><strong>&#x4E09;&#x3001;Meta CSS</strong></p>
<p>&#x539F;&#x5B50;&#x7C7B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x65E0;&#x8BED;&#x4E49;&#x201D;&#x7C7B;&#xFF0C;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/08/07/css_design_method/04" alt=""></p>
<p>&#x5B83;&#x7684;&#x7279;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x6837;&#x5F0F;&#x548C;&#x7ED3;&#x6784;&#x3001;&#x5185;&#x5BB9;&#x65E0;&#x5173;&#xFF0C;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x597D;&#x8FD9;&#x4E48;&#x4E00;&#x7EC4;&#x89C4;&#x5219;&#xFF0C;&#x5728;&#x9700;&#x8981;&#x7684;&#x5730;&#x65B9;&#x52A0;&#x4E0A;&#x5373;&#x53EF;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x6BCF;&#x4E2A;&#x4EBA;&#x7B2C;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x4F1A;&#x60F3;&#xFF1A;&#x8FD8;&#x80FD;&#x8FD9;&#x6837;&#x5199;&#x554A;&#xFF1F;&#xFF01;&#x662F;&#x7684;&#xFF0C;&#x603B;&#x6709;&#x4E00;&#x4E9B;&#x4EBA;&#xFF0C;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x601D;&#x60F3;&#x548C;&#x65B9;&#x6CD5;&#x4F1A;&#x6D8C;&#x73B0;&#x51FA;&#x6765;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x79F0;&#x8D5E;&#x5176;&#x672C;&#x8EAB;&#x6709;&#x591A;&#x4E48;&#x597D;&#xFF0C;&#x800C;&#x662F;&#x8BF4;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x548C;&#x8FC7;&#x7A0B;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x7ECF;&#x5E38;&#x88AB;&#x4EBA;&#x5410;&#x69FD;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x201C;&#x8FD9;&#x6837;&#x5199;&#x548C;&#x76F4;&#x63A5;&#x5185;&#x8054;&#x6709;&#x533A;&#x522B;&#x5417;&#xFF1F;&#x201D;&#x3001;&#x201C;&#x5982;&#x679C;&#x8981;&#x8C03;&#x6574;&#x6837;&#x5F0F;&#xFF0C;&#x5C31;&#x8981;&#x53BB;&#x6539;HTML&#xFF0C;&#x7EF4;&#x62A4;&#x66F4;&#x52A0;&#x9EBB;&#x70E6;&#xFF0C;&#x4E5F;&#x6709;&#x8FDD;&#x6837;&#x5F0F;&#x548C;&#x7ED3;&#x6784;&#x5206;&#x79BB;&#x7684;&#x521D;&#x8877;&#x201D;&#x7B49;&#x7B49;&#xFF0C;&#x5176;&#x5B9E;&#x6211;&#x4E2A;&#x4EBA;&#x4E5F;&#x662F;&#x4E0D;&#x8D5E;&#x6210;&#x4E0A;&#x9762;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x8981;&#x628A;&#x8FD9;&#x4E9B;&#x62BD;&#x79BB;&#x51FA;&#x6765;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x62BD;&#x4E0D;&#x51FA;&#x6765;&#x7684;&#x5462;&#xFF1F;&#x800C;&#x4E14;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#xFF0C;&#x9875;&#x9762;&#x4E4B;&#x95F4;&#xFF0C;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x901A;&#x7528;&#x6027;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x62BD;&#x51FA;&#x6765;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x7A0D;&#x5FAE;&#x61D2;&#x7701;&#x52B2;&#x513F;&#x4E9B;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x7167;&#x987E;&#x5230;&#x66F4;&#x591A;&#x60C5;&#x51B5;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5199;&#x5165;&#x5197;&#x4F59;&#x4EE3;&#x7801;&#xFF0C;&#x662F;&#x5F97;&#x4E0D;&#x507F;&#x5931;&#x7684;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5B83;&#x6709;&#x7F3A;&#x70B9;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x8D5E;&#x6210;&#x53E6;&#x5916;&#x7684;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x5206;&#x51FA;&#x6765;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x6D6E;&#x52A8;&#xFF08;float&#xFF09;&#x3001;&#x6587;&#x672C;&#x5E03;&#x5C40;&#xFF08;text-align&#xFF09;&#x3001;Flexbox&#x5E03;&#x5C40;&#x7B49;&#xFF0C;<strong>&#x8FD9;&#x4E9B;&#x662F;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x53EF;&#x80FD;&#x6027;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7528;&#x9891;&#x7E41;&#xFF0C;&#x590D;&#x7528;&#x65B9;&#x4FBF;&#xFF0C;&#x6539;&#x52A8;&#x8F83;&#x5C11;&#xFF0C;</strong>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x516C;&#x5171;&#x7684;&#x5C0F;&#x9897;&#x7C92;&#x7C7B;&#xFF0C;&#x6BD4;&#x5982;&#x6309;&#x94AE;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x6587;&#x5B57;&#x989C;&#x8272;&#x7684;&#x79CD;&#x7C7B;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;<strong>&#x548C;CSS&#x672C;&#x8EAB;&#x65E0;&#x5173;&#xFF0C;&#x548C;&#x9879;&#x76EE;&#x76F8;&#x5173;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x501F;&#x9274;&#x5176;&#x601D;&#x60F3;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x62FF;&#x6765;&#x7528;</strong>&#x3002;</p>
<p><strong>&#x56DB;&#x3001;BEM</strong></p>
<p>&#x4E25;&#x683C;&#x8BF4;&#x6765;&#xFF0C;BEM&#x4E0D;&#x662F;&#x4E00;&#x5957;&#x6709;&#x9AA8;&#x6709;&#x8089;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4F60;&#x5728;CSS&#x7684;&#x5C42;&#x9762;&#x53BB;&#x89C4;&#x5212;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x600E;&#x6837;&#x53BB;&#x7EC4;&#x7EC7;&#x3001;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x5B83;&#xFF0C;&#x5BF9;&#x524D;&#x7AEF;&#x754C;&#x7684;&#x5F71;&#x54CD;&#x5374;&#x662F;&#x5DE8;&#x5927;&#x7684;&#x3002;</p>
<p>&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>Block&#xFF08;&#x5757;&#xFF09;&#x3001;Element&#xFF08;&#x5143;&#x7D20;&#xFF09;&#x3001;Modifier&#xFF08;&#x4FEE;&#x9970;&#x7B26;&#xFF09;</p>
<p>&#x5B83;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x9875;&#x9762;&#x4E2D;&#x6BCF;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x7EA7;&#x522B;&#x5C5E;&#x6027;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x62C6;&#x201D;&#x3002;&#x547D;&#x540D;&#x89C4;&#x5219;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/08/07/css_design_method/05" alt=""></p>
<p>&#x5B83;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x66FE;&#x7ED9;&#x4E0D;&#x5C11;&#x4EBA;&#x5E26;&#x6765;&#x542F;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6709;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#x4ECD;&#x7136;&#x62B1;&#x7740;&#x6311;&#x5254;&#x7684;&#x6001;&#x5EA6;&#xFF0C;&#x8B6C;&#x5982;&#xFF1A;</p>
<p>1&#x3001;&#x98CE;&#x683C;&#x4E0D;&#x7EDF;&#x4E00;&#xFF0C;&#x663E;&#x5F97;&#x4EE3;&#x7801;&#x4E0D;&#x591F;&#x6574;&#x6D01;&#x7F8E;&#x89C2;<br>2&#x3001;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7C7B;&#x540D;&#x8FC7;&#x957F;</p>
<p>&#x8FD8;&#x662F;&#x524D;&#x9762;&#x8BF4;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E0D;&#x53BB;&#x76F4;&#x63A5;&#x7528;&#x5B83;&#xFF0C;&#x4F46;&#x8981;&#x6E05;&#x695A;&#x5B83;&#x7684;&#x4F18;&#x70B9;&#xFF1A;<strong>&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x4EC5;&#x901A;&#x8FC7;&#x7C7B;&#x540D;&#x5C31;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x4EE3;&#x7801;&#x662F;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5185;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x6A21;&#x5757;&#x4E2D;&#x6240;&#x8D77;&#x7684;&#x4F5C;&#x7528;&#x3002;</strong>&#x7136;&#x540E;&#x501F;&#x9274;&#x4E4B;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;BEM&#x96C6;&#x805A;&#x4E86;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x5FC3;&#x8840;&#xFF0C;&#x4E5F;&#x5F97;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x8D5E;&#x8A89;&#xFF0C;&#x5176;&#x4E2D;&#x5C31;&#x5305;&#x62EC;OOCSS&#x7684;&#x4F5C;&#x8005;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B83;&#x80AF;&#x5B9A;&#x4E0D;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;&#x5B83;&#x8FD8;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x600E;&#x6837;&#x914D;&#x5408;&#x7740;js&#x6765;&#x5199;&#xFF0C;&#x4F60;&#x7684;&#x6587;&#x4EF6;&#x600E;&#x6837;&#x7EC4;&#x7EC7;&#x66F4;&#x597D;&#xFF0C;&#x9879;&#x76EE;&#x8BE5;&#x600E;&#x4E48;&#x6784;&#x5EFA;&#x7B49;&#x3002;&#x8BE6;&#x7EC6;&#x53EF;&#x4EE5;&#x5230;&#x5B98;&#x7F51;&#x53BB;&#x67E5;&#x9605;&#x3002;&#x5730;&#x5740;&#xFF1A;<a href="https://en.bem.info/" target="_blank" rel="external">https://en.bem.info/</a></p>
<h2 id="&#x4ECE;&#x5B9E;&#x9645;&#x51FA;&#x53D1;&#xFF0C;&#x51B3;&#x5B9A;&#x7ED3;&#x679C;&#x7684;&#x4EBA;&#x662F;&#x4F60;"><a href="#&#x4ECE;&#x5B9E;&#x9645;&#x51FA;&#x53D1;&#xFF0C;&#x51B3;&#x5B9A;&#x7ED3;&#x679C;&#x7684;&#x4EBA;&#x662F;&#x4F60;" class="headerlink" title="&#x4ECE;&#x5B9E;&#x9645;&#x51FA;&#x53D1;&#xFF0C;&#x51B3;&#x5B9A;&#x7ED3;&#x679C;&#x7684;&#x4EBA;&#x662F;&#x4F60;"></a>&#x4ECE;&#x5B9E;&#x9645;&#x51FA;&#x53D1;&#xFF0C;&#x51B3;&#x5B9A;&#x7ED3;&#x679C;&#x7684;&#x4EBA;&#x662F;&#x4F60;</h2><p>&#x5230;&#x5E95;&#x600E;&#x6837;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1F;</p>
<p>&#x867D;&#x7136;&#x5DF2;&#x7ECF;&#x6709;&#x6210;&#x719F;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x5F53;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x89C9;&#x5F97;&#x54EA;&#x4E2A;&#x8DDF;&#x81EA;&#x5DF1;&#x7684;&#x9879;&#x76EE;&#x90FD;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x543B;&#x5408;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x8981;&#x53BB;&#x4E3A;&#x4E86;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x800C;&#x8C03;&#x6574;&#xFF0C;&#x6210;&#x672C;&#x5F88;&#x9AD8;&#x3002;&#x5176;&#x5B9E;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x8FCE;&#x5408;&#x6A21;&#x5F0F;&#xFF0C;&#x8981;&#x8BA9;&#x6A21;&#x5F0F;&#x4E3A;&#x6211;&#x6240;&#x7528;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x80CC;&#x540E;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x501F;&#x9274;&#x4E4B;&#xFF0C;&#x7528;&#x5B83;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#x6211;&#x4EEC;&#x7684;&#x95EE;&#x9898;</strong>&#xFF0C;&#x5C31;&#x597D;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x4F5C;&#x96BE;&#x8981;&#x4E0D;&#x8981;&#x7528;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x7EA0;&#x7ED3;&#x9009;&#x54EA;&#x4E2A;&#xFF0C;&#x4E0D;&#x662F;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x54EA;&#x4E2A;&#x597D;&#xFF0C;&#x54EA;&#x4E2A;&#x4E0D;&#x597D;&#xFF0C;&#x603B;&#x6709;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x7528;&#x5F97;&#x4E0A;&#x5B83;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6D77;&#x7EB3;&#x767E;&#x5DDD;&#xFF0C;&#x96C6;&#x767E;&#x5BB6;&#x4F17;&#x957F;&#x3002;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#x6240;&#x575A;&#x6301;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x89C2;&#x70B9;&#x5C31;&#x662F;&#xFF0C;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x4E09;&#x9A7E;&#x9A6C;&#x8F66;&#x2014;&#x2014;html&#x3001;css&#x3001;js&#xFF0C;&#x4E0D;&#x8981;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x5B64;&#x7ACB;&#x7684;&#x53BB;&#x8C08;&#x90A3;&#x6837;&#x597D;&#x6216;&#x8005;&#x8FD9;&#x6837;&#x597D;&#xFF0C;&#x6211;&#x4EEC;&#x6781;&#x5C11;&#x4F1A;&#x6709;&#x53EA;&#x7528;&#x4E00;&#x6B21;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x8005;&#x6A21;&#x5757;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x53EA;&#x5199;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#xFF0C;&#x4E09;&#x9A7E;&#x9A6C;&#x8F66;&#x90FD;&#x662F;&#x5728;&#x4E00;&#x8D77;&#x534F;&#x4F5C;&#x7684;&#xFF0C;&#x90FD;&#x662F;&#x4F1A;&#x6709;&#x590D;&#x7528;&#x3001;&#x6269;&#x5C55;&#x548C;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x591A;&#x65B9;&#x9762;&#x7684;&#x56E0;&#x7D20;&#x5728;&#x91CC;&#x9762;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x4E0D;&#x80FD;&#x62B1;&#x7740;&#x8FD9;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#xFF1A;<strong>&#x6211;&#x73B0;&#x5728;&#x5C31;&#x5728;&#x505A;&#x8FD9;&#x4E2A;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x6CA1;&#x95EE;&#x9898;&#x3002;&#x5176;&#x5B9E;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x6F5C;&#x5728;&#x7684;&#xFF0C;&#x8981;&#x5E26;&#x7740;&#x53D1;&#x5C55;&#x773C;&#x5149;&#x53BB;&#x770B;&#x5F85;&#x3002;</strong>&#x9879;&#x76EE;&#x7684;&#x6587;&#x4EF6;&#x4E4B;&#x95F4;&#xFF0C;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#xFF0C;&#x56E2;&#x961F;&#x6210;&#x5458;&#x4E4B;&#x95F4;&#xFF0C;&#x4E0D;&#x8BBA;&#x4F60;&#x7684;&#x5206;&#x5DE5;&#x662F;&#x54EA;&#x5757;&#xFF0C;&#x90FD;&#x8981;&#x8003;&#x8651;&#x5230;&#x524D;&#x540E;&#x7684;&#x5F71;&#x54CD;&#x548C;&#x53EF;&#x80FD;&#x7ED9;&#x5408;&#x4F5C;&#x5E26;&#x6765;&#x7684;&#x4E0D;&#x4FBF;&#x3002;</p>
<p>&#x600E;&#x6837;&#x624D;&#x662F;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF1F;&#x6709;&#x201C;&#x5B9E;&#x8DF5;&#x201D;&#xFF0C;&#x624D;&#x6709;&#x201C;&#x6700;&#x4F73;&#x201D;&#xFF0C;&#x8131;&#x79BB;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x8C08;&#x6700;&#x4F73;&#xFF0C;&#x5C31;&#x662F;&#x7A7A;&#x4E2D;&#x697C;&#x9601;&#x3002;&#x90A3;&#x4E48;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x662F;&#x54EA;&#x4E2A;&#x7ECF;&#x5178;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x4E2D;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x78E8;&#x5408;&#x8C03;&#x6574;&#x800C;&#x51FA;&#x7684;&#x3002;&#x6545;&#x800C;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x518D;&#x60E7;&#x6015;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x660E;&#x89C9;&#x5389;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x56E0;&#x4E3A;&#x81EA;&#x5DF1;&#x8FD8;&#x4E0D;&#x61C2;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x800C;&#x90C1;&#x95F7;&#xFF0C;&#x5B83;&#x5C31;&#x662F;&#x4EBA;&#x4EEC;&#x603B;&#x7ED3;&#x51FA;&#x6765;&#x7684;&#x5B9E;&#x6218;&#x65B9;&#x6CD5;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x6A21;&#x5F0F;~</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/CSS/" rel="tag">#CSS</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/06/27/less_sass/" rel="next" title="抛开语法，深度剖析CSS预处理器">
                <i class="fa fa-chevron-left"></i> 抛开语法，深度剖析CSS预处理器
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/08/15/readbook_seetheworld/" rel="prev" title="静静的打开一本书，你会看到新的世界">
                静静的打开一本书，你会看到新的世界 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#什么是设计模式？"><span class="nav-number">1.</span> <span class="nav-text">什么是设计模式？</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#从需求出发"><span class="nav-number">2.</span> <span class="nav-text">从需求出发</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#从结论出发"><span class="nav-number">3.</span> <span class="nav-text">从结论出发</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#从矛盾出发"><span class="nav-number">4.</span> <span class="nav-text">从矛盾出发</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#从现有模式出发"><span class="nav-number">5.</span> <span class="nav-text">从现有模式出发</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#从实际出发，决定结果的人是你"><span class="nav-number">6.</span> <span class="nav-text">从实际出发，决定结果的人是你</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
