<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="成长，经历，思考," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x4ECA;&amp;#x5929;&amp;#xFF0C;&amp;#x662F;&amp;#x6211;&amp;#x5165;&amp;#x804C;&amp;#x817E;&amp;#x8BAF;&amp;#x4E00;&amp;#x5468;&amp;#x5E74;&amp;#x7684;&amp;#x65E5;&amp;#x5B50;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x771F;&amp;#x6B63;&amp;#x610F;&amp;#x4E49;&amp;#x4E0A;&amp;#x7B2C;&amp;#x4E00;">
<meta property="og:type" content="article">
<meta property="og:title" content="总有一个地方，我们未曾到达——我的鹅厂周年记">
<meta property="og:url" content="http://yoursite.com/2016/08/17/tencent_oneyear/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#xFF0C;&amp;#x662F;&amp;#x6211;&amp;#x5165;&amp;#x804C;&amp;#x817E;&amp;#x8BAF;&amp;#x4E00;&amp;#x5468;&amp;#x5E74;&amp;#x7684;&amp;#x65E5;&amp;#x5B50;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x771F;&amp;#x6B63;&amp;#x610F;&amp;#x4E49;&amp;#x4E0A;&amp;#x7B2C;&amp;#x4E00;">
<meta property="og:updated_time" content="2016-08-16T15:51:30.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="总有一个地方，我们未曾到达——我的鹅厂周年记">
<meta name="twitter:description" content="&amp;#x4ECA;&amp;#x5929;&amp;#xFF0C;&amp;#x662F;&amp;#x6211;&amp;#x5165;&amp;#x804C;&amp;#x817E;&amp;#x8BAF;&amp;#x4E00;&amp;#x5468;&amp;#x5E74;&amp;#x7684;&amp;#x65E5;&amp;#x5B50;&amp;#xFF0C;&amp;#x4E5F;&amp;#x662F;&amp;#x771F;&amp;#x6B63;&amp;#x610F;&amp;#x4E49;&amp;#x4E0A;&amp;#x7B2C;&amp;#x4E00;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 总有一个地方，我们未曾到达——我的鹅厂周年记 | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                总有一个地方，我们未曾到达——我的鹅厂周年记
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-08-17T00:00:00+08:00" content="2016-08-17">
              2016-08-17
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4ECA;&#x5929;&#xFF0C;&#x662F;&#x6211;&#x5165;&#x804C;&#x817E;&#x8BAF;&#x4E00;&#x5468;&#x5E74;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x4E5F;&#x662F;&#x771F;&#x6B63;&#x610F;&#x4E49;&#x4E0A;&#x7B2C;&#x4E00;&#x6B21;&#x5728;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x5F85;&#x6EE1;&#x4E00;&#x5E74;&#x3002;&#x867D;&#x7136;&#x5728;&#x8FD9;&#x91CC;&#x5DF2;&#x7ECF;&#x5F85;&#x4E86;&#x4E00;&#x5E74;&#xFF0C;&#x4F46;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x665A;&#x4E0A;&#x79BB;&#x5F00;&#x8FD9;&#x91CC;&#xFF0C;&#x90FD;&#x4F1A;&#x518D;&#x770B;&#x770B;&#x8FD9;&#x5EA7;&#x5927;&#x697C;&#xFF0C;&#x597D;&#x50CF;&#x662F;&#x7B2C;&#x4E00;&#x5929;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x4FDD;&#x7559;&#x7740;&#x5BF9;&#x5B83;&#x7684;&#x65B0;&#x9C9C;&#x611F;&#x548C;&#x656C;&#x754F;&#x611F;&#x3002;&#x8FD9;&#x4E00;&#x5E74;&#xFF0C;&#x8868;&#x9762;&#x4E0A;&#x770B;&#x6765;&#x6CE2;&#x6F9C;&#x4E0D;&#x60CA;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x6709;&#x7740;&#x5F88;&#x591A;&#x7684;&#x7ECF;&#x5386;&#x548C;&#x611F;&#x609F;&#xFF0C;&#x8C28;&#x4EE5;&#x6B64;&#x6587;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x8FD9;&#x4E00;&#x5E74;&#x6765;&#x7684;&#x5FC3;&#x8DEF;&#x5386;&#x7A0B;&#x3002;</p>
<h2 id="&#x5927;&#x516C;&#x53F8;&#x5149;&#x73AF;&#xFF0C;&#x90A3;&#x4E48;&#x8FDC;&#x53C8;&#x8FD9;&#x4E48;&#x8FD1;"><a href="#&#x5927;&#x516C;&#x53F8;&#x5149;&#x73AF;&#xFF0C;&#x90A3;&#x4E48;&#x8FDC;&#x53C8;&#x8FD9;&#x4E48;&#x8FD1;" class="headerlink" title="&#x5927;&#x516C;&#x53F8;&#x5149;&#x73AF;&#xFF0C;&#x90A3;&#x4E48;&#x8FDC;&#x53C8;&#x8FD9;&#x4E48;&#x8FD1;"></a>&#x5927;&#x516C;&#x53F8;&#x5149;&#x73AF;&#xFF0C;&#x90A3;&#x4E48;&#x8FDC;&#x53C8;&#x8FD9;&#x4E48;&#x8FD1;</h2><p>&#x6211;&#x76F8;&#x4FE1;&#xFF0C;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4ECE;&#x521A;&#x5165;&#x884C;&#x5F00;&#x59CB;&#xFF0C;&#x8111;&#x6D77;&#x91CC;&#x5C31;&#x6709;&#x51E0;&#x4E2A;&#x95EA;&#x95EA;&#x53D1;&#x5149;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x5FAE;&#x8F6F;&#x3001;&#x8C37;&#x6B4C;&#x3001;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x3001;&#x767E;&#x5EA6;&#x3001;&#x817E;&#x8BAF;&#x7B49;&#x7B49;&#xFF0C;&#x90FD;&#x662F;&#x56FD;&#x5185;&#x5916;&#x7684;IT&#x884C;&#x4E1A;&#x5DE8;&#x5934;&#xFF0C;&#x90FD;&#x4F1A;&#x61A7;&#x61AC;&#x7740;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x80FD;&#x53BB;&#x770B;&#x770B;&#x8BE5;&#x591A;&#x597D;&#xFF0C;&#x66F4;&#x4E0D;&#x7528;&#x63D0;&#x5982;&#x679C;&#x80FD;&#x53BB;&#x90A3;&#x91CC;&#x5DE5;&#x4F5C;&#xFF0C;&#x80AF;&#x5B9A;&#x4F1A;&#x5E78;&#x798F;&#x6B7B;&#x5427;&#xFF1F;~</p>
<p>&#x6211;&#x4E5F;&#x662F;&#xFF0C;&#x6BD5;&#x4E1A;&#x4E4B;&#x540E;&#xFF0C;&#x6765;&#x6DF1;&#x5733;&#xFF0C;&#x4E0E;&#x5176;&#x8BF4;&#x6211;&#x662F;&#x591A;&#x65B9;&#x9762;&#x8003;&#x91CF;&#x548C;&#x5BF9;&#x6BD4;&#x624D;&#x7B03;&#x5B9A;&#x7684;&#x9009;&#x62E9;&#x6DF1;&#x5733;&#xFF0C;&#x4E0D;&#x5982;&#x8BF4;&#xFF0C;&#x662F;&#x51A5;&#x51A5;&#x4E4B;&#x4E2D;&#x6709;&#x4E00;&#x80A1;&#x529B;&#x91CF;&#x628A;&#x6211;&#x63A8;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6765;&#x8FFD;&#x68A6;&#x3002;&#x662F;&#x7684;&#xFF0C;&#x6DF1;&#x5733;&#x662F;&#x4E2A;&#x5F88;&#x9002;&#x5408;&#x8FFD;&#x68A6;&#x7684;&#x57CE;&#x5E02;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x521A;&#x6765;&#x6DF1;&#x5733;&#x7684;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x5207;&#x662F;&#x90A3;&#x4E48;&#x8FDC;&#xFF0C;&#x6211;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x521A;&#x8E0F;&#x5165;&#x793E;&#x4F1A;&#x7684;&#x83DC;&#x9E1F;&#x800C;&#x5DF2;&#xFF0C;&#x793E;&#x4F1A;&#x7ECF;&#x9A8C;&#xFF0C;&#x5DE5;&#x4F5C;&#x7ECF;&#x9A8C;&#xFF0C;&#x90FD;&#x51E0;&#x4E4E;&#x4E3A;&#x96F6;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x5148;&#x751F;&#x5B58;&#xFF0C;&#x5148;&#x5728;&#x8FD9;&#x4E2A;&#x57CE;&#x5E02;&#x7ACB;&#x8DB3;&#xFF0C;&#x522B;&#x7684;&#x4EE5;&#x540E;&#x518D;&#x8C08;&#x5427;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E2A;&#x95E8;&#x69DB;&#x8F83;&#x4F4E;&#xFF0C;&#x613F;&#x610F;&#x6536;&#x7559;&#x6211;&#x7684;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;&#x6211;&#x7684;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x4E4B;&#x8DEF;&#x3002;</p>
<p>&#x8D77;&#x70B9;&#x5F88;&#x4F4E;&#xFF0C;&#x4F46;&#x6211;&#x4ECE;&#x6CA1;&#x653E;&#x5F03;&#x8FC7;&#x5F80;&#x4E0A;&#x722C;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5149;&#x6709;&#x60F3;&#x6CD5;&#x662F;&#x4E0D;&#x884C;&#x7684;&#xFF0C;&#x8981;&#x5B66;&#x4E60;&#xFF0C;&#x8981;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#xFF0C;&#x8981;&#x6709;&#x673A;&#x4F1A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x867D;&#x7136;&#x6765;&#x5230;&#x4E86;&#x6DF1;&#x5733;&#x8FD9;&#x5EA7;&#x57CE;&#x5E02;&#xFF0C;&#x6211;&#x4E5F;&#x6CA1;&#x6709;&#x5230;&#x592A;&#x591A;&#x5730;&#x65B9;&#x53BB;&#x73A9;&#x513F;&#xFF0C;&#x6CA1;&#x6709;&#x53BB;&#x66F4;&#x591A;&#x7684;&#x4F53;&#x9A8C;&#x5927;&#x57CE;&#x5E02;&#x7684;&#x7E41;&#x534E;&#xFF0C;&#x538B;&#x529B;&#x662F;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x4EBA;&#x51FA;&#x53BB;&#x73A9;&#x513F;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0A;&#x4E0B;&#x73ED;&#xFF0C;&#x770B;&#x4E66;&#xFF0C;&#x4E0A;&#x7F51;&#x67E5;&#x8D44;&#x6599;&#x6572;&#x4EE3;&#x7801;&#x2026;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x8FC7;&#x53BB;&#x4E86;&#x4E00;&#x5E74;&#x591A;&#xFF0C;&#x6BCF;&#x6B21;&#x5750;&#x8F66;&#x9014;&#x5F84;&#x817E;&#x8BAF;&#x5927;&#x53A6;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x5FCD;&#x4E0D;&#x4F4F;&#x591A;&#x770B;&#x51E0;&#x773C;&#xFF0C;&#x7136;&#x540E;&#xFF0C;<strong>&#x5FC3;&#x91CC;&#x60F3;&#x7740;&#xFF1A;&#x6211;&#x73B0;&#x5728;&#x7684;&#x80FD;&#x529B;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x600E;&#x6837;&#x7684;&#x6C34;&#x5E73;&#x4E0A;&#xFF0C;&#x591F;&#x4E86;&#x5417;&#xFF1F;&#x5E94;&#x8BE5;&#x4E0D;&#x591F;&#x5427;&#xFF0C;&#x90A3;&#x91CC;&#x7684;&#x4EBA;&#x80AF;&#x5B9A;&#x90FD;&#x5F88;&#x5389;&#x5BB3;&#xFF0C;&#x6211;&#x518D;&#x591A;&#x6DF7;&#x4E2A;&#x4E24;&#x4E09;&#x5E74;&#x518D;&#x53BB;&#x5C1D;&#x8BD5;&#x5427;&#x3002;</strong></p>
<p>&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5E78;&#x8FD0;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x52AA;&#x529B;&#x7EC8;&#x5F97;&#x56DE;&#x62A5;&#xFF0C;&#x5076;&#x7136;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5F97;&#x77E5;&#x817E;&#x8BAF;&#x7406;&#x8D22;&#x901A;&#x5728;&#x62DB;&#x4EBA;&#xFF0C;&#x51B3;&#x5B9A;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x4E4B;&#x6240;&#x4EE5;&#x9F13;&#x8D77;&#x52C7;&#x6C14;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x628A;&#x63E1;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x5E95;&#x6C14;&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x8FD8;&#x662F;&#x6709;&#x5DEE;&#x8DDD;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;<strong>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x53BB;&#x5C1D;&#x8BD5;&#xFF0C;&#x5C31;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x7684;&#x5DEE;&#x8DDD;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x4E0B;&#x4E00;&#x9636;&#x6BB5;&#x518D;&#x53BB;&#x52AA;&#x529B;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x548C;&#x76EE;&#x6807;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x662F;&#x5C1D;&#x8BD5;&#xFF0C;&#x5C3D;&#x529B;&#x800C;&#x4E3A;&#xFF0C;&#x6210;&#x8D25;&#x987A;&#x5176;&#x81EA;&#x7136;&#x3002;</strong>&#x8BA4;&#x771F;&#x7684;&#x505A;&#x673A;&#x8BD5;&#x9898;&#xFF0C;&#x4E3A;&#x81EA;&#x5DF1;&#x8D62;&#x5F97;&#x4E86;&#x9762;&#x8BD5;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4E00;&#x8F6E;&#x3001;&#x4E24;&#x8F6E;&#x2026;&#x4E0D;&#x6C42;&#x6210;&#x529F;&#xFF0C;&#x53EA;&#x6C42;&#x5C3D;&#x53EF;&#x80FD;&#x8868;&#x73B0;&#x51FA;&#x81EA;&#x5DF1;&#x6700;&#x597D;&#x7684;&#x4E00;&#x9762;&#x3002;</p>
<p>&#x6700;&#x7EC8;&#xFF0C;&#x6211;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x4ECE;&#x53EA;&#x6C42;&#x7AD9;&#x5728;&#x697C;&#x4E0B;&#x770B;&#x770B;&#x5C31;&#x597D;&#xFF0C;&#x5230;&#x5373;&#x5C06;&#x53EF;&#x4EE5;&#x8D70;&#x8FDB;&#x8FD9;&#x5EA7;&#x5927;&#x697C;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x6FC0;&#x52A8;&#xFF0C;&#x6709;&#x671F;&#x5F85;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#xFF0C;&#x662F;&#x51C6;&#x5907;&#x8FCE;&#x63A5;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<h2 id="&#x878D;&#x5165;&#x3001;&#x9002;&#x5E94;"><a href="#&#x878D;&#x5165;&#x3001;&#x9002;&#x5E94;" class="headerlink" title="&#x878D;&#x5165;&#x3001;&#x9002;&#x5E94;"></a>&#x878D;&#x5165;&#x3001;&#x9002;&#x5E94;</h2><p>&#x5230;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x516C;&#x53F8;&#x548C;&#x56E2;&#x961F;&#xFF0C;&#x90FD;&#x6709;&#x4E00;&#x5957;&#x56FA;&#x5B9A;&#x7A0B;&#x5E8F;&#xFF0C;&#x529E;&#x9F50;&#x5404;&#x79CD;&#x8BC1;&#x4EF6;&#xFF0C;&#x4E86;&#x89E3;&#x73AF;&#x5883;&#xFF0C;&#x51C6;&#x5907;&#x529E;&#x516C;&#x7684;&#x8F6F;&#x786C;&#x4EF6;&#xFF0C;&#x719F;&#x6089;&#x65B0;&#x540C;&#x4E8B;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x548C;&#x5230;&#x5927;&#x5B66;&#x6216;&#x8005;&#x4EFB;&#x4F55;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x6CA1;&#x591A;&#x5927;&#x533A;&#x522B;&#xFF0C;&#x878D;&#x5165;&#x548C;&#x9002;&#x5E94;&#x4E00;&#x4E2A;&#x96C6;&#x4F53;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x65B0;&#x7684;&#x5F81;&#x7A0B;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x6BB5;&#x770B;&#x54EA;&#x513F;&#x54EA;&#x513F;&#x90FD;&#x597D;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x4E5F;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#xFF0C;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x8FDB;&#x884C;&#x4E86;&#x89E3;&#x7684;&#x6700;&#x4F73;&#x65F6;&#x6BB5;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x4F1A;&#x5728;&#x4E50;&#x95EE;&#x4E0A;&#x770B;&#x5230;&#x5C0F;&#x9C9C;&#x8089;&#x5728;&#x5410;&#x69FD;&#x548C;&#x503E;&#x8BC9;&#x81EA;&#x5DF1;&#x7684;&#x201C;&#x65B0;&#x4EBA;&#x70E6;&#x607C;&#x201D;&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4E0D;&#x61C2;&#x7684;&#x592A;&#x591A;&#xFF0C;&#x611F;&#x89C9;&#x5F88;&#x56F0;&#x96BE;&#xFF0C;&#x538B;&#x529B;&#x5F88;&#x5927;&#xFF0C;<strong>&#x5176;&#x5B9E;&#x65B0;&#x4EBA;&#x521A;&#x6765;&#x7684;&#x878D;&#x5165;&#x9636;&#x6BB5;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x8BA4;&#x8BC6;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x7136;&#x540E;&#x53BB;&#x5B66;&#x4E60;&#x3001;&#x53BB;&#x6539;&#x8FDB;&#x7684;&#x597D;&#x65F6;&#x673A;&#xFF0C;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x522B;&#x4EBA;&#x90FD;&#x4F1A;&#x5F88;&#x4E50;&#x610F;&#x5F88;&#x70ED;&#x60C5;&#x7684;&#x53BB;&#x6559;&#x4F60;&#xFF0C;&#x53BB;&#x5E26;&#x4F60;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x7528;&#x6015;&#xFF0C;&#x4E0D;&#x7528;&#x6025;&#xFF0C;&#x8981;&#x597D;&#x597D;&#x5229;&#x7528;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x3002;</strong></p>
<h2 id="&#x4E3B;&#x52A8;&#x3001;&#x4E3B;&#x89C2;"><a href="#&#x4E3B;&#x52A8;&#x3001;&#x4E3B;&#x89C2;" class="headerlink" title="&#x4E3B;&#x52A8;&#x3001;&#x4E3B;&#x89C2;"></a>&#x4E3B;&#x52A8;&#x3001;&#x4E3B;&#x89C2;</h2><p>&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x4F1A;&#x5F88;&#x61A7;&#x61AC;&#xFF0C;&#x5230;&#x4E00;&#x4E2A;&#x597D;&#x516C;&#x53F8;&#xFF0C;&#x4E00;&#x4E2A;&#x597D;&#x56E2;&#x961F;&#xFF0C;&#x8DDF;&#x4E00;&#x4E9B;&#x725B;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x80FD;&#x6709;&#x5F88;&#x591A;&#x5B66;&#x4E60;&#x673A;&#x4F1A;&#xFF0C;&#x4E5F;&#x4F1A;&#x6162;&#x6162;&#x53D8;&#x5F97;&#x5F88;&#x725B;&#x5427;&#xFF1F;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5047;&#x60F3;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x591A;&#x5E74;&#x524D;&#xFF0C;&#x4F60;&#x61A7;&#x61AC;&#x7740;&#xFF0C;&#x81EA;&#x5DF1;&#x5982;&#x679C;&#x6709;&#x4E00;&#x5929;&#x8003;&#x4E0A;&#x4E86;&#x5927;&#x5B66;&#xFF0C;&#x4F1A;&#x600E;&#x6837;&#x600E;&#x6837;&#xFF1F;&#x540E;&#x6765;&#x5462;&#xFF1F;&#x8DDF;&#x60F3;&#x8C61;&#x6709;&#x5F88;&#x5927;&#x5DEE;&#x522B;&#xFF0C;&#x5BF9;&#x591A;&#x6570;&#x4EBA;&#x6765;&#x8BF4;&#x662F;&#x5DEE;&#x8DDD;&#x3002;&#x73B0;&#x5B9E;&#x4F1A;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#xFF0C;&#x60F3;&#x5F52;&#x60F3;&#xFF0C;&#x843D;&#x5230;&#x5B9E;&#x9645;&#x7684;&#x751F;&#x6D3B;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x6765;&#x4E0D;&#x5F97;&#x534A;&#x70B9;&#x865A;&#x7684;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x4F60;&#x53BB;&#x505A;&#xFF0C;&#x4E3B;&#x89C2;&#x4E0A;&#x6709;&#x601D;&#x8003;&#xFF0C;&#x6709;&#x89C4;&#x5212;&#xFF0C;&#x4E3B;&#x52A8;&#x51FA;&#x51FB;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x817E;&#x8BAF;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x4E1A;&#x754C;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x725B;&#x4EBA;&#x4E0D;&#x5047;&#xFF0C;&#x6709;&#x5404;&#x79CD;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x7684;&#x5E73;&#x53F0;&#x548C;&#x6280;&#x672F;&#x5206;&#x4EAB;&#x4E5F;&#x4E0D;&#x5047;&#xFF0C;&#x4F46;&#x662F;<strong>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x53BB;&#x4E3B;&#x52A8;&#x53C2;&#x4E0E;&#xFF0C;&#x4E0D;&#x53BB;&#x4E3B;&#x52A8;&#x8BF7;&#x6559;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x90A3;&#x4E9B;&#x4E1C;&#x897F;&#x518D;&#x597D;&#xFF0C;&#x4E5F;&#x88C5;&#x4E0D;&#x5230;&#x4F60;&#x7684;&#x8111;&#x5B50;&#x91CC;</strong>&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x4EC5;&#x8981;&#x53BB;&#x542C;&#x90A3;&#x4E9B;&#x5206;&#x4EAB;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5B9E;&#x8DF5;&#xFF0C;&#x522B;&#x4EBA;&#x8BB2;&#x7684;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x5B9E;&#x8DF5;&#x548C;&#x601D;&#x8003;&#x4E4B;&#x540E;&#x6D53;&#x7F29;&#x63D0;&#x53D6;&#x800C;&#x6210;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F60;&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;&#x5B9E;&#x8DF5;&#xFF0C;&#x53EF;&#x80FD;&#x53EA;&#x4F1A;&#x5438;&#x6536;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x751A;&#x81F3;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x4E5F;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x53D8;&#x5F97;&#x6A21;&#x7CCA;&#x3002;</p>
<p>&#x518D;&#x6765;&#x8BF4;&#x8BF4;&#x5B9E;&#x8DF5;&#xFF0C;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x65B0;&#x542C;&#x8BF4;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x53EF;&#x662F;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x7528;&#x7684;&#x5462;&#xFF1F;&#x6211;&#x5DE5;&#x4F5C;&#x4E2D;&#x7528;&#x4E0D;&#x5230;&#x554A;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x88AB;&#x7565;&#x8FC7;&#xFF0C;&#x4EBA;&#x90FD;&#x662F;&#x6709;&#x60F0;&#x6027;&#x7684;&#xFF0C;&#x7528;&#x4E0D;&#x5230;&#x6211;&#x5B66;&#x5B83;&#x5E72;&#x561B;&#xFF1F;&#x8FD9;&#x5C31;&#x8981;&#x8C08;&#x5230;&#x4E0B;&#x9762;&#x7684;&#x8BDD;&#x9898;&#x3002;</p>
<p><strong>&#x9700;&#x6C42;&#x9A71;&#x52A8;&#x4E0E;&#x4E2A;&#x4EBA;&#x9A71;&#x52A8;</strong><br>&#x5F88;&#x591A;&#x65B0;&#x4EBA;&#x4F1A;&#x95EE;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x5B66;&#x4E86;&#x201C;&#x67D0;&#x67D0;&#x67D0;&#x201D;&#xFF0C;&#x73B0;&#x5728;&#x6211;&#x9700;&#x8981;&#x600E;&#x6837;&#x505A;&#x53BB;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x5462;&#xFF1F;&#x8001;&#x9E1F;&#x4EEC;&#x4F1A;&#x8BF4;&#xFF0C;&#x505A;demo&#xFF0C;&#x505A;&#x9879;&#x76EE;&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x8BF4;&#x7684;&#x201C;&#x9700;&#x6C42;&#x201D;&#x4FBF;&#x662F;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x201C;&#x8F7B;&#x677E;&#x201D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x903C;&#x7740;&#x81EA;&#x5DF1;&#x505A;&#xFF0C;&#x522B;&#x4EBA;&#x4E5F;&#x4F1A;&#x903C;&#x7740;&#x4F60;&#x505A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x8981;&#x4FDD;&#x8BC1;&#x8D28;&#x91CF;&#xFF0C;&#x8FD8;&#x8981;&#x4FDD;&#x8BC1;&#x6548;&#x7387;&#xFF0C;&#x5728;&#x8FD9;&#x5176;&#x4E2D;&#xFF0C;&#x4F60;&#x9047;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x751F;&#x758F;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#x6216;&#x8005;&#x6280;&#x672F;&#x96BE;&#x9898;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x60F3;&#x529E;&#x6CD5;&#x53BB;&#x514B;&#x670D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x505A;&#x7684;&#xFF0C;&#x6210;&#x957F;&#x548C;&#x79EF;&#x7D2F;&#x6700;&#x5FEB;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x5C31;&#x50CF;&#x662F;&#x4E0A;&#x9762;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x6BCF;&#x5929;&#x63A5;&#x89E6;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4E0D;&#x662F;&#x6240;&#x6709;&#xFF0C;&#x751A;&#x81F3;&#x53EA;&#x6709;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x4F1A;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x53E6;&#x4E00;&#x79CD;&#x2014;&#x2014;&#x201C;&#x4E2A;&#x4EBA;&#x9A71;&#x52A8;&#x201D;&#xFF0C;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EBA;&#x4F1A;&#x6709;&#x4E2A;&#x4EBA;&#x9A71;&#x52A8;&#x5462;&#xFF1F;</p>
<p><strong>&#x4E00;&#x79CD;&#x662F;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x6280;&#x672F;&#x592A;&#x83DC;&#x4E86;&#xFF0C;&#x7ECF;&#x5E38;&#x65E0;&#x6CD5;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x5B8C;&#x6210;&#x6240;&#x5206;&#x914D;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5145;&#x6EE1;&#x5371;&#x673A;&#x611F;&#xFF1B;<br>&#x53E6;&#x4E00;&#x79CD;&#xFF0C;&#x662F;&#x771F;&#x7684;&#x5BF9;&#x6280;&#x672F;&#x559C;&#x7231;&#x7684;&#xFF0C;&#x559C;&#x6B22;&#x4E0D;&#x65AD;&#x6316;&#x6398;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x65AD;&#x63D0;&#x9AD8;&#x81EA;&#x5DF1;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x5DE7;&#x548C;&#x8D28;&#x91CF;&#xFF0C;&#x5229;&#x7528;&#x6240;&#x5B66;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x505A;&#x81EA;&#x5DF1;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x3002;</strong></p>
<p>&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x90FD;&#x662F;&#x6B63;&#x5E38;&#x7684;&#xFF0C;&#x4E5F;&#x90FD;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x8D77;&#x7801;&#x90FD;&#x662F;&#x5728;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x8FDB;&#x6B65;&#xFF0C;&#x4F46;&#x6211;&#x66F4;&#x5E0C;&#x671B;&#x4F60;&#x662F;&#x7B2C;&#x4E8C;&#x79CD;~</p>
<h2 id="&#x627F;&#x62C5;&#x3001;&#x8D23;&#x4EFB;"><a href="#&#x627F;&#x62C5;&#x3001;&#x8D23;&#x4EFB;" class="headerlink" title="&#x627F;&#x62C5;&#x3001;&#x8D23;&#x4EFB;"></a>&#x627F;&#x62C5;&#x3001;&#x8D23;&#x4EFB;</h2><p><strong>&#x4E3A;&#x4EA7;&#x54C1;&#x8D1F;&#x8D23;</strong><br>&#x6BCF;&#x4E2A;&#x516C;&#x53F8;&#x6216;&#x8005;&#x56E2;&#x961F;&#xFF0C;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x6240;&#x505A;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x90A3;&#x4E48;&#x8C01;&#x8BE5;&#x4E3A;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x8D1F;&#x8D23;&#x5462;&#xFF1F;&#x4F60;&#x53EF;&#x80FD;&#x8BF4;&#x8001;&#x677F;&#xFF0C;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x5728;&#x4E00;&#x7EBF;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x540C;&#x6837;&#x6709;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x66F4;&#x5927;&#x7684;&#x8D23;&#x4EFB;&#x53BB;&#x4E3A;&#x4EA7;&#x54C1;&#x8D1F;&#x8D23;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;<br><strong>&#x6211;&#x4EEC;&#x662F;&#x6267;&#x884C;&#x8005;</strong>&#xFF0C;&#x4EA7;&#x54C1;&#x662F;&#x4ECE;&#x6211;&#x4EEC;&#x624B;&#x4E2D;&#x505A;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x4E00;&#x9488;&#x4E00;&#x7EBF;&#x90FD;&#x662F;&#x7531;&#x6211;&#x4EEC;&#x7F16;&#x5236;&#x51FA;&#x6765;&#xFF1B;<strong>&#x6211;&#x4EEC;&#x662F;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;</strong>&#xFF0C;&#x54EA;&#x91CC;&#x9700;&#x8981;&#x600E;&#x6837;&#x505A;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x54EA;&#x91CC;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x6211;&#x4EEC;&#x8981;&#x6BD4;&#x522B;&#x4EBA;&#x66F4;&#x6E05;&#x695A;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E3A;&#x4EA7;&#x54C1;&#x8D1F;&#x8D23;&#x3002;</p>
<p><strong>&#x4E3A;&#x81EA;&#x5DF1;&#x8D1F;&#x8D23;</strong><br>&#x4F5C;&#x4E3A;&#x4E00;&#x7EBF;&#x5458;&#x5DE5;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x8D28;&#x91CF;&#xFF0C;&#x4E0D;&#x4EC5;&#x5173;&#x4E4E;&#x4EA7;&#x54C1;&#xFF0C;&#x66F4;&#x5173;&#x4E4E;&#x81EA;&#x8EAB;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x4F60;&#x6240;&#x79EF;&#x7D2F;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6240;&#x63A5;&#x89E6;&#x7684;&#x597D;&#x7684;&#x5B9E;&#x8DF5;&#x65B9;&#x5F0F;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x505A;&#x9879;&#x76EE;&#x6765;&#x83B7;&#x5F97;&#x6216;&#x8005;&#x5C1D;&#x8BD5;&#x7684;&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4F60;&#x505A;&#x7684;&#x4E1C;&#x897F;&#x522B;&#x4EBA;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x6CA1;&#x4EBA;&#x559C;&#x6B22;&#x88AB;&#x8BF4;&#x201C;&#x505A;&#x5F97;&#x5F88;&#x70C2;&#x201D;&#xFF0C;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x56E2;&#x961F;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#xFF0C;&#x4E5F;&#x662F;&#x56E2;&#x961F;&#x7684;&#x4E00;&#x4EFD;&#x5B50;&#xFF0C;&#x4E3A;&#x81EA;&#x5DF1;&#x8D1F;&#x8D23;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x662F;&#x4E3A;&#x56E2;&#x961F;&#x8D1F;&#x8D23;&#x3002;&#x5173;&#x4E8E;&#x56E2;&#x961F;&#xFF0C;&#x4E0B;&#x9762;&#x4F1A;&#x8C08;&#x3002;</p>
<h2 id="&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x624D;&#x662F;&#x771F;&#x7684;&#x597D;"><a href="#&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x624D;&#x662F;&#x771F;&#x7684;&#x597D;" class="headerlink" title="&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x624D;&#x662F;&#x771F;&#x7684;&#x597D;"></a>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x624D;&#x662F;&#x771F;&#x7684;&#x597D;</h2><p>&#x968F;&#x7740;&#x5DE5;&#x4F5C;&#x7684;&#x5F00;&#x5C55;&#xFF0C;&#x968F;&#x7740;&#x9879;&#x76EE;&#x7684;&#x9010;&#x6E10;&#x63A8;&#x8FDB;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x5F88;&#x591A;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6587;&#x4EF6;&#x7EC4;&#x7EC7;&#x662F;&#x5426;&#x5408;&#x7406;&#xFF0C;&#x9700;&#x8981;&#x4F18;&#x5316;&#x5417;&#xFF1F;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x66F4;&#x9AD8;&#x6548;&#x5417;&#xFF1F;&#x6709;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x5728;&#x56E2;&#x961F;&#x4E2D;&#x63A8;&#x5E7F;&#x4F7F;&#x7528;&#x5417;&#xFF1F;&#x8E29;&#x8FC7;&#x4EC0;&#x4E48;&#x5751;&#x53EF;&#x4EE5;&#x63D0;&#x9192;&#x5927;&#x5BB6;&#x4E00;&#x540C;&#x89C4;&#x907F;&#x5417;&#xFF1F;&#x5B66;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x597D;&#x7684;&#x5B9E;&#x7528;&#x6280;&#x5DE7;&#x53EF;&#x4EE5;&#x8DDF;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E00;&#x4E0B;&#x5417;&#xFF1F;&#x53EA;&#x8981;&#x4F60;&#x60F3;&#xFF0C;&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x5F88;&#x591A;&#x3002;</p>
<p><strong>&#x89C4;&#x8303;&#x5316;&#x3001;&#x7EDF;&#x4E00;&#x5316;</strong><br>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x91CD;&#x89C6;&#xFF0C;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x96BE;&#x5B9E;&#x65BD;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x89C4;&#x8303;&#x3002;&#x5982;&#x679C;&#x56E2;&#x961F;&#x91CC;&#x9762;&#x53EA;&#x6709;&#x4E00;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x968F;&#x610F;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x8BF4;&#x7684;&#xFF0C;&#x53E3;&#x5934;&#x4EA4;&#x4EE3;&#x4E00;&#x4E0B;&#x4E5F;OK&#xFF0C;&#x4F46;&#x5F53;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x4EBA;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x5927;&#x5BB6;&#x5BF9;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x770B;&#x6CD5;&#x548C;&#x505A;&#x6CD5;&#x90FD;&#x4E0D;&#x540C;&#xFF0C;&#x6240;&#x505A;&#x7684;&#x9879;&#x76EE;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x4E00;&#x5207;&#x4F1A;&#x6162;&#x6162;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x548C;&#x7EB7;&#x4E71;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x5982;&#x679C;&#x90FD;&#x6309;&#x7167;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x66F4;&#x613F;&#x610F;&#xFF0C;&#x66F4;&#x8212;&#x670D;&#x7684;&#x65B9;&#x5F0F;&#x53BB;&#x505A;&#xFF0C;&#x53EF;&#x80FD;&#x5230;&#x6700;&#x540E;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x4F1A;&#x8212;&#x670D;&#xFF0C;&#x5F53;&#x7A9F;&#x7ABF;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x8D8A;&#x96BE;&#x586B;&#x8865;&#x4E86;&#x3002;<br>&#x6240;&#x4EE5;&#xFF0C;&#x56E2;&#x961F;&#x91CC;&#x7684;&#x6210;&#x5458;&#xFF0C;&#x9700;&#x8981;&#x5171;&#x540C;&#x7684;&#x63A2;&#x8BA8;&#x4E00;&#x5957;&#x5927;&#x5BB6;&#x90FD;&#x7EDF;&#x4E00;&#x53BB;&#x6267;&#x884C;&#x7684;&#x89C4;&#x8303;&#x51FA;&#x6765;&#xFF0C;&#x5728;&#x89C4;&#x8303;&#x5F62;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x5927;&#x5BB6;&#x90FD;&#x53EF;&#x4EE5;&#x5404;&#x6292;&#x5DF1;&#x89C1;&#xFF0C;&#x53BB;&#x63D0;&#x51FA;&#x81EA;&#x5DF1;&#x8BA4;&#x4E3A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x70B9;&#xFF0C;&#x5230;&#x6700;&#x540E;&#xFF0C;&#x7EDF;&#x4E00;&#x4E00;&#x81F4;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5927;&#x5BB6;&#x90FD;&#x9700;&#x8981;&#x9075;&#x5B88;&#x7684;&#x4E1C;&#x897F;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x51FA;&#x73B0;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x89C4;&#x8303;&#x653E;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x4F60;&#x8BE5;&#x600E;&#x6837;&#x8FD8;&#x600E;&#x6837;&#xFF0C;&#x90A3;&#x5C31;&#x5931;&#x53BB;&#x4E86;&#x5B83;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x968F;&#x610F;&#x7684;&#x53BB;&#x505A;&#x5927;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x6BD5;&#x7ADF;&#x8981;&#x8003;&#x8651;&#x5230;&#x7684;&#x662F;&#x6574;&#x4E2A;&#x56E2;&#x961F;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E00;&#x6BB5;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x9001;&#x5927;&#x5BB6;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;<strong>&#x505A;&#x4E00;&#x4E9B;&#x5BF9;&#x56E2;&#x961F;&#x6709;&#x5229;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5F80;&#x5F80;&#x5BF9;&#x4F60;&#x4E5F;&#x662F;&#x6709;&#x5229;&#x7684;&#x3002;</strong></p>
<h2 id="&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x522B;&#x4EBA;&#xFF0C;&#x66F4;&#x8981;&#x8981;&#x6C42;&#x81EA;&#x5DF1;"><a href="#&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x522B;&#x4EBA;&#xFF0C;&#x66F4;&#x8981;&#x8981;&#x6C42;&#x81EA;&#x5DF1;" class="headerlink" title="&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x522B;&#x4EBA;&#xFF0C;&#x66F4;&#x8981;&#x8981;&#x6C42;&#x81EA;&#x5DF1;"></a>&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x522B;&#x4EBA;&#xFF0C;&#x66F4;&#x8981;&#x8981;&#x6C42;&#x81EA;&#x5DF1;</h2><p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x542C;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x62B1;&#x6028;&#xFF1A;&#x4F60;&#x770B;&#x8FD9;&#x4E2A;&#x4EBA;&#x505A;&#x7684;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x65E0;&#x8BDD;&#x53EF;&#x8BF4;&#xFF0C;&#x8FD9;&#x6837;&#x63CF;&#x8FF0;&#x7684;&#x4E0D;&#x6E05;&#x4E0D;&#x695A;&#xFF0C;&#x8FD9;&#x4E48;&#x4E71;&#xFF0C;&#x8BA9;&#x6211;&#x600E;&#x4E48;&#x505A;&#x561B;&#x3002;</p>
<p>&#x4F60;&#xFF0C;&#x6216;&#x8005;&#x522B;&#x4EBA;&#xFF0C;&#x53EF;&#x80FD;&#x90FD;&#x6709;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x6311;&#x5254;&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x7684;&#x4E0A;&#x6E38;&#x6216;&#x8005;&#x540C;&#x4E8B;&#xFF0C;&#x505A;&#x5F97;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x4E0D;&#x591F;&#x4E13;&#x4E1A;&#xFF0C;&#x8BA9;&#x81EA;&#x5DF1;&#x5F88;&#x96BE;&#x529E;&#x3002;&#x8BDA;&#x7136;&#xFF0C;&#x4EBA;&#x65E0;&#x5B8C;&#x4EBA;&#xFF0C;&#x4E5F;&#x90FD;&#x8FD8;&#x5728;&#x6210;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x72AF;&#x9519;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x758F;&#x5FFD;&#xFF0C;&#x96BE;&#x514D;&#x4F1A;&#x5076;&#x5C14;&#x5BF9;&#x81EA;&#x5DF1;&#x653E;&#x677E;&#x8981;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x4F60;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E9B;&#x6CA1;&#x90A3;&#x4E48;&#x597D;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x4F46;&#x8C01;&#x53C8;&#x4E0D;&#x662F;&#x5462;&#xFF1F;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x4EBA;&#xFF0C;&#x5BF9;&#x81EA;&#x5DF1;&#x591A;&#x4E00;&#x4E9B;&#x8981;&#x6C42;&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5207;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x5427;&#xFF1F;&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x522B;&#x4EBA;&#xFF0C;&#x66F4;&#x8981;&#x8981;&#x6C42;&#x81EA;&#x5DF1;&#x3002;</p>
<h2 id="&#x52A0;&#x73ED;&#xFF0C;&#x60F3;&#x8BF4;&#x7231;&#x4F60;&#x4E0D;&#x5BB9;&#x6613;"><a href="#&#x52A0;&#x73ED;&#xFF0C;&#x60F3;&#x8BF4;&#x7231;&#x4F60;&#x4E0D;&#x5BB9;&#x6613;" class="headerlink" title="&#x52A0;&#x73ED;&#xFF0C;&#x60F3;&#x8BF4;&#x7231;&#x4F60;&#x4E0D;&#x5BB9;&#x6613;"></a>&#x52A0;&#x73ED;&#xFF0C;&#x60F3;&#x8BF4;&#x7231;&#x4F60;&#x4E0D;&#x5BB9;&#x6613;</h2><p>&#x66FE;&#x6709;&#x4E2A;&#x65B0;&#x540C;&#x4E8B;&#xFF0C;&#x6765;&#x7684;&#x65F6;&#x5019;&#x6211;&#x5E2E;&#x5979;&#x88C5;&#x7535;&#x8111;&#xFF0C;&#x4E00;&#x8FB9;&#x88C5;&#x4E00;&#x8FB9;&#x804A;&#x5929;&#xFF0C;&#x5979;&#x95EE;&#x6211;&#xFF1A;&#x8FD9;&#x91CC;&#x52A0;&#x73ED;&#x591A;&#x5417;&#xFF1F;&#x6211;&#x5BF9;&#x5979;&#x7B11;&#x4E86;&#x7B11;&#xFF1A;&#x4F60;&#x8BF4;&#x5462;&#xFF1F;&#x817E;&#x8BAF;&#x6709;&#x52A0;&#x73ED;&#x6587;&#x5316;~&#x5979;&#x5F88;&#x8BE7;&#x5F02;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x662F;&#x5F00;&#x73A9;&#x7B11;&#x7684;&#x3002;</p>
<p>&#x6587;&#x5316;&#x662F;&#x6CA1;&#x6709;&#xFF0C;&#x53EF;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E2A;&#x5DE5;&#x4F5C;&#x65E5;&#x7684;&#x665A;&#x4E0A;8&#x70B9;&#x6765;&#x817E;&#x8BAF;&#x5927;&#x53A6;&#x770B;&#x4E00;&#x770B;&#xFF0C;&#x662F;&#x4E00;&#x756A;&#x4EC0;&#x4E48;&#x573A;&#x666F;&#xFF0C;&#x8FD8;&#x6709;&#x76F8;&#x5F53;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#xFF0C;&#x6C89;&#x6D78;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x4E0D;&#x80FD;&#x81EA;&#x62D4;~&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x66F4;&#x665A;&#xFF0C;24&#xFF1A;00&#x4EE5;&#x540E;&#xFF0C;&#x8FD8;&#x4F1A;&#x6709;&#x4EBA;&#xFF0C;&#x5F88;&#x75AF;&#x72C2;&#x5417;&#xFF1F;&#x6DF1;&#x5733;&#x52A0;&#x73ED;&#x6700;&#x591A;&#x7684;&#x5927;&#x697C;&#x7EDF;&#x8BA1;&#x91CC;&#xFF0C;&#x4ECE;&#x6765;&#x90FD;&#x6CA1;&#x6709;&#x5C11;&#x8FC7;&#x79D1;&#x5174;&#x7684;&#x8EAB;&#x5F71;&#xFF0C;&#x800C;&#x5B83;&#x662F;&#x817E;&#x8BAF;&#x4E92;&#x5A31;&#x7684;&#x6240;&#x5728;&#x5730;&#x3002;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E0D;&#x8981;&#x6015;&#xFF0C;&#x6211;&#x5E76;&#x4E0D;&#x662F;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x6765;&#x8FD9;&#x91CC;&#x5C31;&#x8981;&#x52A0;&#x73ED;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x52A0;&#x73ED;&#xFF0C;&#x800C;&#x662F;&#x5468;&#x56F4;&#x4F1A;&#x6709;&#x90A3;&#x6837;&#x4E00;&#x79CD;&#x6C1B;&#x56F4;&#xFF0C;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x4E25;&#x683C;&#x7684;&#x4E0A;&#x73ED;&#x548C;&#x4E0B;&#x73ED;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x505A;&#x597D;&#x4F60;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#xFF0C;&#x53EF;&#x80FD;&#x90A3;&#x4E9B;&#x52A0;&#x73ED;&#x7684;&#x4EBA;&#xFF0C;&#x771F;&#x7684;&#x4E0D;&#x662F;&#x4E0D;&#x80FD;&#x8D70;&#xFF0C;&#x800C;&#x662F;&#x559C;&#x6B22;&#x5F85;&#x5728;&#x90A3;&#x91CC;&#x4E0D;&#x60F3;&#x8D70;&#x5462;&#xFF1F;~</p>
<h2 id="&#x74F6;&#x9888;&#x548C;&#x70ED;&#x60C5;"><a href="#&#x74F6;&#x9888;&#x548C;&#x70ED;&#x60C5;" class="headerlink" title="&#x74F6;&#x9888;&#x548C;&#x70ED;&#x60C5;"></a>&#x74F6;&#x9888;&#x548C;&#x70ED;&#x60C5;</h2><p>&#x74F6;&#x9888;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x9047;&#x5230;&#x8FC7;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E2A;&#x5C42;&#x9762;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x521D;&#x5B66;&#x8005;&#x662F;&#x6700;&#x5E78;&#x798F;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x76F8;&#x5BF9;&#x663E;&#x5F97;&#x65E0;&#x77E5;&#xFF0C;&#x88AB;&#x4EBA;&#x770B;&#x4F5C;&#x83DC;&#x9E1F;&#xFF0C;&#x4F46;&#x6BCF;&#x63A5;&#x89E6;&#x4E00;&#x4E2A;&#x65B0;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x5FEB;&#x901F;&#x5438;&#x6536;&#x8425;&#x517B;&#xFF0C;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x4F4F;&#x8DB3;&#x591F;&#x7684;&#x597D;&#x5947;&#x548C;&#x70ED;&#x60C5;&#xFF0C;&#x5FEB;&#x901F;&#x6210;&#x957F;&#x3002;&#x800C;&#x5F53;&#x5B66;&#x4E60;&#x5230;&#x4E86;&#x4E00;&#x5E74;&#xFF0C;&#x4E24;&#x5E74;&#xFF0C;&#x4E09;&#x5E74;&#xFF0C;&#x4F60;&#x5728;&#x67D0;&#x4E2A;&#x9886;&#x57DF;&#x6240;&#x80FD;&#x5B66;&#x4E60;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6240;&#x505A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x9047;&#x5230;&#x7684;&#x96BE;&#x9898;&#x3001;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90FD;&#x5DF2;&#x7ECF;&#x8FBE;&#x5230;&#x4E86;&#x76F8;&#x5BF9;&#x9971;&#x548C;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x5E73;&#x53F0;&#x53BB;&#x5F00;&#x62D3;&#x89C6;&#x91CE;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x4E3B;&#x52A8;&#x7684;&#x8D70;&#x51FA;&#x53BB;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5219;&#x4F1A;&#x9677;&#x5165;&#x74F6;&#x9888;&#x671F;&#x3002;</p>
<p>&#x600E;&#x6837;&#x4ECE;&#x4E3B;&#x89C2;&#x4E0A;&#x52AA;&#x529B;&#x8D70;&#x51FA;&#x74F6;&#x9888;&#x5462;&#xFF1F;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E09;&#x4E2A;&#x5C42;&#x9762;&#x5165;&#x624B;&#xFF1A;</p>
<p><strong>&#x9879;&#x76EE;</strong><br>&#x5F88;&#x591A;&#x4EBA;&#x8FDB;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4E4B;&#x540E;&#xFF0C;&#x4F1A;&#x505A;&#x6BD4;&#x8F83;&#x591A;&#x67D0;&#x4E00;&#x7C7B;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x5BF9;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x63A5;&#x89E6;&#x8F83;&#x5C11;&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5B9E;&#x8DF5;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;&#x53EA;&#x505A;PC&#xFF0C;&#x53EA;&#x505A;&#x7CFB;&#x7EDF;&#x7B49;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;PC&#x5DF2;&#x7ECF;&#x5F88;&#x719F;&#x4E86;&#xFF0C;&#x79FB;&#x52A8;&#x5462;&#xFF1F;&#x4EA7;&#x54C1;&#x5DF2;&#x7ECF;&#x5F88;&#x719F;&#x4E86;&#xFF0C;&#x6D3B;&#x52A8;&#x5462;&#xFF1F;&#x9759;&#x6001;&#x5DF2;&#x7ECF;&#x5F88;&#x719F;&#x4E86;&#xFF0C;&#x52A8;&#x753B;&#x5462;&#xFF1F;&#x57FA;&#x7840;&#x7684;&#x4E1C;&#x897F;&#x638C;&#x63E1;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x6027;&#x80FD;&#x5462;&#xFF1F;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x5462;&#xFF1F;&#x6548;&#x7387;&#x5462;&#xFF1F;&#x7B49;&#x7B49;&#xFF0C;&#x4ECE;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x65B9;&#x9762;&#x8003;&#x91CF;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x5BDF;&#x89C9;&#x4E86;&#x81EA;&#x5DF1;&#x5728;&#x5B9E;&#x8DF5;&#x5F53;&#x4E2D;&#x5B58;&#x5728;&#x7740;&#x660E;&#x663E;&#x7684;&#x77ED;&#x677F;&#xFF1F;&#x6709;&#x6CA1;&#x6709;&#x7A7A;&#x767D;&#xFF1F;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x7684;&#x4E0D;&#x8DB3;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x4E0D;&#x8981;&#x6015;&#x505A;&#x4ECE;&#x6765;&#x6CA1;&#x505A;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E0D;&#x8981;&#x6015;&#x63A5;&#x53D7;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x96BE;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x5C31;&#x4F1A;&#x5F97;&#x5230;&#x65B0;&#x7684;&#x6210;&#x957F;&#x3002;</p>
<p><strong>&#x77E5;&#x8BC6;&#x7EF4;&#x5EA6;</strong><br>&#x6BCF;&#x4E00;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x90FD;&#x662F;&#x7531;&#x5F88;&#x591A;&#x77E5;&#x8BC6;&#x70B9;&#x7EC4;&#x6210;&#xFF0C;&#x5728;&#x6700;&#x5F00;&#x59CB;&#x5B66;&#x4E60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x9879;&#x76EE;&#x53BB;&#x505A;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x53BB;&#x9488;&#x5BF9;&#x67D0;&#x4E00;&#x70B9;&#x6DF1;&#x6316;&#xFF0C;&#x800C;&#x662F;&#x6CBF;&#x7740;&#x6BD4;&#x8F83;&#x7CFB;&#x7EDF;&#x548C;&#x57FA;&#x7840;&#x7684;&#x7EBF;&#x53BB;&#x5B66;&#x4E60;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5B66;&#x5F97;&#x5DEE;&#x4E0D;&#x591A;&#x4E86;&#xFF0C;&#x80FD;&#x591F;&#x4E0A;&#x624B;&#x5F00;&#x59CB;&#x505A;&#x7B80;&#x5355;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x4FBF;&#x8D70;&#x5165;&#x4E86;&#x5B9E;&#x8DF5;&#x4E4B;&#x8DEF;&#xFF0C;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x5B9E;&#x8DF5;&#x5F53;&#x4E2D;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x518D;&#x53BB;&#x627E;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x53BB;&#x627E;&#x7B54;&#x6848;&#xFF0C;&#x91CD;&#x65B0;&#x7684;&#xFF0C;&#x66F4;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x5BF9;&#x539F;&#x6709;&#x77E5;&#x8BC6;&#x8FDB;&#x884C;&#x5BA1;&#x89C6;&#x548C;&#x7406;&#x89E3;&#x3002;&#x4F46;&#x5373;&#x4FBF;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x6240;&#x6709;&#x95EE;&#x9898;&#x90FD;&#x9047;&#x5230;&#xFF0C;&#x90FD;&#x89E3;&#x51B3;&#xFF0C;&#x90A3;&#x4E48;&#xFF0C;<strong>&#x6709;&#x5F88;&#x591A;&#x7684;&#x77E5;&#x8BC6;&#x7EC6;&#x8282;&#xFF0C;&#x539F;&#x7406;&#xFF0C;&#x4F1A;&#x88AB;&#x6211;&#x4EEC;&#x4E3B;&#x89C2;&#x4E0A;&#x5FFD;&#x89C6;&#x6389;&#xFF0C;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x4F1A;&#x4E86;&#xFF0C;&#x638C;&#x63E1;&#x4E86;&#xFF0C;&#x591F;&#x7528;&#x4E86;&#xFF0C;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4EBA;&#x90FD;&#x4F1A;&#x8FD9;&#x6837;&#xFF0C;&#x6CA1;&#x6709;&#x66B4;&#x9732;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x5F80;&#x5F80;&#x6211;&#x4EEC;&#x53C8;&#x5BB9;&#x6613;&#x88AB;&#x4E0D;&#x7ECF;&#x610F;&#x95F4;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x5F04;&#x7684;&#x675F;&#x624B;&#x65E0;&#x7B56;&#xFF0C;</strong>&#x6BCF;&#x5F53;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5C31;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x529F;&#x529B;&#x5E76;&#x6CA1;&#x6709;&#x60F3;&#x8C61;&#x7684;&#x90A3;&#x4E48;&#x6DF1;&#x539A;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x61C8;&#x53EF;&#x51FB;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B66;&#x4F1A;&#x6311;&#x6218;&#x81EA;&#x5DF1;&#xFF0C;&#x4E3B;&#x52A8;&#x7A81;&#x7834;&#x81EA;&#x5DF1;&#xFF0C;&#x662F;&#x7A81;&#x7834;&#x74F6;&#x9888;&#x7684;&#x8981;&#x70B9;&#x3002;</p>
<p><strong>&#x804C;&#x4F4D;&#x4EA4;&#x53C9;&#x70B9;</strong><br>&#x4EC0;&#x4E48;&#x662F;&#x804C;&#x4F4D;&#x4EA4;&#x53C9;&#x70B9;&#xFF0C;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4F60;&#x662F;&#x4E00;&#x540D;&#x524D;&#x7AEF;&#xFF0C;&#x90A3;&#x4E48;&#x5F80;&#x5F80;&#x4F1A;&#x8981;&#x6C42;&#x4F60;&#x5BF9;&#x540E;&#x53F0;&#x4E5F;&#x6709;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#xFF1B;&#x4F60;&#x662F;&#x4E00;&#x540D;UI&#x5F00;&#x53D1;&#xFF0C;&#x4E5F;&#x4F1A;&#x5BF9;&#x8BBE;&#x8BA1;&#x548C;&#x5BA1;&#x7F8E;&#x6709;&#x4E00;&#x5B9A;&#x8981;&#x6C42;&#x3002;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x804C;&#x4F4D;&#x4E4B;&#x5916;&#x7684;&#x8303;&#x7574;&#x53BB;&#x505A;&#x786C;&#x6027;&#x7684;&#xFF0C;&#x5F88;&#x9AD8;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x591A;&#x6D89;&#x730E;&#x4E00;&#x4E9B;&#x76F8;&#x5173;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x591A;&#x638C;&#x63E1;&#x4E00;&#x4E9B;&#x6280;&#x80FD;&#xFF0C;&#x5BF9;&#x5DE5;&#x4F5C;&#x5F53;&#x4E2D;&#x7684;&#x5408;&#x4F5C;&#x548C;&#x81EA;&#x8EAB;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x90FD;&#x4F1A;&#x6709;&#x4E0D;&#x5C0F;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x4F1A;&#x9020;&#x6210;&#x6211;&#x4EEC;&#x505C;&#x6EDE;&#x4E0D;&#x524D;&#x5462;&#xFF1F;</p>
<h2 id="&#x5E78;&#x798F;&#x7684;&#x6E29;&#x5BA4;"><a href="#&#x5E78;&#x798F;&#x7684;&#x6E29;&#x5BA4;" class="headerlink" title="&#x5E78;&#x798F;&#x7684;&#x6E29;&#x5BA4;"></a>&#x5E78;&#x798F;&#x7684;&#x6E29;&#x5BA4;</h2><p>&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x773C;&#x91CC;&#xFF0C;&#x76F8;&#x6BD4;&#x5728;&#x4E00;&#x822C;&#x516C;&#x53F8;&#xFF0C;&#x5C0F;&#x516C;&#x53F8;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5E78;&#x798F;&#x7684;&#xFF1B;&#x76F8;&#x6BD4;&#x5F88;&#x82E6;&#x5F88;&#x7D2F;&#xFF0C;&#x4E00;&#x4E2A;&#x6708;&#x5374;&#x53EA;&#x80FD;&#x6323;&#x4E24;&#x4E09;&#x5343;&#xFF0C;&#x4E09;&#x56DB;&#x5343;&#x85AA;&#x6C34;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5E78;&#x798F;&#x7684;&#x3002;&#x4E8E;&#x662F;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x5F88;&#x52AA;&#x529B;&#x7684;&#x8D70;&#x4E86;&#x8FDB;&#x6765;&#xFF0C;&#x8FD8;&#x4F1A;&#x4E0D;&#x4F1A;&#x50CF;&#x5F53;&#x521D;&#x90A3;&#x6837;&#xFF0C;&#x6709;&#x7740;&#x660E;&#x786E;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x618B;&#x7740;&#x4E00;&#x80A1;&#x52B2;&#x7EE7;&#x7EED;&#x52AA;&#x529B;&#xFF1F;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#xFF0C;&#x4F46;&#x5FC5;&#x7136;&#x6709;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x4EBA;&#x4E0D;&#x4F1A;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x6E29;&#x5BA4;&#x5F53;&#x4E2D;&#xFF0C;&#x5F88;&#x8212;&#x670D;&#xFF0C;&#x6CA1;&#x6709;&#x5371;&#x673A;&#x611F;&#xFF0C;&#x4E0D;&#x518D;&#x90A3;&#x4E48;&#x671D;&#x6C14;&#x84EC;&#x52C3;&#xFF0C;&#x4E0D;&#x518D;&#x52AA;&#x529B;&#x671D;&#x7740;&#x9633;&#x5149;&#x5014;&#x5F3A;&#x751F;&#x957F;&#x3002;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x4EBA;&#x662F;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x80FD;&#x53BB;&#x5C3D;&#x529B;&#x7684;&#x907F;&#x514D;&#x81EA;&#x5DF1;&#x4E0D;&#x8981;&#x90A3;&#x6837;&#x3002;</p>
<h2 id="&#x826F;&#x6027;&#x6BD4;&#x8F83;&#xFF0C;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x7684;&#x76F8;&#x5BF9;&#x4E0E;&#x7EDD;&#x5BF9;"><a href="#&#x826F;&#x6027;&#x6BD4;&#x8F83;&#xFF0C;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x7684;&#x76F8;&#x5BF9;&#x4E0E;&#x7EDD;&#x5BF9;" class="headerlink" title="&#x826F;&#x6027;&#x6BD4;&#x8F83;&#xFF0C;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x7684;&#x76F8;&#x5BF9;&#x4E0E;&#x7EDD;&#x5BF9;"></a>&#x826F;&#x6027;&#x6BD4;&#x8F83;&#xFF0C;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x7684;&#x76F8;&#x5BF9;&#x4E0E;&#x7EDD;&#x5BF9;</h2><p>&#x5728;&#x8FDB;&#x5165;&#x516C;&#x53F8;&#x4E4B;&#x524D;&#xFF0C;&#x4F1A;&#x60F3;&#x8C61;&#x7740;&#xFF0C;&#x8FD9;&#x91CC;&#x80AF;&#x5B9A;&#x90FD;&#x662F;&#x7CBE;&#x82F1;&#xFF0C;&#x5927;&#x725B;&#xFF0C;&#x80AF;&#x5B9A;&#x90FD;&#x9AD8;&#x4E0D;&#x53EF;&#x6500;&#xFF0C;&#x4F1A;&#x6709;&#x5F88;&#x5927;&#x538B;&#x529B;&#x3002;&#x5165;&#x804C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B0;&#x4EBA;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x8FBE;&#x4EBA;&#x8BBF;&#x8C08;&#x201D;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6211;&#x9009;&#x62E9;&#x4E86;&#x81EA;&#x5DF1;&#x4E00;&#x76F4;&#x60F3;&#x4E0E;&#x4E4B;&#x4EA4;&#x8C08;&#xFF0C;&#x4E5F;&#x9762;&#x8BD5;&#x8FC7;&#x6211;&#x7684;&#x201C;&#x9B3C;&#x54E5;&#x201D;&#xFF0C;&#x4ED6;&#x5728;&#x817E;&#x8BAF;&#x5DF2;&#x7ECF;&#x7B2C;&#x5341;&#x4E2A;&#x5E74;&#x5934;&#xFF0C;&#x8BBF;&#x8C08;&#x4E2D;&#xFF0C;&#x6211;&#x95EE;&#x4E86;&#x4ED6;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x60A8;&#x4ECE;&#x4E1A;&#x8FD9;&#x4E48;&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x600E;&#x6837;&#x770B;&#x5F85;&#x81EA;&#x8EAB;&#x7684;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#xFF1F;&#x4ED6;&#x7684;&#x56DE;&#x7B54;&#x5F88;&#x5B9E;&#x5728;&#xFF0C;&#x5927;&#x6982;&#x610F;&#x601D;&#x662F;&#xFF0C;&#x4EBA;&#x4E00;&#x76F4;&#x662F;&#x5904;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x4F1A;&#x6709;&#x81EA;&#x5DF1;&#x8FD8;&#x6CA1;&#x6709;&#x63A5;&#x89E6;&#x5230;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x4E0D;&#x8DB3;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x6211;&#x73B0;&#x5728;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x86EE;&#x9AD8;&#x4E86;&#xFF0C;&#x4F46;&#x4F9D;&#x7136;&#x8FDC;&#x6CA1;&#x6709;&#x5230;&#x9876;&#xFF0C;&#x4E0A;&#x9762;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x4EBA;&#x6BD4;&#x6211;&#x66F4;&#x9AD8;&#xFF0C;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x8981;&#x8BF4;&#x7684;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C31;&#x50CF;&#x9B3C;&#x54E5;&#x6240;&#x8BF4;&#xFF0C;&#x4E0D;&#x8BBA;&#x6211;&#x4EEC;&#x505A;&#x5F97;&#x591A;&#x597D;&#xFF0C;&#x591A;&#x5DEE;&#xFF0C;&#x90FD;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x8DDF;&#x522B;&#x4EBA;&#x6BD4;&#x8F83;&#x800C;&#x51FA;&#x7684;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#xFF0C;&#x6709;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x7EDD;&#x5BF9;&#x4F4D;&#x7F6E;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5BF9;&#x81EA;&#x8EAB;&#x80FD;&#x529B;&#x7684;&#x5BA2;&#x89C2;&#x8003;&#x91CF;&#xFF0C;<strong>&#x6BD4;&#x522B;&#x4EBA;&#x5DEE;&#xFF0C;&#x90A3;&#x76F8;&#x5BF9;&#x4E4B;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x4E86;&#x8FDB;&#x6B65;&#xFF1F;&#x6BD4;&#x5F88;&#x591A;&#x4EBA;&#x505A;&#x5F97;&#x90FD;&#x597D;&#xFF0C;&#x90A3;&#x662F;&#x5426;&#x5C31;&#x6CA1;&#x6709;&#x4E86;&#x8FDB;&#x6B65;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x662F;&#x5426;&#x505A;&#x5230;&#x4E86;&#x81EA;&#x5DF1;&#x80FD;&#x505A;&#x5230;&#x7684;&#x6700;&#x597D;&#xFF1F;</strong></p>
<p>&#x8BA4;&#x8BC6;&#x81EA;&#x5DF1;&#xFF0C;&#x826F;&#x6027;&#x6BD4;&#x8F83;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x80FD;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x5FC3;&#x6001;&#x7EE7;&#x7EED;&#x524D;&#x8FDB;&#x3002;</p>
<h2 id="&#x61C2;&#x5F97;&#x611F;&#x6069;"><a href="#&#x61C2;&#x5F97;&#x611F;&#x6069;" class="headerlink" title="&#x61C2;&#x5F97;&#x611F;&#x6069;"></a>&#x61C2;&#x5F97;&#x611F;&#x6069;</h2><p><strong>&#x516C;&#x53F8;</strong><br>&#x817E;&#x8BAF;&#x4EBA;&#xFF0C;&#x9664;&#x4E86;&#x522B;&#x4EBA;&#x773C;&#x91CC;&#x7684;&#x9AD8;&#x85AA;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x798F;&#x5229;&#xFF0C;&#x770B;&#x5F97;&#x89C1;&#x7684;&#xFF0C;&#x5F39;&#x6027;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x3001;&#x73ED;&#x8F66;&#x3001;&#x8336;&#x6C34;&#x996E;&#x6599;&#x3001;&#x5065;&#x8EAB;&#x623F;&#x7B49;&#x7B49;&#xFF0C;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x5C31;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x6211;&#x5E38;&#x8FD9;&#x6837;&#x8DDF;&#x4EBA;&#x5F62;&#x5BB9;&#xFF1A;&#x53EA;&#x6709;&#x4F60;&#x60F3;&#x4E0D;&#x5230;&#xFF0C;&#x6CA1;&#x6709;&#x5B83;&#x4E0D;&#x63D0;&#x4F9B;&#x3002;&#x4F46;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x6709;&#x4EBA;&#x65F6;&#x4E0D;&#x65F6;&#x5410;&#x69FD;&#x81EA;&#x5DF1;&#x5BF9;&#x516C;&#x53F8;&#x54EA;&#x91CC;&#x5F88;&#x4E0D;&#x6EE1;&#xFF0C;&#x54EA;&#x91CC;&#x5F88;&#x4E0D;&#x516C;&#x3002;</p>
<p>&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x662F;&#xFF0C;&#x4E0D;&#x7BA1;&#x4F60;&#x89C9;&#x5F97;&#x6709;&#x54EA;&#x4E9B;&#x59D4;&#x5C48;&#xFF0C;&#x6709;&#x591A;&#x7D2F;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x4F60;&#x5E94;&#x5F97;&#x7684;&#x6CA1;&#x5F97;&#x5230;&#xFF0C;&#x4F60;&#x90FD;&#x8981;&#x60F3;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x5B83;&#x7ED9;&#x4E86;&#x4F60;&#x591A;&#x5C11;&#xFF0C;&#x90A3;&#x4E9B;&#x4F60;&#x8FD8;&#x6CA1;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x56E2;&#x961F;&#xFF0C;&#x56E0;&#x4E3A;&#x516C;&#x53F8;&#xFF0C;&#x8FD8;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#xFF1F;</p>
<p><strong>&#x81EA;&#x5DF1;</strong><br>&#x611F;&#x8C22;&#x81EA;&#x5DF1;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x9996;&#x5148;&#x611F;&#x8C22;&#x81EA;&#x5DF1;&#x52AA;&#x529B;&#x6765;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD8;&#x8981;&#x611F;&#x8C22;&#x81EA;&#x5DF1;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x6240;&#x505A;&#x51FA;&#x7684;&#x90A3;&#x4E9B;&#x5C0F;&#x5C0F;&#x7684;&#x6210;&#x7EE9;&#xFF0C;&#x90A3;&#x4E9B;&#x6536;&#x83B7;&#xFF0C;&#x751A;&#x81F3;&#x72AF;&#x8FC7;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x8EAB;&#x7684;&#x63D0;&#x9AD8;&#x662F;&#x65E0;&#x5F62;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x4E0D;&#x6613;&#x88AB;&#x522B;&#x4EBA;&#x5BDF;&#x89C9;&#x7684;&#xFF0C;&#x5728;&#x5C1A;&#x672A;&#x5F97;&#x5230;&#x522B;&#x4EBA;&#x8BA4;&#x53EF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x81EA;&#x5DF1;&#x8981;&#x5B66;&#x4F1A;&#x7ED9;&#x81EA;&#x5DF1;&#x6FC0;&#x52B1;&#xFF0C;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x524D;&#x8FDB;&#x7684;&#x52A8;&#x529B;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x90FD;&#x4F1A;&#x662F;&#x5E73;&#x51E1;&#x7684;&#xFF0C;&#x9ED8;&#x9ED8;&#x65E0;&#x95FB;&#x7684;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x4EE3;&#x8868;&#x6211;&#x4EEC;&#x7684;&#x8FDB;&#x6B65;&#x548C;&#x6210;&#x7EE9;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x90A3;&#x662F;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x7684;&#x8D22;&#x5BCC;&#x79EF;&#x7D2F;&#xFF0C;&#x8C01;&#x4E5F;&#x62FF;&#x4E0D;&#x8D70;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x5149;&#xFF0C;&#x53D1;&#x70ED;&#xFF0C;&#x88AB;&#x66F4;&#x591A;&#x4EBA;&#x770B;&#x89C1;~</p>
<h2 id="&#x662F;&#x7EC8;&#x70B9;&#xFF0C;&#x66F4;&#x662F;&#x8D77;&#x70B9;"><a href="#&#x662F;&#x7EC8;&#x70B9;&#xFF0C;&#x66F4;&#x662F;&#x8D77;&#x70B9;" class="headerlink" title="&#x662F;&#x7EC8;&#x70B9;&#xFF0C;&#x66F4;&#x662F;&#x8D77;&#x70B9;"></a>&#x662F;&#x7EC8;&#x70B9;&#xFF0C;&#x66F4;&#x662F;&#x8D77;&#x70B9;</h2><p>&#x5E73;&#x65F6;&#x8DDF;&#x65C1;&#x4EBA;&#x804A;&#x8D77;&#x817E;&#x8BAF;&#xFF0C;&#x4EBA;&#x5E38;&#x4F1A;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;&#x201C;&#x4E16;&#x754C;500&#x5F3A;&#x201D;&#x3001;&#x201C;&#x4E92;&#x8054;&#x7F51;&#x5DE8;&#x5934;&#x201D;&#x3001;&#x201C;&#x85AA;&#x8D44;&#x5F85;&#x9047;&#x597D;&#x201D;&#x3001;&#x201C;&#x5F88;&#x795E;&#x79D8;&#x201D;&#xFF0C;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7684;&#x8BCD;&#x6C47;&#xFF0C;&#x8BDA;&#x7136;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x597D;&#x5947;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x60F3;&#x6765;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x91CD;&#x590D;&#x4E86;&#x6574;&#x6574;&#x4E00;&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x6BCF;&#x5929;&#x5728;&#x8FD9;&#x5EA7;&#x5927;&#x53A6;&#x91CC;&#x8FDB;&#x8FDB;&#x51FA;&#x51FA;&#xFF0C;&#x4E0D;&#x53EF;&#x8C13;&#x4E0D;&#x719F;&#x6089;&#xFF0C;&#x5374;&#x4ECD;&#x7136;&#x62B1;&#x6709;&#x201C;&#x6211;&#x662F;&#x600E;&#x6837;&#x6765;&#x5230;&#x8FD9;&#x91CC;&#x201D;&#x7684;&#x656C;&#x754F;&#x611F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E5F;&#x548C;&#x6211;&#x4E00;&#x6837;&#xFF0C;&#x901A;&#x8FC7;&#x4E0D;&#x61C8;&#x7684;&#x52AA;&#x529B;&#x52A0;&#x4E0A;&#x65E0;&#x754F;&#x7684;&#x52C7;&#x6C14;&#xFF0C;&#x7EC8;&#x4E8E;&#x6765;&#x5230;&#x4E86;&#x8FD9;&#x91CC;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x8DB3;&#x591F;&#x73CD;&#x60DC;&#x5728;&#x8FD9;&#x91CC;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5B83;&#x66FE;&#x7ECF;&#x662F;&#x6211;&#x4EEC;&#x68A6;&#x5BD0;&#x4EE5;&#x6C42;&#x7684;&#xFF0C;&#x662F;&#x6211;&#x4EEC;&#x90A3;&#x6BB5;&#x594B;&#x6597;&#x7ECF;&#x5386;&#x7684;&#x7EC8;&#x70B9;&#xFF0C;&#x66F4;&#x662F;&#x8D70;&#x5411;&#x4E0B;&#x4E00;&#x7AD9;&#x7684;&#x8D77;&#x70B9;&#x3002;</p>
<h2 id="&#x5199;&#x5728;&#x6700;&#x540E;"><a href="#&#x5199;&#x5728;&#x6700;&#x540E;" class="headerlink" title="&#x5199;&#x5728;&#x6700;&#x540E;"></a>&#x5199;&#x5728;&#x6700;&#x540E;</h2><p>&#x8FD8;&#x8BB0;&#x5F97;&#xFF0C;&#x521A;&#x6765;&#x516C;&#x53F8;&#x7684;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x505A;&#x9879;&#x76EE;&#xFF0C;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x5B58;&#x5728;&#x7740;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E0D;&#x80FD;&#x8BF4;&#x5199;&#x5F97;&#x4E0D;&#x5BF9;&#xFF0C;&#x662F;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x4E0D;&#x89C4;&#x8303;&#x3001;&#x4E0D;&#x597D;&#x7EF4;&#x62A4;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x4E0D;&#x591F;&#x7B49;&#xFF0C;&#x5BFC;&#x5E08;&#x90FD;&#x7ED9;&#x6211;&#x53CA;&#x65F6;&#x6307;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x540E;&#x6765;&#xFF0C;&#x6211;&#x53D7;&#x5230;&#x90A3;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x523A;&#x6FC0;&#xFF0C;&#x5199;&#x4E0B;&#x4E86;&#x4E00;&#x7BC7;&#x6587;&#x2014;&#x2014;<a href="http://ideazhao.com/2015/10/17/those-year-i-do-bad/" target="_blank" rel="external">&#x90A3;&#x4E9B;&#x5E74;&#x6211;&#x5E72;&#x8FC7;&#x7684;&#x77EC;&#x4E8B;</a>&#x3002;&#x8FD9;&#x7BC7;&#x5468;&#x5E74;&#x8BB0;&#x7684;&#x6807;&#x9898;&#xFF0C;&#x4E5F;&#x662F;&#x6765;&#x6E90;&#x4E8E;&#x8FD9;&#x4E00;&#x8DEF;&#x8D70;&#x6765;&#x6240;&#x9047;&#x5230;&#x7684;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;<strong>&#x6211;&#x4EEC;&#x603B;&#x662F;&#x5BB9;&#x6613;&#x89C9;&#x5F97;&#x591F;&#x4E86;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x5374;&#x603B;&#x6709;&#x672A;&#x66FE;&#x5230;&#x8FBE;&#x7684;&#x5730;&#x65B9;&#x3002;</strong></p>
<p><strong>&#x4EBA;&#x6700;&#x75DB;&#x82E6;&#x7684;&#x4E8B;&#xFF0C;&#x4E0D;&#x662F;&#x81EA;&#x5DF1;&#x89C9;&#x5F97;&#x53EF;&#x4EE5;&#xFF0C;&#x522B;&#x4EBA;&#x89C9;&#x5F97;&#x4E0D;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x81EA;&#x5DF1;&#x5BF9;&#x81EA;&#x5DF1;&#x5931;&#x671B;&#xFF0C;</strong>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5F88;&#x4E0D;&#x60F3;&#x770B;&#x5230;&#xFF0C;&#x4E00;&#x5E74;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x6BD4;&#x4E09;&#x5E74;&#x524D;&#x7684;&#x81EA;&#x5DF1;&#x66F4;&#x4F18;&#x79C0;&#xFF0C;&#x4E00;&#x5E74;&#x4E4B;&#x540E;&#x7684;&#x81EA;&#x5DF1;&#xFF0C;&#x5374;&#x6BD4;&#x60F3;&#x8C61;&#x4E2D;&#x7684;&#x5DEE;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4F1A;&#x5BF9;&#x81EA;&#x5DF1;&#x8BF4;&#xFF0C;&#x5FD8;&#x6389;&#x6210;&#x7EE9;&#xFF0C;&#x5FD8;&#x6389;&#x8D1F;&#x62C5;&#xFF0C;&#x62FE;&#x8D77;&#x597D;&#x5947;&#x548C;&#x70ED;&#x60C5;&#xFF0C;&#x91CD;&#x65B0;&#x5E72;&#x8D77;&#x6765;&#x5427;&#xFF0C;&#x5C31;&#x50CF;&#x66FE;&#x7ECF;&#x505A;&#x8FC7;&#x7684;&#x90A3;&#x6837;&#x3002;</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/成长，经历，思考/" rel="tag">#成长，经历，思考</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/08/15/readbook_seetheworld/" rel="next" title="静静的打开一本书，你会看到新的世界">
                <i class="fa fa-chevron-left"></i> 静静的打开一本书，你会看到新的世界
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/09/21/javascript-study-six/" rel="prev" title="征服javascript学习笔记（六）——面向对象的程序设计之创建对象">
                征服javascript学习笔记（六）——面向对象的程序设计之创建对象 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://f2er.club/" target="_blank">醉牛前端导航</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#大公司光环，那么远又这么近"><span class="nav-number">1.</span> <span class="nav-text">大公司光环，那么远又这么近</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#融入、适应"><span class="nav-number">2.</span> <span class="nav-text">融入、适应</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#主动、主观"><span class="nav-number">3.</span> <span class="nav-text">主动、主观</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#承担、责任"><span class="nav-number">4.</span> <span class="nav-text">承担、责任</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#大家好，才是真的好"><span class="nav-number">5.</span> <span class="nav-text">大家好，才是真的好</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#可以要求别人，更要要求自己"><span class="nav-number">6.</span> <span class="nav-text">可以要求别人，更要要求自己</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#加班，想说爱你不容易"><span class="nav-number">7.</span> <span class="nav-text">加班，想说爱你不容易</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#瓶颈和热情"><span class="nav-number">8.</span> <span class="nav-text">瓶颈和热情</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#幸福的温室"><span class="nav-number">9.</span> <span class="nav-text">幸福的温室</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#良性比较，职业发展的相对与绝对"><span class="nav-number">10.</span> <span class="nav-text">良性比较，职业发展的相对与绝对</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#懂得感恩"><span class="nav-number">11.</span> <span class="nav-text">懂得感恩</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#是终点，更是起点"><span class="nav-number">12.</span> <span class="nav-text">是终点，更是起点</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#写在最后"><span class="nav-number">13.</span> <span class="nav-text">写在最后</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
