<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>抛开语法，深度剖析CSS预处理器 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">抛开语法，深度剖析CSS预处理器</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">抛开语法，深度剖析CSS预处理器</h1><div class="post-meta">Jun 27, 2016<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2016/06/27/less_sass/" href="/2016/06/27/less_sass/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#背景"><span class="toc-number">1.</span> <span class="toc-text">背景</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#是什么让你还在犹豫？我猜你可能有以下几处困惑"><span class="toc-number">2.</span> <span class="toc-text">是什么让你还在犹豫？我猜你可能有以下几处困惑</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#你可能忽略的一些点"><span class="toc-number">3.</span> <span class="toc-text">你可能忽略的一些点</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#说了这么多，该如何选择？"><span class="toc-number">4.</span> <span class="toc-text">说了这么多，该如何选择？</span></a></li></ol></div></div><div class="post-content"><h2 id="&#x80CC;&#x666F;"><a href="#&#x80CC;&#x666F;" class="headerlink" title="&#x80CC;&#x666F;"></a>&#x80CC;&#x666F;</h2><p>&#x73B0;&#x5728;&#x6765;&#x8BF4;&#x8FD9;&#x4E9B;&#xFF0C;&#x663E;&#x5F97;&#x665A;&#x4E86;&#x4E9B;&#xFF0C;&#x5927;&#x5BB6;&#x503E;&#x5411;&#x4E8E;&#x53BB;&#x5173;&#x6CE8;&#x6700;&#x65B0;&#x3001;&#x6700;&#x9177;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x6240;&#x8C13;&#x6280;&#x672F;&#x7684;&#x6F6E;&#x6D41;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x7684;&#x6982;&#x5FF5;&#x4E0D;&#x7B97;&#x65B0;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x524D;&#x7AEF;&#x4ECE;&#x4E1A;&#x8005;&#xFF0C;&#x5E94;&#x8BE5;&#x90FD;&#x4F7F;&#x7528;&#x8FC7;&#x6216;&#x8005;&#x7784;&#x8FC7;&#x4E24;&#x773C;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#xFF0C;&#x8BD5;&#x7528;&#x8FC7;&#x4E4B;&#x540E;&#x89C9;&#x5F97;&#x4E0D;&#x9519;&#x5C31;&#x4E00;&#x76F4;&#x7528;&#x5E76;&#x4E14;&#x63A8;&#x5E7F;&#x4E0B;&#x53BB;&#xFF1B;&#x6709;&#x4E9B;&#x5728;&#x7528;&#x4E86;&#x4E00;&#x4E0B;&#x4E4B;&#x540E;&#x5C31;&#x653E;&#x4E0B;&#x4E86;&#xFF1B;&#x800C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#xFF0C;&#x53EF;&#x80FD;&#x770B;&#x8FC7;&#x4E4B;&#x540E;&#x5C31;&#x6CA1;&#x6709;&#x518D;&#x7528;&#x3002;</p>
<p>&#x4E0D;&#x7BA1;&#x4F60;&#x662F;&#x5C5E;&#x4E8E;&#x54EA;&#x4E00;&#x7C7B;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x5E94;&#x8BE5;&#x662F;&#x4FDD;&#x6301;&#x4E00;&#x79CD;&#x597D;&#x5947;&#x548C;&#x656C;&#x754F;&#x4E4B;&#x5FC3;&#xFF0C;&#x53BB;&#x770B;&#x5F85;&#x5B83;&#x4EEC;&#xFF0C;&#x6BD5;&#x7ADF;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x5E94;&#x9700;&#x800C;&#x751F;&#xFF0C;&#x7A81;&#x7834;&#x601D;&#x7EF4;&#x5C40;&#x9650;&#xFF0C;&#x6253;&#x7834;&#x8BED;&#x8A00;&#x5C40;&#x9650;&#xFF0C;&#x80FD;&#x591F;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x5236;&#x9020;&#x4FBF;&#x5229;&#x7684;&#x597D;&#x5DE5;&#x5177;&#x3002;&#x5B66;&#x4E60;&#x4E4B;&#xFF0C;&#x7814;&#x7A76;&#x4E4B;&#xFF0C;&#x662F;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x3002;</p>
<p>&#x5148;&#x6765;&#x770B;&#x770B;&#x76EE;&#x524D;&#x4E3A;&#x6B62;CSS&#x7684;&#x75DB;&#x70B9;&#x5728;&#x54EA;&#x91CC;&#xFF1F;</p>
<p>CSS&#x7684;&#x51FA;&#x73B0;</p>
<p>1&#x3001;&#x4E3A;&#x7ED3;&#x6784;&#x548C;&#x8868;&#x73B0;&#x5206;&#x79BB;&#x63D0;&#x4F9B;&#x4E86;&#x4FBF;&#x5229;&#x3002;<br>2&#x3001;&#x4E3A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x591A;&#x5904;&#x5F15;&#x5165;&#xFF0C;&#x6539;&#x4E00;&#x5904;&#x591A;&#x5904;&#x6539;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4FBF;&#x5229;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5176;&#x6700;&#x5927;&#x7684;&#x7F3A;&#x9677;&#x5728;&#x4E8E;&#xFF0C;&#x5B8C;&#x5168;&#x9759;&#x6001;&#xFF0C;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x677F;&#x4E00;&#x773C;&#x7684;&#x6572;&#x4E0A;&#x53BB;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<p>1&#x3001;&#x5D4C;&#x5957;<br>2&#x3001;&#x590D;&#x7528;&#x4EE3;&#x7801;&#x6BB5;<br>3&#x3001;&#x6A21;&#x5757;&#x5316;&#x5F00;&#x53D1;&#x7684;&#x4E0D;&#x7075;&#x6D3B;<br>4&#x3001;&#x4E0D;&#x5177;&#x5907;&#x903B;&#x8F91;&#x80FD;&#x529B;&#x548C;&#x62BD;&#x8C61;&#x80FD;&#x529B;</p>
<p>&#x6216;&#x8BB8;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x52A8;&#x7528;&#x806A;&#x660E;&#x7684;&#x5934;&#x8111;&#x53BB;&#x89C4;&#x5212;&#xFF0C;&#x53BB;&#x8BBE;&#x8BA1;&#xFF0C;&#x6765;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x53EF;&#x590D;&#x7528;&#x6027;&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x786C;&#x4F24;&#x662F;&#x96BE;&#x4EE5;&#x7A81;&#x7834;&#x7684;&#x3002;<br>&#x9884;&#x5904;&#x7406;&#x5668;&#x7684;&#x5171;&#x540C;&#x70B9;</p>
<p>&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x6B62;&#x4E00;&#x79CD;&#xFF0C;&#x6BD4;&#x5982;sass&#x3001;less&#x3001;stylus&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x95EE;&#x8FC7;&#x8FD9;&#x4E48;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x8981;&#x9009;&#x54EA;&#x79CD;&#x597D;&#x5462;&#xFF1F;&#x5B83;&#x4EEC;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x4E00;&#x6837;&#x5417;&#xFF1F;&#x9996;&#x5148;&#x6765;&#x770B;&#x5171;&#x540C;&#x70B9;&#xFF1A;</p>
<p><strong>1&#x3001;&#x53D8;&#x91CF;</strong></p>
<p>&#x61C2;&#x5F97;&#x7F16;&#x7A0B;&#x7684;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#xFF0C;&#x53D8;&#x91CF;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#xFF0C;&#x4F60;&#x628A;&#x4E00;&#x4E2A;&#x503C;&#x5B58;&#x8FDB;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x5404;&#x5904;&#x5747;&#x53EF;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x5B83;&#x53BB;&#x8BBF;&#x95EE;&#x90A3;&#x4E2A;&#x503C;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B83;&#x9002;&#x5408;&#x6279;&#x91CF;&#x5B9A;&#x4E49;&#x548C;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x9002;&#x5408;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF1F;</p>
<ul>
<li>&#x8BE5;&#x503C;&#x81F3;&#x5C11;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#x4E86;&#x4E24;&#x6B21;&#xFF1B;</li>
<li>&#x8BE5;&#x503C;&#x81F3;&#x5C11;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x66F4;&#x65B0;&#x4E00;&#x6B21;&#xFF1B;</li>
<li>&#x8BE5;&#x503C;&#x6240;&#x6709;&#x7684;&#x8868;&#x73B0;&#x90FD;&#x4E0E;&#x53D8;&#x91CF;&#x6709;&#x5173;&#xFF08;&#x975E;&#x5DE7;&#x5408;&#xFF09;&#x3002;</li>
</ul>
<p>&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x6C38;&#x8FDC;&#x4E0D;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x6216;&#x8005;&#x53EA;&#x5728;&#x5355;&#x4E00;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x53D8;&#x91CF;&#x957F;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x7684;</p>
<p><img src="/2016/06/27/less_sass/1" alt=""></p>
<p>&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x5668;&#x524D;&#x9762;&#x7684;&#x7B26;&#x53F7;&#x4E0D;&#x540C;&#x3002;</p>
<p><strong>2&#x3001;&#x5D4C;&#x5957;</strong></p>
<p>&#x6765;&#x770B;&#x4E00;&#x5F20;&#x5927;&#x5BB6;&#x90FD;&#x719F;&#x6089;&#x7684;&#x4EE3;&#x7801;&#x6BB5;</p>
<p><img src="/2016/06/27/less_sass/2" alt=""></p>
<p>&#x660E;&#x663E;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x4E0A;&#x9762;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5728;&#x9009;&#x62E9;&#x5668;&#x90E8;&#x5206;&#xFF0C;&#x884C;&#x4E0E;&#x884C;&#x4E4B;&#x95F4;&#x90FD;&#x6709;&#x4E00;&#x4E9B;&#x91CD;&#x590D;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x4E66;&#x5199;&#x5E26;&#x6765;&#x5F88;&#x591A;&#x91CD;&#x590D;&#x3002;&#x800C;&#x5904;&#x7406;&#x5668;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5D4C;&#x5957;&#x89C4;&#x5219;&#xFF0C;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x514D;&#x4E8E;&#x4E0D;&#x65AD;&#x7684;&#x53BB;&#x5199;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x7684;&#x7236;&#x5BB9;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x540E;&#x9762;&#x4E66;&#x5199;&#x5B50;&#x5BB9;&#x5668;&#x7684;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/3" alt=""></p>
<p>&#x5F53;&#x4EE3;&#x7801;&#x91CF;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x76F8;&#x5F53;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x3002;</p>
<p><strong>3&#x3001;&#x6A21;&#x5757;&#x5316;&#x7BA1;&#x7406;&#x3001;&#x6613;&#x7EF4;&#x62A4;</strong></p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x505A;&#x4E2D;&#x3001;&#x5927;&#x578B;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F80;&#x5F80;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x6216;&#x8005;&#x6A21;&#x5757;&#xFF0C;&#x4F1A;&#x5728;&#x5F88;&#x591A;&#x9875;&#x9762;&#x90FD;&#x7528;&#x5230;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4EEC;&#x5355;&#x72EC;&#x7684;&#x653E;&#x5230;&#x6240;&#x6709;&#x9875;&#x9762;&#x5BF9;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x6B21;&#x4FEE;&#x6539;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x8981;&#x53BB;&#x6539;&#x6240;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4F4E;&#x6548;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x5B83;&#x4EEC;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x516C;&#x5171;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x6709;&#x5F88;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x5197;&#x4F59;&#xFF0C;&#x6216;&#x8BB8;&#xFF0C;&#x4F60;&#x4F1A;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5F15;&#x5165;&#x5230;&#x9875;&#x9762;&#x4E2D;&#xFF0C;&#x5C31;&#x884C;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x662F;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x591A;&#x51FA;&#x6765;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#xFF0C;&#x90A3;&#x4E48;&#x4ECE;&#x7EF4;&#x62A4;&#x6027;&#x548C;&#x6027;&#x80FD;&#x4E24;&#x65B9;&#x9762;&#x8003;&#x8651;&#x7684;&#x8BDD;&#xFF0C;&#x5C31;&#x5F97;&#x4E0D;&#x507F;&#x5931;&#x4E86;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x7684;@import&#x89C4;&#x5219;&#xFF0C;&#x628A;&#x590D;&#x7528;&#x4EE3;&#x7801;&#x6BB5;&#x63D0;&#x53D6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9700;&#x8981;&#x7684;&#x9875;&#x9762;&#x5F15;&#x5165;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x540C;&#x6837;&#x80FD;&#x8FBE;&#x5230;&#x201C;&#x4E00;&#x5904;&#x53D8;&#x3001;&#x5904;&#x5904;&#x53D8;&#x201D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x800C;&#x4E14;&#xFF0C;&#x4E0D;&#x4F1A;&#x6709;&#x591A;&#x4F59;&#x7684;&#x8BF7;&#x6C42;&#x53D1;&#x51FA;&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x53EF;&#x4EE5;&#x53EA;&#x6709;&#x4E00;&#x4E2A;css&#x6587;&#x4EF6;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/4" alt=""></p>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5C01;&#x88C5;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9700;&#x8981;&#x7684;&#x6587;&#x4EF6;&#x91CC;&#x5F15;&#x5165;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x6837;&#x65B9;&#x4FBF;&#x7EF4;&#x62A4;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x9875;&#x9762;&#x91CC;&#x653E;&#x591A;&#x4F59;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x3002;</p>
<p><strong>4&#x3001;Mixins</strong></p>
<p>&#x5728;css&#x4E2D;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x5199;&#x4E00;&#x4E9B;&#x4E0D;&#x60C5;&#x613F;&#xFF0C;&#x4F46;&#x53C8;&#x4E0D;&#x5F97;&#x4E0D;&#x53BB;&#x5199;&#x7684;&#x590D;&#x6742;&#x4EE3;&#x7801;&#x6BB5;&#xFF0C;&#x6700;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;CSS3&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4E3A;&#x4E86;&#x517C;&#x5BB9;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x52A0;&#x4E00;&#x5806;&#x6D4F;&#x89C8;&#x5668;&#x524D;&#x7F00;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x7684;&#x9891;&#x6B21;&#x8F83;&#x9AD8;&#xFF0C;&#x8FD9;&#x4ECD;&#x7136;&#x4F1A;&#x6210;&#x4E3A;&#x4E0D;&#x5C0F;&#x7684;&#x6210;&#x672C;&#x3002;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x63D2;&#x4EF6;&#x53BB;&#x5FEB;&#x901F;&#x8865;&#x5168;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x662F;&#x9700;&#x8981;&#x91CD;&#x590D;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x4F55;&#x4E0D;&#x8BA9;&#x6211;&#x4EEC;&#x53EA;&#x5199;&#x4E00;&#x6B21;&#x7136;&#x540E;&#x90FD;&#x590D;&#x7528;&#x4E4B;&#x5462;&#xFF1F;</p>
<p>Mixins&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x5C31;&#x662F;&#x5B9E;&#x73B0;&#x5927;&#x6BB5;&#x6837;&#x5F0F;&#x7684;&#x91CD;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x9700;&#x8981;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x4E8B;&#x5148;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x7136;&#x540E;&#x7ED9;&#x5176;&#x6570;&#x503C;&#x90E8;&#x5206;&#x8BBE;&#x7F6E;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x9700;&#x8981;&#x7528;&#x5230;&#x7C7B;&#x4F3C;&#x4E1C;&#x897F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x597D;&#x7684;mixin&#xFF0C;&#x5BF9;&#x4E8E;&#x5C3A;&#x5BF8;&#x5927;&#x5C0F;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4F20;&#x5165;&#x4E0D;&#x540C;&#x53C2;&#x6570;&#x5373;&#x53EF;&#x3002;</p>
<p><img src="/2016/06/27/less_sass/5" alt=""></p>
<p>&#x4E0A;&#x9762;&#x5217;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;css&#x5C5E;&#x6027;&#x91CC;&#x9762;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x5C40;&#x9650;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x4E5F;&#x662F;&#x5141;&#x8BB8;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x5927;&#x5BB6;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x6709;&#x4E2A;&#x56F0;&#x60D1;&#xFF0C;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#x6211;&#x662F;&#x9700;&#x8981;&#x4E25;&#x683C;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x4E66;&#x5199;&#x5417;&#xFF1F;&#x5176;&#x5B9E;&#x4E0D;&#x5FC5;&#xFF0C;sass&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;  $name: value &#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/6" alt=""></p>
<p>&#x53EA;&#x8981;&#x5BF9;&#x5E94;&#x7684;&#x8BBE;&#x7F6E;value&#x5C31;&#x597D;&#x3002;</p>
<p><strong>5&#x3001;extend&#x6269;&#x5C55;/&#x7EE7;&#x627F;</strong></p>
<p>&#x8FD9;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5904;&#x7406;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x4EAE;&#x70B9;&#xFF0C;&#x4F60;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x540E;&#x9762;&#x5982;&#x679C;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x9700;&#x8981;&#x7528;&#x5230;&#x548C;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x4E86;&#x7684;&#x7C7B;&#x540C;&#x6837;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;@extend&#x6765;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#xFF0C;&#x6765;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x5B83;&#x5B9A;&#x4E49;&#x8FC7;&#x7684;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x4E0D;&#x4F1A;&#x591A;&#x51FA;&#x6765;&#x5F88;&#x591A;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#x6BB5;&#x5417;&#xFF1F;&#x53EF;&#x80FD;&#x4F60;&#x8DDF;&#x6211;&#x6709;&#x8FC7;&#x540C;&#x6837;&#x7684;&#x56F0;&#x60D1;&#xFF0C;&#x5176;&#x5B9E;&#x5B83;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x7FA4;&#x7EC4;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x591A;&#x4E2A;&#x7C7B;&#x5171;&#x7528;&#x4E00;&#x6BB5;css&#x6837;&#x5F0F;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5728;&#x4F60;&#x60F3;&#x5B9A;&#x4E49;&#x6709;&#x5171;&#x6027;&#x53C8;&#x6709;&#x5DEE;&#x5F02;&#x7684;&#x4E00;&#x7EC4;&#x5143;&#x7D20;&#x65F6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5199;&#x591A;&#x4E2A;&#x7C7B;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5199;&#x5B83;&#x5355;&#x72EC;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x6211;&#x4E2A;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5199;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x5728;&#x6570;&#x91CF;&#x4E0D;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8DDF;&#x63D0;&#x53D6;&#x4E00;&#x4E2A;&#x57FA;&#x7C7B;&#xFF0C;&#x518D;&#x8FFD;&#x52A0;&#x6269;&#x5C55;&#x7C7B;&#x7684;&#x6210;&#x672C;&#x662F;&#x5DEE;&#x4E0D;&#x591A;&#x7684;&#x3002;&#x5E76;&#x663E;&#x793A;&#x4E0D;&#x51FA;&#x4F18;&#x52BF;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x662F;&#x591A;&#x5199;&#x4E86;&#x51E0;&#x4E2A;&#x7C7B;&#x5728;html&#x91CC;&#x8FD8;&#x662F;css&#x91CC;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x662F;html&#x7684;&#x91CD;&#x590D;&#x5355;&#x5143;&#x6570;&#x91CF;&#x5F88;&#x591A;&#xFF0C;&#x5DEE;&#x5F02;&#x9879;&#x53C8;&#x4E0D;&#x591A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F1A;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x9700;&#x8981;&#x6709;&#x8DDF;html&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x8FDB;&#x884C;&#x7ED1;&#x5B9A;&#x7684;&#x57FA;&#x7C7B;&#x4E86;&#x3002;&#x4EAE;&#x70B9;&#x5C31;&#x5728;&#x4E8E;&#x4F60;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x7684;&#x7C7B;&#xFF0C;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5230;html&#x91CC;&#x9762;&#x7684;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x4E4B;&#x524D;&#x7684;sass&#x5C42;&#x9762;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x6BB5;&#x516C;&#x5171;&#x5757;&#x4FBF;&#x4E8E;&#x5F15;&#x7528;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/7" alt=""></p>
<p><img src="/2016/06/27/less_sass/8" alt=""></p>
<p>&#x6B64;&#x5904;&#x201C;.error&#x201D;&#x8FD9;&#x4E2A;&#x7C7B;&#xFF0C;&#x5C31;&#x662F;sass&#x5C42;&#x9762;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x590D;&#x7528;&#x7C7B;&#xFF0C;&#x4E0D;&#x5FC5;&#x4F7F;&#x7528;&#x5728;html&#x4E2D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x6709;&#x5FC5;&#x8981;&#x53BB;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x4ECE;&#x6765;&#x4E0D;&#x9700;&#x8981;&#x5728;html&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x7C7B;&#xFF1F;&#x53EF;&#x80FD;&#x4F60;&#x89C9;&#x5F97;&#x5B83;&#x7684;&#x5F71;&#x54CD;&#x5FAE;&#x4E4E;&#x5176;&#x5FAE;&#xFF0C;&#x4F46;&#x4ECE;sass3.2&#x4E4B;&#x540E;&#xFF0C;&#x8FFD;&#x6C42;&#x6781;&#x81F4;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x8FD8;&#x662F;&#x7ED9;&#x51FA;&#x4E86;&#x5BF9;&#x5E94;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x201C;%placeholder&#x201D;&#xFF0C;&#x9009;&#x62E9;&#x5668;&#x5360;&#x4F4D;&#x7B26;&#xFF0C;&#x6709;&#x4E86;&#x5B83;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x4F5C;&#x7528;&#x7684;&#x7C7B;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x53BB;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x90FD;&#x968F;&#x4F60;~</p>
<p><strong>6&#x3001;&#x8FD0;&#x7B97;</strong></p>
<p>&#x6D89;&#x53CA;&#x5230;&#x8FD0;&#x7B97;&#x7684;&#xFF0C;&#x80AF;&#x5B9A;&#x5C31;&#x662F;&#x6570;&#x5B57;&#x76F8;&#x5173;&#xFF0C;&#x52A0;&#x51CF;&#x4E58;&#x9664;&#xFF0C;&#x90A3;&#x4E48;&#x80FD;&#x8FDB;&#x884C;&#x600E;&#x6837;&#x7684;&#x8FD0;&#x7B97;&#x5462;&#xFF1F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/9" alt=""></p>
<p>&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5C5E;&#x6027;&#x540D;&#x76F4;&#x63A5;&#x8BA1;&#x7B97;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x503C;&#xFF0C;&#x6570;&#x503C;&#x5F53;&#x4E2D;&#x7684;&#x5355;&#x4F4D;&#x9700;&#x8981;&#x7EDF;&#x4E00;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7F3A;&#x7701;&#xFF0C;&#x751A;&#x81F3;&#x4F60;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E2A;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x524D;&#x540E;&#x4E0D;&#x540C;&#xFF0C;&#x5C31;&#x4F1A;&#x62A5;&#x9519;&#x4E86;&#x3002;</p>
<p>&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF1A;</p>
<p>&#x731B;&#x4E00;&#x60F3;&#xFF0C;&#x6CA1;&#x6709;&#x54EA;&#x91CC;&#x9700;&#x8981;&#x7528;&#x5230;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x662F;&#x843D;&#x5165;&#x4E86;&#x60EF;&#x6027;&#x601D;&#x7EF4;&#x7684;&#x5708;&#x5B50;&#xFF0C;&#x5176;&#x5B9E;&#x5E73;&#x65F6;&#x7684;&#x5F88;&#x591A;&#x8BA1;&#x7B97;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x5FC3;&#x7B97;&#x6216;&#x8005;&#x8BA1;&#x7B97;&#x5668;&#x6765;&#x7B97;&#xFF0C;&#x7136;&#x540E;&#x5199;&#x5230;&#x6837;&#x5F0F;&#x91CC;&#x9762;&#x4E86;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x9700;&#x8981;&#x88AB;&#x51E0;&#x7B49;&#x5206;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x4E00;&#x9879;&#x9700;&#x8981;&#x591A;&#x5C11;&#xFF1B;&#x5F53;&#x4E00;&#x79CD;&#x5E03;&#x5C40;&#x9700;&#x8981;&#x4E00;&#x8FB9;&#x5B9A;&#x5BBD;&#x4E00;&#x8FB9;&#x81EA;&#x9002;&#x5E94;&#x65F6;&#xFF0C;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x8FD9;&#x8FB9;&#x5E94;&#x8BE5;&#x662F;&#x591A;&#x5BBD;&#x3002;&#x7B49;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD0;&#x7B97;&#x6765;&#x641E;&#x5B9A;&#x7684;&#xFF0C;&#x7EF4;&#x62A4;&#x8D77;&#x6765;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x4E9B;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x73B0;&#x5728;css3&#x5DF2;&#x7ECF;&#x52A0;&#x5165;&#x4E86;&#x201D;calc()&#x201D;&#x8FD9;&#x4E2A;&#x5177;&#x5907;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x4ECD;&#x4E0D;&#x652F;&#x6301;&#x5B83;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x9884;&#x5904;&#x7406;&#x5668;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x591F;&#x5F25;&#x8865;&#x8FD9;&#x4E00;&#x4E0D;&#x8DB3;&#x3002;</p>
<p><strong>7&#x3001;&#x51FD;&#x6570;</strong></p>
<p>&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5728;&#x5F88;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x91CC;&#x90FD;&#x6709;&#x51FD;&#x6570;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F46;&#x65E9;&#x671F;&#x7684;css&#x662F;&#x6CA1;&#x6709;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x9884;&#x5904;&#x7406;&#x5668;&#x5C31;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x51FD;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/10" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x5B9A;&#x4E49;&#x4E86;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x548C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x51FD;&#x6570;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x201C;$n&#x201D;,&#x901A;&#x8FC7;&#x7F16;&#x8BD1;&#xFF0C;&#x6267;&#x884C;&#x4E86;&#x51FD;&#x6570;&#x4E4B;&#x540E;&#xFF0C;&#x6709;&#x4E86;&#x53F3;&#x8FB9;&#x7684;css&#x4EE3;&#x7801;&#x3002;<br>&#x5F53;&#x7136;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x9884;&#x5904;&#x7406;&#x5668;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E9B;&#x5185;&#x7F6E;&#x51FD;&#x6570;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;</p>
<p><strong>&#x989C;&#x8272;&#x51FD;&#x6570;&#xFF1A;</strong></p>
<p> rgb($red,$green,$blue)&#xFF1A;&#x6839;&#x636E;&#x7EA2;&#x3001;&#x7EFF;&#x3001;&#x84DD;&#x4E09;&#x4E2A;&#x503C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#xFF1B;</p>
<p> rgba($red,$green,$blue,$alpha)&#xFF1A;&#x6839;&#x636E;&#x7EA2;&#x3001;&#x7EFF;&#x3001;&#x84DD;&#x548C;&#x900F;&#x660E;&#x5EA6;&#x503C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#xFF1B;</p>
<p> red($color)&#xFF1A;&#x4ECE;&#x4E00;&#x4E2A;&#x989C;&#x8272;&#x4E2D;&#x83B7;&#x53D6;&#x5176;&#x4E2D;&#x7EA2;&#x8272;&#x503C;&#xFF1B;</p>
<p><strong>&#x6570;&#x5B57;&#x51FD;&#x6570;&#xFF1A;</strong></p>
<p> percentage($value)&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x4E0D;&#x5E26;&#x5355;&#x4F4D;&#x7684;&#x6570;&#x8F6C;&#x6362;&#x6210;&#x767E;&#x5206;&#x6BD4;&#x503C;&#xFF1B;</p>
<p> round($value)&#xFF1A;&#x5C06;&#x6570;&#x503C;&#x56DB;&#x820D;&#x4E94;&#x5165;&#xFF0C;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x6574;&#x6570;&#xFF1B;</p>
<p> ceil($value)&#xFF1A;&#x5C06;&#x5927;&#x4E8E;&#x81EA;&#x5DF1;&#x7684;&#x5C0F;&#x6570;&#x8F6C;&#x6362;&#x6210;&#x4E0B;&#x4E00;&#x4F4D;&#x6574;&#x6570;&#xFF1B;</p>
<p> floor($value)&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x53BB;&#x9664;&#x4ED6;&#x7684;&#x5C0F;&#x6570;&#x90E8;&#x5206;&#xFF1B;</p>
<p>&#x4EE5;&#x4E0A;&#x5217;&#x51FA;&#x7684;&#x662F;sass&#x4E2D;&#x6709;&#x7684;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x4F3C;&#x66FE;&#x76F8;&#x8BC6;&#xFF1F;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x975E;&#x5E38;&#x591A;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x591A;&#x5230;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#x5462;&#xFF0C;&#x591A;&#x5230;&#x4F60;&#x6000;&#x7591;&#x5B83;&#x4EEC;&#x662F;&#x7528;&#x6765;&#x5E72;&#x561B;&#x7684;~&#x6709;&#x5174;&#x8DA3;&#xFF0C;&#x53EF;&#x4EE5;&#x8F7B;&#x6233;&#x8FD9;&#x91CC;&#x4E86;&#x89E3;<a href="http://sass-lang.com/documentation/Sass/Script/Functions.html" target="_blank" rel="external">http://sass-lang.com/documentation/Sass/Script/Functions.html</a></p>
<p>&#x662F;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x9F13;&#x52B1;&#x5927;&#x5BB6;&#x7528;&#x9884;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#xFF0C;&#x5E73;&#x65F6;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x7528;&#x4E0D;&#x5230;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5927;&#x5BB6;&#x5927;&#x6982;&#x77E5;&#x9053;&#x5C31;&#x597D;&#x3002;</p>
<p><strong>8&#x3001;&#x6761;&#x4EF6;&#x5224;&#x65AD;</strong></p>
<p>&#x63D0;&#x8D77;&#x6761;&#x4EF6;&#x5224;&#x65AD;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x60F3;&#x5230;if&#x2026;else&#x2026;&#x90A3;&#x4E48;&#xFF0C;css&#x4E2D;&#x6709;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x5730;&#x65B9;&#xFF1F;&#x521A;&#x5F00;&#x59CB;&#x6211;&#x4E5F;&#x662F;&#x89C9;&#x5F97;&#x6CA1;&#x6709;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x9700;&#x8981;&#x5224;&#x65AD;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4EA4;&#x7ED9;js&#x53BB;&#x505A;&#x4E86;&#xFF0C;&#x5BF9;&#x5427;&#xFF1F;&#x6240;&#x4EE5;&#xFF0C;&#x8FD8;&#x662F;&#x6709;&#x7528;&#x6B66;&#x4E4B;&#x5730;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<p>&#x5F53;&#x6D4F;&#x89C8;&#x5668;&#x7248;&#x672C;&#x4F4E;&#x4E8E;IE9&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7528;&#x54EA;&#x6BB5;&#x6837;&#x5F0F;&#xFF1B;&#x5F53;&#x6211;&#x4EEC;&#x67D0;&#x4E2A;&#x5143;&#x7D20;&#x9700;&#x8981;&#x5207;&#x6362;&#x72B6;&#x6001;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7528;&#x54EA;&#x6BB5;&#x6837;&#x5F0F;&#x3002;&#x7B49;&#x7B49;&#x3002;&#x5C31;&#x50CF;&#x4E0B;&#x9762;&#x8FD9;&#x6837;&#x3002;</p>
<p><img src="/2016/06/27/less_sass/11" alt=""></p>
<p><strong>9&#x3001;&#x5FAA;&#x73AF;</strong></p>
<p>&#x5FAA;&#x73AF;&#x7684;&#x51FA;&#x73B0;&#x610F;&#x5473;&#x7740;&#x5B58;&#x5728;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5728;Sass&#x4E2D;&#x7684;&#x590D;&#x6742;&#x903B;&#x8F91;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x5FAA;&#x73AF;&#x4E4B;&#x524D;&#xFF0C;&#x52A1;&#x5FC5;&#x786E;&#x5B9A;&#x8FD9;&#x4E48;&#x505A;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x786E;&#x8BA4;&#x8FD9;&#x4E48;&#x505A;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F1A;&#x597D;&#x5947;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x54EA;&#x91CC;&#x5FAA;&#x73AF;&#xFF0C;&#x7528;&#x6765;&#x5E72;&#x561B;&#xFF1F;</p>
<p>&#x8BF4;&#x5B9E;&#x8BDD;&#xFF0C;&#x4E00;&#x65F6;&#x80FD;&#x60F3;&#x5230;&#x7684;&#x7528;&#x5904;&#x771F;&#x7684;&#x4E0D;&#x591A;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7528;&#x5230;&#x5B83;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x5B9E;&#x548C;js&#x91CC;&#x9762;&#x7684;&#x5FAA;&#x73AF;&#x7528;&#x9014;&#x7C7B;&#x4F3C;&#xFF0C;&#x9700;&#x8981;&#x5904;&#x7406;&#x4E00;&#x7EC4;&#x6709;&#x7740;&#x76F8;&#x540C;&#x6027;&#x8D28;&#x4E14;&#x6709;&#x89C4;&#x5F8B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#x7684;li&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x683C;&#x7684;tr&#x3001;td&#xFF0C;&#x6216;&#x8005;&#x8F83;&#x6709;&#x89C4;&#x5F8B;&#x7684;&#x96EA;&#x78A7;&#x56FE;&#xFF0C;&#x518D;&#x6216;&#x8005;&#xFF0C;&#x4F60;&#x5728;&#x81EA;&#x5DF1;&#x80FD;&#x591F;&#x9A7E;&#x9A6D;&#x7684;&#x8303;&#x56F4;&#x5185;&#x81EA;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x6216;&#x5C5E;&#x6027;&#x503C;&#x5217;&#x8868;&#x3002;<br>&#x6BD4;&#x5982;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/12" alt=""></p>
<p>&#x54C7;&#x5076;&#xFF0C;&#x9177;&#x6BD9;&#x4E86;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x4E9B;&#x6CA1;&#x60F3;&#x5230;&#x8FD8;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#xFF1F;&#x5176;&#x5B9E;&#x4ECE;&#x8FD9;&#x91CC;&#x9762;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x660E;&#x663E;&#x7684;&#x770B;&#x51FA;css&#x548C;&#x4E00;&#x4E9B;&#x4F20;&#x7EDF;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x5DEE;&#x8DDD;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x91CD;&#x590D;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x53EA;&#x505A;&#x4E00;&#x6B21;&#x3002;</p>
<h2 id="&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x4F60;&#x8FD8;&#x5728;&#x72B9;&#x8C6B;&#xFF1F;&#x6211;&#x731C;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x5904;&#x56F0;&#x60D1;"><a href="#&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x4F60;&#x8FD8;&#x5728;&#x72B9;&#x8C6B;&#xFF1F;&#x6211;&#x731C;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x5904;&#x56F0;&#x60D1;" class="headerlink" title="&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x4F60;&#x8FD8;&#x5728;&#x72B9;&#x8C6B;&#xFF1F;&#x6211;&#x731C;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x5904;&#x56F0;&#x60D1;"></a>&#x662F;&#x4EC0;&#x4E48;&#x8BA9;&#x4F60;&#x8FD8;&#x5728;&#x72B9;&#x8C6B;&#xFF1F;&#x6211;&#x731C;&#x4F60;&#x53EF;&#x80FD;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x5904;&#x56F0;&#x60D1;</h2><p><strong>1&#x3001;&#x53D8;&#x91CF;&#x7684;&#x7279;&#x6B8A;&#x5316;</strong></p>
<p>&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x662F;&#x6211;&#x672C;&#x4EBA;&#xFF0C;&#x4E5F;&#x662F;&#x540C;&#x4E8B;&#xFF0C;&#x90FD;&#x5B58;&#x5728;&#x8FC7;&#x7684;&#x987E;&#x8651;&#x2014;&#x2014;&#x6211;&#x73B0;&#x5728;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5168;&#x7AD9;&#x90FD;&#x7528;&#xFF0C;&#x90A3;&#x5982;&#x679C;&#x6211;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x5176;&#x4E2D;&#x4E00;&#x5904;&#xFF0C;&#x6216;&#x8005;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x975E;&#x8981;&#x6539;&#x6389;&#x5176;&#x4E2D;&#x4E00;&#x5904;&#xFF0C;&#x600E;&#x4E48;&#x529E;&#xFF1F;</p>
<p>&#x66FE;&#x7ECF;&#xFF0C;&#x6211;&#x4EE5;&#x4E3A;&#x8FD9;&#x4E2A;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#xFF0C;&#x540E;&#x6765;&#x624D;&#x77E5;&#x9053;&#x662F;&#x6D45;&#x5C1D;&#x8F84;&#x6B62;&#x5C31;&#x5426;&#x5B9A;&#x5B83;&#x3002;&#x771F;&#x5B9E;&#x60C5;&#x51B5;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/13" alt=""></p>
<p>&#x4ECE;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;sass&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x641E;&#x5B9A;&#x8FD9;&#x79CD;&#x7279;&#x6B8A;&#x5316;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x548C;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x548C;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x91CC;&#x7684;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;~&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;</p>
<p><strong>2&#x3001;&#x4F2A;&#x7C7B;&#x3001;&#x4F2A;&#x5143;&#x7D20;&#x3001;&#x5BB9;&#x5668;&#x5916;&#x90E8;&#x5D4C;&#x5957;&#xFF0C;&#x8FD9;&#x4E9B;&#x600E;&#x4E48;&#x529E;&#xFF1F;</strong></p>
<p>&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;&#xFF0C;&#x4E00;&#x4E2A;&#x201C;&amp;&#x201D;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5566;&#xFF01;&#x4E0B;&#x9762;&#x770B;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p><img src="/2016/06/27/less_sass/14" alt=""><br>&#x8FD9;&#x662F;&#x4F2A;&#x7C7B;&#x548C;&#x4F2A;&#x5143;&#x7D20;&#xFF0C;&#x90A3;&#x4E48;&#x5BB9;&#x5668;&#x7684;&#x5916;&#x90E8;&#x5D4C;&#x5957;&#x5462;&#xFF1F;&#x8FD9;&#x4E2A;&#x76F8;&#x4FE1;&#x4F60;&#x4E5F;&#x6709;&#x60F3;&#x8FC7;&#x5BF9;&#x4E48;&#xFF0C;&#x5F53;&#x6211;&#x5199;&#x4E86;&#x4E00;&#x5927;&#x4E32;&#x7684;&#x5D4C;&#x5957;&#x4E4B;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x5728;&#x5916;&#x90E8;&#x52A0;&#x7236;&#x5BB9;&#x5668;&#x8FDB;&#x884C;&#x9650;&#x5236;&#x7684;&#x8BDD;&#xFF0C;&#x96BE;&#x9053;&#x8FD8;&#x8981;&#x5728;&#x5916;&#x9762;&#x5957;&#x4E00;&#x5C42;&#x5417;&#xFF0C;&#x663E;&#x5F97;&#x592A;low&#x4E86;&#x5427;&#xFF0C;&#x5176;&#x5B9E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/15" alt=""><br>&#x53EA;&#x8981;&#x628A;&#x4F60;&#x60F3;&#x8981;&#x5957;&#x5728;&#x5916;&#x9762;&#x7684;&#x9009;&#x62E9;&#x5668;&#x5199;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x201C;&amp;&#x201D;&#x5C31;&#x53EF;&#x4EE5;&#x641E;&#x5B9A;&#x4E86;&#x3002;</p>
<p><strong>3&#x3001;&#x9009;&#x62E9;&#x5668;&#x5C42;&#x7EA7;&#x8FC7;&#x591A;</strong></p>
<p>&#x4F7F;&#x7528;&#x8FC7;&#x9884;&#x5904;&#x7406;&#x5668;&#x7684;&#x4EBA;&#xFF0C;&#x5E94;&#x8BE5;&#x90FD;&#x6709;&#x8FC7;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x62C5;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5D4C;&#x5957;&#x662F;&#x5F88;&#x968F;&#x610F;&#x4E14;&#x8F7B;&#x677E;&#x7684;&#xFF0C;&#x5199;&#x4E00;&#x4E2A;&#x6700;&#x5916;&#x9762;&#x7684;&#x7236;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x4E00;&#x5C42;&#x5C42;&#x7684;&#x5F80;&#x91CC;&#x5957;&#x4E86;&#xFF0C;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#xFF0C;&#x751F;&#x6210;&#x7684;css&#x4EE3;&#x7801;&#x51FA;&#x73B0;&#x5C42;&#x7EA7;&#x8FC7;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5176;&#x5B9E;&#x5C31;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x8BDD;&#xFF0C;&#x4E2A;&#x4EBA;&#x4EE5;&#x4E3A;&#xFF0C;&#x9996;&#x5148;&#x8981;&#x4ECE;&#x6E90;&#x5934;&#x89E3;&#x51B3;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x6E90;&#x5934;&#xFF0C;&#x5C31;&#x662F;&#x4F60;&#x5BF9;&#x81EA;&#x5DF1;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x7684;&#x89C4;&#x5212;&#xFF0C;html&#x7ED3;&#x6784;&#x7684;&#x5408;&#x7406;&#x7CBE;&#x7B80;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x591A;&#x4E8E;4&#x5C42;&#x7684;&#x5BB9;&#x5668;&#x5D4C;&#x5957;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x662F;&#x4ECE;&#x9875;&#x9762;&#x5BB9;&#x5668;&#x5230;&#x6700;&#x91CC;&#x9762;&#x4E00;&#x5C42;&#x6570;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x8D85;&#x8FC7;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x5F88;&#x5927;&#x4E86;&#xFF0C;&#x4F46;&#x89C9;&#x5F97;&#x6CA1;&#x591A;&#x5C11;&#x4EBA;&#x4F1A;&#x8FD9;&#x4E48;&#x53BB;&#x5199;&#x5427;&#xFF1F;&#x6240;&#x4EE5;&#xFF0C;&#x6309;&#x7167;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x7EC4;&#x4EF6;&#x5316;&#x7684;&#x601D;&#x60F3;&#x53BB;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5C42;&#x7EA7;&#x8FC7;&#x591A;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>4&#x3001;&#x751F;&#x6210;&#x5197;&#x4F59;&#x4EE3;&#x7801;</strong></p>
<p>&#x8FD9;&#x4E00;&#x70B9;&#x662F;&#x6211;&#x770B;&#x5230;sass&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x590D;&#x7528;&#x4FBF;&#x5229;&#x4E4B;&#x540E;&#x7684;&#x76F4;&#x63A5;&#x53CD;&#x5E94;&#xFF0C;&#x5982;&#x679C;&#x590D;&#x7528;&#x8D77;&#x6765;&#x90A3;&#x4E48;&#x5BB9;&#x6613;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4E0D;&#x4F1A;&#x592A;&#x4F9D;&#x8D56;&#x4E4B;&#xFF0C;&#x53CD;&#x800C;&#x751F;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x6CA1;&#x5FC5;&#x8981;&#x7684;&#x5197;&#x4F59;&#x4EE3;&#x7801;&#x6BB5;&#x5462;&#xFF1F;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;sass&#x7684;&#x786E;&#x662F;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x65B9;&#x6848;&#x7684;&#xFF0C;&#x4ECE;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x5427;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x53BB;&#x628A;&#x63A7;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p><strong>mixin&#xFF0C;&#x4F55;&#x65F6;&#x4F7F;&#x7528;mixin&#xFF1F;</strong></p>
<p>&#x5148;&#x6765;&#x4E00;&#x6BB5;&#x5B98;&#x65B9;&#x63CF;&#x8FF0;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5728;&#x4E0D;&#x505C;&#x5730;&#x91CD;&#x590D;&#x4E00;&#x6BB5;&#x6837;&#x5F0F;&#xFF0C;&#x90A3;&#x5C31;&#x5E94;&#x8BE5;&#x628A;&#x8FD9;&#x6BB5;&#x6837;&#x5F0F;&#x6784;&#x9020;&#x6210;&#x4F18;&#x826F;&#x7684;&#x6DF7;&#x5408;&#x5668;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x8FD9;&#x6BB5;&#x6837;&#x5F0F;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x5355;&#x5143;&#x3002;&#x518D;&#x4E3A;&#x5176;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5C55;&#x793A;&#x6027;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x80FD;&#x591F;&#x6E05;&#x6670;&#x660E;&#x4E86;&#x7684;&#x770B;&#x51FA;&#x5B83;&#x662F;&#x7528;&#x6765;&#x5E72;&#x561B;&#x7684;&#x3002;</p>
<p>&#x663E;&#x7136;&#xFF0C;&#x4F60;&#x9996;&#x5148;&#x4F1A;&#x60F3;&#x5230;&#x7684;&#x662F;&#x9700;&#x8981;&#x5404;&#x79CD;&#x6D4F;&#x89C8;&#x5668;&#x5382;&#x5546;&#x524D;&#x7F00;&#x7684;CSS3&#x4EE3;&#x7801;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#xFF0C;mixin&#x672C;&#x8EAB;&#x4E0D;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x5230;css&#x4EE3;&#x7801;&#x4E2D;&#x3002;<br>&#x5728;&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4E2A;&#x4EBA;&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x8D5E;&#x540C;&#x8FD9;&#x79CD;&#x201C;&#x91CD;&#x590D;&#x6837;&#x5F0F;&#x5C31;&#x6784;&#x9020;&#x6DF7;&#x5408;&#x5668;&#x201D;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x6743;&#x5F53;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x529F;&#x80FD;&#x63CF;&#x8FF0;&#xFF0C;&#x5728;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x3002;&#x5B9E;&#x9645;&#x5F53;&#x4E2D;&#xFF0C;&#x4E2A;&#x4EBA;&#x66F4;&#x503E;&#x5411;&#x4E8E;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5E38;&#x7528;&#x4EE3;&#x7801;&#x5E93;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E3A;&#x7ED3;&#x6784;&#x6DFB;&#x52A0;&#x53EF;&#x7528;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x6837;&#x65E2;&#x65B9;&#x4FBF;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x9020;&#x6210;&#x660E;&#x663E;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x591A;&#x4E2A;&#x5730;&#x65B9;&#x4E0D;&#x65AD;&#x5728;&#x91CD;&#x590D;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x6BB5;&#x3002;</p>
<p>&#x9002;&#x5408;&#x4F7F;&#x7528;mixin&#x7684;&#x5730;&#x65B9;&#x5728;&#x6211;&#x770B;&#x6765;&#x662F;&#x5E94;&#x8BE5;&#x5B58;&#x5728;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6BCF;&#x5904;&#x7684;&#x5706;&#x89D2;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x6BCF;&#x5904;&#x7684;&#x9634;&#x5F71;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x6BCF;&#x5904;&#x7684;&#x6E10;&#x53D8;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x4E0D;&#x4E00;&#x6837;&#x65F6;&#xFF0C;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x53EA;&#x662F;&#x6570;&#x503C;&#x6539;&#x53D8;&#xFF0C;&#x800C;&#x6027;&#x8D28;&#x672A;&#x53D8;&#xFF0C;&#x8FD9;&#x5C31;&#x9002;&#x5408;&#x4F7F;&#x7528;&#x5E26;&#x53C2;&#x6570;&#x7684;mixin&#x6765;&#x641E;&#x5B9A;&#x4E86;&#x3002;</p>
<p><strong>extend&#x7EE7;&#x627F;&#x7684;&#x5DE5;&#x4F5C;&#x7EC6;&#x8282;</strong>     </p>
<p>&#x8DDF;&#x53D8;&#x91CF;&#x548C;&#x6DF7;&#x5408;&#x5668;&#x4E0D;&#x540C;&#xFF0C;&#x7EE7;&#x627F;&#x4E0D;&#x662F;&#x4EC5;&#x4EC5;&#x7528;&#x6837;&#x5F0F;&#x66FF;&#x6362;@extend&#x5904;&#x7684;&#x4EE3;&#x7801;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x7EE7;&#x627F;&#x53EA;&#x4F1A;&#x5728;&#x751F;&#x6210;CSS&#x65F6;&#x590D;&#x5236;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x590D;&#x5236;&#x5927;&#x6BB5;&#x7684;CSS&#x5C5E;&#x6027;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x9762;&#x5DF2;&#x7ECF;&#x8BF4;&#x8FC7;&#x4E86;&#xFF0C;&#x8FD9;&#x91CC;&#x518D;&#x63D0;&#x53CA;&#x4E00;&#x4E0B;&#x3002;</p>
<p><strong>5&#x3001;@import&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF1F;</strong></p>
<p>&#x5982;&#x679C;&#x4F60;&#x6709;&#x8FD9;&#x4E2A;&#x7591;&#x95EE;&#xFF0C;&#x90A3;&#x4E48;&#x53C8;&#x5148;&#x5165;&#x4E3A;&#x4E3B;&#x4E86;&#x54C8;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5148;&#x6765;&#x56DE;&#x987E;&#x4E00;&#x4E0B;CSS&#x7684;&#x201C;@import&#x201D;&#x4F1A;&#x5E26;&#x6765;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x6027;&#x80FD;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x90FD;&#x8BF4;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x4F7F;&#x7528;@import&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x505A;&#x4F1A;&#x5BFC;&#x81F4;CSS&#x65E0;&#x6CD5;&#x5E76;&#x884C;&#x52A0;&#x8F7D;&#xFF0C;&#x4F7F;&#x7528;@import&#x5F15;&#x7528;&#x7684;&#x6587;&#x4EF6;&#x53EA;&#x6709;&#x5728;&#x5F15;&#x7528;&#x5B83;&#x7684;&#x90A3;&#x4E2A;css&#x6587;&#x4EF6;&#x88AB;&#x4E0B;&#x8F7D;&#x3001;&#x89E3;&#x6790;&#x4E4B;&#x540E;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x624D;&#x4F1A;&#x77E5;&#x9053;&#x8FD8;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x4E2A;css&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#xFF0C;&#x8FD9;&#x65F6;&#x624D;&#x53BB;&#x4E0B;&#x8F7D;&#x3002;</p>
<p>&#x597D;&#x7684;&#xFF0C;&#x539F;&#x56E0;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x6709;&#x95EE;&#x9898;&#x54B1;&#x4EEC;&#x5C31;&#x6709;&#x5BF9;&#x7B56;&#x662F;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#x6240;&#x6709;&#x6837;&#x5F0F;&#x89C4;&#x5219;&#x4E4B;&#x524D;&#x5F15;&#x7528;&#x4E0D;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF1F;&#x800C;&#x4E14;&#x518D;&#x9000;&#x4E00;&#x6B65;&#x8BF4;&#xFF0C;&#x8C01;&#x544A;&#x8BC9;&#x4F60;sass&#x7F16;&#x8BD1;&#x5B8C;&#x4E86;&#x4E4B;&#x540E;&#x8FD8;&#x5B58;&#x5728;@import&#x8FD9;&#x4E48;&#x4E2A;&#x4E1C;&#x897F;&#x7684;&#xFF1F;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x5728;&#x7F16;&#x8BD1;&#x4E4B;&#x524D;&#x65B9;&#x4FBF;&#x6211;&#x4EEC;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x800C;&#x5DF2;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x89C9;&#x5F97;&#x4E0A;&#x5F53;&#x4E86;&#xFF1F;~&#x6240;&#x4EE5;&#xFF0C;&#x5B8C;&#x5168;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x54AF;&#x3002;</p>
<h2 id="&#x4F60;&#x53EF;&#x80FD;&#x5FFD;&#x7565;&#x7684;&#x4E00;&#x4E9B;&#x70B9;"><a href="#&#x4F60;&#x53EF;&#x80FD;&#x5FFD;&#x7565;&#x7684;&#x4E00;&#x4E9B;&#x70B9;" class="headerlink" title="&#x4F60;&#x53EF;&#x80FD;&#x5FFD;&#x7565;&#x7684;&#x4E00;&#x4E9B;&#x70B9;"></a>&#x4F60;&#x53EF;&#x80FD;&#x5FFD;&#x7565;&#x7684;&#x4E00;&#x4E9B;&#x70B9;</h2><p><strong>1&#x3001;&#x5C5E;&#x6027;&#x5D4C;&#x5957;</strong></p>
<p>&#x4F60;&#x5F88;&#x5BB9;&#x6613;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x9009;&#x62E9;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5D4C;&#x5957;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x4E0D;&#x4EC5;&#x662F;&#x9009;&#x62E9;&#x5668;&#xFF0C;&#x5C5E;&#x6027;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#x7684;&#x54E6;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/16" alt=""></p>
<p><img src="/2016/06/27/less_sass/17" alt=""></p>
<p><strong>2&#x3001;!default&#x3001;!global</strong></p>
<p>&#x5199;css&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x90FD;&#x4F1A;&#x9762;&#x4E34;&#x7740;&#x4E00;&#x4E9B;&#x7EF4;&#x62A4;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x7C7B;&#x540D;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x51B2;&#x7A81;&#x7684;&#x907F;&#x514D;&#xFF0C;sass&#x53EA;&#x662F;&#x53D8;&#x7740;&#x6CD5;&#x7684;&#x5728;&#x5199;css&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x95EE;&#x9898;&#x662F;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x56E2;&#x961F;&#x5408;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x3002;&#x6240;&#x4EE5;&#x5F53;&#x4F60;&#x7ED9;&#x5B9A;&#x4E49;&#x53D8;&#x91CF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ED9;&#x53D8;&#x91CF;&#x52A0;&#x4E0A;&#x4E86;!default&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x8005;&#x5B9A;&#x4E49;&#x4E86;&#x81EA;&#x5DF1;&#x8981;&#x7528;&#x7684;&#x53D8;&#x91CF;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x5F15;&#x5165;&#x4E86;&#x4F60;&#x7684;&#x5E93;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x62C5;&#x5FC3;&#x4E8C;&#x8005;&#x6709;&#x51B2;&#x7A81;&#xFF0C;&#x6BD4;&#x5982;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/18" alt=""></p>
<p><img src="/2016/06/27/less_sass/19" alt=""></p>
<p>&#x54EA;&#x91CC;&#x4E0D;&#x5BF9;&#x52B2;&#x5462;&#xFF0C;&#x5199;&#x5728;&#x540E;&#x9762;&#x7684;&#x53D8;&#x91CF;&#x6743;&#x91CD;&#x53CD;&#x800C;&#x66F4;&#x4F4E;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#xFF01;default&#x7684;&#x4F5C;&#x7528;&#x5728;&#x8FD9;&#x91CC;&#x5C31;&#x662F;&#x964D;&#x7EA7;&#x8BA9;&#x8DEF;&#xFF0C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x53D8;&#x91CF;&#x503C;&#xFF0C;&#x522B;&#x7684;&#x503C;&#x90FD;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x5B83;&#x3002;</p>
<p>&#x800C;&#x201D;!global&#x201D;&#x7684;&#x4F5C;&#x7528;&#x6070;&#x6070;&#x76F8;&#x53CD;&#xFF0C;&#x662F;&#x7528;&#x6765;&#x5347;&#x7EA7;&#x8986;&#x76D6;&#xFF0C;&#x56DE;&#x5230;&#x524D;&#x9762;&#x770B;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x518D;&#x6765;&#x770B;</p>
<p><img src="/2016/06/27/less_sass/20" alt=""></p>
<p>&#x672C;&#x6765;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x53EA;&#x662F;&#x5728;&#x5C40;&#x90E8;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x662F;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x5168;&#x5C40;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x52A0;&#x4E0A;&#x4E86;&#x201C;!global&#x201D;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;.sub-wrap-three&#x7684;&#x503C;&#x53D8;&#x6210;&#x4E86;.sub-wrap-two&#x91CC;&#x9762;&#x5B9A;&#x4E49;&#x7684;300px&#x3002;</p>
<p><strong>3&#x3001; &#x5D4C;&#x5957;&#x5BFC;&#x5165;</strong></p>
<p>&#x901A;&#x8FC7;&#x524D;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#xFF0C;sass&#x662F;&#x53EF;&#x4EE5;&#x5BFC;&#x5165;&#x6211;&#x4EEC;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#x7684;&#x6A21;&#x5757;&#x6837;&#x5F0F;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x6B62;&#x5982;&#x6B64;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5728;&#x5B9A;&#x4E49;&#x7684;&#x6837;&#x5F0F;&#x5F53;&#x4E2D;&#x8FDB;&#x884C;&#x5BFC;&#x5165;&#x3002;&#x6BD4;&#x5982;&#x8FD9;&#x6837;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/21" alt=""></p>
<p><img src="/2016/06/27/less_sass/22" alt=""><br><strong>4&#x3001;list&#x548C;map</strong></p>
<p>&#x5176;&#x5B9E;&#x4E0A;&#x9762;&#x90A3;&#x4E48;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x8DB3;&#x4EE5;&#x4EE4;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4ED4;&#x5934;&#x5927;&#x4E86;&#xFF0C;&#x53EF;&#x662F;sass&#x4ECD;&#x4E0D;&#x6B62;&#x8FD9;&#x4E9B;&#xFF0C;&#x8FD8;&#x6709;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;list&#x548C;map&#x3002;</p>
<p>list&#xFF0C;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;js&#x4E2D;&#x7684;&#x6570;&#x7EC4;&#x3002;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x4E00;&#x7EC4;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x548C;&#x4F7F;&#x7528;&#x7684;&#x503C;&#x3002;&#x6BD4;&#x5982;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/23" alt=""><br>map&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x6620;&#x5C04;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x8DDF;&#x4EC0;&#x4E48;&#x5DEE;&#x4E0D;&#x591A;&#x5462;&#xFF0C;&#x4F60;&#x731C;&#x5BF9;&#x4E86;&#xFF0C;json~&#x6BD4;&#x5982;&#xFF1A;</p>
<p><img src="/2016/06/27/less_sass/24" alt=""><br><strong>5&#x3001;&#x8B66;&#x544A;&#x548C;&#x9519;&#x8BEF;</strong></p>
<p>&#x4EC0;&#x4E48;&#x9B3C;&#xFF0C;&#x8FD8;&#x6709;&#x5B8C;&#x6CA1;&#x5B8C;&#xFF1F;&#x8FD9;&#x4E9B;&#x53C8;&#x662F;&#x7528;&#x6765;&#x5E72;&#x561B;&#x7684;&#xFF1F;</p>
<p>@debug;  @warn;  @error&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E09;&#x4F4D;&#x3002;<br>@debug&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x4F5C;&#x8C03;&#x8BD5; SassScript&#xFF0C;&#x8FD9;&#x4E2A;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x91CD;&#x70B9;&#x3002;<br>@warn&#xFF0C;&#x548C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x7684;&#x8BA4;&#x77E5;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x4E0D;&#x4F1A;&#x628A;&#x7A0B;&#x5E8F;&#x7ED9;&#x5361;&#x4F4F;&#x65E0;&#x6CD5;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x662F;&#x80FD;&#x591F;&#x9884;&#x6D4B;&#x98CE;&#x9669;&#x5E76;&#x63D0;&#x9192;&#x5F00;&#x53D1;&#x8005;&#x3002;<br>@error&#xFF0C;&#x5C06;&#x4F1A;&#x4E2D;&#x65AD;&#x7F16;&#x8BD1;&#x5668;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x8FDB;&#x7A0B;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x5B83;&#x4EEC;&#x4E2D;&#x65AD;&#x7F16;&#x8BD1;&#x5E76;&#x50CF;&#x5806;&#x6808;&#x8DDF;&#x8E2A;&#x4E00;&#x6837;&#x5728;&#x8F93;&#x51FA;&#x6D41;&#x4E2D;&#x663E;&#x793A;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x5BF9;&#x8C03;&#x8BD5;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
<h2 id="&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#xFF1F;"><a href="#&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#xFF1F;" class="headerlink" title="&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#xFF1F;"></a>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x8BE5;&#x5982;&#x4F55;&#x9009;&#x62E9;&#xFF1F;</h2><p>&#x5148;&#x6765;&#x770B;&#x770B;&#x7B80;&#x53F2;&#xFF1A;</p>
<p>Sass &#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#x8FD8;&#x8981;&#x8FFD;&#x6EAF;&#x5230;&#x8DDD;&#x4ECA;&#x516B;&#x5E74;&#x4E4B;&#x4E45;&#x7684; 2006 &#x5E74;&#x5E95;&#x3002;&#x7531;Ruby&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x3002;</p>
<p>Less &#x7531; Alexis Sellier &#x4E8E; 2009 &#x5E74;&#x521B;&#x5EFA;&#x3002;&#x4F7F;&#x7528;js&#x7F16;&#x5199;&#x3002;&#x65E2;&#x53EF;&#x4EE5;&#x5728; &#x5BA2;&#x6237;&#x7AEF; &#x4E0A;&#x8FD0;&#x884C; (&#x652F;&#x6301;IE 6+, Webkit, Firefox)&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x501F;&#x52A9;Node.js&#x6216;&#x8005;Rhino&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x8FD0;&#x884C;&#x3002;</p>
<p>stylus&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x63D0;&#x4EA4;&#x662F;&#x5728;2010&#x5E74;11&#x6708;&#x3002;&#x6765;&#x81EA;Node.js&#x793E;&#x533A;&#x3002;</p>
<p>&#x4ECE;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x7EBF;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;sass&#x6700;&#x65E9;&#xFF0C;&#x76EE;&#x524D;&#x4E09;&#x8005;&#x90FD;&#x6709;&#x4EBA;&#x4F7F;&#x7528;&#x3002;&#x5176;&#x4E2D;&#xFF0C;sass&#x548C;less&#x90FD;&#x6709;&#x5B98;&#x7F51;&#x7684;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x3002;<br>&#x5982;&#x4E0B;&#xFF1A;</p>
<p>sass <a href="http://www.sass.hk/" target="_blank" rel="external">http://www.sass.hk/</a>                  sass&#x8BBE;&#x8BA1;&#x6307;&#x5357;   <a href="http://sass-guidelin.es/zh/" target="_blank" rel="external">http://sass-guidelin.es/zh/</a><br>less  <a href="http://less.bootcss.com/" target="_blank" rel="external">http://less.bootcss.com/</a><br>&#x800C;stylus&#x6CA1;&#x6709;&#xFF0C;&#x53EA;&#x6709;&#x5F20;&#x946B;&#x65ED;&#x65E9;&#x5728;2012&#x5E74;&#x7FFB;&#x8BD1;&#x7684;&#x4E2D;&#x6587;&#x6587;&#x6863;  <a href="http://www.zhangxinxu.com/jq/stylus/" target="_blank" rel="external">http://www.zhangxinxu.com/jq/stylus/</a></p>
<p>&#x4ED6;&#x4E5F;&#x5199;&#x8FC7;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x6587;&#x4E2D;&#x8BF4;&#xFF0C;&#x4ED6;&#x6CA1;&#x6709;&#x9009;&#x7528;sass&#x7684;&#x539F;&#x56E0;&#x662F;ruby  <a href="http://www.zhangxinxu.com/wordpress/2012/06/stylus-nodejs-expressive-dynamic-robust-css/&#x3002;" target="_blank" rel="external">http://www.zhangxinxu.com/wordpress/2012/06/stylus-nodejs-expressive-dynamic-robust-css/&#x3002;</a><br>&#x663E;&#x7136;&#xFF0C;&#x4ECE;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x7528;&#x5230;ruby&#x7684;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x4E0D;&#x5E94;&#x6210;&#x4E3A;&#x5927;&#x5BB6;&#x4E0D;&#x7528;&#x5B83;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x5176;&#x5B9E;&#x4F60;&#x9009;&#x7528;&#x54EA;&#x79CD;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x5C31;&#x76EE;&#x524D;&#x6765;&#x770B;&#xFF0C;sass&#x662F;&#x6700;&#x5F3A;&#x5927;&#xFF0C;&#x4E5F;&#x662F;&#x88AB;&#x5F88;&#x591A;&#x4EBA;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x7684;&#xFF0C;bootstrap&#x7684;&#x65B0;&#x7248;&#x4E5F;&#x662F;&#x629B;&#x5F03;less&#x6295;&#x5954;sass&#x800C;&#x53BB;&#xFF0C;&#x65E2;&#x7136;&#x5DEE;&#x522B;&#x4E0D;&#x5927;&#xFF0C;&#x4F55;&#x4E0D;&#x9009;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7528;&#x7684;&#x5462;&#xFF1F;~</p>
<p>##&#x5DE5;&#x5177;<br>&#x9884;&#x5904;&#x7406;&#x5668;&#x5DF2;&#x7ECF;&#x662F;css&#x7684;&#x5DE5;&#x5177;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x8FD8;&#x6709;&#x5DE5;&#x5177;&#x5417;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;sass&#x7684;&#x5DE5;&#x5177;<a href="http://compass-style.org/" target="_blank" rel="external">compass</a>&#xFF0C;less&#x7684;&#x5DE5;&#x5177;<a href="http://ecomfe.github.io/est/" target="_blank" rel="external">est</a>&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x4E3A;&#x9884;&#x5904;&#x7406;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x5C01;&#x88C5;&#x597D;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x62FF;&#x6765;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;&#x662F;&#x5E2E;&#x4F60;&#x61D2;&#x5230;&#x5BB6;&#x4E86;&#x54C8;&#x3002;&#x8BE6;&#x60C5;&#x5927;&#x5BB6;&#x81EA;&#x5DF1;&#x70B9;&#x51FB;&#x94FE;&#x63A5;&#x770B;&#x54C8;&#xFF0C;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#x3002;</p>
<p>##&#x5982;&#x679C;&#x5B9E;&#x5728;&#x4E0D;&#x611F;&#x5192;&#x5462;&#xFF1F;<br>&#x662F;&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x624D;&#x534E;&#x6A2A;&#x6EA2;&#x7684;&#x4F60;&#x7528;css&#x5B8C;&#x5168;&#x80FD;&#x591F;&#x80DC;&#x4EFB;&#x73B0;&#x5728;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x8981;&#x53BB;&#x4E86;&#x89E3;&#x9884;&#x5904;&#x7406;&#x5668;&#x770B;&#x8D77;&#x6765;&#x90A3;&#x4E48;&#x590D;&#x6742;&#x7684;&#x8BED;&#x6CD5;&#xFF08;&#x5176;&#x5B9E;&#x4E0D;&#x590D;&#x6742;~&#xFF09;&#xFF0C;&#x4E0D;&#x59A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x90E8;&#x5206;&#x7279;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x5D4C;&#x5957;&#x3001;mixin&#x3001;&#x6A21;&#x5757;&#x5316;&#x7B49;&#x7B49;&#xFF0C;&#x603B;&#x4E4B;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6392;&#x65A5;&#x5B83;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x4FBF;&#x5229;&#xFF0C;&#x53C8;&#x4F55;&#x4E50;&#x800C;&#x4E0D;&#x4E3A;&#x5462;&#xFF1F;~</p>
</div><a data-url="http://yoursite.com/2016/06/27/less_sass/" data-id="cirkcbsw4003ra0qipu2o69o9" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2016/08/07/css_design_method/" class="pre">没那么难，谈谈CSS的设计模式</a><a href="/2016/04/20/javascript-study-five/" class="next">征服javascript学习笔记（五）——引用类型Object和Array</a></div><div data-thread-key="2016/06/27/less_sass/" data-title="抛开语法，深度剖析CSS预处理器" data-url="http://yoursite.com/2016/06/27/less_sass/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2016/06/27/less_sass/" data-title="抛开语法，深度剖析CSS预处理器" data-url="http://yoursite.com/2016/06/27/less_sass/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>