<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>说说基本的布局观 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">说说基本的布局观</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">说说基本的布局观</h1><div class="post-meta">Dec 1, 2015<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2015/12/01/basic-layout/" href="/2015/12/01/basic-layout/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#话题的来由"><span class="toc-number">1.</span> <span class="toc-text">话题的来由</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#那什么是布局"><span class="toc-number">2.</span> <span class="toc-text">那什么是布局</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#布局家族"><span class="toc-number">3.</span> <span class="toc-text">布局家族</span></a></li></ol></div></div><div class="post-content"><p>&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#x7531;&#x6211;&#x6765;&#x8BF4;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x6700;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x8BBA;&#x8D44;&#x5386;&#x548C;&#x8BA4;&#x8BC6;&#xFF0C;&#x6211;&#x4E0D;&#x5982;&#x90A3;&#x4E9B;&#x5F81;&#x6218;&#x591A;&#x5E74;&#x7684;&#x884C;&#x4E1A;&#x524D;&#x8F88;&#x4EEC;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x60F3;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8BF7;&#x522B;&#x4EBA;&#x82B1;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x6765;&#x505A;&#xFF0C;&#x89C9;&#x5F97;&#x4E0D;&#x5927;&#x5408;&#x9002;&#xFF0C;&#x6211;&#x4E5F;&#x613F;&#x610F;&#x5199;&#x8FD9;&#x4E48;&#x4E00;&#x7BC7;&#x6587;&#x6765;&#x5206;&#x4EAB;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x7F51;&#x9875;&#x5E03;&#x5C40;&#x6700;&#x57FA;&#x672C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x70B9;&#xFF1A;</p>
<p>&#x4E00;&#x3001;&#x4E0D;&#x4F1A;&#x6709;&#x201C;&#x6DF1;&#x523B;&#x8BA4;&#x8BC6;&#x201D;&#x3001;&#x201C;&#x63ED;&#x79D8;&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x672C;&#x6765;&#x5C31;&#x6CA1;&#x6709;&#xFF1B;&#x4E0D;&#x4F1A;&#x6709;&#x5F88;&#x5389;&#x5BB3;&#x6216;&#x8005;&#x901A;&#x7528;&#x7684;&#x5E03;&#x5C40;&#x65B9;&#x6848;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#xFF0C;&#x4E0D;&#x662F;&#x672C;&#x6587;&#x91CD;&#x70B9;&#xFF1B;&#x4E5F;&#x4E0D;&#x4F1A;&#x65F6;&#x4E0D;&#x65F6;&#x628A;&#x6807;&#x51C6;&#x642C;&#x51FA;&#x6765;&#xFF0C;&#x53EA;&#x4F1A;&#x76F4;&#x89C2;&#x7684;&#x7B80;&#x8981;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x4F1A;&#x5E26;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x6545;&#x4E8B;&#x60C5;&#x8282;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x524D;&#x7AEF;&#x4EEC;&#x90FD;&#x6709;&#x7740;&#x76F8;&#x4F3C;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x6CBF;&#x7740;&#x6545;&#x4E8B;&#x7684;&#x53D1;&#x5C55;&#x8DEF;&#x7EBF;&#xFF0C;&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x591A;&#x7684;&#x5171;&#x9E23;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x7B80;&#x5355;&#x7684;&#x8BDD;&#x8BF4;&#x5C31;&#x662F;&#xFF1A;&#x66F4;&#x9002;&#x5408;&#x521D;&#x5B66;&#x8005;&#x770B;~</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x8A00;&#x5F52;&#x6B63;&#x4F20;&#x3002;</p>
<h2 id="&#x8BDD;&#x9898;&#x7684;&#x6765;&#x7531;"><a href="#&#x8BDD;&#x9898;&#x7684;&#x6765;&#x7531;" class="headerlink" title="&#x8BDD;&#x9898;&#x7684;&#x6765;&#x7531;"></a>&#x8BDD;&#x9898;&#x7684;&#x6765;&#x7531;</h2><p>&#x6211;&#x4E2A;&#x4EBA;&#x6709;&#x4E2A;QQ&#x7FA4;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x4EA4;&#x6D41;&#x73AF;&#x5883;&#xFF0C;&#x4E0D;&#x8BA9;&#x66F4;&#x591A;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x4EBA;&#x8FDB;&#x6765;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x56DE;&#x7B54;&#x81F3;&#x5C11;&#x4E24;&#x79CD;&#x5E03;&#x5C40;&#x65B9;&#x6CD5;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x867D;&#x4E0D;&#x7B97;&#x5341;&#x5206;&#x5177;&#x4F53;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x7B3C;&#x7EDF;&#xFF0C;&#x9760;&#x8FB9;&#x6216;&#x8005;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#x5927;&#x6982;&#x6709;&#x8FD9;&#x51E0;&#x79CD;&#xFF1A;&#x201C;div&#x3001;table&#x3001;css&#x3001;&#x6D41;&#x5F0F;&#x5E03;&#x5C40;&#x3001;&#x6D6E;&#x52A8;&#x3001;&#x5B9A;&#x4F4D;&#x201D;&#x3002; &#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x9760;&#x8FB9;&#xFF0C;&#x8FD9;&#x5F97;&#x770B;&#x5BF9;&#x201C;&#x65B9;&#x6CD5;&#x201D;&#x4E8C;&#x5B57;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x5148;&#x6765;&#x770B;&#x51E0;&#x6BB5;&#x6545;&#x4E8B;&#x5427;&#x3002;</p>
<p>&#x6545;&#x4E8B;&#x4E00;&#xFF1A;<strong>&#x5927;&#x5B66;&#x8BFE;&#x5802;</strong></p>
<p>&#x8001;&#x5E08;&#x5BF9;&#x6211;&#x4EEC;&#x8BF4;&#xFF1A;&#x201C;&#x8868;&#x683C;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x5F88;&#x6D41;&#x884C;&#x7684;&#x5E03;&#x5C40;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x7684;&#x7279;&#x70B9;&#x662F;&#x80FD;&#x591F;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x628A;&#x7F51;&#x9875;&#x6392;&#x7248;&#x7684;&#x6574;&#x9F50;&#x597D;&#x770B;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x7ED9;&#x4F60;&#x4EEC;&#x63A8;&#x8350;&#x4E00;&#x6B3E;&#x5BB9;&#x6613;&#x4E0A;&#x624B;&#x53C8;&#x597D;&#x7528;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x8F91;&#x5668;&#xFF0C;dreamweaver8.&#x201D;</p>
<p>&#x6545;&#x4E8B;&#x4E8C;&#xFF1A;<strong>&#x5C0F;&#x8BD5;&#x725B;&#x5200;</strong></p>
<p>&#x8981;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;&#x4E86;&#xFF0C;&#x5BF9;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x5F88;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x9009;&#x4E86;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x505A;&#x7F51;&#x7AD9;&#x7684;&#x8BFE;&#x9898;&#xFF0C;&#x62FF;&#x5230;&#x4E4B;&#x540E;&#xFF0C;&#x51ED;&#x7740;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x7684;&#x4E00;&#x4E01;&#x70B9;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5F00;&#x59CB;&#x6784;&#x601D;&#xFF0C;&#x52A8;&#x624B;&#xFF0C;&#x4E00;&#x5207;&#x8C8C;&#x4F3C;&#x987A;&#x98CE;&#x987A;&#x6C34;&#xFF0C;&#x5F53;&#x505A;&#x5230;&#x5BFC;&#x822A;&#x680F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x91C7;&#x7528;&#x4E86;ul&#xFF08;&#x65E0;&#x5E8F;&#x5217;&#x8868;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x9047;&#x5230;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x7B97;&#x5F97;&#x4E0A;&#x201C;&#x96BE;&#x9898;&#x201D;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5217;&#x8868;&#x662F;&#x7AD6;&#x7740;&#x6392;&#x5217;&#x7684;&#xFF0C;&#x6211;&#x8981;&#x7684;&#x662F;&#x6A2A;&#x7740;&#x7684;&#xFF0C;&#x8FD9;&#x53EF;&#x600E;&#x4E48;&#x529E;&#xFF0C;&#x6211;&#x5C31;&#x53BB;&#x7FA4;&#x91CC;&#x95EE;&#xFF0C;&#x6CA1;&#x4EBA;&#x56DE;&#x7B54;&#xFF0C;&#x4E8E;&#x662F;&#x4E4E;&#xFF0C;&#x60F3;&#x5230;&#x4E86;&#x5EA6;&#x5A18;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x7F51;&#x53CB;&#x4E00;&#x4E0B;&#x5C31;&#x7ED9;&#x51FA;&#x4E86;&#x7B54;&#x6848;&#x2014;&#x2014;float&#xFF0C;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x77E5;&#x9053;&#x4E86;&#x4E2A;&#x79D8;&#x5BC6;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x8BF7;&#x6559;&#x7684;&#x524D;&#x8F88;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x8C01;&#x8DDF;&#x4F60;&#x8BF4;&#x6392;&#x6210;&#x4E00;&#x884C;&#x5C31;&#x8981;&#x7528;float&#xFF0C;span&#x4E5F;&#x884C;&#x554A;&#xFF01;&#x6211;&#x6709;&#x70B9;&#x4E0D;&#x5FFF;&#xFF0C;&#x66F4;&#x4E0D;&#x89E3;&#xFF0C;span&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x6545;&#x4E8B;&#x4E09;&#xFF1A;<strong>div+css</strong></p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5230;&#x4EFB;&#x610F;&#x4E00;&#x5BB6;&#x7535;&#x5546;&#x7F51;&#x7AD9;&#xFF0C;&#x641C;&#x7D22;&#x201C;div&#x201D;&#xFF0C;&#x80AF;&#x5B9A;&#x80FD;&#x641C;&#x5230;&#x201C;div+css&#x7F51;&#x9875;&#x5E03;&#x5C40;**&#x201D;&#x4E4B;&#x7C7B;&#x7684;&#x4E66;&#xFF0C;div&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#xFF1F;&#x8FD9;&#x662F;&#x6211;&#x65E9;&#x671F;&#x66FE;&#x5728;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x7FA4;&#x91CC;&#x95EE;&#x8FC7;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x7B54;&#x6848;&#x5DF2;&#x7ECF;&#x8BB0;&#x4E0D;&#x6E05;&#x4E86;&#xFF0C;&#x5E94;&#x8BE5;&#x662F;&#x6CA1;&#x80FD;&#x89E3;&#x7B54;&#x6211;&#x7684;&#x7591;&#x60D1;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x5462;&#xFF1F;&#x4E0B;&#x9762;&#x8BE6;&#x8FF0;&#x3002;</p>
<p>&#x6545;&#x4E8B;&#x56DB;&#xFF1A;<strong>&#x521D;&#x5165;&#x804C;&#x573A;</strong></p>
<p>&#x521D;&#x5165;&#x793E;&#x4F1A;&#xFF0C;&#x597D;&#x4E0D;&#x5BB9;&#x6613;&#x6709;&#x4E2A;&#x9762;&#x8BD5;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x662F;&#x5728;&#x7EBF;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x95EE;&#x4E86;&#x6211;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x662F;&#xFF0C;&#x600E;&#x6837;&#x8BA9;&#x5143;&#x7D20;&#x5C45;&#x4E2D;&#xFF1F;&#x6211;&#x72B9;&#x8C6B;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#xFF0C;&#x56DE;&#x4ED6;&#xFF1A;align=&#x201C;center&#xFF1B;&#x201D;&#x7136;&#x540E;&#x4ED6;&#x8BF4;&#xFF0C;&#x7B97;&#x6709;&#x70B9;&#x57FA;&#x7840;&#xFF0C;&#x4E0D;&#x8FC7;&#x9700;&#x8981;&#x57F9;&#x8BAD;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x6545;&#x4E8B;&#x4E94;&#xFF1A;<strong>&#x4E00;&#x6B21;&#x4E13;&#x8BBF;</strong></p>
<p>&#x6709;&#x4E00;&#x6B21;&#x9762;&#x8BD5;&#xFF0C;&#x9762;&#x8BD5;&#x5B98;&#x95EE;&#x6211;&#xFF0C;&#x600E;&#x6837;&#x770B;&#x5F85;&#x7F51;&#x9875;&#x91CD;&#x6784;&#x3002;&#x6211;&#x7684;&#x7B54;&#x6848;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x540E;&#x6765;&#x6709;&#x4E00;&#x6B21;&#x81EA;&#x4E3B;&#x8054;&#x7CFB;&#x8BBF;&#x8C08;&#x672C;&#x516C;&#x53F8;&#x804C;&#x5458;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x6211;&#x600E;&#x4F1A;&#x8F7B;&#x6613;&#x653E;&#x8FC7;~&#x4E8E;&#x662F;&#x6211;&#x7EA6;&#x4E86;&#x4ED6;&#xFF0C;&#x51C6;&#x5907;&#x4E86;&#x4E00;&#x5806;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x628A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x95EE;&#x4E86;&#x56DE;&#x53BB;&#x3002;&#x4ED6;&#x7684;&#x7B54;&#x6848;&#x63D0;&#x53D6;&#x51FA;&#x4E00;&#x90E8;&#x5206;&#x5C31;&#x662F;&#xFF1A;html&#x4E4B;&#x4E8E;&#x7F51;&#x9875;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x8EAB;&#x4F53;&#x8EAF;&#x5E72;&#x4E4B;&#x4E8E;&#x4EBA;&#xFF0C;&#x8D77;&#x5230;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x7ED3;&#x6784;&#x548C;&#x9AA8;&#x67B6;&#x7684;&#x4F5C;&#x7528;&#xFF0C;css&#x4E4B;&#x4E8E;&#x7F51;&#x9875;&#xFF0C;&#x50CF;&#x662F;&#x4EBA;&#x7684;&#x8863;&#x7740;&#x6253;&#x626E;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x51E0;&#x6BB5;&#xFF0C;&#x90FD;&#x662F;&#x771F;&#x5B9E;&#x7ECF;&#x5386;&#x7684;&#x6D53;&#x7F29;&#x3002;&#x4E0B;&#x9762;&#x4F1A;&#x6709;&#x5BF9;&#x5E94;&#x8BE0;&#x91CA;&#x3002;</p>
<p>&#x6545;&#x4E8B;&#x544A;&#x8BC9;&#x6211;&#x4EEC;</p>
<p>&#x5BF9;&#x5E94;&#x4EE5;&#x4E0A;&#x51E0;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x6709;&#x8FD9;&#x51E0;&#x65B9;&#x9762;</p>
<p><strong>&#x7B2C;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;</strong></p>
<p>&#x5F88;&#x76F4;&#x89C2;&#x7684;&#x6709;&#x4E24;&#x70B9;&#x8868;&#x73B0;&#xFF0C;&#x7F51;&#x9875;&#x7ED3;&#x6784;&#x4E3B;&#x8981;&#x7528;table&#xFF0C;&#x7F16;&#x7A0B;&#x5DE5;&#x5177;&#x4F7F;&#x7528;dreamweaver&#x3002;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x53EF;&#x80FD;&#x4F60;&#x5E76;&#x4E0D;&#x964C;&#x751F;&#xFF0C;&#x8FD9;&#x8868;&#x660E;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;</p>
<p>&#x524D;&#x7AEF;&#x6280;&#x672F;&#xFF08;&#x4E66;&#x7C4D;&#xFF09;&#x7684;&#x5F15;&#x8FDB;&#x548C;&#x63A8;&#x5E7F;&#x6709;&#x6240;&#x5EF6;&#x8FDF;</p>
<p>&#x524D;&#x7AEF;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#x7684;&#x5B66;&#x6821;&#x6559;&#x80B2;&#x91CD;&#x89C6;&#x7A0B;&#x5EA6;&#x4E0D;&#x591F;</p>
<p>&#x4ECE;&#x4E8B;&#x76F8;&#x5173;&#x6559;&#x80B2;&#x7684;&#x4ECE;&#x4E1A;&#x8005;&#x6709;&#x90E8;&#x5206;&#x4E0D;&#x5728;&#x4E00;&#x7EBF;&#xFF0C;&#x4E13;&#x4E1A;&#x5EA6;&#x8F83;&#x4F4E;&#x3001;&#x77E5;&#x8BC6;&#x66F4;&#x65B0;&#x901F;&#x5EA6;&#x8F83;&#x6162;</p>
<p>&#x5F88;&#x591A;&#x4EBA;&#x6700;&#x5F00;&#x59CB;&#x5199;&#x7F51;&#x9875;&#x4EE3;&#x7801;&#x7528;&#x7684;&#x662F;dreamweaver **&#xFF0C;&#x91C7;&#x7528;table&#x4E3A;&#x7F51;&#x9875;&#x7ED3;&#x6784;&#x7684;&#x4E3B;&#x529B;&#x519B;&#xFF0C;&#x9884;&#x89C8;&#x6548;&#x679C;&#x548C;&#x8C03;&#x8BD5;&#x662F;&#x7528;360&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x76F4;&#x63A5;&#x5728;DW&#x91CC;&#x770B;&#x7684;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5B58;&#x5728;&#x7684;&#x5BF9;&#x5427;&#xFF1F;&#x4E5F;&#x4E0D;&#x80FD;&#x8BF4;&#x5B83;&#x4E0D;&#x5BF9;&#x6216;&#x8005;&#x4E0D;&#x597D;&#xFF0C;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5386;&#x53F2;&#x539F;&#x56E0;&#x5728;&#x91CC;&#x9762;&#xFF0C;css&#x8BDE;&#x751F;&#xFF0C;web&#x6807;&#x51C6;&#x7684;&#x8BDE;&#x751F;&#x548C;&#x5F15;&#x8FDB;&#x4EE5;&#x53CA;chrome&#x3001;firefox&#x8FD9;&#x4E9B;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x51FA;&#x73B0;&#x548C;&#x63A8;&#x5E7F;&#x4F7F;&#x7528;&#xFF0C;&#x90FD;&#x662F;&#x5F71;&#x54CD;&#x56E0;&#x7D20;&#x3002;&#x4E0D;&#x80FD;&#x53BB;&#x8BC4;&#x5224;&#x5B83;&#x7684;&#x5BF9;&#x4E0E;&#x9519;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x7ED9;&#x521D;&#x5B66;&#x8005;&#x5BF9;&#x4E8E;&#x4E66;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x4E60;&#x60EF;&#x3001;&#x65B9;&#x6CD5;&#xFF0C;&#x5DE5;&#x5177;&#x7684;&#x9009;&#x62E9;&#x7B49;&#x9020;&#x6210;&#x7684;&#x4E0D;&#x5229;&#x5F71;&#x54CD;&#x662F;&#x5BA2;&#x89C2;&#x4E8B;&#x5B9E;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x5E86;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x524D;&#x7AEF;&#x804C;&#x4F4D;&#x5728;&#x8FD1;&#x51E0;&#x5E74;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x6D6A;&#x6F6E;&#x4E4B;&#x4E0B;&#x7684;&#x6301;&#x7EED;&#x706B;&#x7206;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x8FDB;&#x5165;&#x4E86;&#x524D;&#x7AEF;&#x884C;&#x5217;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x6559;&#x80B2;&#x7EC4;&#x7EC7;&#x3001;&#x673A;&#x6784;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x66F4;&#x591A;&#x5B66;&#x4E60;&#x8D44;&#x6E90;&#xFF0C;&#x66F4;&#x591A;f2er&#x7684;&#x52AA;&#x529B;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x5728;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E8C;&#x4E2A;&#x6545;&#x4E8B;</strong></p>
<p>&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x4E00;&#x9879;&#x6280;&#x672F;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x9A6C;&#x4E0A;&#x5C31;&#x52A8;&#x624B;&#x8BD5;&#x8BD5;&#x7684;&#x51B2;&#x52A8;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x79CD;&#x6210;&#x5C31;&#x611F;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x50CF;&#x7F51;&#x9875;&#x8FD9;&#x79CD;&#xFF0C;&#x53EF;&#x89C6;&#x5316;&#x5F88;&#x5F3A;&#xFF0C;&#x4E8E;&#x6B64;&#x540C;&#x65F6;&#x5C31;&#x4F1A;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x521D;&#x4E86;&#x89E3;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x90FD;&#x662F;&#x7247;&#x9762;&#x7684;&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x9047;&#x5230;&#x5404;&#x79CD;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x6025;&#x4E8E;&#x627E;&#x5230;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5BFB;&#x6C42;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x8FC7;&#x7A0B;&#x5462;&#xFF0C;&#x65E2;&#x4E0D;&#x4F1A;&#x8003;&#x8651;&#x5168;&#x9762;&#x6027;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x6DF1;&#x6316;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x80FD;&#x529B;&#x8861;&#x91CF;&#x4F18;&#x52A3;&#xFF0C;&#x751A;&#x81F3;&#x4F1A;&#x628A;&#x9047;&#x5230;&#x7684;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x53EF;&#x884C;&#x7684;&#x65B9;&#x6848;&#x5F53;&#x505A;&#x552F;&#x4E00;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x6848;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x7684;&#x7591;&#x95EE;&#x70B9;&#x6070;&#x5728;&#x4E8E;&#x6B64;&#xFF0C;&#x7EAF;&#x7CB9;&#x662F;&#x56E0;&#x4E3A;&#x57FA;&#x7840;&#x8584;&#x5F31;&#xFF0C;&#x6700;&#x57FA;&#x672C;&#x7684;&#x201C;&#x5757;&#x5143;&#x7D20;&#x201D;&#x548C;&#x201C;&#x884C;&#x5185;&#x5143;&#x7D20;&#x201D;&#x90FD;&#x6CA1;&#x4E86;&#x89E3;&#x6E05;&#x695A;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5F88;&#x591A;&#x57FA;&#x7840;&#x7684;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x8E0F;&#x5B9E;&#x3001;&#x7CFB;&#x7EDF;&#x7684;&#x5B66;&#x4E60;&#x53BB;&#x89E3;&#x5F00;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E09;&#x4E2A;&#x6545;&#x4E8B;</strong></p>
<p>div+css&#xFF0C;&#x5E7F;&#x4E3A;&#x8BDF;&#x75C5;&#x7684;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF0C;&#x5F88;&#x591A;&#x4E66;&#x7C4D;&#x4EE5;&#x5B83;&#x547D;&#x540D;&#xFF0C;&#x5F88;&#x591A;&#x62DB;&#x8058;&#x4FE1;&#x606F;&#x4E5F;&#x662F;&#x8FD9;&#x4E48;&#x5199;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x53EF;&#x80FD;&#x662F;&#x5077;&#x61D2;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#xFF0C;&#x81F3;&#x5C11;&#x4F5C;&#x4E3A;&#x5F53;&#x65F6;&#x7684;&#x6211;&#x5BF9;&#x5B83;&#x7684;&#x5370;&#x8C61;&#x662F;&#xFF1A;div&#x4E5F;&#x662F;&#x4E00;&#x95E8;&#x6280;&#x672F;&#xFF0C;&#x5177;&#x6709;&#x5F88;&#x591A;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x6216;&#x8005;&#x5177;&#x5907;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4FE9;&#x662F;&#x5E76;&#x5217;&#x5173;&#x7CFB;&#x5440;&#x3002;&#x8BFB;&#x8FD9;&#x7BC7;&#x6587;&#x65F6;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x4E86;&#xFF0C;&#x8FD9;&#x79CD;&#x8BA4;&#x8BC6;&#x6709;&#x70B9;&#x53EF;&#x7B11;&#x3002; &#x8FD9;&#x662F;&#x5728;&#x63A8;&#x5E7F;&#x4F7F;&#x7528;css&#x6280;&#x672F;&#xFF0C;&#x63A8;&#x5E7F;&#x201C;&#x7ED3;&#x6784;&#x548C;&#x8868;&#x73B0;&#x5206;&#x79BB;&#x201D;&#x601D;&#x60F3;&#x4E4B;&#x540E;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x6240;&#x5174;&#x8D77;&#x7684;&#x6D6A;&#x6F6E;&#xFF0C;&#x5F71;&#x54CD;&#x81F3;&#x4ECA;&#xFF0C;&#x867D;&#x7136;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x4F1A;&#x518D;&#x6709;&#x50CF;&#x6211;&#x5F53;&#x65F6;&#x90A3;&#x6837;&#x7684;&#x8BEF;&#x89E3;&#xFF0C;&#x4F46;&#x5728;&#x9F13;&#x52B1;&#x4F7F;&#x7528;&#x8BED;&#x4E49;&#x5316;&#x6807;&#x7B7E;&#x548C;&#x63A8;&#x5E7F;HTML5&#x65B0;&#x6807;&#x51C6;&#x7684;&#x4ECA;&#x5929;&#xFF0C;&#x4ECD;&#x7136;&#x6709;&#x4E0D;&#x5C11;&#x4EBA;&#x5728;&#x6EE5;&#x7528;&#x7740;div&#x6807;&#x7B7E;&#x3002;</p>
<p><strong>&#x7B2C;&#x56DB;&#x4E2A;&#x6545;&#x4E8B;</strong></p>
<p>&#x5F53;&#x65F6;&#x7684;&#x6211;&#xFF0C;&#x662F;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x6BD5;&#x4E1A;&#x8BBE;&#x8BA1;&#xFF0C;&#x81EA;&#x8BA4;&#x4E3A;&#x81F3;&#x5C11;&#x5177;&#x5907;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x80FD;&#x529B;&#x3002;&#x53EF;&#x662F;&#x5BF9;&#x5C45;&#x4E2D;&#x7684;&#x8BA4;&#x77E5;&#x8FD8;&#x505C;&#x7559;&#x5728;align=&#x201C;center&#x201D;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5206;&#x79BB;&#xFF0C;&#x66F4;&#x662F;&#x5BF9;&#x73B0;&#x5728;&#x4E00;&#x4E9B;&#x4E30;&#x5BCC;&#x7684;&#x5C45;&#x4E2D;&#x65B9;&#x6CD5;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x3002;&#x771F;&#x7684;&#x662F;&#x7EAF;&#x6B63;&#x7684;&#x83DC;&#x9E1F;&#xFF0C;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x591A;&#x6570;&#x524D;&#x7AEF;&#x4EBA;&#x4F1A;&#x8D70;&#x7684;&#x8FC7;&#x7A0B;&#x5427;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E94;&#x4E2A;&#x6545;&#x4E8B;</strong></p>
<p>&#x7B97;&#x662F;&#x5BF9;&#x201C;&#x7ED3;&#x6784;&#x8868;&#x73B0;&#x5206;&#x79BB;&#x201D;&#x601D;&#x60F3;&#x7684;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x91CC;&#x4E0D;&#x662F;&#x5728;&#x5F31;&#x5316;&#x7ED3;&#x6784;&#x5F3A;&#x8C03;&#x8868;&#x73B0;&#xFF0C;&#x771F;&#x6B63;&#x5199;&#x5F97;&#x597D;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x5199;&#x4EC0;&#x4E48;&#x6837;&#x5F0F;&#x4E5F;&#x4E0D;&#x4F1A;&#x8BA9;&#x8BFB;&#x8005;&#x89C9;&#x5F97;&#x522B;&#x626D;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x79CD;&#x8BF4;&#x6CD5;&#xFF1A;&#x770B;&#x4E00;&#x4E2A;&#x4EBA;html&#x5199;&#x5F97;&#x597D;&#x8FD8;&#x662F;&#x4E0D;&#x597D;&#xFF0C;&#x76F4;&#x63A5;&#x628A;&#x6837;&#x5F0F;&#x53BB;&#x6389;&#x770B;&#x5C31;&#x77E5;&#x9053;&#x4E86;~&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x6D89;&#x53CA;&#x5230;&#x8BED;&#x4E49;&#x5316;&#x7684;&#x8FD0;&#x7528;&#xFF0C;&#x683C;&#x5F0F;&#x548C;&#x6CE8;&#x91CA;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x8BE6;&#x8BF4;&#x3002;</p>
<p>&#x4EE5;&#x4E0A;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x6240;&#x8868;&#x8FBE;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x8BA4;&#x77E5;&#x7684;&#x8FDB;&#x5316;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x4E3A;&#x4E86;&#x4E0D;&#x90A3;&#x4E48;&#x7A81;&#x5140;&#x7684;&#x5C31;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x4E0B;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="&#x90A3;&#x4EC0;&#x4E48;&#x662F;&#x5E03;&#x5C40;"><a href="#&#x90A3;&#x4EC0;&#x4E48;&#x662F;&#x5E03;&#x5C40;" class="headerlink" title="&#x90A3;&#x4EC0;&#x4E48;&#x662F;&#x5E03;&#x5C40;"></a>&#x90A3;&#x4EC0;&#x4E48;&#x662F;&#x5E03;&#x5C40;</h2><p>&#x4E0D;&#x7BA1;&#x662F;&#x521D;&#x5B66;&#x8005;&#x8FD8;&#x662F;&#x8001;&#x624B;&#xFF0C;&#x90FD;&#x77E5;&#x9053;&#x7F51;&#x9875;&#x662F;&#x7531;&#x5927;&#x5927;&#x5C0F;&#x5C0F;&#x7684;&#x5BB9;&#x5668;&#x7EC4;&#x6210;&#xFF0C;&#x6216;&#x8005;&#x79F0;&#x4E4B;&#x4E3A;&#x5143;&#x7D20;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x70B9;&#xFF0C;&#x521D;&#x5B66;&#x8005;&#x8FD8;&#x53EF;&#x80FD;&#x4F1A;&#x5F04;&#x6DF7;&#x7684;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x662F;&#x201C;&#x5143;&#x7D20;&#x201D;&#x548C;&#x201C;&#x6807;&#x7B7E;&#x201D;&#xFF0C;&#x62FF;&#x6BB5;&#x843D;&#x6765;&#x4E3E;&#x4F8B;&#xFF0C;&#x6BB5;&#x843D;&#x662F;&#x4E00;&#x79CD;&#x5143;&#x7D20;&#x7C7B;&#x578B;&#xFF0C;&#x7528;&#x6765;&#x8868;&#x793A;&#x6216;&#x8005;&#x5305;&#x88F9;&#x8FD9;&#x4E2A;&#x5143;&#x7D20;&#x5185;&#x5BB9;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x662F;</p><p></p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x4EEC;&#x63D0;&#x53CA;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x4F1A;&#x8FD9;&#x4E48;&#x5199;&#xFF0C;&#x4F1A;&#x76F4;&#x63A5;&#x8BF4;P&#x6807;&#x7B7E;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;P&#x5143;&#x7D20;&#x6216;&#x8005;P&#x6807;&#x7B7E;&#xFF0C;&#x5728;&#x63D0;&#x53CA;&#x4E8C;&#x8005;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x4E0D;&#x7B49;&#x540C;&#x5C31;&#x597D;&#x3002;<p></p>
<p>&#x7F51;&#x9875;&#x672C;&#x8EAB;&#x662F;&#x4E2A;&#x4E8C;&#x7EF4;&#x7684;&#x5E73;&#x9762;&#x7A7A;&#x95F4;&#xFF0C;&#x6709;&#x4E86;&#x5404;&#x79CD;&#x5143;&#x7D20;&#x7684;&#x5806;&#x780C;&#x4E4B;&#x540E;&#xFF0C;&#x600E;&#x4E48;&#x5728;&#x7F51;&#x9875;&#x91CC;&#x6446;&#x653E;&#x5B83;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#xFF1F; &#x9996;&#x5148;&#x6BCF;&#x79CD;&#x5143;&#x7D20;&#x90FD;&#x6709;&#x5176;&#x201C;&#x81EA;&#x5E26;&#x201D;&#x7684;&#x8868;&#x73B0;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x201C;&#x81EA;&#x5E26;&#x201D;&#xFF0C;&#x6765;&#x81EA;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x7531;&#x4E8E;&#x4E0D;&#x540C;&#x6D4F;&#x89C8;&#x5668;&#x5BF9;&#x5176;&#x7684;&#x6807;&#x51C6;&#x4E0D;&#x4E00;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x540E;&#x6765;&#x7684;reset&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x7EC6;&#x8BF4;&#xFF0C;&#x60F3;&#x4E86;&#x89E3;&#x66F4;&#x591A;&#x53EF;&#x4EE5;&#x5230;&#x5173;&#x4E8E;reset&#x90A3;&#x4E9B;&#x4E8B;&#x513F;&#x7CFB;&#x5217;&#x4E86;&#x89E3;)&#xFF0C;&#x662F;&#x5426;&#x5360;&#x6EE1;&#x4E00;&#x884C;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x8FB9;&#x8DDD;&#xFF0C;&#x662F;&#x5426;&#x6709;&#x7279;&#x5B9A;&#x683C;&#x5F0F;&#x548C;&#x5927;&#x5C0F;&#x7B49;&#x3002;&#x5982;&#x679C;&#x53EA;&#x662F;&#x628A;&#x5143;&#x7D20;&#x8D64;&#x88F8;&#x88F8;&#x7684;&#x4E22;&#x5230;&#x7F51;&#x9875;&#x5F53;&#x4E2D;&#x53BB;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x6837;&#x5B50;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6CA1;&#x90A3;&#x4E48;&#x7F8E;&#x89C2;&#xFF08;&#x53EF;&#x4EE5;&#x53BB;&#x770B;&#x770B;CSS&#x9B54;&#x6CD5;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x5DF2;&#x88F8;&#x5954;&#x591A;&#x5E74;~&#xFF09;&#xFF0C;&#x8FD9;&#x4E5F;&#x80FD;&#x7B97;&#x662F;&#x4E00;&#x79CD;&#x7B80;&#x964B;&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x5BF9;&#x201C;div&#x3001;table&#x201D;&#x8FD9;&#x7C7B;&#x7684;&#x7B54;&#x6848;&#x89C6;&#x4E4B;&#x4E3A;&#x6CBE;&#x8FB9;&#xFF0C;&#x4F46;&#x4E0D;&#x51C6;&#x786E;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E3B;&#x8981;&#x5145;&#x5F53;&#x4E86;&#x5305;&#x88F9;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x7684;&#x5BB9;&#x5668;&#x8FD9;&#x4E48;&#x4E2A;&#x89D2;&#x8272;&#xFF0C;&#x662F;css&#x5F97;&#x4EE5;&#x65BD;&#x5C55;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x53C2;&#x4E0E;&#x4E86;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x7684;&#x4E00;&#x73AF;&#xFF0C;&#x672C;&#x8EAB;&#x5E76;&#x6CA1;&#x6709;&#x5F88;&#x5F3A;&#x7684;&#x5E03;&#x5C40;&#x80FD;&#x529B;&#x3002;</p>
<p><strong>&#x5E7F;&#x4E49;&#x7684;&#x201C;&#x76D2;&#x201D;</strong></p>
<p>&#x5F88;&#x591A;&#x6559;&#x7A0B;&#x4F1A;&#x628A;&#x201C;&#x76D2;&#x6A21;&#x578B;&#x201D;&#x7ED9;&#x5355;&#x72EC;&#x5217;&#x51FA;&#x6765;&#xFF0C;&#x5F53;&#x5E74;&#x6211;&#x5728;&#x5B66;&#x90A3;&#x4E9B;&#x6559;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x4E00;&#x76F4;&#x597D;&#x5947;&#x201D;&#x76D2;&#x6A21;&#x578B;&#x201D;&#x662F;&#x4E2A;&#x4EC0;&#x4E48;&#xFF1F;&#x8FD9;&#x8DDF;&#x7F51;&#x9875;&#x5236;&#x4F5C;&#x600E;&#x4E48;&#x626F;&#x4E0A;&#x5173;&#x7CFB;&#x7684;&#xFF0C;&#x540E;&#x6765;&#x77E5;&#x9053;&#x4E86;&#x4E4B;&#x540E;&#x66FE;&#x5947;&#x602A;&#x4E3A;&#x4EC0;&#x4E48;&#x8D77;&#x90A3;&#x4E48;&#x4E2A;&#x540D;&#x5B57;~&#x867D;&#x7136;&#x5F62;&#x8C61;&#xFF0C;&#x4F46;&#x89C9;&#x5F97;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x52A9;&#x4E8E;&#x7B2C;&#x4E00;&#x5370;&#x8C61;&#x7684;&#x7406;&#x89E3;&#x3002; &#x5148;&#x6765;&#x770B;&#x666E;&#x904D;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x76D2;&#xFF1A; </p>
<p><img src="/2015/12/01/basic-layout/1.jpg" alt=""></p>
<p>&#x6211;&#x7ED9;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5E7F;&#x4E49;&#x7684;&#x201C;&#x76D2;&#x201D;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x968F;&#x7740;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#x8FDB;&#x6B65;&#xFF0C;&#x548C;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x7684;&#x521B;&#x610F;&#x65E0;&#x9650;&#xFF0C;&#x5143;&#x7D20;&#x7684;&#x6392;&#x5217;&#x4E0D;&#x518D;&#x90A3;&#x4E48;&#x89C4;&#x77E9;&#xFF0C;&#x5F62;&#x72B6;&#x4E5F;&#x4E0D;&#x4F1A;&#x90A3;&#x4E48;&#x89C4;&#x5219;&#xFF0C;&#x89C6;&#x89C9;&#x6548;&#x679C;&#x66F4;&#x4E30;&#x5BCC;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x9700;&#x8981;&#x7528;&#x5230;&#x4E00;&#x4E9B;&#x6280;&#x5DE7;&#x548C;&#x65B0;&#x7684;&#x5C5E;&#x6027;&#x3002; &#x7F57;&#x5217;&#x4E0B;&#x6765;&#x5927;&#x81F4;&#x6709;width&#x3001;height&#x3001;padding&#x3001;margin&#x3001;border&#x3001;outline&#x3001;box-shadow&#x3001;background&#x3001;:after/:before&#x3001;transform&#x3001;box-sizing&#x7B49;&#xFF0C;&#x81F3;&#x4E8E;&#x5229;&#x7528;canvas&#x3001;svg&#x7B49;&#x505A;&#x51FA;&#x7684;&#x66F4;&#x52A0;&#x532A;&#x5937;&#x6240;&#x601D;&#x6548;&#x679C;&#x7684;&#xFF0C;&#x53E6;&#x5F53;&#x522B;&#x8BBA;&#x3002;</p>
<h2 id="&#x5E03;&#x5C40;&#x5BB6;&#x65CF;"><a href="#&#x5E03;&#x5C40;&#x5BB6;&#x65CF;" class="headerlink" title="&#x5E03;&#x5C40;&#x5BB6;&#x65CF;"></a>&#x5E03;&#x5C40;&#x5BB6;&#x65CF;</h2><p>&#x8BF4;&#x4E86;&#x534A;&#x5929;&#xFF0C;&#x7EC8;&#x4E8E;&#x8981;&#x626F;&#x5230;&#x6B63;&#x9898;&#x4E0A;&#x6765;&#xFF0C;&#x7F51;&#x9875;&#x5C31;&#x662F;&#x7531;&#x5404;&#x79CD;&#x5BB9;&#x5668;&#x6309;&#x7167;&#x4E00;&#x5B9A;&#x7684;&#x79E9;&#x5E8F;&#x8FDB;&#x884C;&#x6446;&#x653E;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x7BA1;&#x662F;&#x4F5C;&#x7528;&#x4E8E;&#x5B83;&#x672C;&#x8EAB;&#xFF0C;&#x8FD8;&#x662F;&#x5916;&#x90E8;&#x5144;&#x5F1F;&#x5143;&#x7D20;&#x3001;&#x7236;&#x5B50;&#x5143;&#x7D20;&#x4E4B;&#x95F4;&#x4F4D;&#x7F6E;&#x7684;&#xFF0C;&#x90FD;&#x7B97;&#xFF0C;&#x54EA;&#x4E9B;&#x5462;&#xFF1F; &#x5148;&#x770B;&#x5143;&#x7D20;&#x672C;&#x8EAB;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5927;&#x81F4;&#x5206;&#x4E3A;&#x201C;&#x5757;&#x7EA7;&#x201D;&#x548C;&#x201C;&#x884C;&#x5185;&#x201D;&#xFF0C;&#x8FD9;&#x662F;&#x4E24;&#x79CD;&#x57FA;&#x672C;&#x5F62;&#x6001;&#x2014;&#x2014;&#x201C;&#x5360;&#x636E;&#x6574;&#x884C;&#x201D;&#x548C;&#x201C;&#x53EF;&#x5728;&#x540C;&#x4E00;&#x884C;&#x5E76;&#x6392;&#x653E;&#x201D;&#xFF0C;&#x5DEE;&#x4E0D;&#x591A;&#x591F;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;float&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x201C;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x6A2A;&#x7740;&#x653E;&#x201D;&#x7684;&#x5417;&#xFF1F;&#x5F88;&#x591A;&#x4EBA;&#x559C;&#x6B22;&#x7684;&#x7528;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x8BF4;&#x6700;&#x521D;&#x7684;&#x8BBE;&#x8BA1;&#x610F;&#x56FE;&#x2014;&#x2014;&#x201C;&#x56FE;&#x6587;&#x6DF7;&#x6392;&#x7684;&#x6587;&#x5B57;&#x73AF;&#x7ED5;&#x201D;&#x4E86;&#x3002; &#x9664;&#x53BB;&#x5143;&#x7D20;&#x672C;&#x8EAB;&#xFF0C;css&#x7684;&#x54EA;&#x4E9B;&#x662F;&#x8DDF;&#x5E03;&#x5C40;&#x6709;&#x5173;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x62FF;&#x6765;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;control&#x7684;&#xFF1F;</p>
<p>width/height &#x5BBD;/&#x9AD8;</p>
<p>padding/margin &#x5185;&#x5916;&#x8FB9;&#x8DDD;</p>
<p>position &#x5B9A;&#x4F4D;</p>
<p>float &#x6D6E;&#x52A8;</p>
<p>display &#x5143;&#x7D20;&#x7C7B;&#x578B;</p>
<p>z-index &#x5C42;&#x7EA7;</p>
<p>overflow &#x6EA2;&#x51FA;&#x5904;&#x7406;</p>
<p>&#x6587;&#x672C;&#x76F8;&#x5173;&#xFF1A;text-align&#x3001;text-transform&#x3001;text-indent&#x3001;word-wrap&#x3001;white-space&#x3001;line-height&#x3001;vertical-align&#x7B49;&#x7B49;</p>
<p>&#x4E66;&#x5199;&#x6A21;&#x5F0F;&#xFF1A;direction&#x3001;writing-mode&#x7B49;</p>
<p>Multi-column&#x3001;calc()&#x3001;Grid&#x3001;regions&#x3001;shapes&#x3001;Object-fit/Object-position&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x9664;&#x4E86;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8BF4;&#xFF0C;&#x6D41;&#x5F0F;&#x3001;&#x81EA;&#x9002;&#x5E94;&#x3001;&#x54CD;&#x5E94;&#x5F0F;&#x3001;&#x5F39;&#x6027;&#x76D2;&#xFF0C;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x53CC;&#x98DE;&#x7FFC;&#x3001;&#x5723;&#x676F;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0D;&#x662F;&#x5417;&#xFF1F;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x6211;&#x95EE;&#x4F60;&#x98DF;&#x7269;&#x6709;&#x54EA;&#x51E0;&#x79CD;&#xFF0C;&#x4F60;&#x8DDF;&#x6211;&#x8BF4;&#xFF0C;&#x6709;&#x201C;&#x9EBB;&#x5A46;&#x8C46;&#x8150;&#x3001;&#x5C0F;&#x8471;&#x62CC;&#x8C46;&#x8150;&#x3001;&#x7EA2;&#x70E7;&#x8C46;&#x8150;&#x3001;&#x5BB6;&#x5E38;&#x7092;&#x8C46;&#x8150;&#x201D;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4E9B;&#x662F;&#x83DC;&#x5F0F;&#xFF0C;&#x5B83;&#x80FD;&#x5403;&#xFF0C;&#x4F46;&#x5E94;&#x8BE5;&#x5F52;&#x5230;&#x98DF;&#x7269;&#x79CD;&#x7C7B;&#x91CC;&#x5417;&#xFF1F;&#x663E;&#x7136;&#x4E0D;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E0A;&#x9762;&#x6240;&#x5217;&#x51FA;&#x6765;&#x7684;&#x8FD9;&#x4E9B;&#x5177;&#x4F53;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x771F;&#x6B63;&#x4F5C;&#x7528;&#x5230;&#x5143;&#x7D20;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x624D;&#x662F;&#x6700;&#x7406;&#x60F3;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<p>&#x628A;&#x4ED6;&#x4EEC;&#x5217;&#x51FA;&#x6765;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x6CA1;&#x60F3;&#x5230;&#x6709;&#x5982;&#x6B64;&#x4E4B;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6CA1;&#x5217;&#x5B8C;&#x3002;&#x5B83;&#x4EEC;&#x5F53;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x6700;&#x521D;&#x7684;&#x7248;&#x672C;&#x5C31;&#x652F;&#x6301;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x662F;&#x56E0;&#x4E3A;css3&#x7684;&#x51FA;&#x73B0;&#x4E14;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5F88;&#x597D;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#xFF0C;&#x6709;&#x5F85;&#x7EE7;&#x7EED;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x652F;&#x6301;&#x3002; &#x60F3;&#x4E86;&#x89E3;&#x7684;&#x66F4;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;css&#x53C2;&#x8003;&#x624B;&#x518C;&#x548C;w3cplus&#x3001;css reference&#x3001;webkitcss&#x91CC;&#x9762;&#x7684;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x7ECF;&#x8FC7;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x5520;&#x53E8;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4ECE;&#x201C;&#x672A;&#x77E5;&#x201D;&#x5230;&#x201C;&#x5DF2;&#x77E5;&#x201D;&#x5230;&#x201C;&#x719F;&#x77E5;&#x201D;&#xFF0C;&#x518D;&#x63A2;&#x7D22;&#x201C;&#x672A;&#x77E5;&#x201D;&#x7684;&#x8F68;&#x8FF9;&#xFF0C;&#x6B63;&#x6240;&#x8C13;&#x5B66;&#x65E0;&#x6B62;&#x5883;&#xFF0C;&#x53EA;&#x662F;&#x5E03;&#x5C40;&#x5C31;&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x8FDC;&#x672A;&#x8BF4;&#x5B8C;&#x3002;&#x524D;&#x7AEF;&#x5145;&#x6EE1;&#x7740;&#x4E50;&#x8DA3;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5171;&#x540C;&#x53BB;&#x73A9;&#x800D;~&#x4E0B;&#x6B21;&#x89C1;</p>
</div><a data-url="http://yoursite.com/2015/12/01/basic-layout/" data-id="cinae7blz0051h3qi8wq3z4ty" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2015/12/14/自学者需要具备的基本技能和素质/" class="pre">自学者需要具备的基本技能和素质</a><a href="/2015/10/23/zaoduke-visit/" class="next">前端早读课专访</a></div><div data-thread-key="2015/12/01/basic-layout/" data-title="说说基本的布局观" data-url="http://yoursite.com/2015/12/01/basic-layout/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2015/12/01/basic-layout/" data-title="说说基本的布局观" data-url="http://yoursite.com/2015/12/01/basic-layout/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/05/javascript-study-two/">征服javascript学习笔记（二）——基本概念（上）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/02/28/my-love-with-words/">我的文字情结</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>