<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>图片以及其他替换元素的空隙问题 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">图片以及其他替换元素的空隙问题</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">图片以及其他替换元素的空隙问题</h1><div class="post-meta">Apr 18, 2015<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2015/04/18/img-ele-gap/" href="/2015/04/18/img-ele-gap/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div></div></div><div class="post-content"><p>&#x4ECA;&#x5929;&#x6765;&#x804A;&#x804A;&#x56FE;&#x7247;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5BF9;&#x4E8E;web&#x6765;&#x8BF4;&#xFF0C;&#x56FE;&#x7247;&#x662F;&#x4E2A;&#x5927;&#x547D;&#x9898;&#xFF0C;&#x591A;&#x5927;&#x5462;&#xFF1F;&#x8981;&#x591A;&#x5927;&#x6709;&#x591A;&#x5927;~ &#x8FD9;&#x91CC;&#x53EA;&#x8C08;&#x5B83;&#x662F;&#x600E;&#x4E48;&#x201C;&#x4E0D;&#x542C;&#x8BDD;&#x7684;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x5B83;&#x4E56;&#x4E00;&#x70B9;&#x3002;</p>
<p>Web&#x7684;&#x4E16;&#x754C;&#x91CC;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x4E0E;&#x4E4B;&#x5BF9;&#x5E94;&#x7684;&#x57FA;&#x672C;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x60C5;&#x666F;&#x548C;&#x5BF9;&#x7B56;&#x3002;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x5C31;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x9047;&#x5230;&#x67D0;&#x79CD;&#x60C5;&#x666F;&#x548C;&#x627E;&#x5230;&#x7684;&#x5BF9;&#x7B56;&#x4E5F;&#x90FD;&#x5177;&#x6709;&#x5076;&#x7136;&#x6027;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x6311;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x9047;&#x5230;&#x8FC7;&#x7684;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x8BF4;&#x8BF4;&#x3002;</p>
<p>&#x4E0A;&#x7BC7;&#x6587;&#x7AE0;&#x6211;&#x4EEC;&#x8C08;&#x4E86;inline-block&#x7684;&#x7A7A;&#x9699;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x4F9D;&#x7136;&#x662F;&#x804A;&#x7A7A;&#x9699;&#x3002;&#x901A;&#x8FC7;&#x4E0A;&#x7BC7;&#x6587;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5176;&#x5B9E;&#x7A7A;&#x9699;&#x548C;&#x5143;&#x7D20;&#x672C;&#x8EAB;&#x5E76;&#x65E0;&#x76F4;&#x63A5;&#x5173;&#x7CFB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x771F;&#x7684;&#x5C31;&#x662F;&#x201C;&#x7A7A;&#x9699;&#x201D;&#x3002;&#x4F46;&#x662F;&#x5C0F;&#x5C0F;&#x7684;&#x7A7A;&#x9699;&#x5374;&#x5E38;&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x5C0F;&#x5C0F;&#x7684;&#x56F0;&#x60D1;&#x548C;&#x9EBB;&#x70E6;&#x3002;</p>
<p>&#x573A;&#x666F;&#xFF1A;&#x201C;&#x8FD9;&#x662F;&#x600E;&#x4E48;&#x56DE;&#x4E8B;&#x554A;&#xFF0C;&#x6211;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x7ED9;&#x56FE;&#x7247;&#x8BBE;&#x7F6E;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x7A7A;&#x9699;&#xFF1F;&#xFF01;&#x7136;&#x540E;&#xFF0C;margin&#x3001;padding&#x3001;border&#x3001;outline&#x2026;&#xFF08;&#x4E03;&#x5927;&#x59D1;&#x516B;&#x5927;&#x59E8;&#xFF09;&#x5168;&#x90FD;&#x53BB;&#x6389;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x6709;&#xFF1F;&#xFF01;&#x80BF;&#x4E48;&#x529E;&#x5450;&#xFF1F;&#xFF01;&#x201D;</p>
<p>&#x5BF9;&#x4E8E;&#x4EE5;&#x4E0A;&#x573A;&#x666F;&#x4F60;&#x662F;&#x5426;&#x719F;&#x6089;&#x634F;&#xFF1F;~&#x9887;&#x6709;&#x75C5;&#x6025;&#x4E71;&#x6295;&#x533B;&#xFF0C;reset&#x6389;&#x5B83;&#x5168;&#x5BB6;&#x7684;&#x610F;&#x5473;&#x54C8;&#xFF01;</p>
<p>&#x518D;&#x7A0D;&#x5FAE;&#x5206;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x6765;&#x8BF4;&#xFF08;&#x5176;&#x5B9E;&#x6CA1;&#x5565;&#x533A;&#x522B;&#xFF09;&#xFF0C;&#x4E00;&#x79CD;&#x662F;img&#x201C;&#x88F8;&#x5954;&#x201D;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x88AB;&#x5176;&#x4ED6;&#x5143;&#x7D20;&#x5305;&#x88F9;&#xFF0C;&#x6BD4;&#x5982;div&#x6216;&#x8005;li&#x7B49;&#x3002;</p>
<p>&#x201C;&#x88F8;&#x5954;&#x201D;&#x4EE3;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>&lt;div class=&quot;img_list&quot;&gt;
    &lt;img src=&quot;images/xiang01.jpg&quot; alt=&quot;&quot;&gt;
    &lt;img src=&quot;images/xiang02.jpg&quot; alt=&quot;&quot;&gt;            
    &lt;img src=&quot;images/xiang03.jpg&quot; alt=&quot;&quot;&gt;
    &lt;img src=&quot;images/xiang04.jpg&quot; alt=&quot;&quot;&gt;
    &lt;img src=&quot;images/xiang05.jpg&quot; alt=&quot;&quot;&gt;            
&lt;/div&gt;
</code></pre><p>&#x5B9E;&#x73B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="/2015/04/18/img-ele-gap/1.png" alt=""></p>
<p>&#x806A;&#x660E;&#x5982;&#x4F60;&#x5E94;&#x8BE5;&#x770B;&#x51FA;&#x7AEF;&#x502A;&#x4E86;&#x5BF9;&#x5427;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x6BCF;&#x5F20;&#x56FE;&#x7247;&#x7684;&#x53F3;&#x8FB9;&#x5982;&#x9884;&#x671F;&#x822C;&#x51FA;&#x73B0;&#x4E86;&#x7A7A;&#x9699;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4EC5;&#x4EC5;&#x5982;&#x6B64;&#x4E48;&#xFF1F;~ &#x6211;&#x4EEC;&#x628A;&#x5BB9;&#x5668;&#x7F29;&#x5C0F;&#x770B;&#x4E00;&#x4E0B; duang~</p>
<p><img src="/2015/04/18/img-ele-gap/2.png" alt=""></p>
<p>&#x539F;&#x6765;&#x4E0D;&#x53EA;&#x662F;&#x53F3;&#x8FB9;&#x6709;&#xFF0C;&#x4E0B;&#x9762;&#x4E5F;&#x6709;&#xFF1F;&#x4F3C;&#x66FE;&#x76F8;&#x8BC6;&#x5417;&#xFF1F;</p>
<p><strong>&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;font-size&#xFF1A;0&#xFF1B;</strong></p>
<p>&#x662F;&#x7684;&#x3002;&#x201C;&#x97F3;&#x70C2;&#x4E0D;&#x5520;&#x55D1;&#x201D;&#x90A3;&#x5BB6;&#x4F19;&#x597D;&#x50CF;&#x4E5F;&#x662F;&#x6709;&#x7A7A;&#x9699;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x628A;&#x5B83;&#x6D88;&#x9664;&#x6389;&#x8BD5;&#x8BD5;&#xFF0C;&#x628A;font-size&#x8BBE;&#x7F6E;&#x4E3A;0&#xFF1B;</p>
<p><img src="/2015/04/18/img-ele-gap/3.png" alt=""></p>
<p>&#x545C;&#x547C;&#xFF0C;&#x679C;&#x7136;&#xFF0C;&#x90A3;&#x8FD9;&#x662F;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;float</strong></p>
<p>&#x7531;&#x4E8E;float&#x80FD;&#x8BA9;&#x5143;&#x7D20;&#x8131;&#x79BB;&#x6B63;&#x5E38;&#x6587;&#x6863;&#x6D41;&#xFF0C;&#x53EF;&#x8C13;&#x6709;&#x6467;&#x6BC1;&#x4E00;&#x5207;&#x7684;&#x67B6;&#x52BF;&#xFF0C;&#x8FD9;&#x91CC;&#x4E5F;&#x4E0D;&#x610F;&#x5916;&#xFF0C;&#x4F7F;&#x7528;float&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x4ED6;&#x4EEC;&#x6D88;&#x5931;&#x4E8E;&#x65E0;&#x5F62;&#xFF0C;&#x5982;&#x679C;&#x8D76;&#x4E0A;&#x4F60;&#x5236;&#x4F5C;&#x56FE;&#x6587;&#x6DF7;&#x6392;&#x6587;&#x5B57;&#x73AF;&#x7ED5;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E00;&#x4E3E;&#x4E24;&#x5F97;&#x4E86;~</p>
<p><strong>&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;vertical-align&#xFF1A;XX&#xFF1B;</strong></p>
<p>&#x6216;&#x8BB8;&#x4F60;&#x4F1A;&#x6709;&#x70B9;&#x5947;&#x602A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;XX&#xFF1F;&#x6CA1;&#x9519;&#xFF0C;&#x6709;&#x4E9B;&#x6587;&#x7AE0;&#x4E2D;&#x6709;&#x8BF4;&#x8BBE;&#x4E3A;&#x201C;top&#x201D;&#xFF0C;&#x6709;&#x4E9B;&#x6587;&#x7AE0;&#x4E2D;&#x8BF4;&#x7528;&#x201C;bottom&#x201D;&#xFF0C;&#x53EF;&#x662F;&#x5728;css&#x5982;&#x6B64;&#x7684;&#x7CBE;&#x5F69;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x4F60;&#x4F1A;&#x5BF9;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7B54;&#x6848;&#x6EE1;&#x8DB3;&#x4E48;&#xFF1F;&#x603B;&#x4F1A;&#x591A;&#x95EE;&#x51E0;&#x4E2A;why&#xFF1F;&#x7136;&#x540E;&#xFF0C;you try try &#x4FBF;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#xFF0C;&#x539F;&#x6765;&#x8BBE;&#x7F6E;top|bottom|middle|text-bottom|text-top&#x7B49;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x6389;&#x8FD9;&#x4E2A;&#x7A7A;&#x9699;&#x7684;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5F80;&#x5F80;&#x9875;&#x9762;&#x4E2D;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x56FE;&#x7247;&#x5B64;&#x7ACB;&#x7684;&#x5B58;&#x5728;&#x7740;&#xFF0C;&#x8BBE;&#x5B9A;&#x4E0D;&#x540C;&#x7684;&#x503C;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x5176;&#x4ED6;&#x7684;&#x5185;&#x5BB9;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x7EC6;&#x8BF4;&#xFF0C;&#x5177;&#x4F53;&#x8BF7;&#x5404;&#x4F4D;&#x53BB;&#x4E86;&#x89E3;&#x4E0B;vertical-align&#x65B9;&#x9762;&#x7684;&#x4E1C;&#x4E1C;&#xFF08;&#x4E0B;&#x9762;&#x6709;&#x4E2A;&#x5F20;&#x8001;&#x5E08;&#x7684;&#x94FE;&#x63A5;&#xFF09;&#x3002;&#x81F3;&#x4E8E;&#x4E3A;&#x4EC0;&#x4E48;vertical-align&#x6709;&#x9664;&#x6389;&#x8FD9;&#x4E2A;&#x7A7A;&#x9699;&#x7684;&#x4F5C;&#x7528;&#x5462;&#xFF1F;</p>
<p>&#x636E;&#x4E0D;&#x5B8C;&#x5168;&#x8003;&#x5BDF;&#xFF0C;&#x56FE;&#x7247;&#x6587;&#x5B57;&#x7B49;inline&#x5143;&#x7D20;&#x9ED8;&#x8BA4;&#x662F;&#x548C;&#x7236;&#x7EA7;&#x5143;&#x7D20;&#x7684;baseline&#x5BF9;&#x9F50;&#x7684;&#xFF0C;&#x800C;baseline&#x53C8;&#x548C;&#x7236;&#x7EA7;&#x5E95;&#x8FB9;&#x6709;&#x4E00;&#x5B9A;&#x8DDD;&#x79BB;&#xFF08;&#x8FD9;&#x4E2A;&#x8DDD;&#x79BB;&#x548C; font-size&#xFF0C;font-family &#x76F8;&#x5173;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x8BBE;&#x7F6E; vertical-align&#x7684;&#x67D0;&#x4E9B;&#x503C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BD5;&#x4E00;&#x4E0B;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x8D1F;&#x767E;&#x5206;&#x6BD4;&#x503C;&#x4E5F;&#x884C;&#x54E6;~</p>
<p><strong>&#x65B9;&#x6CD5;&#x56DB;&#xFF1A;display&#xFF1A;block&#xFF1B;</strong></p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x53EF;&#x884C;&#x7684;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x8DDF;&#x65B9;&#x6CD5;&#x4E09;&#x548C;&#x65B9;&#x6CD5;&#x4E8C;&#x6709;&#x7740;&#x67D0;&#x79CD;&#x5FAE;&#x5999;&#x7684;&#x8054;&#x7CFB;&#xFF0C;what&#xFF1F;&#x83AB;&#x6025;&#xFF0C;&#x5148;&#x6765;&#x8BF4;&#x8DDF;&#x65B9;&#x6CD5;&#x4E09;&#x6709;&#x4F55;&#x8054;&#x7CFB;&#xFF0C;&#x65B9;&#x6CD5;&#x4E09;&#x91CC;&#xFF0C;&#x626F;&#x5230;&#x4E86;baseline&#xFF0C;&#x4E5F;&#x626F;&#x5230;&#x4E86;vertical-align&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x626F;&#x4E00;&#x626F;&#x5B83;&#x5728;&#x54EA;&#x4E9B;&#x5143;&#x7D20;&#x4E0A;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;block&#x7EA7;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x73A9;&#x513F;&#x4E0D;&#x4E86;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x89C1;&#x5F20;&#x8001;&#x5E08;&#x725B;&#x5976;/&#x679C;&#x51BB;/&#x575A;&#x679C;&#xFF0C;&#x6545;&#x800C;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E3A;block&#xFF0C;&#x5B83;&#x5C31;&#x5E72;&#x6389;&#x4E86;&#x7A7A;&#x9699;&#x3002;&#x8DDF;&#x65B9;&#x6CD5;&#x4E8C;&#x7684;&#x5173;&#x7CFB;&#x662F;&#xFF0C;&#x4E0D;&#x77E5;&#x5927;&#x5BB6;&#x662F;&#x5426;&#x6CE8;&#x610F;&#x5230;&#x884C;&#x7EA7;&#x5143;&#x7D20;&#x5728;&#x8BBE;&#x7F6E;float&#x4E4B;&#x540E;&#xFF0C;&#x5177;&#x5907;&#x4E86;&#x5757;&#x7EA7;&#x5143;&#x7D20;&#x6240;&#x5177;&#x5907;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6BD4;&#x5982;&#x8BBE;&#x7F6E;&#x5BBD;&#x9AD8;&#xFF0C;&#x5185;&#x5916;&#x8FB9;&#x8DDD;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6D6E;&#x52A8;&#xFF0C;&#x6548;&#x679C;&#x8DDF;&#x6B64;&#x6CD5;&#x7C7B;&#x4F3C;&#x3002; &#x5F53;&#x7136;&#xFF0C;&#x9274;&#x4E8E;block&#x4E4B;&#x540E;&#x4F1A;&#x6539;&#x53D8;&#x5B83;&#x672C;&#x8EAB;inline&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x6709;&#x4E9B;&#x670B;&#x53CB;&#x53EF;&#x80FD;&#x4F1A;&#x8003;&#x8651;inline-block&#xFF0C;but&#x8FD9;&#x6837;&#x662F;&#x4E0D;&#x51D1;&#x6548;&#x7684;&#xFF0C;&#x51B5;&#x4E14;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x5B58;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x65B9;&#x6CD5;&#x4E94;&#xFF1A;&#x4E3A;&#x7236;&#x5BB9;&#x5668;&#x8BBE;&#x7F6E;&#x9AD8;&#x5EA6;</strong></p>
<p>&#x73B0;&#x5728;&#x624D;&#x8BF4;&#x8D77;&#x8FD9;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5E73;&#x5E38;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4E0D;&#x662F;&#x6211;&#x4E0D;&#x591F;&#x5766;&#x767D;&#xFF0C;&#x56E0;&#x4E3A;&#x5F88;&#x591A;&#x4EBA;&#x53EF;&#x80FD;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x9047;&#x5230;&#x8FC7;&#x56FE;&#x7247;&#x7A7A;&#x9699;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x662F;&#x4E2A;&#x633A;&#x96BE;&#x9047;&#x5230;&#x7684;bug&#xFF0C;&#x5176;&#x5B9E;&#x4E0D;&#x7136;&#xFF0C;&#x6CA1;&#x6709;&#x9047;&#x5230;&#x53F3;&#x8FB9;&#x7684;&#x7A7A;&#x9699;&#x662F;&#x56E0;&#x4E3A;&#xFF0C;&#x53EA;&#x8981;&#x5B83;&#x4E0D;&#x662F;&#x88F8;&#x5954;&#xFF0C;&#x8B6C;&#x5982;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>&lt;ul class=&quot;img_list&quot;&gt;
    &lt;li&gt;&lt;img src=&quot;images/xiang01.jpg&quot; alt=&quot;&quot;&gt;
        &lt;/li&gt;
    &lt;li&gt;&lt;img src=&quot;images/xiang02.jpg&quot; alt=&quot;&quot;&gt;
        &lt;/li&gt;
    &lt;li&gt;&lt;img src=&quot;images/xiang03.jpg&quot; alt=&quot;&quot;&gt;
        &lt;/li&gt;
    &lt;li&gt;&lt;img src=&quot;images/xiang04.jpg&quot; alt=&quot;&quot;&gt;
        &lt;/li&gt;
    &lt;li&gt;&lt;img src=&quot;images/xiang05.jpg&quot; alt=&quot;&quot;&gt;
        &lt;/li&gt;
&lt;/ul&gt;
</code></pre><p>img&#x88AB;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#x5305;&#x88F9;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x91CC;&#x662F;li&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x662F;&#x522B;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x53F3;&#x8FB9;&#x7684;&#x7A7A;&#x9699;&#x5C31;&#x6CA1;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x5B58;&#x5728;&#x4E8E;img&#x4E4B;&#x95F4;&#xFF0C;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x5C42;&#x5BB9;&#x5668;&#x5C06;&#x5176;&#x9694;&#x5F00;&#x3002;&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x56E0;&#x4E3A;&#x8BBE;&#x7F6E;&#x4E86;margin&#x503C;&#xFF0C;&#x4ECE;&#x89C6;&#x89C9;&#x4E0A;&#x76F4;&#x63A5;&#x5FFD;&#x7565;&#x4E86;&#x7A7A;&#x9699;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4E0D;&#x5728;&#x8BA8;&#x8BBA;&#x4E4B;&#x5217;&#x54C8;~ &#x6CA1;&#x6709;&#x9047;&#x5230;&#x8FC7;&#x4E0B;&#x9762;&#x7684;&#x7A7A;&#x9699;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x65E0;&#x610F;&#x95F4;&#x4F7F;&#x7528;&#x4E86;&#x80FD;&#x591F;&#x6D88;&#x9664;&#x6389;&#x5B83;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x5E73;&#x5E38;&#x548C;&#x81EA;&#x7136;&#x7684;&#x5C31;&#x662F;&#x8BBE;&#x7F6E;&#x7236;&#x5BB9;&#x5668;&#x9AD8;&#x5EA6;&#x4E86;&#x3002;</p>
<p><strong>&#x65B9;&#x6CD5;&#x516D;&#xFF1A;&#x65E0;&#x7F1D;&#x6392;&#x5217;</strong></p>
<p>&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x548C;&#x6D88;&#x9664;inline-block&#x7A7A;&#x9699;&#x540C;&#x7406;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x7D27;&#x5BC6;&#x6392;&#x5217;&#x5373;&#x53EF;&#xFF0C;&#x4E0D;&#x8FC7;&#x540C;&#x6837;&#xFF0C;&#x4ECE;&#x4EE3;&#x7801;&#x7684;&#x683C;&#x5F0F;&#x4E0A;&#x6765;&#x8BF4;&#x4E0D;&#x5B9C;&#x91C7;&#x53D6;&#x3002;</p>
<p>&#x8BA8;&#x8BBA;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x8C8C;&#x4F3C;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x662F;img&#x6240;&#x72EC;&#x6709;&#x7684;&#xFF0C;&#x662F;&#x4E48;&#xFF1F;&#x806A;&#x660E;&#x5982;&#x4F60;&#x53EF;&#x80FD;&#x53C8;&#x731C;&#x5BF9;&#xFF0C;no&#xFF01;~ &#x53EF;&#x80FD;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;html&#x7684;&#x5143;&#x7D20;&#x4E2D;&#x6709;&#x4E00;&#x7C7B;&#x5143;&#x7D20;&#x53EB;&#x505A;&#x66FF;&#x6362;&#x5143;&#x7D20;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x66FF;&#x6362;&#x5143;&#x7D20;&#x5462;&#xFF0C;&#x54B1;&#x62FF;&#x89C4;&#x8303;&#x8BF4;&#x8BF4;&#x4E8B;&#x513F;&#x5427;&#xFF1B;&#x4EE5;img&#x4E3A;&#x4F8B;&#xFF1A;</p>
<p>The IMG element embeds an image in the current document at the location of the element&#x2019;s definition. The IMG element has no content; it is usually replaced inline by the image designated by the src attribute&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x89C4;&#x8303;&#x91CC;&#x5BF9;img&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x7B80;&#x5355;&#x8BF4;&#x6765;img&#x5143;&#x7D20;&#x6CA1;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x662F;&#x628A;&#x6765;&#x81EA;src&#x5C5E;&#x6027;&#x503C;&#x7684;&#x90A3;&#x4E2A;&#x56FE;&#x7247;&#x5D4C;&#x5165;&#x9875;&#x9762;&#x4E2D;&#x3002;</p>
<p>&#x8BF4;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x60F3;&#x8D77;&#x8FD8;&#x6709;&#x4E0D;&#x5C11;&#x5143;&#x7D20;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1F;&#x6BD4;&#x5982;input&#x3001;textarea&#x3001;select&#x7B49;&#x7B49;&#xFF1F;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x540C;&#x6837;&#x5B58;&#x5728;&#x7740;&#x7F1D;&#x9699;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF0C;&#x770B;&#x56FE;</p>
<p><img src="/2015/04/18/img-ele-gap/4.png" alt=""></p>
<p>&#x662F;&#x5426;&#x6709;&#x79D2;&#x61C2;&#x7684;&#x611F;&#x89C9;&#xFF1F;</p>
<p>&#x597D;&#x5427;&#xFF0C;&#x626F;&#x4E86;&#x4E0D;&#x5C11;&#x4E86;&#xFF0C;&#x91CC;&#x9762;&#x63D0;&#x5230;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x4E1C;&#x4E1C;&#xFF0C;&#x6CA1;&#x6709;&#x7EC6;&#x8C08;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x6311;&#x51FA;&#x6765;&#x90FD;&#x591F;&#x559D;&#x4E00;&#x58F6;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x7EC6;&#x804A;&#x4E86;&#xFF0C;&#x91CD;&#x70B9;&#x8FD8;&#x662F;&#x5E2E;&#x52A9;&#x6709;&#x9047;&#x5230;&#x7C7B;&#x4F3C;&#x95EE;&#x9898;&#x7684;&#x670B;&#x53CB;&#x627E;&#x5230;&#x8F83;&#x5408;&#x9002;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002;&#x6587;&#x4E2D;&#x53EF;&#x80FD;&#x6709;&#x4E0D;&#x5F53;&#x4E4B;&#x5904;&#xFF0C;&#x8FD8;&#x671B;&#x6307;&#x6559;&#x3002;</p>
<p>&#x6B22;&#x8FCE;&#x6765;&#x8FD9;&#x91CC;&#x4EA4;&#x6D41;&#xFF1A;152128548<br>&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x524D;&#x7AEF;&#x5468;&#x672B; </p>
</div><a data-url="http://yoursite.com/2015/04/18/img-ele-gap/" data-id="cirxnem1d004oloqilbvpsm1h" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2015/05/09/say-opacity/" class="pre">小叙透明</a><a href="/2015/04/11/inline-block-gap/" class="next">小谈inline-block的那点空隙</a></div><div data-thread-key="2015/04/18/img-ele-gap/" data-title="图片以及其他替换元素的空隙问题" data-url="http://yoursite.com/2015/04/18/img-ele-gap/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2015/04/18/img-ele-gap/" data-title="图片以及其他替换元素的空隙问题" data-url="http://yoursite.com/2015/04/18/img-ele-gap/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/成长，经历，思考/" style="font-size: 15px;">成长，经历，思考</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/08/17/tencent_oneyear/">总有一个地方，我们未曾到达——我的鹅厂周年记</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/15/readbook_seetheworld/">静静的打开一本书，你会看到新的世界</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/08/07/css_design_method/">没那么难，谈CSS的设计模式</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>