<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="思考," />





  <link rel="alternate" href="/atom.xml" title="灵感之见" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x96C4;&amp;#x9738;&amp;#x5929;&amp;#x4E0B;&amp;#xFF0C;&amp;#x6210;&amp;#x4E5F;&amp;#x98CE;&amp;#x4E91;&amp;#xFF0C;&amp;#x8D25;&amp;#x4E5F;&amp;#x98CE;&amp;#x4E91;&amp;#xFF01;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x7559;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8D70;&amp;#xFF1F;">
<meta property="og:type" content="article">
<meta property="og:title" content="在不是终点的”终点“，等风来~">
<meta property="og:url" content="http://yoursite.com/2014/11/09/在不是终点的”终点“，等风来~/index.html">
<meta property="og:site_name" content="灵感之见">
<meta property="og:description" content="&amp;#x96C4;&amp;#x9738;&amp;#x5929;&amp;#x4E0B;&amp;#xFF0C;&amp;#x6210;&amp;#x4E5F;&amp;#x98CE;&amp;#x4E91;&amp;#xFF0C;&amp;#x8D25;&amp;#x4E5F;&amp;#x98CE;&amp;#x4E91;&amp;#xFF01;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x7559;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8D70;&amp;#xFF1F;">
<meta property="og:updated_time" content="2016-02-24T12:56:42.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="在不是终点的”终点“，等风来~">
<meta name="twitter:description" content="&amp;#x96C4;&amp;#x9738;&amp;#x5929;&amp;#x4E0B;&amp;#xFF0C;&amp;#x6210;&amp;#x4E5F;&amp;#x98CE;&amp;#x4E91;&amp;#xFF0C;&amp;#x8D25;&amp;#x4E5F;&amp;#x98CE;&amp;#x4E91;&amp;#xFF01;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x7559;&amp;#xFF0C;&amp;#x4E3A;&amp;#x4EC0;&amp;#x4E48;&amp;#x8D70;&amp;#xFF1F;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 在不是终点的”终点“，等风来~ | 灵感之见 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感之见</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                在不是终点的”终点“，等风来~
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2014-11-09T00:00:00+08:00" content="2014-11-09">
              2014-11-09
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/思考/" itemprop="url" rel="index">
                    <span itemprop="name">思考</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x96C4;&#x9738;&#x5929;&#x4E0B;&#xFF0C;&#x6210;&#x4E5F;&#x98CE;&#x4E91;&#xFF0C;&#x8D25;&#x4E5F;&#x98CE;&#x4E91;&#xFF01;<br>&#x4E3A;&#x4EC0;&#x4E48;&#x7559;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8D70;&#xFF1F;</p>
<p>&#x662F;&#x7684;&#xFF0C;&#x6211;&#x53C8;&#x8D70;&#x4E86;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8D70;&#x662F;5&#x4E2A;&#x6708;&#x524D;&#xFF0C;&#x6BCF;&#x6B21;&#x79BB;&#x5F00;&#xFF0C;&#x6211;&#x90FD;&#x633A;&#x7EA0;&#x7ED3;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x5185;&#x5FC3;&#x7684;&#x7B54;&#x6848;&#x662F;&#x6E05;&#x6670;&#x7684;&#xFF0C;&#x4F46;&#x6211;&#x5BF9;&#x6BCF;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x90FD;&#x662F;&#x6709;&#x611F;&#x60C5;&#x7684;&#xFF0C;&#x5F53;&#x5E0C;&#x671B;&#x53D8;&#x6210;&#x4E86;&#x5931;&#x671B;&#xFF0C;&#x65E0;&#x529B;&#x518D;&#x633D;&#x56DE;&#x3002;</p>
<p>&#x77E5;&#x9053;&#x7684;&#x90FD;&#x4F1A;&#x95EE;&#x6211;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x6362;&#x5DE5;&#x4F5C;&#x8FD9;&#x4E48;&#x9891;&#x7E41;&#xFF1F;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x4E24;&#x4EFD;&#x5DE5;&#x4F5C;&#x6240;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x6216;&#x8BB8;&#x8FD8;&#x6CA1;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x4E45;&#xFF0C;&#x53EF;&#x6211;&#x53C8;&#x4F55;&#x66FE;&#x4E0D;&#x60F3;&#x6709;&#x4E00;&#x4EFD;&#x957F;&#x671F;&#x7A33;&#x5B9A;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x597D;&#x597D;&#x53D1;&#x5C55;&#x5462;&#xFF1F;&#x81F3;&#x4E8E;&#x539F;&#x56E0;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x4E5F;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#x3002;&#x6211;&#x81EA;&#x8BA4;&#x4E3A;&#x662F;&#x4E2A;&#x6709;&#x8010;&#x6027;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x5230;&#x8FEB;&#x4E0D;&#x5F97;&#x5DF2;&#x4E0D;&#x4F1A;&#x505A;&#x51FA;&#x544A;&#x522B;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x65E2;&#x4ECE;&#x6211;&#x5FC3;&#xFF0C;&#x4FBF;&#x4E5F;&#x65E0;&#x6094;&#xFF01;</p>
<p>&#x8FD9;&#x4E00;&#x5E74;&#x591A;&#x4EE5;&#x6765;&#xFF0C;&#x6211;&#x5F88;&#x5C11;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x5047;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x653E;&#x5047;&#x3002;&#x7531;&#x4E8E;&#x4E00;&#x4E9B;&#x4E0D;&#x582A;&#x56DE;&#x9996;&#x7684;&#x5F80;&#x4E8B;&#xFF0C;&#x7ED9;&#x6211;&#x9020;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x9700;&#x8981;&#x53BB;&#x5F25;&#x8865;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6709;&#x592A;&#x591A;&#x4E0D;&#x8DB3;&#xFF0C;&#x592A;&#x591A;&#x8425;&#x517B;&#x9700;&#x8981;&#x5438;&#x53D6;&#xFF0C;&#x89C9;&#x5F97;&#x54EA;&#x6015;&#x4E00;&#x5929;48&#x5C0F;&#x65F6;&#x4E5F;&#x5403;&#x4E0D;&#x9971;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x8FD9;&#x4E48;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x4E94;&#x4E00;&#x3001;&#x4E2D;&#x79CB;&#x3001;&#x5341;&#x4E00;&#x3002;&#x3002;&#x6240;&#x6709;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#xFF0C;&#x521A;&#x8FC7;&#x4E86;&#x5341;&#x4E00;&#xFF0C;11&#x6708;&#x6211;&#x51B3;&#x5B9A;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x4E2A;&#x5047;&#xFF0C;&#x8D81;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x7ED9;&#x8111;&#x5B50;&#x51CF;&#x51CF;&#x8D1F;&#xFF0C;&#x6574;&#x7406;&#x4E00;&#x4E0B;&#x5934;&#x7EEA;&#xFF0C;&#x56E0;&#x4E3A;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x4F1A;&#x6BD4;&#x4E4B;&#x524D;&#x7684;&#x66F4;&#x8F7B;&#x677E;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x53EA;&#x4F1A;&#x66F4;&#x91CD;&#x3002;&#x4F46;&#xFF0C;&#x65E2;&#x5DF2;&#x9009;&#x62E9;&#xFF0C;&#x4FBF;&#x6B23;&#x7136;&#x524D;&#x5F80;&#xFF01;~</p>
<p>&#x5728;&#x4E0D;&#x7B97;&#x957F;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x6211;&#x7ECF;&#x5386;&#x4E86;&#x4E24;&#x5BB6;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#xFF0C;&#x7B2C;&#x4E00;&#x5BB6;&#x7ED9;&#x4E86;&#x6211;&#x5165;&#x884C;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x867D;&#x7136;&#x85AA;&#x6C34;&#x4E0D;&#x9AD8;&#xFF0C;&#x4F46;&#x610F;&#x4E49;&#x5F88;&#x5927;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8E0F;&#x5165;&#x804C;&#x573A;&#xFF0C;&#x611F;&#x53D7;&#x804C;&#x573A;&#x6C1B;&#x56F4;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x6B63;&#x5F0F;&#x505A;&#x7F51;&#x7AD9;&#x2026;&#x2026;.&#x5F88;&#x591A;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4E0D;&#x7BA1;&#x6700;&#x540E;&#x6211;&#x79BB;&#x5F00;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5BF9;&#x5B83;&#x7684;&#x611F;&#x8C22;&#x662F;&#x4E0D;&#x4F1A;&#x53D8;&#x7684;&#x3002;&#x7B2C;&#x4E8C;&#x5BB6;&#xFF0C;&#x867D;&#x77ED;&#x6682;&#xFF0C;&#x60C5;&#x611F;&#x4E5F;&#x590D;&#x6742;&#xFF0C;&#x6211;&#x66FE;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x9009;&#x62E9;&#x611F;&#x5230;&#x5E86;&#x5E78;&#xFF0C;&#x89C9;&#x5F97;&#x516C;&#x53F8;&#x592A;&#x597D;&#x4E86;&#xFF0C;&#x8001;&#x677F;&#x592A;&#x597D;&#x4E86;&#xFF0C;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x7528;&#x8BF4;&#xFF0C;&#x90FD;&#x7ED9;&#x529E;&#x7684;&#x5F88;&#x9F50;&#x5907;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x65B9;&#x4FBF;&#x529E;&#x516C;&#x63D0;&#x4F9B;&#x4E86;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x6700;&#x597D;&#x6761;&#x4EF6;&#xFF0C;&#x85AA;&#x6C34;&#x4E5F;&#x6BD4;&#x4E4B;&#x524D;&#x7684;&#x9AD8;&#xFF0C;&#x56E2;&#x961F;&#x6210;&#x5458;&#x4E5F;&#x591A;&#x6837;&#x5316;&#xFF0C;&#x8BBE;&#x8BA1;&#xFF0C;&#x540E;&#x53F0;&#xFF0C;&#x524D;&#x7AEF;&#xFF0C;&#x5B89;&#x5353;&#xFF0C;ios&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x53EA;&#x86EE;&#x6709;&#x6218;&#x6597;&#x529B;&#xFF0C;&#x89E6;&#x89D2;&#x4F38;&#x5230;&#x5168;&#x5E73;&#x53F0;&#x7684;&#x56E2;&#x961F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x7684;&#x53D1;&#x751F;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x6084;&#x6084;&#x6539;&#x53D8;&#xFF0C;&#x76F4;&#x5230;&#xFF0C;&#x53D8;&#x5316;&#x5230;&#x6211;&#x65E0;&#x6CD5;&#x627F;&#x53D7;&#x4E4B;&#x91CD;&#x3002;&#x867D;&#x7136;&#x538B;&#x529B;&#x4E0D;&#x5927;&#xFF0C;&#x5DE5;&#x4F5C;&#x4E0D;&#x5FD9;&#xFF0C;&#x4F46;&#x5185;&#x5FC3;&#x544A;&#x8BC9;&#x6211;&#x90A3;&#x4E0D;&#x662F;&#x6211;&#x5E0C;&#x671B;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x9879;&#x76EE;&#x66F4;&#x6362;&#xFF0C;&#x4EBA;&#x5458;&#x6D41;&#x5931;&#xFF0C;&#x770B;&#x4E0D;&#x5230;&#x4E00;&#x4E1D;&#x4F1A;&#x597D;&#x8F6C;&#x7684;&#x8FF9;&#x8C61;&#x3002;&#x5C31;&#x5230;&#x4E86;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;&#x518D;&#x89C1;&#x7684;&#x65F6;&#x5019;&#x3002;&#x540C;&#x6837;&#x5F88;&#x611F;&#x8C22;&#x8FD9;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x524D;&#x7AEF;&#x7531;&#x6211;&#x4E00;&#x4E2A;&#x4EBA;&#x5168;&#x6743;&#x8D1F;&#x8D23;&#xFF0C;&#x6709;&#x53E5;&#x8BDD;&#x53EB;&#x201D;&#x80FD;&#x529B;&#x8D8A;&#x5927;&#xFF0C;&#x8D23;&#x4EFB;&#x5C31;&#x8D8A;&#x5927;&#x201C;&#xFF0C;&#x800C;&#x6211;&#x6070;&#x76F8;&#x53CD;&#xFF0C;&#x56E0;&#x4E3A;&#x8D23;&#x4EFB;&#x5927;&#x4E86;&#xFF0C;&#x6211;&#x4E0D;&#x5F97;&#x4E0D;&#x8BA9;&#x81EA;&#x5DF1;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6709;&#x80FD;&#x529B;&#xFF0C;&#x9876;&#x7740;&#x538B;&#x529B;&#x53BB;&#x4E00;&#x6B21;&#x6B21;&#x7684;&#x653B;&#x514B;&#x96BE;&#x9898;&#xFF0C;&#x521D;&#x6B21;&#x63A5;&#x89E6;&#x79FB;&#x52A8;&#x7AEF;&#x9875;&#x9762;&#x5236;&#x4F5C;&#xFF0C;&#x9760;&#x81EA;&#x5DF1;&#x6478;&#x7D22;&#xFF0C;&#x5F88;&#x591A;&#x6B21;&#x90FD;&#x89C9;&#x5F97;&#x8981;&#x5B8C;&#x4E86;&#xFF0C;&#x4F46;&#x540E;&#x6765;&#x90FD;&#x633A;&#x8FC7;&#x6765;&#x4E86;&#xFF0C;&#x5728;&#x63D0;&#x5347;&#x4E86;&#x6280;&#x672F;&#x80FD;&#x529B;&#xFF0C;&#x79EF;&#x7D2F;&#x4E86;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x5F88;&#x597D;&#x7684;&#x953B;&#x70BC;&#x4E86;&#x6297;&#x538B;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x51E0;&#x6B21;&#x5047;&#x671F;&#xFF0C;&#x90FD;&#x6709;&#x670B;&#x53CB;&#x6216;&#x8005;&#x5BB6;&#x4EBA;&#x8BA9;&#x6211;&#x597D;&#x597D;&#x653E;&#x677E;&#x4E00;&#x4E0B;&#xFF0C;&#x51FA;&#x53BB;&#x73A9;&#x513F;&#x73A9;&#x513F;&#xFF0C;&#x53EF;&#x6211;&#x6EE1;&#x8111;&#x5B50;&#x90FD;&#x662F;&#x6280;&#x672F;&#xFF0C;&#x4E66;&#x7C4D;&#xFF0C;&#x4EE3;&#x7801;&#xFF0C;&#x4E8B;&#x4E1A;&#x3002;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x4EC0;&#x4E48;&#x5927;&#x7684;&#x6E38;&#x73A9;&#x513F;&#x8BA1;&#x5212;&#xFF0C;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x5374;&#x7ED9;&#x81EA;&#x5DF1;&#x653E;&#x5047;&#x4E86;~</p>
<p>&#x7B49;&#x98CE;&#x6765;&#xFF0C;&#x662F;&#x51E0;&#x4E2A;&#x6708;&#x524D;&#x4E00;&#x4E2A;&#x670B;&#x53CB;&#x7ED9;&#x6211;&#x63A8;&#x8350;&#x7684;&#x4E00;&#x90E8;&#x7535;&#x5F71;&#xFF0C;&#x8BF4;&#x597D;&#x770B;&#xFF0C;&#x6211;&#x4E00;&#x76F4;&#x6CA1;&#x770B;&#xFF0C;&#x4E5F;&#x60F3;&#x8C61;&#x7740;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x6709;&#x591A;&#x597D;&#x770B;&#xFF1F;&#x52A8;&#x4F5C;&#x7247;&#xFF1F;&#x7279;&#x6548;&#x5F88;&#x70AB;&#xFF1F;&#x60C5;&#x8282;&#x5F88;&#x7CBE;&#x5F69;&#xFF1F;&#x6216;&#x8005;&#x5F88;&#x641E;&#x7B11;&#xFF1F;&#x5F53;&#x6211;&#x8FD9;&#x6B21;&#x6709;&#x65F6;&#x95F4;&#x4E5F;&#x6709;&#x5FC3;&#x601D;&#x53BB;&#x770B;&#x4E86;&#xFF0C;&#x624D;&#x53D1;&#x73B0;&#xFF0C;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x8BB2;&#x4E86;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x6545;&#x4E8B;&#x5462;&#xFF1F;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4EBA;&#xFF0C;&#x5171;&#x540C;&#x5230;&#x4E86;&#x5C3C;&#x6CCA;&#x5C14;&#xFF0C;&#x53BB;&#x6D17;&#x6DA4;&#x7075;&#x9B42;&#xFF0C;&#x53D9;&#x8FF0;&#x4E86;&#x51E0;&#x6BB5;&#x5F80;&#x4E8B;&#x548C;&#x5185;&#x5FC3;&#x72EC;&#x767D;&#xFF0C;&#x8FD9;&#x793E;&#x4F1A;&#x591A;&#x6B8B;&#x9177;&#xFF0C;&#x4EBA;&#x9762;&#x6709;&#x591A;&#x5047;&#xFF0C;&#x4EBA;&#x6709;&#x591A;&#x65E0;&#x5948;~&#x6216;&#x8BB8;&#x8FD9;&#x90E8;&#x8D70;&#x8FDB;&#x539F;&#x751F;&#x6001;&#x7684;&#x7535;&#x5F71;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x4E00;&#x90E8;&#x597D;&#x7535;&#x5F71;&#x5427;&#x3002;&#x5267;&#x4E2D;&#x6709;&#x53E5;&#x8BDD;&#xFF1A;&#x522B;&#x778E;&#x6298;&#x817E;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;~&#xFF08;&#x5BF9;&#x6211;&#x8FD9;&#x7C7B;&#x4EBA;&#x8BF4;&#x7684;&#x4E48;&#xFF0C;&#x5475;&#x5475;&#xFF09;</p>
<p>&#x201D;&#x4F60;&#x53EF;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x539F;&#x56E0;&#x6709;&#x4EBA;&#x7FA1;&#x6155;&#x4F60;  &#x53EA;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x66FE;&#x7ECF;&#x4E5F;&#x5E74;&#x8F7B;&#xFF0C;&#x4F60;&#x53EF;&#x660E;&#x767D;&#x4EC0;&#x4E48;&#x9053;&#x7406;&#x6709;&#x4EBA;&#x5AC9;&#x5992;&#x4F60; &#x53EA;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x6293;&#x5F97;&#x7D27;&#x201C;</p>
<p>&#x8981;&#x5F00;&#x59CB;&#x4E00;&#x6BB5;&#x65B0;&#x7684;&#x672A;&#x77E5;&#x65C5;&#x7A0B;&#x4E86;&#xFF0C;&#x662F;&#x7684;&#xFF0C;&#x6211;&#x8FD8;&#x5E74;&#x8F7B;&#xFF0C;&#x6211;&#x4E5F;&#x8981;&#x6293;&#x7D27;&#xFF01;&#x671F;&#x5F85;&#x51FA;&#x53D1;&#xFF01;~</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/思考/" rel="tag">#思考</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2014/11/03/为标签正名之“也谈语义化”/" rel="next" title="为标签正名之“也谈语义化”">
                <i class="fa fa-chevron-left"></i> 为标签正名之“也谈语义化”
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2014/11/12/section和article,向左还是向右？ /" rel="prev" title="section和article,向左还是向右？">
                section和article,向左还是向右？ <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/linggan100" target="_blank">
                  
                    <i class="fa fa-github"></i> GitHub
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/ideazhao" target="_blank">
                  
                    <i class="fa fa-weibo"></i> Weibo
                  
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhihu.com/people/ideazhao" target="_blank">
                  
                    <i class="fa fa-globe"></i> zhihu
                  
                </a>
              </span>
            
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
            <p class="site-author-name">优质博客</p>
            
              <span class="links-of-author-item">
                <a href="http://blog.cssforest.org/" target="_blank">cssforest</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://evanyou.me/" target="_blank">尤小右</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ruanyifeng.com/home.html" target="_blank">阮一峰</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.zhangxinxu.com/" target="_blank">张鑫旭</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://yuguo.us/" target="_blank">余果</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/fouber/blog" target="_blank">前端农民工</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://github.com/yisibl/blog/issues" target="_blank">一丝</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://jiongks.name/" target="_blank">勾三股四</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://cly84920.blog.163.com/" target="_blank">真阿当</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.doyoe.com/" target="_blank">doyoe</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cssmagic.net/" target="_blank">CSS魔法</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.toobug.net/" target="_blank">Toobug</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/yexiaochai" target="_blank">叶小钗</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/jikey/" target="_blank">豪情</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://blog.f2er.net/" target="_blank">情封</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://imququ.com/" target="_blank">屈光宇</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.barretlee.com/" target="_blank">小胡子哥</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://luopq.com/" target="_blank">luopq</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.w3cplus.com/" target="_blank">W3cplus</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://peunzhang.cnblogs.com/" target="_blank">白树</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.xuanfengge.com/" target="_blank">轩枫阁</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.caihong.cc/" target="_blank">练小习</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://kezhen.info/" target="_blank">kevin</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yanhaijing.com/" target="_blank">颜海镜</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="https://xuexb.com/" target="_blank">前端小武</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://yujiangshui.com/" target="_blank">于江水</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.cnblogs.com/tugenhua0707/" target="_blank">龙恩</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.dang-jian.com/" target="_blank">党建</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://tiye.me/" target="_blank">题叶</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://zhangwenli.com/" target="_blank">羡辙</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.ido321.com/" target="_blank">会飞的Pikachu</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://www.fefork.com/" target="_blank">聂微东</a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://xiaoqiang730730.github.io" target="_blank">前端-小强</a>
              </span>
            
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
