<!doctype html>



  


<html class="theme-next pisces use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css"/>




  <link href="//fonts.googleapis.com/css?family=Lato:300,400,700,400italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">



<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=0.5.0" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="总结," />





  <link rel="alternate" href="/atom.xml" title="灵感的小窝" type="application/atom+xml" />




  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=0.5.0" />






<meta name="description" content="&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x90FD;&amp;#x5199;&amp;#x4E86;&amp;#x5E74;&amp;#x7EC8;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x6211;&amp;#x4E0D;&amp;#x662F;&amp;#x7231;&amp;#x51D1;&amp;#x70ED;&amp;#x95F9;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x540E;&amp;#x6765;&amp;#x53C8;&amp;#x60F3;">
<meta property="og:type" content="article">
<meta property="og:title" content="梦幻般的2015，更丰盈的2016">
<meta property="og:url" content="http://yoursite.com/2016/01/01/2015-summary/index.html">
<meta property="og:site_name" content="灵感的小窝">
<meta property="og:description" content="&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x90FD;&amp;#x5199;&amp;#x4E86;&amp;#x5E74;&amp;#x7EC8;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x6211;&amp;#x4E0D;&amp;#x662F;&amp;#x7231;&amp;#x51D1;&amp;#x70ED;&amp;#x95F9;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x540E;&amp;#x6765;&amp;#x53C8;&amp;#x60F3;">
<meta property="og:image" content="http://yoursite.com/2016/01/01/2015-summary/1.jpg">
<meta property="og:image" content="http://yoursite.com/2016/01/01/2015-summary/2.jpg">
<meta property="og:updated_time" content="2016-02-24T12:51:11.000Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="梦幻般的2015，更丰盈的2016">
<meta name="twitter:description" content="&amp;#x5F88;&amp;#x591A;&amp;#x4EBA;&amp;#x90FD;&amp;#x5199;&amp;#x4E86;&amp;#x5E74;&amp;#x7EC8;&amp;#x603B;&amp;#x7ED3;&amp;#xFF0C;&amp;#x6211;&amp;#x4E0D;&amp;#x662F;&amp;#x7231;&amp;#x51D1;&amp;#x70ED;&amp;#x95F9;&amp;#x7684;&amp;#x4EBA;&amp;#xFF0C;&amp;#x540E;&amp;#x6765;&amp;#x53C8;&amp;#x60F3;">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Pisces',
    sidebar: {"position":"left","display":"post"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>

  <title> 梦幻般的2015，更丰盈的2016 | 灵感的小窝 </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  








  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">灵感的小窝</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">生活琐碎、前端杂谈</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu ">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-home fa-fw"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-user fa-fw"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-archive fa-fw"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-tags fa-fw"></i> <br />
            
            标签
          </a>
        </li>
      

      
      
      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                梦幻般的2015，更丰盈的2016
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-01-01T00:00:00+08:00" content="2016-01-01">
              2016-01-01
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/总结/" itemprop="url" rel="index">
                    <span itemprop="name">总结</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
          

          

          
          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x5199;&#x4E86;&#x5E74;&#x7EC8;&#x603B;&#x7ED3;&#xFF0C;&#x6211;&#x4E0D;&#x662F;&#x7231;&#x51D1;&#x70ED;&#x95F9;&#x7684;&#x4EBA;&#xFF0C;&#x540E;&#x6765;&#x53C8;&#x60F3;&#x60F3;&#xFF1A;&#x8FD9;&#x662F;&#x81EA;&#x5DF1;&#x7684;&#x4E8B;&#xFF0C;&#x8DDF;&#x51D1;&#x70ED;&#x95F9;&#x6709;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4E3A;&#x4E86;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x8FC7;&#x53BB;&#xFF0C;&#x8BA9;&#x4EE5;&#x540E;&#x56DE;&#x770B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x77E5;&#x9053;2015&#x5E74;&#x7684;&#x81EA;&#x5DF1;&#x662F;&#x8FD9;&#x6837;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x5C31;&#x4E00;&#x8FB9;&#x542C;&#x7740;&#x300A;my love&#x300B;&#xFF0C;&#x4E00;&#x8FB9;&#x5C0F;&#x7ED3;&#x4E00;&#x4E0B;&#x3002;</p>
<h2 id="&#x5DE5;&#x4F5C;"><a href="#&#x5DE5;&#x4F5C;" class="headerlink" title="&#x5DE5;&#x4F5C;"></a>&#x5DE5;&#x4F5C;</h2><p>&#x8FD9;&#x4E24;&#x5E74;&#x662F;&#x5728;&#x5916;&#x95EF;&#x8361;&#x7684;&#x4E24;&#x5E74;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6709;&#x65F6;&#x5019;&#x7A81;&#x7136;&#x60F3;&#x8D77;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FEB;&#x5FD8;&#x4E86;&#x662F;&#x54EA;&#x5E74;&#x5E72;&#x7684;&#xFF0C;&#x7EC6;&#x60F3;&#x4E00;&#x4E0B;&#x624D;&#x77E5;&#x9053;&#xFF0C;&#x6211;&#x60F3;&#x662F;&#x7F18;&#x4E8E;&#x201C;&#x53D8;&#x5316;&#x201D;&#x5427;,&#x4ECE;&#x8FDB;&#x5165;&#x7B2C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x6709;&#x7740;&#x4E00;&#x4E2A;&#x68A6;&#xFF0C;&#x8BF4;&#x5F97;&#x4FD7;&#x4E00;&#x70B9;&#xFF1A;&#x5E0C;&#x671B;&#x6709;&#x4E00;&#x5929;&#x80FD;&#x6210;&#x4E3A;&#x6280;&#x672F;&#x5927;&#x725B;&#xFF0C;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x516C;&#x53F8;&#x53D1;&#x5C55;&#x58EE;&#x5927;&#xFF0C;&#x5E72;&#x5927;&#x4E8B;&#xFF0C;&#x8D5A;&#x5927;&#x94B1;&#x3002;&#x867D;&#x7136;&#xFF0C;&#x540E;&#x6765;&#x8FD9;&#x4E2A;&#x68A6;&#x5728;&#x90A3;&#x91CC;&#x6401;&#x6D45;&#xFF0C;&#x53EF;&#x8FD9;&#x4E0D;&#x5F71;&#x54CD;&#x6211;&#x5BF9;&#x5B83;&#x7684;&#x611F;&#x6069;&#xFF0C;&#x63A5;&#x7EB3;&#x6211;&#xFF0C;&#x7ED9;&#x6211;&#x4E00;&#x4E2A;&#x8D77;&#x70B9;&#xFF0C;&#x4E8B;&#x4E1A;&#x548C;&#x751F;&#x6D3B;&#x90FD;&#x662F;&#xFF0C;&#x4EE5;&#x524D;&#x5199;&#x5F97;&#x6587;&#x7AE0;&#x91CC;&#x4E5F;&#x66FE;&#x591A;&#x6B21;&#x63D0;&#x5230;&#xFF0C;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#x54C8;&#x3002;&#x7B2C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x5F85;&#x5230;11&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x6309;&#x8010;&#x4E0D;&#x4F4F;&#x5FC3;&#x4E2D;&#x7684;&#x8E81;&#x52A8;&#xFF0C;&#x5728;&#x72B9;&#x8C6B;&#x4E86;&#x51E0;&#x4E2A;&#x661F;&#x671F;&#xFF0C;&#x8F97;&#x8F6C;&#x53CD;&#x4FA7;&#x4E86;&#x51E0;&#x4E2A;&#x665A;&#x4E0A;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x63D0;&#x51FA;&#x4E86;&#x79BB;&#x804C;&#xFF0C;&#x56E0;&#x4E3A;&#x6DF1;&#x601D;&#x719F;&#x8651;&#xFF0C;&#x4E5F;&#x8868;&#x660E;&#x4E86;&#x6001;&#x5EA6;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8001;&#x677F;&#x6CA1;&#x6709;&#x505A;&#x592A;&#x591A;&#x633D;&#x7559;&#x3002;&#x8FD9;&#x662F;&#x53D1;&#x751F;&#x5728;14&#x5E74;6&#x6708;&#x4EFD;&#x7684;&#x4E8B;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x60F3;&#x627E;&#x4E00;&#x4EFD;&#x8DDF;&#x4E4B;&#x524D;&#x4E0D;&#x4E00;&#x6837;&#x5185;&#x5BB9;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x80FD;&#x8BA9;&#x81EA;&#x5DF1;&#x505A;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#xFF0C;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x63D0;&#x5347;&#xFF0C;&#x7B2C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x7ED9;&#x7684;&#x85AA;&#x6C34;&#x5F88;&#x4F4E;&#xFF0C;&#x5728;&#x627E;&#x7B2C;&#x4E8C;&#x4EFD;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x8981;&#x6C42;&#x4ECD;&#x7136;&#x4E0D;&#x9AD8;&#xFF0C;4&#x3001;5K&#x5C31;&#x597D;&#xFF0C;&#x6211;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x662F;&#x8D5A;&#x94B1;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x5230;&#x73B0;&#x5728;&#x90FD;&#x53EF;&#x80FD;&#x662F;&#x670B;&#x53CB;&#x5708;&#x91CC;&#x6700;poor&#x7684;&#x4EBA;~&#x6211;&#x6E34;&#x671B;&#x6210;&#x957F;&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7406;&#x7531;&#x3002;&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x5BB6;&#x516C;&#x53F8;&#xFF0C;&#x60C5;&#x51B5;&#x6BD4;&#x6211;&#x60F3;&#x7684;&#x7A0D;&#x5FAE;&#x5DEE;&#x4E00;&#x70B9;&#xFF0C;&#x662F;&#x4E2A;&#x521A;&#x7EC4;&#x6210;&#x6CA1;&#x591A;&#x4E45;&#x7684;&#x521B;&#x4E1A;&#x56E2;&#x961F;&#xFF0C;14&#x5E74;&#x642C;&#x5230;&#x6DF1;&#x5733;&#xFF0C;&#x65B0;&#x7684;&#x529E;&#x516C;&#x5BA4;&#x5728;F518&#x521B;&#x610F;&#x56ED;&#xFF0C;&#x8FD8;&#x5728;&#x88C5;&#x4FEE;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x548C;&#x540C;&#x4E8B;&#x4EEC;&#x5728;&#x5C0F;&#x533A;&#x91CC;&#x7684;&#x4E00;&#x4E2A;&#x4E09;&#x5BA4;&#x4E00;&#x5385;&#x529E;&#x516C;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x90A3;&#x5BB6;&#x516C;&#x53F8;&#x7684;&#x4EA7;&#x54C1;&#x5B98;&#x7F51;&#x548C;&#x6211;&#x8FD9;&#x8F88;&#x5B50;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x79FB;&#x52A8;&#x7AEF;&#x7AD9;&#x70B9;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x90A3;&#x91CC;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x60F3;&#x60F3;&#x4E5F;&#x662F;&#x591F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x5C31;&#x6211;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EBA;&#x6559;&#x6211;&#xFF0C;&#x4EC0;&#x4E48;&#x53EB;&#x903C;&#x4E0A;&#x6881;&#x5C71;~&#x540E;&#x6765;&#x642C;&#x5230;&#x65B0;&#x529E;&#x516C;&#x5BA4;&#xFF0C;&#x65B0;&#x7684;&#x9700;&#x6C42;&#x4E5F;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x6765;&#xFF0C;&#x516C;&#x53F8;&#x5B98;&#x7F51;&#xFF0C;&#x7535;&#x5F71;&#x5E73;&#x53F0;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x90FD;&#x662F;&#x4E0D;&#x5C0F;&#x7684;&#x6311;&#x6218;&#xFF0C;jquery&#x5C31;&#x662F;&#x5728;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x53D6;&#x5F97;&#x4E86;&#x5B9E;&#x8D28;&#x6027;&#x7684;&#x8FDB;&#x6B65;&#x3002;&#x9057;&#x61BE;&#x7684;&#x662F;&#xFF0C;&#x6162;&#x6162;&#x7684;&#xFF0C;&#x516C;&#x53F8;&#x878D;&#x8D44;&#x51FA;&#x73B0;&#x56F0;&#x96BE;&#xFF0C;&#x8D44;&#x91D1;&#x94FE;&#x65AD;&#x6389;&#x4E86;&#xFF0C;&#x5458;&#x5DE5;&#x9646;&#x7EED;&#x79BB;&#x804C;&#xFF0C;&#x6211;&#x4E5F;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x91CC;&#xFF0C;&#x5C31;&#x5230;&#x4E86;14&#x5E74;11&#x6708;&#xFF0C;&#x7B2C;&#x4E8C;&#x5BB6;&#x516C;&#x53F8;&#x53EA;&#x5F85;&#x4E86;5&#x4E2A;&#x6708;&#x3002;</p>
<p>&#x6709;&#x4E0D;&#x5C11;&#x670B;&#x53CB;&#x95EE;&#x6211;&#xFF0C;&#x600E;&#x4E48;&#x7528;&#x4E00;&#x4E2A;&#x8BCD;&#x5F62;&#x5BB9;&#x81EA;&#x5DF1;&#x7684;2015&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x6700;&#x5408;&#x9002;&#x7684;&#x8BCD;&#x5C31;&#x662F;&#x201C;&#x5982;&#x68A6;&#x5982;&#x5E7B;&#x201D;&#xFF0C;&#x5982;&#x9898;~&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E48;&#x8BF4;&#xFF0C;14&#x5E74;&#x7684;&#x5E74;&#x5E95;&#xFF0C;11&#x6708;17&#x53F7;&#xFF0C;&#x662F;&#x6211;&#x5F00;&#x59CB;&#x4E00;&#x4EFD;&#x65B0;&#x5DE5;&#x4F5C;&#x7684;&#x65E5;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EFD;&#x8BA9;&#x6211;&#x65E0;&#x6BD4;&#x671F;&#x5F85;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5230;&#x817E;&#x8BAF;CDC&#xFF08;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x4E0E;&#x8BBE;&#x8BA1;&#x90E8;&#xFF09;&#xFF0C;&#x867D;&#x7136;&#x53EA;&#x662F;&#x5916;&#x5305;&#xFF0C;&#x4F46;&#x90A3;&#x65F6;&#x6211;&#x8BA4;&#x4E3A;&#x6CA1;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF0C;&#x66FE;&#x65E0;&#x6570;&#x6B21;&#x60F3;&#x8C61;&#x8FC7;&#x8FD9;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x516C;&#x4EA4;&#x4E0A;&#xFF0C;&#x5730;&#x94C1;&#x4E0A;&#xFF0C;&#x8DDF;&#x670B;&#x53CB;&#x804A;&#x5929;&#x5439;&#x725B;&#xFF0C;&#x5728;&#x5BB6;&#x91CC;&#x7684;&#x7535;&#x8111;&#x524D;&#xFF0C;&#x751A;&#x81F3;&#xFF0C;&#x53EF;&#x80FD;&#x5728;&#x5927;&#x5B66;&#x5BBF;&#x820D;&#x91CC;&#x90FD;&#x60F3;&#x8FC7;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x9884;&#x60F3;&#x662F;&#x56DB;&#x5230;&#x4E94;&#x5E74;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x8FD9;&#x4E48;&#x5FEB;&#x5C31;&#x5B9E;&#x73B0;&#xFF0C;&#x53BB;&#x9762;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x633A;&#x6FC0;&#x52A8;&#x7684;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x8DDF;&#x5FC3;&#x6240;&#x5411;&#x5F80;&#x7684;&#x516C;&#x53F8;&#x79BB;&#x5F97;&#x8FD9;&#x4E48;&#x8FD1;&#x3002;&#x5176;&#x5B9E;&#xFF0C;&#x8FDB;&#x5927;&#x516C;&#x53F8;&#x662F;&#x6BCF;&#x4E2A;&#x505A;&#x6280;&#x672F;&#x7684;&#x4EBA;&#x90FD;&#x60F3;&#x7684;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x6B62;&#x60F3;&#x8FC7;&#x5230;&#x817E;&#x8BAF;&#xFF0C;&#x767E;&#x5EA6;&#x3001;&#x534E;&#x4E3A;&#x3001;&#x4EAC;&#x4E1C;&#xFF0C;&#x90FD;&#x6709;&#x60F3;&#x8FC7;&#xFF0C;&#x73B0;&#x5728;&#x770B;&#x6765;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x4E0D;&#x591F;&#x7406;&#x6027;&#x7684;&#x3002;&#x6765;&#x5230;CDC&#x9762;&#x8BD5;&#x6211;&#x7684;&#x4EBA;&#x662F;tommy&#x548C;&#x963F;&#x4E49;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x5468;&#x4F1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x89C1;&#x5230;&#x4E86;basecss&#x548C;&#x5F6A;&#x53D4;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE5;&#x524D;&#x53EA;&#x542C;&#x8FC7;&#x540D;&#x5B57;&#xFF0C;&#x770B;&#x8FC7;&#x535A;&#x5BA2;&#x7684;&#x4EBA;&#xFF0C;&#x6210;&#x4E86;&#x8DDF;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x7684;&#x4EBA;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x53F7;&#x79F0;&#x201C;&#x5B87;&#x5B99;&#x7B2C;&#x4E00;&#x8BBE;&#x8BA1;&#x7814;&#x53D1;&#x56E2;&#x961F;&#x201D;&#xFF0C;&#x4E0D;&#x7531;&#x5FC3;&#x751F;&#x8BB8;&#x591A;&#x60F3;&#x6CD5;&#xFF0C;&#x867D;&#x7136;&#x540E;&#x6765;&#x8BC1;&#x660E;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6D89;&#x4E16;&#x672A;&#x6DF1;&#x9A9A;&#x5E74;&#x7684;&#x4E00;&#x70B9;&#x70B9;&#x8E81;&#x52A8;&#x7F62;&#x4E86;&#xFF0C;&#x6FC0;&#x4E0D;&#x8D77;&#x534A;&#x70B9;&#x6D9F;&#x6F2A;~</p>
<p>&#x5728;CDC&#x505A;&#x4E86;&#x51E0;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5927;&#x90FD;&#x662F;&#x5185;&#x90E8;&#x7684;&#x2026;&#x7F51;&#x7AD9;&#x6539;&#x7248;&#xFF0C;&#x548C;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5F88;&#x591A;&#x5230;&#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x4E0A;&#x7EBF;&#xFF0C;&#x6BD4;&#x5982;&#x884C;&#x653F;&#x95E8;&#x6237;&#xFF0C;&#x817E;&#x8BAF;&#x5B66;&#x9662;&#x7B49;&#x3002;</p>
<p>&#x6211;&#x771F;&#x7684;&#x4E5F;&#x6CA1;&#x60F3;&#x8FC7;&#x5728;CDC&#x53EA;&#x5F85;&#x4E86;8&#x4E2A;&#x6708;&#xFF0C;&#x6211;&#x66FE;&#x7ECF;&#x8BA4;&#x4E3A;&#x5B83;&#x5C31;&#x662F;&#x6211;&#x5728;&#x6DF1;&#x5733;&#x7684;&#x7EC8;&#x70B9;&#xFF0C;&#x5230;&#x4E86;&#x4ECA;&#x5E74;7&#x6708;&#x4EFD;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E4B;&#x524D;&#x8BA4;&#x8BC6;&#x7684;&#x4E00;&#x4E2A;&#x540C;&#x5728;&#x817E;&#x8BAF;&#x7684;&#x670B;&#x53CB;&#x7ED9;&#x6211;&#x4ECB;&#x7ECD;&#x4E00;&#x4E2A;&#x673A;&#x4F1A;&#xFF0C;&#x5728;&#x7406;&#x8D22;&#x901A;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x7B2C;&#x4E00;&#x6B21;&#x6709;&#x4EBA;&#x7ED9;&#x6211;&#x4ECB;&#x7ECD;&#x4E86;&#xFF0C;&#x6709;&#x8D22;&#x4ED8;&#x901A;&#x3001;&#x4E92;&#x5A31;&#x3001;sng&#xFF0C;&#x6211;&#x5927;&#x90E8;&#x5206;&#x662F;&#x5A49;&#x62D2;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5C1A;&#x5F85;&#x6210;&#x957F;&#xFF0C;&#x4F46;&#x8FD9;&#x6B21;&#x6211;&#x6CA1;&#x6709;&#x62D2;&#x7EDD;&#xFF0C;&#x6211;&#x89C9;&#x5F97;&#x603B;&#x662F;&#x8FD9;&#x6837;&#x81EA;&#x5DF1;&#x95F7;&#x7740;&#x5934;&#x505A;&#x4E8B;&#xFF0C;&#x5B66;&#x4E60;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5230;&#x4E86;&#x4EC0;&#x4E48;&#x7A0B;&#x5EA6;&#xFF0C;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x8FD8;&#x6709;&#x54EA;&#x4E9B;&#x4E0D;&#x8DB3;&#xFF0C;&#x8FD8;&#x5DEE;&#x591A;&#x8FDC;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x51B3;&#x5B9A;&#x8BD5;&#x8BD5;&#xFF0C;&#x68C0;&#x9A8C;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#xFF0C;&#x5C31;&#x51C6;&#x5907;&#x4E86;&#x4E00;&#x4EFD;&#x7B80;&#x5386;&#x7ED9;&#x8FC7;&#x53BB;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x505A;&#x9762;&#x8BD5;&#x9898;&#xFF0C;&#x53C8;&#x662F;&#x4ECE;&#x6CA1;&#x505A;&#x8FC7;&#x7684;&#x4E1C;&#x897F;&#x2026;&#x867D;&#x7136;&#x4ECE;&#x6CA1;&#x505A;&#x8FC7;&#xFF0C;&#x4F46;&#x5E73;&#x65F6;&#x81EA;&#x5DF1;&#x8FD8;&#x662F;&#x6709;&#x4E86;&#x89E3;&#x548C;&#x5B66;&#x4E60;&#x4E00;&#x70B9;&#xFF0C;&#x82B1;&#x4E86;&#x4E0D;&#x5C11;&#x7684;&#x529F;&#x592B;&#xFF0C;&#x81EA;&#x6211;&#x6311;&#x6218;&#x4E86;&#x4E00;&#x628A;&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x662F;&#x633A;&#x6EE1;&#x610F;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x7EA6;&#x6211;&#x9762;&#x8BD5;&#xFF0C;&#x56E0;&#x4E3A;&#x9762;&#x8BD5;&#x9898;&#x662F;&#x5408;&#x683C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x9762;&#x5F88;&#x987A;&#x5229;&#xFF0C;&#x804A;&#x6CA1;&#x4E00;&#x4F1A;&#x513F;&#x5C31;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x4E8C;&#x9762;&#x662F;&#x9B3C;&#x54E5;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x8FD1;&#x8DDD;&#x79BB;&#x63A5;&#x89E6;&#x9B3C;&#x54E5;&#xFF0C;&#x4E4B;&#x524D;&#x662F;webrebuild&#x548C;&#x4E00;&#x6B21;&#x5C0F;&#x7684;&#x5206;&#x4EAB;&#x4F1A;&#xFF0C;&#x8FDC;&#x8FDC;&#x7684;&#x6CE8;&#x89C6;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x5176;&#x4ED6;&#x60F3;&#x6CD5;&#xFF0C;&#x6211;&#x662F;&#x6765;&#x9762;&#x8BD5;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x95EE;&#x9898;&#x90FD;&#x8BA4;&#x771F;&#x7684;&#x56DE;&#x7B54;&#x3002;&#x603B;&#x5171;&#x7ECF;&#x5386;&#x4E86;5&#x9762;&#xFF0C;&#x5386;&#x65F6;&#x5DEE;&#x4E0D;&#x591A;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x9634;&#x5DEE;&#x9633;&#x9519;&#x7684;&#xFF0C;&#x53C8;&#x5728;17&#x53F7;&#x8FD9;&#x5929;&#x5165;&#x804C;&#x4E86;&#xFF0C;&#x662F;8&#x6708;17&#x53F7;&#x3002;</p>
<p>&#x6765;&#x4E86;&#x4E4B;&#x540E;&#xFF0C;&#x63A5;&#x53D7;&#x57F9;&#x8BAD;&#xFF0C;&#x9002;&#x5E94;&#x4E86;&#x51E0;&#x5929;&#x65B0;&#x73AF;&#x5883;&#x548C;&#x9879;&#x76EE;&#xFF0C;&#x5C31;&#x5F00;&#x5DE5;&#x4E86;&#x3002;&#x6216;&#x8BB8;&#x4F1A;&#x6709;&#x670B;&#x53CB;&#x8FD8;&#x60F3;&#x95EE;&#xFF0C;&#x4F60;&#x662F;&#x600E;&#x4E48;&#x8FDB;&#x53BB;&#x7684;&#xFF1F;&#x8FDB;&#x53BB;&#x80AF;&#x5B9A;&#x5F88;&#x96BE;&#x5427;&#xFF1F;&#x6211;&#x4F1A;&#x8BF4;&#xFF1A;&#x4E0D;&#x65AD;&#x52AA;&#x529B;&#x63D0;&#x5347;&#x81EA;&#x5DF1;&#xFF0C;&#x52C7;&#x6562;&#x5C1D;&#x8BD5;&#xFF0C;&#x5C3D;&#x4EBA;&#x4E8B;&#xFF0C;&#x673A;&#x4F1A;&#x4F1A;&#x7ED9;&#x6709;&#x51C6;&#x5907;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x51C6;&#x5907;&#x597D;&#x4E86;&#xFF0C;&#x6C34;&#x5230;&#x6E20;&#x6210;&#xFF0C;&#x8FD8;&#x6015;&#x4EC0;&#x4E48;&#xFF1F;~&#xFF08;&#x771F;&#x6CA1;&#x4F60;&#x60F3;&#x7684;&#x90A3;&#x4E48;&#x96BE;&#xFF09;</p>
<p>2016&#x7684;&#x61A7;&#x61AC;&#x5C31;&#x662F;&#xFF0C;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x80FD;&#x66F4;&#x9AD8;&#x8D28;&#xFF0C;&#x66F4;&#x6709;&#x6548;&#x7387;&#x7684;&#x5B8C;&#x6210;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x548C;&#x65F6;&#x95F4;&#x7BA1;&#x7406;&#x65B9;&#x9762;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#x3002;</p>
<h2 id="&#x5206;&#x4EAB;"><a href="#&#x5206;&#x4EAB;" class="headerlink" title="&#x5206;&#x4EAB;"></a>&#x5206;&#x4EAB;</h2><p><strong> &#x56E2;&#x961F;&#x5185;&#x5206;&#x4EAB; </strong>&#xFF1A;css&#x90A3;&#x4E9B;&#x4E8B;&#x513F;&#x3001;css&#x7684;&#x4E50;&#x8DA3;</p>
<p><strong> &#x6587;&#x7AE0; </strong>&#xFF1A;<a href="http://www.html-js.com/article/column/716" target="_blank" rel="external">&#x524D;&#x7AEF;&#x5BB6;&#x56ED;</a>&#x3001;<a href="http://www.html-js.com/article/column/896" target="_blank" rel="external">&#x4E0D;&#x542C;&#x8BDD;&#x7684;&#x6D4F;&#x89C8;&#x5668;</a></p>
<p><strong> &#x9189;&#x725B;&#x524D;&#x7AEF; </strong> &#xFF1A;&#x5DE5;&#x4F5C;&#x4E4B;&#x4F59;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x5199;&#x6587;&#x7AE0;&#xFF0C;&#x793E;&#x533A;&#x4EA4;&#x6D41;&#xFF0C;QQ&#x7FA4;&#x4EA4;&#x6D41;&#xFF0C;&#x4F46;&#x603B;&#x611F;&#x89C9;&#x54EA;&#x91CC;&#x4E0D;&#x591F;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86;&#x505A;&#x4E00;&#x4E2A;&#x8BA9;&#x5927;&#x5BB6;&#x53D7;&#x76CA;&#x7684;&#x4E8B;&#x60C5;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x201C;&#x9189;&#x725B;&#x524D;&#x7AEF;&#x201D;&#xFF0C;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x6211;&#x5199;&#x7684;<a href="http://ideazhao.com/post/1d377a05_8228388" target="_blank" rel="external">&#x9189;&#x725B;&#x524D;&#x7AEF;&#x8BDE;&#x751F;&#x8BB0;</a>,&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x5927;&#x5BB6;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x65B0;&#x4EBA;&#x8FD8;&#x662F;&#x8001;&#x624B;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x4FBF;&#x5229;&#xFF0C;&#x89E3;&#x51B3;&#x4E00;&#x4E9B;&#x5171;&#x6709;&#x7684;&#x75DB;&#x70B9;&#xFF0C;2016&#xFF0C;&#x5B83;&#x4F1A;&#x5E26;&#x7ED9;&#x4F60;&#x66F4;&#x591A;&#x60CA;&#x559C;&#x3002;</p>
<p><strong> &#x524D;&#x7AEF;&#x5468;&#x672B; </strong>&#xFF1A;&#x9664;&#x4E86;&#x201C;&#x9189;&#x725B;&#x201D;&#xFF0C;&#x6211;&#x8FD8;&#x5F00;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x53EB;&#x201C;&#x524D;&#x7AEF;&#x5468;&#x672B;&#x201D;&#xFF0C;&#x6BCF;&#x5468;&#x4E3A;&#x5927;&#x5BB6;&#x53D1;&#x9001;&#x597D;&#x6587;&#x5E72;&#x8D27;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x53D1;&#x4E86;40&#x591A;&#x7BC7;&#xFF0C;&#x51E0;&#x767E;&#x4F4D;&#x8BA2;&#x9605;&#x8005;&#xFF0C;&#x6211;&#x4F1A;&#x6301;&#x7EED;&#x575A;&#x6301;&#x7684;&#x505A;&#x4E0B;&#x53BB;&#xFF0C;&#x505A;&#x5F97;&#x66F4;&#x597D;&#xFF0C;&#x5E0C;&#x671B;&#x80FD;&#x7ED9;&#x5927;&#x5BB6;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x5B9E;&#x9645;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<p>2016&#xFF0C;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x597D;&#x7684;&#x5206;&#x4EAB;&#x5E26;&#x7ED9;&#x5927;&#x5BB6;&#xFF0C;&#x4E5F;&#x662F;&#x9001;&#x7ED9;&#x6211;&#x81EA;&#x5DF1;&#xFF0C;&#x5E0C;&#x671B;&#x81EA;&#x5DF1;&#x5BF9;&#x6280;&#x672F;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x66F4;&#x7CFB;&#x7EDF;&#xFF0C;&#x66F4;&#x6DF1;&#x5165;&#xFF0C;&#x5C42;&#x6B21;&#x4E5F;&#x66F4;&#x9AD8;&#x3002;</p>
<h2 id="&#x4F1A;&#x8BAE;"><a href="#&#x4F1A;&#x8BAE;" class="headerlink" title="&#x4F1A;&#x8BAE;"></a>&#x4F1A;&#x8BAE;</h2><p>&#x6DF1;js&#x3001;&#x524D;&#x7AEF;&#x5708;&#x8D70;&#x8FDB;&#x540D;&#x4F01;&#x3001;OneApm&#x3001;AC&#x5927;&#x4F1A;&#x3001;webrebuild&#x7B49;</p>
<p><img src="/2016/01/01/2015-summary/1.jpg" alt=""></p>
<p>&#x4EE5;&#x524D;&#x662F;&#x4E2A;&#x7231;&#x53C2;&#x4F1A;&#x7684;&#x4EBA;&#xFF0C;&#x53EA;&#x8981;&#x662F;&#x8BB2;&#x524D;&#x7AEF;&#x8BDD;&#x9898;&#xFF0C;&#x90FD;&#x60F3;&#x53BB;&#xFF0C;&#x6BCF;&#x6B21;&#x4F1A;&#x8BAE;&#x90FD;&#x6709;&#x4E00;&#x5927;&#x5806;&#x542C;&#x4E0D;&#x61C2;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x7F18;&#x4E8E;&#x81EA;&#x5DF1;js&#x592A;&#x83DC;&#xFF0C;&#x5982;&#x679C;&#x8BF4;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4E0D;&#x61C2;&#x82F1;&#x8BED;&#x7B49;&#x4E8E;&#x534A;&#x4E2A;&#x778E;&#x5B50;&#xFF0C;&#x90A3;&#x4E48;&#x4F5C;&#x4E3A;&#x524D;&#x7AEF;&#xFF0C;&#x4E0D;&#x61C2;js&#x4E5F;&#x7B49;&#x4E8E;&#x534A;&#x4E2A;&#x778E;&#x5B50;&#x4E86;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x6700;&#x4E25;&#x91CD;&#x7684;&#x4E00;&#x6B21;&#x662F;&#x6DF1;js&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x8001;&#x5916;&#xFF0C;&#x4F60;&#x61C2;&#x7684;..&#x987A;&#x4FBF;&#x89C1;&#x5230;&#x4E86;hax&#x3001;&#x6734;&#x7075;&#x3001;&#x5C24;&#x96E8;&#x6EAA;&#x3001;&#x90ED;&#x8FBE;&#x5CF0;&#x3001;&#x5F90;&#x98DE;&#x3001;&#x9B3C;&#x61FF;&#x3001;&#x60C5;&#x5C01;&#x3001;Toobug&#x7B49;&#x4EE5;&#x524D;&#x6CA1;&#x89C1;&#x8FC7;&#x7684;&#x5927;&#x5496;&#xFF0C;&#x636E;&#x8BF4;sofish&#x4E5F;&#x53BB;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x6CA1;&#x770B;&#x5230;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x53BB;&#x7684;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#xFF0C;&#x4E0D;&#x8FC7;&#x8C8C;&#x4F3C;&#x8DDF;&#x6211;&#x6CA1;&#x5565;&#x5173;&#x7CFB;&#xFF0C;&#x591A;&#x4E48;&#x75DB;&#x7684;&#x9886;&#x609F;~</p>
<p>&#x8BF4;&#x5230;&#x75DB;&#xFF0C;&#x6700;&#x75DB;&#x7684;&#x8FD8;&#x662F;&#x4E0A;&#x6D77;cssconf&#x7684;&#x723D;&#x7EA6;&#xFF0C;&#x5F88;&#x65E9;&#x5C31;&#x5728;&#x671F;&#x5F85;&#x548C;&#x5173;&#x6CE8;&#xFF0C;&#x63D0;&#x524D;&#x4E24;&#x4E2A;&#x6708;&#x8BA2;&#x597D;&#x8F66;&#x7968;&#xFF0C;&#x51FA;&#x53D1;&#x5F53;&#x5929;&#x544A;&#x8BC9;&#x6211;&#x8F66;&#x6B21;&#x56E0;&#x5929;&#x6C14;&#x539F;&#x56E0;&#x505C;&#x8FD0;&#xFF0C;&#x6211;&#x2026;&#x5C31;&#x8FD9;&#x6837;&#xFF0C;&#x653E;&#x4E86;&#x5927;&#x5730;&#x9E3D;&#x5B50;&#xFF0C;&#x4E5F;&#x9519;&#x8FC7;&#x4E86;&#x4E00;&#x6B21;&#x548C;CSS&#x9B54;&#x6CD5;&#x3001;&#x5C0F;&#x5FD7;&#x3001;U2&#x7B49;&#x4F17;&#x9AD8;&#x624B;&#x89C1;&#x9762;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4F1A;&#x8BAE;&#x5F53;&#x5929;&#x8FD8;&#x662F;&#x5728;&#x5168;&#x7A0B;&#x5173;&#x6CE8;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x7CBE;&#x5F69;&#x5185;&#x5BB9;&#x540E;&#x6765;&#x6709;&#x901A;&#x8FC7;&#x522B;&#x7684;&#x9014;&#x5F84;&#x8865;&#x4E0A;&#x3002;PS&#xFF1A;&#x4E0B;&#x6B21;&#x4E00;&#x5B9A;&#x53BB;&#xFF0C;&#x4E00;&#x5B9A;&#x53BB;&#xFF0C;&#x4E00;&#x5B9A;&#x53BB;~</p>
<p>&#x57FA;&#x4E8E;&#x4EE5;&#x4E0A;&#x63CF;&#x8FF0;&#xFF0C;16&#x5E74;&#x6211;&#x4F1A;&#x5927;&#x5E45;&#x7F29;&#x51CF;&#x53C2;&#x4F1A;&#x6B21;&#x6570;&#xFF0C;&#x540C;&#x65F6;&#x6076;&#x8865;js&#xFF0C;&#x4E0D;&#x505A;&#x4F2A;&#x524D;&#x7AEF;&#xFF0C;&#x8036;~</p>
<h2 id="&#x4E13;&#x8BBF;"><a href="#&#x4E13;&#x8BBF;" class="headerlink" title="&#x4E13;&#x8BBF;"></a>&#x4E13;&#x8BBF;</h2><p><strong> &#x4E13;&#x8BBF;&#x9B3C;&#x54E5; </strong></p>
<p>&#x8FDB;&#x5165;&#x9E45;&#x5382;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C0F;&#x9C9C;&#x8089;&#x90FD;&#x6709;&#x4E00;&#x6B21;&#x8FBE;&#x4EBA;&#x4E13;&#x8BBF;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4E5F;&#x662F;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6211;&#x7A0D;&#x52A0;&#x601D;&#x7D22;&#xFF0C;&#x5C31;&#x60F3;&#x5230;&#x4E86;&#x9B3C;&#x54E5;&#xFF0C;&#x8FD9;&#x4E48;&#x597D;&#x7684;&#x673A;&#x4F1A;&#x5E72;&#x561B;&#x8981;&#x653E;&#x8FC7;&#xFF1F;~&#x4E8E;&#x662F;&#x5C31;&#x8054;&#x7CFB;&#x4E86;&#x4ED6;&#xFF0C;&#x7EA6;&#x4E86;&#x65F6;&#x95F4;&#xFF0C;&#x51C6;&#x5907;&#x4E86;&#x4E00;&#x5806;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x660E;&#x5A9A;&#x7684;&#x4E0A;&#x5348;&#xFF0C;&#x4E00;&#x95F4;&#x660E;&#x4EAE;&#x7684;&#x4F1A;&#x8BAE;&#x5BA4;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x9753;&#x4E3D;&#x7684;&#x59B9;&#x7EB8;&#x4E00;&#x8D77;&#xFF0C;&#x91C7;&#x8BBF;&#x4E86;&#x9B3C;&#x54E5;&#xFF0C;&#x63D0;&#x4E86;&#x82E5;&#x5E72;&#x6BD4;&#x8F83;&#x597D;&#x5947;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90FD;&#x4E00;&#x4E00;&#x5F97;&#x5230;&#x89E3;&#x7B54;,&#x6700;&#x540E;&#x5408;&#x4E86;&#x4E2A;&#x5F71;~</p>
<p><img src="/2016/01/01/2015-summary/2.jpg" alt=""></p>
<p><strong> &#x65E9;&#x8BFB;&#x8BFE;&#x4E13;&#x8BBF; </strong></p>
<p>&#x662F;&#x4E2A;&#x5076;&#x7136;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x4E3B;&#x8981;&#x4E5F;&#x662F;&#x56E0;&#x4E3A;&#x201C;&#x9189;&#x725B;&#x524D;&#x7AEF;&#x201D;&#x5BFC;&#x822A;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x4F20;&#x64AD;&#xFF0C;&#x7136;&#x540E;&#xFF0C;&#x65E9;&#x8BFB;&#x541B;&#x2014;&#x2014;&#x60C5;&#x5C01;&#x5C31;&#x8DDF;&#x6211;&#x804A;&#xFF0C;&#x8BF4;&#x53EF;&#x4EE5;&#x6765;&#x4E00;&#x7BC7;&#xFF0C;&#x5199;&#x5199;&#x201C;&#x9189;&#x725B;&#x201D;&#x7684;&#x60C5;&#x6000;&#xFF0C;&#x4E5F;&#x5199;&#x5199;&#x4F60;&#x662F;&#x600E;&#x4E48;&#x8D70;&#x4E0A;&#x524D;&#x7AEF;&#x8FD9;&#x6761;&#x8DEF;&#xFF0C;&#x78B0;&#x5230;&#x95EE;&#x9898;&#x548C;&#x74F6;&#x9888;&#x662F;&#x600E;&#x4E48;&#x5904;&#x7406;&#x548C;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x4E00;&#x5F00;&#x59CB;&#x6211;&#x662F;&#x62D2;&#x7EDD;&#x7684;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x540E;&#x6765;&#xFF0C;&#x597D;&#x5427;&#xFF0C;&#x65E2;&#x7136;&#x770B;&#x5F97;&#x8D77;&#x6211;&#xFF0C;&#x6211;&#x5C31;&#x597D;&#x597D;&#x5199;&#xFF0C;&#x5C31;&#x6709;&#x4E86;&#x90A3;&#x7BC7;&#x4E13;&#x8BBF;&#x548C;&#x4E13;&#x8BBF;&#x4E0B;&#x9762;&#x4E00;&#x7FA4;&#x597D;&#x57FA;&#x53CB;&#x7684;&#x6367;&#x573A;&#x5406;&#x559D;&#x3002;</p>
<p>&#x81F3;&#x4E8E;2016&#x5E74;&#xFF0C;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x6709;&#x4E86;&#x5427;&#xFF0C;&#x54C8;&#x3002;</p>
<h2 id="&#x8BFB;&#x4E66;"><a href="#&#x8BFB;&#x4E66;" class="headerlink" title="&#x8BFB;&#x4E66;"></a>&#x8BFB;&#x4E66;</h2><p>&#x8BF4;&#x5230;&#x8BFB;&#x4E66;&#xFF0C;&#x5148;&#x8BF4;&#x51E0;&#x672C;&#x201C;&#x514D;&#x8D39;&#x201D;&#x5F97;&#x5230;&#x7684;&#x4E66;&#x5427;&#xFF0C;&#x300A;&#x56FE;&#x89E3;css3&#x300B;&#xFF0C;&#x300A;web&#x524D;&#x7AEF;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x300B;&#xFF0C;&#x8FD9;&#x4E24;&#x672C;&#x662F;&#x5199;&#x4E66;&#x8BC4;&#x548C;&#x53C2;&#x4F1A;&#x611F;&#x53D7;&#x5F97;&#x7684;&#xFF0C;&#x300A;&#x5FAE;&#x4FE1;&#x529B;&#x91CF;&#x300B;&#x662F;&#x6D3B;&#x52A8;&#x62BD;&#x5956;&#x5F97;&#x7684;&#xFF0C;&#x300A;&#x5199;&#x7ED9;&#x5927;&#x5BB6;&#x770B;&#x7684;&#x8BBE;&#x8BA1;&#x4E66;&#x300B;&#x662F;&#x65E9;&#x8BFB;&#x8BFE;&#x8BC4;&#x8BBA;&#x96C6;&#x8D5E;&#x5F97;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x6709;&#x4E2A;&#x5171;&#x540C;&#x70B9;&#x2014;&#x2014;&#x90FD;&#x8FD8;&#x6CA1;&#x770B;&#x5B8C;&#xFF0C;&#x54C8;&#x54C8;&#x3002;&#x9664;&#x4E86;&#x8FD9;&#x51E0;&#x672C;&#xFF0C;&#x5F53;&#x7136;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x5566;&#xFF0C;&#x4E70;&#x4E0D;&#x5230;&#x7684;&#x5C31;&#x4E0D;&#x8BF4;&#x4E86;&#xFF0C;&#x80FD;&#x4E70;&#x5230;&#x7684;&#x597D;&#x4E66;&#x90FD;&#x6709;&#xFF0C;&#x4ECA;&#x5E74;&#x6CA1;&#x770B;&#x591A;&#x5C11;&#xFF0C;&#x8C8C;&#x4F3C;&#x53EA;&#x6709;&#x300A;web&#x5168;&#x6808;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x81EA;&#x6211;&#x4FEE;&#x517B;&#x300B;&#x770B;&#x5B8C;&#x4E86;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x540C;&#x9F84;&#x5374;&#x6BD4;&#x6211;&#x5389;&#x5BB3;&#x90A3;&#x4E48;&#x591A;&#x7684;&#x4EBA;&#xFF0C;&#x6211;&#x4E00;&#x5B9A;&#x8981;&#x77E5;&#x9053;&#x4ED6;&#x7684;&#x79D8;&#x5BC6;~&#x8FD9;&#x4E5F;&#x662F;&#x6211;&#x5728;15&#x5E74;&#x505A;&#x5F97;&#x4E0D;&#x591F;&#x7684;&#x5730;&#x65B9;&#x3002;16&#x5E74;&#xFF0C;&#x6211;&#x4F1A;&#x8BA9;&#x81EA;&#x5DF1;&#x66F4;&#x8E0F;&#x5B9E;&#xFF0C;&#x628A;&#x5FC3;&#x6C89;&#x4E0B;&#x6765;&#xFF0C;&#x56DE;&#x5F52;&#x521D;&#x6001;&#xFF0C;&#x8BFB;&#x4E00;&#x8BFB;&#x5B83;&#x4EEC;&#xFF0C;&#x4E66;&#x653E;&#x5728;&#x90A3;&#x91CC;&#x591A;&#x4E45;&#x90FD;&#x53EA;&#x662F;&#x4E00;&#x53E0;&#x7EB8;&#xFF0C;&#x53EA;&#x6709;&#x8BFB;&#x4E86;&#xFF0C;&#x54EA;&#x6015;&#x53EA;&#x80FD;&#x5438;&#x6536;&#x5230;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x4E5F;&#x6210;&#x4E3A;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<h2 id="&#x751F;&#x6D3B;&#x548C;&#x5BB6;&#x4EBA;"><a href="#&#x751F;&#x6D3B;&#x548C;&#x5BB6;&#x4EBA;" class="headerlink" title="&#x751F;&#x6D3B;&#x548C;&#x5BB6;&#x4EBA;"></a>&#x751F;&#x6D3B;&#x548C;&#x5BB6;&#x4EBA;</h2><p>&#x6211;&#x59D0;&#x53BB;&#x5E74;&#x6625;&#x8282;&#x7684;&#x65F6;&#x5019;&#x7ED3;&#x5A5A;&#x4E86;&#xFF0C;&#x6211;&#x7684;&#x5C0F;&#x5916;&#x7525;&#x5973;&#x4E8E;12&#x6708;2&#x65E5;&#x964D;&#x4E34;&#xFF0C;&#x4ECA;&#x5E74;&#xFF0C;&#x4E5F;&#x662F;&#x5979;&#x8301;&#x58EE;&#x6210;&#x957F;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x867D;&#x7136;&#x76F8;&#x9694;&#x5F88;&#x8FDC;&#xFF0C;&#x4E5F;&#x662F;&#x65F6;&#x5E38;&#x770B;&#x5230;&#x5979;&#x7684;&#x9753;&#x7167;&#xFF0C;&#x5173;&#x6CE8;&#x7740;&#x5979;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x5341;&#x4E00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x56DE;&#x53BB;&#x8FD8;&#x5355;&#x72EC;&#x5E26;&#x4E86;&#x5979;&#x4E24;&#x5929;&#xFF0C;&#x73B0;&#x5728;&#x5979;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x5C81;&#x591A;&#x7684;&#x5C0F;&#x59AE;&#x5B50;&#x5566;~</p>
<p>&#x7238;&#x5988;&#x4E94;&#x4E00;&#x7684;&#x65F6;&#x5019;&#x6765;&#x4E86;&#x6DF1;&#x5733;&#xFF0C;&#x53BB;&#x5E74;&#x5C31;&#x8BF4;&#x6765;&#xFF0C;&#x6211;&#x8FD8;&#x4EE5;&#x4E3A;&#x8BF4;&#x7740;&#x73A9;&#x513F;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x6211;&#x8FD8;&#x6BD4;&#x8F83;&#x7A98;&#x8FEB;&#xFF0C;&#x6765;&#x4E86;&#x4F4F;&#x90FD;&#x6324;&#x5F97;&#x614C;&#xFF0C;&#x8FD8;&#x597D;&#x540E;&#x6765;&#x6162;&#x6162;&#x6539;&#x5584;&#x4E86;&#x70B9;&#xFF0C;&#x4ECA;&#x5E74;&#x5C31;&#x771F;&#x7684;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x8BF7;&#x4E86;&#x51E0;&#x5929;&#x5047;&#xFF0C;&#x966A;&#x4ED6;&#x4EEC;&#x201C;&#x73A9;&#x513F;&#x904D;&#x201D;&#x4E86;&#x6DF1;&#x5733;&#x7684;&#x540D;&#x666F;&#x3002;&#x770B;&#x7740;&#x4ED6;&#x4EEC;&#x9AD8;&#x5174;&#xFF0C;&#x6211;&#x662F;&#x66F4;&#x52A0;&#x7684;&#x9AD8;&#x5174;&#x3002;</p>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x4E00;&#x5806;&#x5404;&#x79CD;&#x7ECF;&#x5386;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;2015&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x662F;&#x68A6;&#x5E7B;&#x822C;&#x7684;&#x4E00;&#x5E74;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x5B9E;&#x9645;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x7ED9;&#x4E86;&#x6211;&#x4FE1;&#x5FC3;&#xFF0C;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x4E3A;&#x6211;&#x63ED;&#x5F00;&#x4E86;&#x4E00;&#x4E9B;&#x4E8B;&#x7269;&#x7684;&#x795E;&#x79D8;&#x611F;&#xFF0C;&#x8FD9;&#x79CD;&#x795E;&#x79D8;&#x611F;&#x4F1A;&#x8BA9;&#x6211;&#x4EEC;&#x5931;&#x53BB;&#x4E00;&#x4E9B;&#x7406;&#x6027;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5224;&#x65AD;&#x548C;&#x9009;&#x62E9;&#x51FA;&#x73B0;&#x504F;&#x5DEE;&#x3002;&#x6211;&#x65F6;&#x5E38;&#x53CD;&#x601D;&#x548C;&#x56DE;&#x5F52;&#xFF0C;&#x4EE5;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x5FC3;&#x4E00;&#x76F4;&#x5728;&#x5730;&#x4E0A;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x6CBF;&#x7740;&#x6700;&#x521D;&#x7684;&#x65B9;&#x5411;&#x5F80;&#x524D;&#x8D70;&#xFF0C;&#x4E0D;&#x8981;&#x8D70;&#x504F;&#xFF0C;&#x4E0D;&#x8981;&#x505C;&#x6B62;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;2016&#xFF0C;&#x613F;&#x5927;&#x5BB6;&#x90FD;&#x5F00;&#x5F00;&#x5FC3;&#x5FC3;&#xFF0C;&#x5065;&#x5065;&#x5EB7;&#x5EB7;&#xFF0C;&#x5DE5;&#x4F5C;&#x987A;&#x5229;&#xFF0C;&#x5FC3;&#x60F3;&#x4E8B;&#x6210;&#x3002;</p>

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/总结/" rel="tag">#总结</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2015/12/14/自学者需要具备的基本技能和素质/" rel="next" title="自学者需要具备的基本技能和素质">
                <i class="fa fa-chevron-left"></i> 自学者需要具备的基本技能和素质
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/02/24/new-year-first-do/" rel="prev" title="新年伊始，我都做了些什么">
                新年伊始，我都做了些什么 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
        <!-- JiaThis Button BEGIN -->
<div class="jiathis_style">
  <a class="jiathis_button_tsina"></a>
  <a class="jiathis_button_tqq"></a>
  <a class="jiathis_button_weixin"></a>
  <a class="jiathis_button_cqq"></a>
  <a class="jiathis_button_douban"></a>
  <a class="jiathis_button_renren"></a>
  <a class="jiathis_button_qzone"></a>
  <a class="jiathis_button_kaixin001"></a>
  <a class="jiathis_button_copy"></a>
  <a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jiathis_separator jtico jtico_jiathis" target="_blank"></a>
  <a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
  var jiathis_config={
    hideMore:false
  }
</script>
<script type="text/javascript" src="http://v3.jiathis.com/code/jia.js" charset="utf-8"></script>
<!-- JiaThis Button END -->

      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
            <div id="uyan_frame"></div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/idea.png"
               alt="灵感_idea" />
          <p class="site-author-name" itemprop="name">灵感_idea</p>
          <p class="site-description motion-element" itemprop="description"></p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">63</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>
          
          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">11</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">13</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        
          <div class="feed-link motion-element">
            <a href="/atom.xml" rel="alternate">
              <i class="fa fa-rss"></i>
              RSS
            </a>
          </div>
        

        <div class="links-of-author motion-element">
          
        </div>

        
        

        <div class="links-of-author motion-element">
          
        </div>

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc-indicator-top post-toc-indicator">
            <i class="fa fa-angle-double-up"></i>
          </div>
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#工作"><span class="nav-number">1.</span> <span class="nav-text">工作</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#分享"><span class="nav-number">2.</span> <span class="nav-text">分享</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#会议"><span class="nav-number">3.</span> <span class="nav-text">会议</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#专访"><span class="nav-number">4.</span> <span class="nav-text">专访</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#读书"><span class="nav-number">5.</span> <span class="nav-text">读书</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#生活和家人"><span class="nav-number">6.</span> <span class="nav-text">生活和家人</span></a></li></ol></div>
            
          </div>
          <div class="post-toc-indicator-bottom post-toc-indicator">
            <i class="fa fa-angle-double-down"></i>
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy; 
  <span itemprop="copyrightYear">2017</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">灵感_idea</span>
</div>

<div class="powered-by">
  由 <a class="theme-link" href="http://hexo.io">Hexo</a> 强力驱动
</div>

<div class="theme-info">
  主题 -
  <a class="theme-link" href="https://github.com/iissnan/hexo-theme-next">
    NexT.Pisces
  </a>
</div>



      </div>
    </footer>

    <div class="back-to-top"></div>
  </div>

  


  



  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.min.js"></script>

  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js"></script>

  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=0.5.0"></script>



  
  


  <script type="text/javascript" src="/js/src/affix.js?v=0.5.0"></script>

  <script type="text/javascript" src="/js/src/schemes/pisces.js?v=0.5.0"></script>



  
  
<script type="text/javascript" src="/js/src/scrollspy.js?v=0.5.0"></script>

<script type="text/javascript" id="sidebar.toc.highlight">
  $(document).ready(function () {
    var tocSelector = '.post-toc';
    var $tocSelector = $(tocSelector);
    var activeCurrentSelector = '.active-current';

    $tocSelector
      .on('activate.bs.scrollspy', function () {
        var $currentActiveElement = $(tocSelector + ' .active').last();

        removeCurrentActiveClass();
        $currentActiveElement.addClass('active-current');

        $tocSelector[0].scrollTop = $currentActiveElement.position().top;
      })
      .on('clear.bs.scrollspy', function () {
        removeCurrentActiveClass();
      });

    function removeCurrentActiveClass () {
      $(tocSelector + ' ' + activeCurrentSelector)
        .removeClass(activeCurrentSelector.substring(1));
    }

    function processTOC () {
      getTOCMaxHeight();
      toggleTOCOverflowIndicators();
    }

    function getTOCMaxHeight () {
      var height = $('.sidebar').height() -
                   $tocSelector.position().top -
                   $('.post-toc-indicator-bottom').height();

      $tocSelector.css('height', height);

      return height;
    }

    function toggleTOCOverflowIndicators () {
      tocOverflowIndicator(
        '.post-toc-indicator-top',
        $tocSelector.scrollTop() > 0 ? 'show' : 'hide'
      );

      tocOverflowIndicator(
        '.post-toc-indicator-bottom',
        $tocSelector.scrollTop() >= $tocSelector.find('ol').height() - $tocSelector.height() ? 'hide' : 'show'
      )
    }

    $(document).on('sidebar.motion.complete', function () {
      processTOC();
    });

    $('body').scrollspy({ target: tocSelector });
    $(window).on('resize', function () {
      if ( $('.sidebar').hasClass('sidebar-active') ) {
        processTOC();
      }
    });

    onScroll($tocSelector);

    function onScroll (element) {
      element.on('mousewheel DOMMouseScroll', function (event) {
          var oe = event.originalEvent;
          var delta = oe.wheelDelta || -oe.detail;

          this.scrollTop += ( delta < 0 ? 1 : -1 ) * 30;
          event.preventDefault();

          toggleTOCOverflowIndicators();
      });
    }

    function tocOverflowIndicator (indicator, action) {
      var $indicator = $(indicator);
      var opacity = action === 'show' ? 1 : 0;
      $indicator.velocity ?
        $indicator.velocity('stop').velocity({
          opacity: opacity
        }, { duration: 100 }) :
        $indicator.stop().animate({
          opacity: opacity
        }, 100);
    }

  });
</script>

<script type="text/javascript" id="sidebar.nav">
  $(document).ready(function () {
    var html = $('html');
    var TAB_ANIMATE_DURATION = 200;
    var hasVelocity = $.isFunction(html.velocity);

    $('.sidebar-nav li').on('click', function () {
      var item = $(this);
      var activeTabClassName = 'sidebar-nav-active';
      var activePanelClassName = 'sidebar-panel-active';
      if (item.hasClass(activeTabClassName)) {
        return;
      }

      var currentTarget = $('.' + activePanelClassName);
      var target = $('.' + item.data('target'));

      hasVelocity ?
        currentTarget.velocity('transition.slideUpOut', TAB_ANIMATE_DURATION, function () {
          target
            .velocity('stop')
            .velocity('transition.slideDownIn', TAB_ANIMATE_DURATION)
            .addClass(activePanelClassName);
        }) :
        currentTarget.animate({ opacity: 0 }, TAB_ANIMATE_DURATION, function () {
          currentTarget.hide();
          target
            .stop()
            .css({'opacity': 0, 'display': 'block'})
            .animate({ opacity: 1 }, TAB_ANIMATE_DURATION, function () {
              currentTarget.removeClass(activePanelClassName);
              target.addClass(activePanelClassName);
            });
        });

      item.siblings().removeClass(activeTabClassName);
      item.addClass(activeTabClassName);
    });

    $('.post-toc a').on('click', function (e) {
      e.preventDefault();
      var targetSelector = NexT.utils.escapeSelector(this.getAttribute('href'));
      var offset = $(targetSelector).offset().top;
      hasVelocity ?
        html.velocity('stop').velocity('scroll', {
          offset: offset  + 'px',
          mobileHA: false
        }) :
        $('html, body').stop().animate({
          scrollTop: offset
        }, 500);
    });

    // Expand sidebar on post detail page by default, when post has a toc.
    NexT.motion.middleWares.sidebar = function () {
      var $tocContent = $('.post-toc-content');

      if (CONFIG.sidebar === 'post') {
        if ($tocContent.length > 0 && $tocContent.html().trim().length > 0) {
          NexT.utils.displaySidebar();
        }
      }
    };
  });
</script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=0.5.0"></script>



  



  




    
      
    

   
        <!-- UY BEGIN -->
        <script type="text/javascript" src="http://v2.uyan.cc/code/uyan.js?uid=2143573"></script>
        <!-- UY END -->
    
  

  
  

  
  


</body>
</html>
