<!DOCTYPE html><html lang="zh-CN"><head><meta http-equiv="content-type" content="text/html; charset=utf-8"><meta content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=0" name="viewport"><meta content="yes" name="apple-mobile-web-app-capable"><meta content="black-translucent" name="apple-mobile-web-app-status-bar-style"><meta content="telephone=no" name="format-detection"><meta name="description"><title>图文浅谈css3 | 灵感的小窝</title><link rel="stylesheet" type="text/css" href="/css/normalize.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/pure-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/grids-responsive-min.css?v=0.0.0"><link rel="stylesheet" type="text/css" href="/css/style.css?v=0.0.0"><link rel="stylesheet" href="//cdn.bootcss.com/font-awesome/4.5.0/css/font-awesome.min.css"><link rel="Shortcut Icon" type="image/x-icon" href="/favicon.ico"><link rel="apple-touch-icon" href="/apple-touch-icon.png"><link rel="apple-touch-icon-precomposed" href="/apple-touch-icon.png"><link rel="alternate" type="application/atom+xml" href="/atom.xml"></head><body><div class="body_container"><div id="header"><div class="site-name"><h1 class="hidden">图文浅谈css3</h1><a id="logo" href="/.">灵感的小窝</a><p class="description">生活琐碎、前端杂谈、诗情画意、随心笔记</p></div><div id="nav-menu"><a href="/." class="current"><i class="fa fa-home"> 首页</i></a><a href="/archives/"><i class="fa fa-archive"> 归档</i></a><a href="/about/"><i class="fa fa-user"> 关于</i></a><a href="/atom.xml"><i class="fa fa-rss"> 订阅</i></a></div></div><div id="layout" class="pure-g"><div class="pure-u-1 pure-u-md-3-4"><div class="content_container"><div class="post"><h1 class="post-title">图文浅谈css3</h1><div class="post-meta">Mar 14, 2015<span> | </span><span class="category"><a href="/categories/CSS/">CSS</a></span><script src="https://dn-lbstatics.qbox.me/busuanzi/2.3/busuanzi.pure.mini.js" async></script><span id="busuanzi_container_page_pv"> | <span id="busuanzi_value_page_pv"></span><span> Hits</span></span></div><a data-thread-key="2015/03/14/front-homes-picture-overview-CSS3/" href="/2015/03/14/front-homes-picture-overview-CSS3/#comments" class="ds-thread-count"></a><div class="clear"><div id="toc" class="toc-article"><div class="toc-title">文章目录</div><ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#布局"><span class="toc-number">1.</span> <span class="toc-text">布局</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#Flexbox能干嘛呢？"><span class="toc-number">2.</span> <span class="toc-text">Flexbox能干嘛呢？</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#多栏布局Multi-columns"><span class="toc-number">3.</span> <span class="toc-text">多栏布局Multi columns</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#Calc"><span class="toc-number">4.</span> <span class="toc-text">Calc()</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#Grid-Layout（网格布局）"><span class="toc-number">5.</span> <span class="toc-text">Grid Layout（网格布局）</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#摆脱图片，代码来搞定"><span class="toc-number">6.</span> <span class="toc-text">摆脱图片，代码来搞定</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#给图片加上“翅膀”"><span class="toc-number">7.</span> <span class="toc-text">给图片加上“翅膀”</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#媒体查询-Media-query"><span class="toc-number">8.</span> <span class="toc-text">媒体查询 Media query</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#选择器"><span class="toc-number">9.</span> <span class="toc-text">选择器</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#盒模型-Box-sizing"><span class="toc-number">10.</span> <span class="toc-text">盒模型 Box-sizing</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#Rem"><span class="toc-number">11.</span> <span class="toc-text">Rem</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#Css3的那些炫技"><span class="toc-number">12.</span> <span class="toc-text">Css3的那些炫技</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#css3给我们带来了什么？"><span class="toc-number">13.</span> <span class="toc-text">css3给我们带来了什么？</span></a></li></ol></div></div><div class="post-content"><p><img src="/2015/03/14/front-homes-picture-overview-CSS3/1.jpg" alt=""><br>css3&#x5DF2;&#x7ECF;&#x201C;&#x51FA;&#x6765;&#x201D;&#x633A;&#x4E45;&#x4E86;&#xFF0C;&#x7531;&#x6700;&#x521D;&#x7684;&#x65B0;&#x5947;&#xFF0C;&#x5C1D;&#x8BD5;&#xFF0C;&#x5230;&#x73B0;&#x5728;&#x6162;&#x6162;&#x7684;&#x88AB;&#x4E60;&#x4EE5;&#x4E3A;&#x5E38;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#x9700;&#x6C42;&#x7684;&#x66B4;&#x589E;&#xFF0C;&#x5BF9;css3&#x66F4;&#x597D;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5438;&#x5F15;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x8D70;&#x4E86;&#x8FDB;&#x6765;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x521A;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x5B83;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6216;&#x8BB8;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x7684;&#x6DF7;&#x6C8C;&#x4E4B;&#x5904;&#xFF0C;&#x6BD5;&#x7ADF;&#x5B83;&#x662F;&#x4E2A;&#x5927;&#x5B9D;&#x85CF;&#xFF0C;&#x800C;&#x591A;&#x6570;&#x4EBA;&#x56E0;&#x5E94;&#x7528;&#x7684;&#x5C40;&#x9650;&#xFF0C;&#x4E86;&#x89E3;&#x7684;&#x9762;&#x4E5F;&#x76F8;&#x5BF9;&#x5C40;&#x9650;&#x3002;&#x672C;&#x6587;&#x5C31;&#x8BD5;&#x56FE;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7A0D;&#x5927;&#x8303;&#x56F4;&#x7684;&#x6982;&#x62EC;&#x6027;&#x5C55;&#x73B0;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x53EA;&#x662F;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x4E00;&#x8C08;&#x8D77;css3&#xFF0C;&#x591A;&#x6570;&#x4EBA;&#x53EF;&#x80FD;&#x9996;&#x5148;&#x60F3;&#x5230;&#x7684;&#x662F;&#x5404;&#x79CD;&#x70AB;&#x9177;&#x7684;&#x6548;&#x679C;&#x3002;&#x7684;&#x786E;&#xFF0C;css3&#x7684;&#x51FA;&#x73B0;&#x7684;&#x786E;&#x662F;&#x4F7F;&#x5F97;css&#x7684;&#x4E16;&#x754C;&#x6709;&#x4E86;&#x7115;&#x7136;&#x4E00;&#x65B0;&#xFF0C;&#x88AB;&#x89E3;&#x653E;&#x4E86;&#x7684;&#x611F;&#x89C9;&#x3002;&#x4EE5;&#x524D;&#x9700;&#x8981;&#x7528;&#x56FE;&#x7247;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x6807;&#x7B7E;&#x8FDB;&#x884C;&#x5806;&#x53E0;&#x7684;&#xFF0C;&#x9700;&#x8981;&#x7528;js&#x7684;&#xFF0C;&#x9700;&#x8981;&#x7528;flash&#x7684;&#x7B49;&#x7B49;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x51E0;&#x4E4E;&#x60F3;&#x4E0D;&#x5230;&#x529E;&#x6CD5;&#x53BB;&#x505A;&#x7684;&#x4E1C;&#x897F;&#xFF0C;css3&#x90FD;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x76F8;&#x5E94;&#x7684;&#x8865;&#x507F;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x4E0D;&#x53BB;&#x4ECE;&#x90A3;&#x4E9B;&#x65B9;&#x9762;&#x5F00;&#x59CB;&#x8C08;&#xFF0C;&#x6211;&#x4F1A;&#x6309;&#x7167;&#x67D0;&#x79CD;&#x5206;&#x7C7B;&#x628A;css3&#x6765;&#x4E2A;&#x6574;&#x4F53;&#x6D4F;&#x89C8;&#x3002;&#x76EE;&#x7684;&#x662F;&#x8BA9;&#x5BF9;css3&#x4E0D;&#x592A;&#x4E86;&#x89E3;&#x7684;&#x4EBA;&#x80FD;&#x6709;&#x4E2A;&#x5927;&#x6982;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4E5F;&#x7B97;&#x662F;&#x590D;&#x4E60;&#x4E00;&#x4E0B;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6B64;&#x6587;&#x4E0D;&#x4F1A;&#x5217;&#x51FA;&#x4E00;&#x5806;&#x4EE3;&#x7801;&#x7ED9;&#x4F60;&#x770B;&#x3002;</p>
<h2 id="&#x5E03;&#x5C40;"><a href="#&#x5E03;&#x5C40;" class="headerlink" title="&#x5E03;&#x5C40;"></a>&#x5E03;&#x5C40;</h2><p>Css&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x4E2A;&#x4F5C;&#x7528;&#xFF0C;&#x5C31;&#x662F;&#x5E03;&#x5C40;&#xFF0C;&#x800C;&#x521D;&#x5B66;css3&#x7684;&#x670B;&#x53CB;&#x53EF;&#x80FD;&#x4F1A;&#x56E0;&#x4E3A;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#x5FFD;&#x89C6;&#x6389;&#x5B83;&#xFF0C;&#x539F;&#x56E0;&#x6709;&#x4E8C;&#x3002;</p>
<p>&#x88AB;&#x5404;&#x79CD;&#x9177;&#x70AB;&#x7684;&#x65B0;&#x201C;&#x529F;&#x80FD;&#x201D;&#x7ED9;&#x8499;&#x853D;&#x4E86;&#xFF0C;&#x89C9;&#x5F97;&#x90A3;&#x5C31;&#x662F;css3~<br>&#x6CA1;&#x89C9;&#x5F97;&#x4E4B;&#x524D;&#x7684;css&#x5E03;&#x5C40;&#x65B9;&#x6CD5;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#xFF0C;&#x89C9;&#x5F97;&#x591F;&#x7528;&#x4E86;&#xFF0C;&#x4E0D;&#x9047;&#x5230;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x6216;&#x8005;&#x6CA1;&#x4EBA;&#x63D0;&#x8D77;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x53BB;&#x5728;&#x610F;&#x3002;&#x4EBA;&#x603B;&#x662F;&#x5BB9;&#x6613;&#x77E5;&#x8DB3;&#x7684;~<br>&#x7075;&#x6D3B;&#x7684;Flexbox</p>
<p>&#x5C0F;&#x8C08;&#x4E00;&#x4E0B;float&#xFF0C;&#x5F88;&#x591A;&#x89E3;&#x6790;float&#x7684;&#x6587;&#x7AE0;&#x90FD;&#x63D0;&#x5230;float&#x672C;&#x8EAB;&#x5728;&#x8BBE;&#x8BA1;&#x4E4B;&#x521D;&#x5E76;&#x4E0D;&#x662F;&#x7528;&#x6765;&#x5E03;&#x5C40;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E8E;&#x56FE;&#x6587;&#x6DF7;&#x6392;&#x3002;&#x800C;&#x4E14;&#x6D6E;&#x52A8;&#x7684;&#x5143;&#x7D20;&#x4F1A;&#x8131;&#x79BB;&#x6B63;&#x5E38;&#x7684;&#x6587;&#x6863;&#x6D41;&#xFF0C;&#x8981;&#x95ED;&#x5408;&#x6D6E;&#x52A8;&#x3002;&#x76EE;&#x524D;&#x7684;&#x5F88;&#x591A;&#x7F51;&#x9875;&#x90FD;&#x662F;&#x6EE5;&#x7528;&#x6D6E;&#x52A8;&#xFF0C;&#x5982;&#x4E4B;&#x524D;&#x7684;&#x6EE5;&#x7528;div&#x822C;&#xFF0C;&#x968F;&#x5904;&#x53EF;&#x89C1;fl&#x3001;fr&#xFF0C;&#x7136;&#x540E;&#x6765;&#x4E2A;clearfix&#xFF0C;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#xFF01;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x5DF2;&#x7ECF;&#x88AB;&#x4EBA;&#x6279;&#x8FC7;&#x5F88;&#x591A;&#x6B21;&#x4E86;&#x3002;</p>
<h2 id="Flexbox&#x80FD;&#x5E72;&#x561B;&#x5462;&#xFF1F;"><a href="#Flexbox&#x80FD;&#x5E72;&#x561B;&#x5462;&#xFF1F;" class="headerlink" title="Flexbox&#x80FD;&#x5E72;&#x561B;&#x5462;&#xFF1F;"></a>Flexbox&#x80FD;&#x5E72;&#x561B;&#x5462;&#xFF1F;</h2><p>&#x5F53;&#x4F60;&#x7ED9;&#x7236;&#x5BB9;&#x5668;&#x5E94;&#x7528;&#x4E86;display&#xFF1A;flex&#xFF1B;&#xFF08;&#x6CE8;&#xFF1A;flexbox&#x5728;&#x53D1;&#x5C55;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x6B64;&#x5199;&#x6CD5;&#x4E3A;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF09; &#x90A3;&#x4E48;&#x5B83;&#x7684;&#x5B50;&#x5143;&#x7D20;&#x7ECF;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x76F8;&#x5E94;&#x8BBE;&#x7F6E;&#x53EF;&#x5B9E;&#x73B0;&#xFF1A; &#x6A2A;/&#x7AD6;&#x6392;</p>
<p>&#x6574;&#x4F53;&#x5DE6;&#x4E2D;&#x53F3;&#xFF08;&#x6C34;&#x5E73;&#xFF09;&#x3001;&#x6574;&#x4F53;&#x4E0A;&#x4E2D;&#x4E0B;&#xFF08;&#x5782;&#x76F4;&#xFF09;<br>&#x5012;&#x5E8F;&#x6392;&#x5217;&#x3001;&#x4EFB;&#x610F;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF08;&#x5728;&#x4E0D;&#x6539;&#x52A8;html&#x7ED3;&#x6784;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;<br>&#x591A;&#x4F59;&#x7A7A;&#x95F4;&#x5206;&#x914D;&#xFF0C;&#x5143;&#x7D20;&#x8D85;&#x51FA;&#x5904;&#x7406;&#x3002;<br>&#x5B50;&#x5143;&#x7D20;&#x53EF;&#x5355;&#x72EC;&#x8BBE;&#x7F6E;&#x81EA;&#x8EAB;&#x7684;&#x5C5E;&#x6027;&#x3002; &#x7B49;&#x7B49; &#x5982;&#x4E0B;</p>
<p><img src="/2015/03/14/front-homes-picture-overview-CSS3/2.png" alt=""></p>
<h2 id="&#x591A;&#x680F;&#x5E03;&#x5C40;Multi-columns"><a href="#&#x591A;&#x680F;&#x5E03;&#x5C40;Multi-columns" class="headerlink" title="&#x591A;&#x680F;&#x5E03;&#x5C40;Multi columns"></a>&#x591A;&#x680F;&#x5E03;&#x5C40;Multi columns</h2><p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x591A;&#x680F;&#xFF0C;&#x5B83;&#x7684;&#x7075;&#x6D3B;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x8BBE;&#x7F6E;&#x680F;&#x6570;&#x3001;&#x680F;&#x5BBD;&#x3001;&#x680F;&#x95F4;&#x9694;&#x3001;&#x680F;&#x5206;&#x5272;&#x7EBF;&#x7B49;&#xFF0C;&#x540C;&#x65F6;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x7528;&#x540C;&#x6837;&#x6570;&#x76EE;&#x7684;&#x5BB9;&#x5668;&#x53BB;&#x653E;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x4F1A;&#x6309;&#x7167;&#x4F60;&#x6240;&#x8BBE;&#x7F6E;&#x7684;&#x90A3;&#x6837;&#x4E56;&#x4E56;&#x7684;&#x6392;&#x5E03;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x7684;&#x6700;&#x591A;&#x7684;&#x5F62;&#x5BB9;&#x4FBF;&#x662F;&#x50CF;&#x62A5;&#x520A;&#x3001;&#x6742;&#x5FD7;&#x90A3;&#x6837;&#x7684;&#x6392;&#x7248;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x4E0B; </p>
<p><img src="/2015/03/14/front-homes-picture-overview-CSS3/2.png" alt=""></p>
<h2 id="Calc"><a href="#Calc" class="headerlink" title="Calc()"></a>Calc()</h2><p>calc&#x662F;&#x82F1;&#x6587;&#x5355;&#x8BCD;calculate(&#x8BA1;&#x7B97;)&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;calc()&#x7ED9;&#x5143;&#x7D20;&#x7684;border&#x3001;margin&#x3001;pading&#x3001;font-size&#x548C;width&#x7B49;&#x5C5E;&#x6027;&#x8BBE;&#x7F6E;&#x52A8;&#x6001;&#x503C;&#x3002;&#x4E3A;&#x4F55;&#x8BF4;&#x662F;&#x52A8;&#x6001;&#x503C;&#x5462;?&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x6765;&#x5F97;&#x5230;&#x7684;&#x503C;&#x3002;calc()&#x6700;&#x5927;&#x7684;&#x597D;&#x5904;&#x5C31;&#x662F;&#x7528;&#x5728;&#x6D41;&#x4F53;&#x5E03;&#x5C40;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;calc()&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x5143;&#x7D20;&#x7684;&#x5BBD;&#x5EA6;&#x3002; &#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x5462;&#xFF1F;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x5E94;&#x8BE5;&#x90FD;&#x9047;&#x5230;&#x8FC7;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x7684;&#x6709;border&#x3001;padding&#x7B49;&#xFF0C;&#x800C;&#x4E14;&#x662F;&#x5177;&#x4F53;&#x7684;&#x503C;&#xFF0C;&#x6BD4;&#x5982;px&#x6216;&#x8005;em&#x3001;rem&#x7B49;&#x3002;&#x4F46;&#x5143;&#x7D20;&#x672C;&#x8EAB;&#x662F;&#x4E0D;&#x5B9A;&#x5BBD;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x600E;&#x4E48;&#x53BB;&#x8BBE;&#x7F6E;&#x5143;&#x7D20;&#x7684;&#x5BBD;&#xFF1F; calc()&#x5C31;&#x662F;&#x7ED9;&#x6211;&#x4EEC;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x65B9;&#x4FBF;&#xFF0C;&#x628A;&#x95EE;&#x9898;&#x4EA4;&#x7ED9;&#x4E86;&#x6D4F;&#x89C8;&#x5668;&#x3002; &#x6BD4;&#x5982;&#x8FD9;&#x6837;&#xFF1A;width:calc(100% - (10px + 5px) * 2); &#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x60F3;&#x5230;&#x4E86;&#xFF0C;&#x5B83;&#x80FD;&#x89E3;&#x51B3;&#x5B9A;&#x5BBD;&#x4E0D;&#x5B9A;&#x5BBD;&#x5E76;&#x5B58;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="Grid-Layout&#xFF08;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#xFF09;"><a href="#Grid-Layout&#xFF08;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#xFF09;" class="headerlink" title="Grid Layout&#xFF08;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#xFF09;"></a>Grid Layout&#xFF08;&#x7F51;&#x683C;&#x5E03;&#x5C40;&#xFF09;</h2><p>&#x8FD9;&#x79CD;&#x5E03;&#x5C40;&#x65B9;&#x5F0F;&#xFF0C;&#x8DDF;flexbox&#x6709;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x62FF;&#x4E8C;&#x8005;&#x4F5C;&#x6BD4;&#x8F83;&#xFF0C;&#x8FD9;&#x6BB5;&#x5C31;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x5B83;&#x3002; &#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x5B83;&#x4F1A;&#x5F88;&#x50CF;&#x8868;&#x683C;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x662F;&#x7531;html&#x6240;&#x5199;&#x51FA;&#x7684;&#x8868;&#x683C;&#xFF0C;&#x800C;&#x662F;&#x7531;css&#x6765;&#x8FDB;&#x884C;&#x8BBE;&#x7F6E;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x4F9D;&#x8D56;&#x4E8E;&#x5A92;&#x4F53;&#x67E5;&#x8BE2;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x5E03;&#x5C40;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x6446;&#x8131;&#x73B0;&#x5728;&#x5E03;&#x5C40;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x6587;&#x6863;&#x6D41;&#x9650;&#x5236;&#xFF0C;&#x4F60;&#x7684;&#x7ED3;&#x6784;&#x4E0D;&#x9700;&#x8981;&#x6839;&#x636E;&#x8BBE;&#x8BA1;&#x7A3F;&#x4ECE;&#x4E0A;&#x5F80;&#x4E0A;&#x5E03;&#x7F6E;&#x4E86;&#x3002;&#x8FD9;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x60A8;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x66F4;&#x6539;&#x9875;&#x9762;&#x5143;&#x7D20;&#x4F4D;&#x7F6E;&#x3002;</p>
<h2 id="&#x6446;&#x8131;&#x56FE;&#x7247;&#xFF0C;&#x4EE3;&#x7801;&#x6765;&#x641E;&#x5B9A;"><a href="#&#x6446;&#x8131;&#x56FE;&#x7247;&#xFF0C;&#x4EE3;&#x7801;&#x6765;&#x641E;&#x5B9A;" class="headerlink" title="&#x6446;&#x8131;&#x56FE;&#x7247;&#xFF0C;&#x4EE3;&#x7801;&#x6765;&#x641E;&#x5B9A;"></a>&#x6446;&#x8131;&#x56FE;&#x7247;&#xFF0C;&#x4EE3;&#x7801;&#x6765;&#x641E;&#x5B9A;</h2><p><strong>&#x9634;&#x5F71;</strong></p>
<p>&#x5305;&#x62EC;text-shadow&#x3001;box-shadow</p>
<p><strong>&#x5706;&#x89D2;border-radius</strong></p>
<p>&#x7A81;&#x7834;&#x4E86;&#x4EE5;&#x5F80;&#x53EA;&#x80FD;&#x662F;&#x65B9;&#x5F62;&#x76D2;&#x5B50;&#xFF0C;&#x6216;&#x8005;&#x9700;&#x8981;&#x7528;&#x591A;&#x4F59;&#x6807;&#x7B7E;&#x548C;&#x56FE;&#x7247;&#x6765;&#x5236;&#x4F5C;&#x5706;&#x89D2;&#x6548;&#x679C;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p><strong>&#x6E10;&#x53D8;gradient</strong></p>
<p>&#x6E10;&#x53D8;&#x5728;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x4E2D;&#x968F;&#x5904;&#x53EF;&#x89C1;&#xFF0C;&#x5E38;&#x7528;&#x5728;&#x80CC;&#x666F;&#x4E0A;&#xFF0C;&#x4EE5;&#x524D;&#x9047;&#x5230;&#x6E10;&#x53D8;&#xFF0C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5207;&#x56FE;&#xFF0C;&#x54EA;&#x6015;&#x662F;&#x4E00;&#x5F20;&#x5F88;&#x5C0F;&#x7684;&#x56FE;&#x8FDB;&#x884C;&#x5E73;&#x94FA;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x4E00;&#x79CD;&#x7528;&#x4EE3;&#x7801;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="&#x7ED9;&#x56FE;&#x7247;&#x52A0;&#x4E0A;&#x201C;&#x7FC5;&#x8180;&#x201D;"><a href="#&#x7ED9;&#x56FE;&#x7247;&#x52A0;&#x4E0A;&#x201C;&#x7FC5;&#x8180;&#x201D;" class="headerlink" title="&#x7ED9;&#x56FE;&#x7247;&#x52A0;&#x4E0A;&#x201C;&#x7FC5;&#x8180;&#x201D;"></a>&#x7ED9;&#x56FE;&#x7247;&#x52A0;&#x4E0A;&#x201C;&#x7FC5;&#x8180;&#x201D;</h2><p><strong>&#x56FE;&#x50CF;&#x8FB9;&#x6846;border-images</strong></p>
<p>&#x4EE5;&#x524D;&#xFF0C;&#x8FB9;&#x6846;&#x53EA;&#x80FD;&#x662F;&#x6709;&#x9650;&#x7684;&#x51E0;&#x79CD;&#x7EBF;&#x6027;&#xFF0C;&#x60F3;&#x505A;&#x51FA;&#x66F4;&#x4E30;&#x5BCC;&#x7684;&#x6548;&#x679C;&#x662F;&#x505A;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x7684;&#x521B;&#x9020;&#x529B;+&#x5408;&#x9002;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4FBF;&#x6210;&#x521B;&#x9020;&#x51FA;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p><strong>&#x591A;&#x80CC;&#x666F;&#x56FE;backgrounds</strong></p>
<p>&#x5728;&#x4E4B;&#x524D;&#xFF0C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x540C;&#x65F6;&#x6DFB;&#x52A0;&#x4E24;&#x5F20;&#x80CC;&#x666F;&#x56FE;&#x662F;&#x505A;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF0C;&#x5C31;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x591A;&#x5F20;&#x56FE;&#x4F5C;&#x4E3A;&#x80CC;&#x666F;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5B83;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p><strong>&#x906E;&#x7F69;mask&#x548C;&#x6EE4;&#x955C;filter</strong></p>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x7528;&#x8FC7;ps&#x7684;&#x90FD;&#x77E5;&#x9053;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x5BF9;&#x5B83;&#x4EEC;&#x652F;&#x6301;&#x7684;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#xFF0C;&#x5728;&#x7F51;&#x9875;&#x4E0A;&#x5E94;&#x7528;&#x7684;&#x4E5F;&#x5F88;&#x5C11;&#xFF0C;&#x5C31;&#x4E0D;&#x591A;&#x8BF4;&#x4E86;&#x3002;</p>
<h2 id="&#x5A92;&#x4F53;&#x67E5;&#x8BE2;-Media-query"><a href="#&#x5A92;&#x4F53;&#x67E5;&#x8BE2;-Media-query" class="headerlink" title="&#x5A92;&#x4F53;&#x67E5;&#x8BE2; Media query"></a>&#x5A92;&#x4F53;&#x67E5;&#x8BE2; Media query</h2><p>&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x4E5F;&#x662F;&#x5F88;&#x591A;&#x4EBA;&#x5F00;&#x59CB;&#x63A5;&#x89E6;css3&#x5C31;&#x4E86;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x7B97;&#x662F;&#x4E00;&#x4E2A;&#x4EAE;&#x70B9;&#xFF0C;&#x7ED9;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E3A;&#x4E0D;&#x540C;&#x8BBE;&#x5907;&#x5E94;&#x7528;&#x4E0D;&#x540C;&#x6837;&#x5F0F;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x7279;&#x522B;&#x5728;&#x73B0;&#x5728;&#x8FD9;&#x79CD;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x591A;&#x79CD;&#x591A;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x66F4;&#x52A0;&#x7684;&#x4F53;&#x73B0;&#x4EF7;&#x503C;&#x3002;</p>
<h2 id="&#x9009;&#x62E9;&#x5668;"><a href="#&#x9009;&#x62E9;&#x5668;" class="headerlink" title="&#x9009;&#x62E9;&#x5668;"></a>&#x9009;&#x62E9;&#x5668;</h2><p>&#x8FD9;&#x662F;css3&#x4E00;&#x5927;&#x4EAE;&#x70B9;&#xFF0C;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x4EE5;&#x524D;&#x7684;&#x9009;&#x62E9;&#x5668;&#x663E;&#x5F97;&#x5F88;&#x5355;&#x8C03;&#x4E86;&#xFF0C;&#x4E5F;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x4E86;&#x9875;&#x9762;&#x5F53;&#x4E2D;&#x4F1A;&#x51FA;&#x73B0;&#x5F88;&#x591A;&#x4E3A;&#x4E86;&#x6548;&#x679C;&#x800C;&#x52A0;&#x7684;&#x94A9;&#x5B50;&#xFF0C;&#x591A;&#x4E86;&#x4E4B;&#x540E;&#x4F1A;&#x8FDB;&#x4E00;&#x6B65;&#x5BFC;&#x81F4;&#x547D;&#x540D;&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x548C;&#x5143;&#x7D20;&#x5173;&#x8054;&#x7684;&#x6BD4;&#x8F83;&#x5BC6;&#x5207;&#xFF0C;&#x6216;&#x8005;&#x89C4;&#x5212;&#x7684;&#x4E0D;&#x597D;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x8981;&#x5D4C;&#x5957;&#x5F88;&#x591A;&#x5C42;&#x53BB;&#x589E;&#x52A0;&#x6743;&#x91CD;&#xFF0C;&#x6027;&#x80FD;&#x4E5F;&#x968F;&#x4E4B;&#x964D;&#x4F4E;&#x7B49;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x3002;Css3&#x65B0;&#x589E;&#x7684;&#x9009;&#x62E9;&#x5668;&#x5219;&#x6709;&#x4E86;&#x8BF8;&#x591A;&#x7B5B;&#x9009;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x6BD4;&#x5982;&#x7B2C;&#x51E0;&#x4E2A;&#xFF0C;&#x5076;&#x6570;&#x3001;&#x5947;&#x6570;&#x4E2A;&#xFF0C;&#x5426;&#x5B9A;&#xFF0C;&#x7A7A;&#x5143;&#x7D20;&#xFF0C;&#x5C5E;&#x6027;&#x9009;&#x62E9;&#x7B49;&#x7B49;&#x3002;</p>
<h2 id="&#x76D2;&#x6A21;&#x578B;-Box-sizing"><a href="#&#x76D2;&#x6A21;&#x578B;-Box-sizing" class="headerlink" title="&#x76D2;&#x6A21;&#x578B; Box-sizing"></a>&#x76D2;&#x6A21;&#x578B; Box-sizing</h2><p>&#x6216;&#x8BB8;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4F1A;&#x72AF;&#x8FC7;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x7ED9;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x4E86;&#x5BBD;&#x5EA6;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x8BBE;&#x7F6E;padding&#xFF0C;&#x5440;&#xFF1F;&#xFF01;&#x600E;&#x4E48;&#x6EA2;&#x51FA;&#x4E86;&#xFF1F;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;&#x5C31;&#x662F;&#x76D2;&#x6A21;&#x578B;&#x5728;&#x4F5C;&#x602A;&#x3002;&#x76EE;&#x524D;&#x8FD9;&#x4E9B;&#x7248;&#x672C;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x7684;width&#x662F;&#x4E0D;&#x5305;&#x62EC;padding&#x7684;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;box-sizing&#x6765;&#x6539;&#x53D8;&#x5B83;&#x3002;</p>
<h2 id="Rem"><a href="#Rem" class="headerlink" title="Rem"></a>Rem</h2><p>&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x76F8;&#x5BF9;&#x4E8E;&#x6839;&#x5143;&#x7D20;&#x5B9A;&#x4E49;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x957F;&#x5EA6;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x81EA;&#x5B9A;&#x4E49;&#x5B57;&#x4F53; @font-face</p>
<p>&#x8FD9;&#x4E2A;&#x89C4;&#x5219;&#x540C;&#x6837;&#x662F;css3&#x7684;&#x4EAE;&#x70B9;&#xFF0C;&#x6BCF;&#x4F4D;&#x505A;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x4EBA;&#x90FD;&#x78B0;&#x5230;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x2014;&#x2014;&#x89C6;&#x89C9;&#x7A3F;&#x91CC;&#x9762;&#x7684;&#x5B57;&#x4F53;&#x597D;&#x597D;&#x770B;&#xFF0C;&#x53EF;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#x4E0A;&#x9762;&#x6CA1;&#x6709;&#x90A3;&#x79CD;&#x5B57;&#x4F53;&#xFF0C;&#x597D;&#xFF0C;&#x7D22;&#x6027;&#x627E;&#x8BBE;&#x8BA1;&#x5E08;&#x8981;&#x90A3;&#x79CD;&#x5B57;&#x4F53;&#x7136;&#x540E;&#x88C5;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8111;&#x4E0A;&#xFF0C;&#x53EF;&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x80FD;&#x770B;&#x5230;&#x4E86;&#xFF0C;&#x7528;&#x6237;&#x600E;&#x4E48;&#x529E;&#xFF1F;@font-face&#x4E3A;&#x6211;&#x4EEC;&#x5E26;&#x4E86;&#x66D9;&#x5149;&#x3002;</p>
<h2 id="Css3&#x7684;&#x90A3;&#x4E9B;&#x70AB;&#x6280;"><a href="#Css3&#x7684;&#x90A3;&#x4E9B;&#x70AB;&#x6280;" class="headerlink" title="Css3&#x7684;&#x90A3;&#x4E9B;&#x70AB;&#x6280;"></a>Css3&#x7684;&#x90A3;&#x4E9B;&#x70AB;&#x6280;</h2><p>&#x597D;&#x5427;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x597D;&#x50CF;&#x5728;&#x6545;&#x610F;&#x7684;&#x201C;&#x907F;&#x8C08;&#x201D;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x662F;&#x4E0D;&#x5F97;&#x4E0D;&#x8C08;~&#x4E3A;&#x4EC0;&#x4E48;&#x907F;&#x8C08;&#x5462;&#xFF0C;&#x5728;&#x6587;&#x7AE0;&#x7684;&#x7B2C;&#x4E00;&#x6BB5;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x8BF4;&#x660E;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x6709;&#x4E00;&#x79CD;&#x884C;&#x4E3A;&#x603B;&#x662F;&#x88AB;&#x6279;&#x4E00;&#x6837;&#x2014;&#x2014;&#x201C;&#x54C7;&#xFF0C;&#x8FD9;&#x4E2A;&#x505A;&#x5F97;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x4E0D;&#x9519;&#x54E6;&#xFF0C;html5&#x505A;&#x7684;&#x5427;&#xFF1F;&#x201D;&#x5176;&#x5B9E;&#x53EF;&#x80FD;&#x4E00;&#x70B9;html5&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x6CA1;&#x6709;&#x7528;&#xFF0C;&#x53EA;&#x662F;&#x7528;&#x4E86;css3&#x6216;&#x8005;js&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x5BF9;&#x4E8E;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x52A8;&#x753B;&#xFF0C;&#x5C31;&#x8054;&#x60F3;&#x5230;css3&#xFF0C;&#x4EFF;&#x4F5B;css3=&#x52A8;&#x753B;&#x7684;&#x770B;&#x6CD5;&#xFF0C;&#x4E5F;&#x662F;&#x9519;&#x8BEF;&#x7684;&#xFF0C;css3&#x7684;&#x5B9D;&#x85CF;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x3002;</p>
<p><strong>Transform&#x3001;translate&#x3001;transition&#xFF0C;&#x50BB;&#x50BB;&#x5206;&#x4E0D;&#x6E05;&#x695A;&#xFF1F;</strong></p>
<p>&#x8FD9;&#x51E0;&#x4E2A;&#x4E1C;&#x897F;&#x5BF9;&#x4E8E;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#x8FD8;&#x662F;&#x53EF;&#x80FD;&#x4F1A;&#x8FF7;&#x7CCA;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x770B;&#x4E86;&#x4E0A;&#x9762;&#x6211;&#x63D0;&#x4F9B;&#x7684;&#x90A3;&#x5F20;&#x56FE;&#x5E94;&#x8BE5;&#x4E0D;&#x4F1A;&#x4E86;&#x3002;</p>
<p>Tansform&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x51E0;&#x79CD;&#x5F62;&#x53D8;&#x6216;&#x4F4D;&#x7F6E;&#x53D8;&#x5316;&#xFF0C;&#x6BD4;&#x5982;rotate&#xFF08;&#x65CB;&#x8F6C;&#xFF09;&#x3001;skew&#xFF08;&#x626D;&#x66F2;&#xFF09;&#x3001;scale&#xFF08;&#x7F29;&#x653E;&#xFF09;&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x52A8;&#x753B;&#x90FD;&#x79BB;&#x4E0D;&#x5F00;&#x5B83;&#x3002;Translate&#xFF08;&#x5E73;&#x79FB;&#xFF09;&#x4E5F;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x3002;</p>
<p>Transition&#x4E3A;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x53D8;&#x5316;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x8FC7;&#x6E21;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x7A81;&#x53D8;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x52A8;&#x753B;&#x6548;&#x679C;&#x3002;</p>
<p><strong>Animation</strong></p>
<p>&#x4E00;&#x8BF4;&#x5230;&#x52A8;&#x753B;&#xFF0C;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x7ED3;&#x5408;&#x7740;js&#x6216;&#x8005;Flash&#x6765;&#x505A;&#x7684;&#xFF0C;html5&#x7684;canvas&#x4E5F;&#x4E0D;&#x4F8B;&#x5916;&#x3002;&#x4F46;&#x5230;&#x4E86;css3&#xFF0C;&#x5F15;&#x5165;&#x4E86;animation&#xFF0C;&#x518D;&#x914D;&#x5408;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x5143;&#x7D20;&#x4F4D;&#x7F6E;&#x548C;&#x5F62;&#x72B6;&#x4EE5;&#x53CA;&#x5916;&#x89C2;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5C31;&#x80FD;&#x505A;&#x51FA;&#x52A8;&#x753B;&#x6765;&#x3002;</p>
<p>&#x5B83;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x6709;&#x7528;&#x7684;&#x5C0F;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;shapes&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5728;&#x56FE;&#x6587;&#x6DF7;&#x6392;&#x65F6;&#x505A;&#x51FA;&#x5706;&#x5F27;&#x8FB9;&#x7F18;&#x6216;&#x8005;&#x5404;&#x79CD;&#x4E0D;&#x89C4;&#x5219;&#x5F62;&#x72B6;&#x7B49;&#x7B49;&#x3002;</p>
<h2 id="css3&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#css3&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="css3&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;"></a>css3&#x7ED9;&#x6211;&#x4EEC;&#x5E26;&#x6765;&#x4E86;&#x4EC0;&#x4E48;&#xFF1F;</h2><p>&#x81F3;&#x5C11;&#x4ECE;&#x76EE;&#x524D;&#x770B;&#x6765;&#xFF0C;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x63D0;&#x9AD8;&#x4E86;&#x5236;&#x4F5C;&#x67D0;&#x4E9B;&#x6548;&#x679C;&#x7684;&#x6548;&#x7387;&#x3001;&#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x4E00;&#x4E9B;&#x65B9;&#x6848;&#x3001;&#x4F7F;&#x4EE3;&#x7801;&#x7684;&#x7EF4;&#x62A4;&#x66F4;&#x52A0;&#x65B9;&#x4FBF;&#xFF0C;&#x6027;&#x80FD;&#x4E5F;&#x5F97;&#x5230;&#x4E86;&#x63D0;&#x5347;&#x3002;&#x4E5F;&#x8BA9;css&#x7684;&#x4E16;&#x754C;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4E00;&#x9879;&#x6280;&#x672F;&#x80FD;&#x7528;&#x597D;&#xFF0C;&#x5149;&#x662F;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#xFF0C;&#x8D77;&#x7801;&#x8981;&#x505A;&#x5230;&#x51E0;&#x70B9;&#xFF1A;&#x529F;&#x80FD;&#x6027;&#x3001;&#x5B8C;&#x6574;&#x6027;&#x3001;&#x7075;&#x6D3B;&#x6027;&#x3001;&#x5B9E;&#x7528;&#x6027;&#x3001;&#x5408;&#x7406;&#x6027;&#x3002;&#x82E5;&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x51E0;&#x70B9;&#xFF0C;&#x90A3;&#x4FBF;&#x662F;&#x5F88;&#x9AD8;&#x7684;&#x5883;&#x754C;&#xFF0C;&#x80FD;&#x591F;&#x6325;&#x6D12;&#x81EA;&#x5982;&#x3002;</p>
<p>&#x6B64;&#x6587;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x7C97;&#x7EBF;&#x6761;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x867D;&#x7136;&#x53C2;&#x8003;&#x4E86;&#x4E00;&#x4E9B;&#x8D44;&#x6599;&#xFF0C;&#x6BD4;&#x5982;</p>
<p><a href="http://www.w3cplus.com/" target="_blank" rel="external">w3cplus</a>,<a href="css.doyoe.com/">CSS&#x624B;&#x518C;</a>,<a href="ued.ctrip.com/webkitcss/">webkitcss</a></p>
<p>&#x4F46;&#x96BE;&#x514D;&#x6709;&#x4E0D;&#x5F53;&#x4E4B;&#x5904;&#xFF0C;&#x6B22;&#x8FCE;&#x4EA4;&#x6D41;&#x3002;</p>
</div><a data-url="http://yoursite.com/2015/03/14/front-homes-picture-overview-CSS3/" data-id="cir6fe4go004kvoqiv9oqiy2m" class="article-share-link">分享到</a><div class="tags"><a href="/tags/CSS/">CSS</a></div><div class="post-nav"><a href="/2015/03/28/《web前端最佳实践》—高维护性css/" class="pre">《web前端最佳实践》—高维护性css</a><a href="/2014/12/27/webrebuild_2015/" class="next">第八届webrebuild年会总结暨“如何做一个理想主义者”</a></div><div data-thread-key="2015/03/14/front-homes-picture-overview-CSS3/" data-title="图文浅谈css3" data-url="http://yoursite.com/2015/03/14/front-homes-picture-overview-CSS3/" class="ds-share flat"><div class="ds-share-inline"><ul class="ds-share-icons-16"><li data-toggle="ds-share-icons-more"><a href="javascript:void(0);" class="ds-more">分享到：</a></li><li><a href="javascript:void(0);" data-service="weibo" class="ds-weibo">微博</a></li><li><a href="javascript:void(0);" data-service="qzone" class="ds-qzone">QQ空间</a></li><li><a href="javascript:void(0);" data-service="qqt" class="ds-qqt">腾讯微博</a></li><li><a href="javascript:void(0);" data-service="wechat" class="ds-wechat">微信</a></li></ul><div class="ds-share-icons-more"></div></div></div><div data-thread-key="2015/03/14/front-homes-picture-overview-CSS3/" data-title="图文浅谈css3" data-url="http://yoursite.com/2015/03/14/front-homes-picture-overview-CSS3/" data-author-key="1" class="ds-thread"></div></div></div></div><div class="pure-u-1-4"><div id="sidebar"><div class="widget"><form action="//www.baidu.com/baidu" method="get" accept-charset="utf-8" target="_blank" class="search-form"><input type="search" name="word" maxlength="20" placeholder="Search" class="search-form-input"/><input type="hidden" name="si" value="http://yoursite.com"/><input name="tn" type="hidden" value="bds"/><input name="cl" type="hidden" value="3"/><input name="ct" type="hidden" value="2097152"/><input name="s" type="hidden" value="on"/></form></div><div class="widget"><div class="widget-title"><i class="fa fa-folder-o"> 分类</i></div><ul class="category-list"><li class="category-list-item"><a class="category-list-link" href="/categories/CSS/">CSS</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/HTML/">HTML</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/javascript学习笔记/">javascript学习笔记</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/分享交流/">分享交流</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/学习/">学习</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/思考/">思考</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/总结/">总结</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/移动端/">移动端</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/经历/">经历</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/设计/">设计</a></li><li class="category-list-item"><a class="category-list-link" href="/categories/读后感/">读后感</a></li></ul></div><div class="widget"><div class="widget-title"><i class="fa fa-star-o"> 标签</i></div><div class="tagcloud"><a href="/tags/HTML/" style="font-size: 15px;">HTML</a> <a href="/tags/思考/" style="font-size: 15px;">思考</a> <a href="/tags/CSS/" style="font-size: 15px;">CSS</a> <a href="/tags/学习/" style="font-size: 15px;">学习</a> <a href="/tags/移动端/" style="font-size: 15px;">移动端</a> <a href="/tags/前端/" style="font-size: 15px;">前端</a> <a href="/tags/经历/" style="font-size: 15px;">经历</a> <a href="/tags/总结/" style="font-size: 15px;">总结</a> <a href="/tags/分享交流/" style="font-size: 15px;">分享交流</a> <a href="/tags/思考，技术栈/" style="font-size: 15px;">思考，技术栈</a> <a href="/tags/javascript/" style="font-size: 15px;">javascript</a> <a href="/tags/设计、读后感/" style="font-size: 15px;">设计、读后感</a></div></div><div class="widget"><div class="widget-title"><i class="fa fa-file-o"> 最新文章</i></div><ul class="post-list"><li class="post-list-item"><a class="post-list-link" href="/2016/06/27/less_sass/">抛开语法，深度剖析CSS预处理器</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/20/javascript-study-five/">征服javascript学习笔记（五）——引用类型Object和Array</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/09/web_standard/">是时候再提web标准</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/06/动态中寻找答案/">动态中寻找答案</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/04/04/读《白说》：遇见自己/">读《白说》：遇见自己</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/29/前端资源收集小思/">前端资源收集小思</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/27/javascript-study-four/">征服javascript学习笔记（四）——变量、作用域和内存</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/20/javascript-study-three/">征服javascript学习笔记（三）——基本概念（下）</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/06/design-principle/">设计，不止于美</a></li><li class="post-list-item"><a class="post-list-link" href="/2016/03/05/javascript-study-two/">征服javascript学习笔记（二）——基本概念（上）</a></li></ul></div><div class="widget"><div class="comments-title"><i class="fa fa-comment-o"> 最近评论</i></div><div data-num-items="5" data-show-avatars="0" data-show-time="1" data-show-admin="0" data-excerpt-length="32" data-show-title="1" class="ds-recent-comments"></div></div><div class="widget"><div class="widget-title"><i class="fa fa-external-link"> 友情链接</i></div><ul></ul><a href="http://blog.cssforest.org/" title="cssforest" target="_blank">cssforest</a><ul></ul><a href="http://evanyou.me/" title="尤小右" target="_blank">尤小右</a><ul></ul><a href="http://www.ruanyifeng.com/home.html" title="阮一峰" target="_blank">阮一峰</a><ul></ul><a href="http://www.zhangxinxu.com/" title="张鑫旭" target="_blank">张鑫旭</a><ul></ul><a href="http://sentsin.com/" title="贤心" target="_blank">贤心</a><ul></ul><a href="https://yuguo.us/" title="余果" target="_blank">余果</a><ul></ul><a href="https://github.com/fouber/blog" title="前端农民工" target="_blank">前端农民工</a><ul></ul><a href="https://github.com/yisibl/blog/issues" title="一丝" target="_blank">一丝</a><ul></ul><a href="http://jiongks.name/" title="勾三股四" target="_blank">勾三股四</a><ul></ul><a href="http://cly84920.blog.163.com/" title="真阿当" target="_blank">真阿当</a><ul></ul><a href="http://www.doyoe.com/" title="doyoe" target="_blank">doyoe</a><ul></ul><a href="http://www.cssmagic.net/" title="CSS魔法" target="_blank">CSS魔法</a><ul></ul><a href="http://www.toobug.net/" title="Toobug" target="_blank">Toobug</a><ul></ul><a href="http://www.cnblogs.com/yexiaochai" title="叶小钗" target="_blank">叶小钗</a><ul></ul><a href="http://www.cnblogs.com/jikey/" title="豪情" target="_blank">豪情</a><ul></ul><a href="http://blog.f2er.net/" title="情封" target="_blank">情封</a><ul></ul><a href="https://imququ.com/" title="屈光宇" target="_blank">屈光宇</a><ul></ul><a href="http://www.barretlee.com/" title="小胡子哥" target="_blank">小胡子哥</a><ul></ul><a href="http://luopq.com/" title="luopq" target="_blank">luopq</a><ul></ul><a href="http://www.w3cplus.com/" title="W3cplus" target="_blank">W3cplus</a><ul></ul><a href="http://www.css3china.com/" title="任寒韬" target="_blank">任寒韬</a><ul></ul><a href="http://peunzhang.cnblogs.com/" title="白树" target="_blank">白树</a><ul></ul><a href="http://www.xuanfengge.com/" title="轩枫阁" target="_blank">轩枫阁</a><ul></ul><a href="http://www.caihong.cc/" title="练小习" target="_blank">练小习</a><ul></ul><a href="http://kezhen.info/" title="kevin" target="_blank">kevin</a><ul></ul><a href="http://ons.me/" title="西门的后花园" target="_blank">西门的后花园</a><ul></ul><a href="http://yanhaijing.com/" title="颜海镜" target="_blank">颜海镜</a><ul></ul><a href="https://xuexb.com/" title="前端小武" target="_blank">前端小武</a><ul></ul><a href="http://yujiangshui.com/" title="于江水" target="_blank">于江水</a><ul></ul><a href="http://www.cnblogs.com/tugenhua0707/" title="龙恩" target="_blank">龙恩</a><ul></ul><a href="https://github.com/zhouwenbin/blog/issues" title="周文彬" target="_blank">周文彬</a><ul></ul><a href="http://www.dang-jian.com/" title="党建" target="_blank">党建</a><ul></ul><a href="http://tiye.me/" title="题叶" target="_blank">题叶</a><ul></ul><a href="http://www.cnblogs.com/TomXu/" title="汤姆大叔" target="_blank">汤姆大叔</a><ul></ul><a href="http://www.cnblogs.com/rubylouvre/" title="司徒正美" target="_blank">司徒正美</a><ul></ul><a href="http://zhangwenli.com/" title="羡辙" target="_blank">羡辙</a><ul></ul><a href="http://www.ido321.com/" title="会飞的Pikachu" target="_blank">会飞的Pikachu</a><ul></ul><a href="http://www.fefork.com/" title="聂微东" target="_blank">聂微东</a><ul></ul><a href="http://xiaoqiang730730.github.io" title="前端-小强" target="_blank">前端-小强</a></div></div></div></div><div id="footer">© <a href="/." rel="nofollow">灵感的小窝.</a> Powered by<a rel="nofollow" target="_blank" href="https://hexo.io"> Hexo.</a><a rel="nofollow" target="_blank" href="https://github.com/tufu9441/maupassant-hexo"> Theme</a> by<a rel="nofollow" target="_blank" href="https://github.com/pagecho"> Cho.</a></div><a id="rocket" href="#top" class="show"></a><script type="text/javascript" src="/js/jquery.min.js?v=0.0.0"></script><script type="text/javascript" src="/js/totop.js?v=0.0.0"></script><script type="text/javascript" src="/js/fancybox.pack.js?v=0.0.0"></script><script type="text/javascript" src="/js/jquery.fancybox.js?v=0.0.0"></script><link rel="stylesheet" type="text/css" href="/css/jquery.fancybox.css?v=0.0.0"><script>var duoshuoQuery = {short_name:'ideazhao'};
(function() {
    var ds = document.createElement('script');
    ds.type = 'text/javascript';ds.async = true;
    ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
    ds.charset = 'UTF-8';
    (document.getElementsByTagName('head')[0]
        || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script><script type="text/javascript" src="/js/share.js?v=0.0.0"></script><script type="text/javascript" src="/js/codeblock-resizer.js?v=0.0.0"></script><script type="text/javascript" src="/js/smartresize.js?v=0.0.0"></script></div></body></html>